Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Ace your C# Backend Developer interview
ar: إجتز مقابلة مطور C# Backend بنجاح
be: Закрыйце сумоўе на пасаду C# Backend Developer на выдатна
da: Bliv klar til din C# Backend-udvikler interview
de: Beherrschen Sie Ihr C# Backend Developer Interview
es: Aprovecha tu entrevista para Desarrollador Backend en C#
fr: Réussissez votre entretien de développeur backend C#
id: Kuasai wawancara Developer Backend C# Anda
it: Eccella nel tuo colloquio per Sviluppatore Backend C#
ja: C#バックエンドデベロッパーの面接を成功させる
ms: Lulus Cemerlang dalam Temu Duga Pembangun Backend C# anda
no: Suksess i C# Backend-utvikler intervjuet ditt
pl: Osiągnij sukces na rozmowie kwalifikacyjnej dla Backend Developera C#
pt: Domine sua entrevista para Desenvolvedor Backend C#
ru: Преуспейте в собеседовании на должность разработчика C# Backend
sv: Klara din intervju för C# Backend-utvecklare
th: พิชิตการสัมภาษณ์งานเป็นนักพัฒนา Backend C# ของคุณ
tr: C# Backend Developer mülakatınızı başarıyla geçin
uk: Подолайте співбесіду на позицію C# Backend Developer
vi: Chinh phục phỏng vấn Lập trình viên Backend C# của bạn

source: Achieve Speaking Fluency Fast
ar: حقق طلاقة الكلام بسرعة
be: Дасягніце плавнасці маўлення хутка
da: Opnå tale- og flydende hurtigt
de: Erreiche schnell Sprechflüssigkeit
es: Logra Fluidez al Hablar Rápido
fr: Atteignez la fluidité dans la parole rapidement
id: Capai Kefasihan Berbicara dengan Cepat
it: Raggiungi la Fluency nel Parlare Velocemente
ja: 流暢なスピーキングを素早く達成する
ms: Capai Kelancaran Berbicara Dengan Cepat
no: Oppnå flyt i muntlig språk raskt
pl: Osiągnij płynność w mówieniu szybko
pt: Alcance a Fluência na Fala Rápido
ru: Достигните беглости речи быстро
sv: Uppnå talflyt snabbt
th: บรรลุความคล่องแคล่วในการพูดได้อย่างรวดเร็ว
tr: Hızla Konuşma Akıcılığı Kazanın
uk: Досягніть швидкого вільного спілкування
vi: Đạt được sự lưu loát trong giao tiếp nhanh chóng

source: Achievements
ar: إنجازات
be: Дасягненні
da: Præstationer
de: Errungenschaften
es: Logros
fr: Réalisations
id: Pencapaian
it: Risultati raggiunti
ja: 実績
no: Prestasjoner
pl: Osiągnięcia
pt: Conquistas
ru: Достижения
sv: Prestationer
th: รางวัลความสำเร็จ
tr: Başarılar
uk: Досягнення
vi: Thành tựu

source: Action plan to improve critical backend skills
ar: خطة عمل لتحسين المهارات الأساسية في البرمجة الخلفية
be: План дзеянняў для паляпшэння крытычных навыкаў бэкенда
da: Handlingsplan for at forbedre kritiske backend-færdigheder
de: Aktionsplan zur Verbesserung kritischer Backend-Fähigkeiten
es: Plan de acción para mejorar habilidades críticas de backend
fr: Plan d'action pour améliorer les compétences back-end critiques
id: Rencana aksi untuk meningkatkan keterampilan backend yang kritis
it: Piano d'azione per migliorare le competenze critiche di backend
ja: クリティカルなバックエンドスキルを向上させるためのアクションプラン
ms: Pelan tindakan untuk meningkatkan kemahiran backend kritikal
no: Handlingsplan for å forbedre kritiske backend-ferdigheter
pl: Plan działań na poprawę kluczowych umiejętności backendowych
pt: Plano de ação para melhorar habilidades críticas de backend
ru: План действий для улучшения критических навыков работы с бэкендом
sv: Handlingsplan för att förbättra kritiska backend-färdigheter
th: แผนปฏิบัติการเพื่อพัฒนาทักษะเบื้องหลังที่สำคัญ
tr: Kritik arka uç becerilerini geliştirmek için eylem planı
uk: План дій для покращення критичних навичок бекенду
vi: Kế hoạch hành động để cải thiện kỹ năng backend quan trọng

source: Active
ar: نشط
be: Актыўны
da: Aktiv
de: Aktiv
es: Activo
fr: Actif
id: Aktif
it: Attivo
ja: アクティブ
ms: Aktif
no: Aktiv
pl: Aktywne
pt: Ativo
ru: Активный
sv: Aktiv
th: ทำงาน
tr: Aktif
uk: Активний
vi: Đang hoạt động

source: Add a reply
ar: أضف رداً
be: Дадаць адказ
de: Eine Antwort hinzufügen
es: Agregar una respuesta
fr: Ajouter une réponse
id: Tambahkan balasan
it: Aggiungi una risposta
ja: 返信を追加
no: Legg til et svar
pl: Dodaj odpowiedź
pt: Adicionar uma resposta
ru: Добавить ответ
sv: Lägg till ett svar
th: เพิ่มการตอบกลับ
tr: Yanıt ekle
uk: Додати відповідь
vi: Thêm trả lời

source: Add between 2 and 20 players. Tap a name to edit it.
id: Tambahkan antara 2 dan 20 pemain. Ketuk nama untuk mengeditnya.
it: Aggiungi tra 2 e 20 giocatori. Tocca un nome per modificarlo.
ja: 2人から20人のプレイヤーを追加します。名前をタップして編集します。
no: Legg til mellom 2 og 20 spillere. Trykk på et navn for å redigere det.
ru: Добавьте от 2 до 20 игроков. Коснитесь имени, чтобы отредактировать его.
uk: Додайте від 2 до 20 гравців. Натисніть на ім'я, щоб відредагувати його.

source: Add Comment
de: Kommentar hinzufügen
es: Agregar comentario
id: Tambahkan Komentar
it: Aggiungi Commento
ja: コメントを追加
no: Legg til kommentar
pl: Dodaj komentarz
pt: Adicionar Comentário
ru: Добавить комментарий
sv: Lägg till kommentar
th: เพิ่มความคิดเห็น
tr: Yorum Ekle
uk: Додати коментарій
vi: Thêm bình luận

source: Add new goal
ar: إضافة هدف جديد
be: Дадаць новую мэту
da: Tilføj nyt mål
de: Neues Ziel hinzufügen
es: Agregar nuevo objetivo
fr: Ajouter un nouvel objectif
id: Tambahkan tujuan baru
it: Aggiungi nuovo obiettivo
ja: 新しい目標を追加
no: Legg til nytt mål
pl: Dodaj nowy cel
pt: Adicionar novo objetivo
ru: Добавить новую цель
sv: Lägg till nytt mål
th: เพิ่มเป้าหมายใหม่
tr: Yeni hedef ekle
uk: Додати нову ціль
vi: Thêm mục tiêu mới

source: Add new note
id: Tambahkan catatan baru
it: Aggiungi nuova nota
ja: 新しいメモを追加
no: Legg til ny notat
pl: Dodaj nową notatkę
ru: Добавить новую заметку
sv: Lägg till ny anteckning
uk: Додати нову нотатку

source: Add New Post
de: Neuen Beitrag hinzufügen
es: Agregar nueva publicación
id: Tambahkan Postingan Baru
it: Aggiungi Nuovo Post
ja: 新しい投稿を追加
no: Legg til nytt innlegg
pl: Dodaj nowy post
pt: Adicionar Nova Publicação
ru: Добавить новый пост
sv: Lägg till nytt inlägg
th: เพิ่มโพสต์ใหม่
tr: Yeni Gönderi Ekle
uk: Додати новий пост
vi: Thêm Bài Viết Mới

source: Add note
id: Tambah catatan
it: Aggiungi nota
ja: ノートを追加
no: Legg til notat
pl: Dodaj notatkę
ru: Добавить заметку
sv: Lägg till anteckning
uk: Додати нотатку

source: Add player
id: Tambahkan pemain
it: Aggiungi giocatore
ja: プレイヤーを追加
no: Legg til spiller
ru: Добавить игрока
uk: Додати гравця

source: Add Post
de: Beitrag hinzufügen
es: Añadir Publicación
id: Tambahkan Pos
it: Aggiungi post
ja: 投稿を追加
no: Legg til innlegg
pl: Dodaj Post
pt: Adicionar Publicação
ru: Добавить запись
sv: Lägg till inlägg
th: เพิ่มโพสต์
tr: Gönderi Ekle
uk: Додати допис
vi: Thêm Bài Viết

source: Add Response
de: Antwort hinzufügen
es: Añadir respuesta
id: Tambahkan Tanggapan
it: Aggiungi Risposta
ja: レスポンスを追加
no: Legg til respons
pl: Dodaj odpowiedź
pt: Adicionar Resposta
ru: Добавить ответ
sv: Lägg till svar
th: เพิ่มคำตอบ
tr: Yanıt Ekle
uk: Додати відповідь
vi: Thêm Phản Hồi

source: Add some info why you want a refund and we will do it.
ar: أضف بعض المعلومات حول سبب رغبتك في الحصول على استرداد وسنقوم بذلك.
be: Дадайце некаторую інфармацыю, чаму вы хочаце атрымаць вяртанне грошай, і мы гэта зробім.
da: Tilføj nogle oplysninger om, hvorfor du ønsker en refusion, og vi vil gøre det.
de: Fügen Sie einige Informationen hinzu, warum Sie eine Rückerstattung wünschen und wir werden es tun.
es: Agregue información sobre por qué desea un reembolso y lo haremos.
fr: Ajoutez quelques informations sur pourquoi vous souhaitez un remboursement et nous le ferons.
id: Tambahkan beberapa informasi mengapa Anda ingin pengembalian dana dan kami akan melakukannya.
it: Aggiungi alcune informazioni sul perché desideri un rimborso e noi lo faremo.
ja: あなたが返金を希望する理由をいくつか追加してください、そして私たちはそれを実行します。
ms: Tambahkan beberapa info mengapa anda ingin mendapatkan bayaran balik dan kami akan melakukannya.
no: Legg til litt info om hvorfor du vil ha en refusjon, og vi vil gjøre det.
pl: Dodaj informacje, dlaczego chcesz zwrotu, a my to zrobimy.
pt: Adicione algumas informações sobre por que você deseja um reembolso e nós o faremos.
ru: Добавьте немного информации о том, почему вы хотите получить возврат, и мы это сделаем.
sv: Lägg till lite info om varför du vill ha en återbetalning och vi kommer att göra det.
th: เพิ่มข้อมูลเกี่ยวกับสาเหตุที่ท่านต้องการคืนเงินและเราจะดำเนินการให้คุณ
tr: Bir iade talebinde bulunmak istemenizin nedenini biraz ayrıntılandırın ve biz gerçekleştireceğiz.
uk: Додайте деяку інформацію, чому ви хочете відшкодування, і ми це зробимо.
vi: Thêm một số thông tin vì sao bạn muốn hoàn tiền và chúng tôi sẽ thực hiện.

source: Add Text Answer
ar: أضف إجابة نصية
be: Дадаць тэкставы адказ
da: Tilføj Tekstsvar
de: Textantwort hinzufügen
es: Añadir respuesta de texto
fr: Ajouter une réponse texte
id: Tambahkan Jawaban Teks
it: Aggiungi risposta testuale
ja: テキストで回答を追加
no: Legg til tekstsvar
pl: Dodaj odpowiedź tekstową
pt: Adicionar Resposta de Texto
ru: Добавить текстовый ответ
sv: Lägg till textsvaret
th: เพิ่มคำตอบเป็นข้อความ
tr: Metin Yanıtı Ekle
uk: Додати текстову відповідь
vi: Thêm văn bản trả lời

source: Add your problem here...
id: Tambahkan masalah Anda di sini...
it: Aggiungi qui il tuo problema...
ja: ここにあなたの問題を追加してください...
no: Legg til problemet ditt her...
pl: Dodaj swój problem tutaj...
ru: Добавьте вашу проблему здесь...
sv: Lägg till ditt problem här...
uk: Додайте вашу проблему тут...

source: Address performance considerations
ar: معالجة اعتبارات الأداء
be: Рашэнне пытанняў прадукцыйнасці
da: Adressér ydeevnehensyn
de: Berücksichtigung von Leistungsaspekten
es: Abordar las consideraciones de rendimiento
fr: Prendre en compte les considérations de performance
id: Pertimbangan kinerja alamat
it: Considerazioni sulle prestazioni
ja: パフォーマンスの考慮点に対応する
ms: Pertimbangkan prestasi
no: Ta hensyn til ytelsesvurderinger
pl: Rozważania dotyczące wydajności
pt: Aborde considerações de desempenho
ru: Рассмотрите вопросы производительности
sv: Tänk på prestandahänsyn
th: จัดการข้อพิจารณาด้านประสิทธิภาพ
tr: Performans hususlarını ele alın
uk: Розгляньте питання продуктивності
vi: Xem xét các vấn đề về hiệu suất

source: Advanced
ar: متقدم
be: Пашыраны
da: Avanceret
de: Fortgeschritten
es: Avanzado
fr: Avancé
id: Lanjutan
it: Avanzato
ja: 高度な
ms: Lanjutan
no: Avansert
pl: Zaawansowany
pt: Avançado
ru: Расширенный
sv: Avancerad
th: ขั้นสูง
tr: Gelişmiş
uk: Розширений
vi: Cao cấp

source: Advanced Academic Usage
ar: استخدام أكاديمي متقدم
be: Пашыранае акадэмічнае выкарыстанне
da: Avanceret Akademisk Brug
de: Fortgeschrittene akademische Nutzung
es: Uso Académico Avanzado
fr: Utilisation Académique Avancée
id: Penggunaan Akademik Lanjutan
it: Uso Accademico Avanzato
ja: 高度な学術的利用
ms: Penggunaan Akademik Lanjutan
no: Avansert Akademisk Bruk
pl: Zaawansowane Akademickie Użycie
pt: Uso Acadêmico Avançado
ru: Продвинутое академическое использование
sv: Avancerad Akademisk Användning
th: การใช้งานทางวิชาการขั้นสูง
tr: İleri Akademik Kullanım
uk: Продвинуте академічне використання
vi: Sử dụng Học thuật Nâng cao

source: Advanced English Conversation
ar: محادثة إنجليزية متقدمة
be: Пашыраныя англійскія размовы
da: Avanceret Engelsk Samtale
de: Fortgeschrittene Englisch-Konversation
es: Conversación Avanzada en Inglés
fr: Avancé en conversation anglaise
id: Percakapan Bahasa Inggris Lanjutan
it: Conversazione Avanzata in Inglese
ja: 高度な英会話
ms: Perbualan Bahasa Inggeris Lanjutan
no: Avansert engelsk samtale
pl: Zaawansowana konwersacja w języku angielskim
pt: Conversa Avançada em Inglês
ru: Расширенный английский разговор
sv: Avancerad engelsk konversation
th: การสนทนาภาษาอังกฤษขั้นสูง
tr: Gelişmiş İngilizce Konuşma
uk: Розширена англійська розмова
vi: Cuộc trò chuyện tiếng Anh nâng cao

source: advanced English conversation
ar: محادثة إنجليزية متقدمة
be: пашыранае англійскае размаўлянне
da: avanceret engelsk samtale
de: fortgeschrittene Englisch-Konversation
es: conversación avanzada en inglés
fr: conversation avancée en anglais
id: konversasi Inggris tingkat lanjut
it: conversazione avanzata in inglese
ja: 高度な英会話
ms: perbualan Inggeris lanjutan
no: avansert engelsk samtale
pl: zaawansowana konwersacja w języku angielskim
pt: conversa avançada em inglês
ru: расширенный английский разговор
sv: avancerad engelsk konversation
th: บทสนทนาภาษาอังกฤษขั้นสูง
tr: ilerlemiş İngilizce konuşma
uk: просунутий англійський розмовний клуб
vi: cuộc trò chuyện tiếng Anh nâng cao

source: Advanced Personalization
ar: التخصيص المتقدم
be: Пашыраная персаналізацыя
da: Avanceret Personalisering
de: Fortgeschrittene Personalisierung
es: Personalización Avanzada
fr: Personnalisation Avancée
id: Personalisasi Lanjutan
it: Personalizzazione Avanzata
ja: 高度なパーソナライゼーション
ms: Personalisasi Lanjutan
no: Avansert Personliggjøring
pl: Zaawansowana Personalizacja
pt: Personalização Avançada
ru: Продвинутая персонализация
sv: Avancerad Personalisering
th: การปรับแต่งส่วนบุคคลอย่างละเอียด
tr: İleri Düzey Kişiselleştirme
uk: Розширена персоналізація
vi: Tùy chỉnh cá nhân hóa cao cấp

source: Advanced Plan
ar: خطة متقدمة
be: Прасунуты план
da: Avanceret Plan
de: Erweiterter Plan
es: Plan Avanzado
fr: Plan Avancé
id: Paket Lanjutan
it: Piano Avanzato
ja: 高級プラン
no: Avansert plan
pl: Plan zaawansowany
pt: Plano Avançado
ru: Расширенный план
sv: Avancerat abonnemang
th: แผนขั้นสูง
tr: Gelişmiş Plan
uk: Розширений план
vi: Gói Nâng Cao

source: Affordable AI Language Learning
ar: تعلم اللغات بالذكاء الاصطناعي ميسور التكلفة
be: Даступнае вучэнне мовы з дапамогай ШІ
da: Overkommelig AI Sprogindlæring
de: Erschwingliches KI-Sprachenlernen
es: Aprovechable Aprendizaje de Idiomas con IA
fr: Apprentissage des langues AI abordable
id: Pembelajaran Bahasa AI Terjangkau
it: Apprendimento delle lingue con intelligenza artificiale a prezzi accessibili
ja: 手頃なAI言語学習
ms: Pengajaran Bahasa AI Berpatutan
no: Kostnadseffektiv AI Språklæring
pl: Tania nauka języków z AI
pt: Acessível Aprendizado de Línguas com IA
ru: Доступное изучение языков с помощью ИИ
sv: Prisvärd AI Språkinlärning
th: การเรียนรู้ภาษาด้วย AI ในราคาที่เข้าถึงได้
tr: Uygun Fiyatlı Yapay Zeka Dil Eğitimi
uk: Доступне навчання мовам з використанням штучного інтелекту
vi: Giá cả phải chăng để học ngôn ngữ bằng AI

source: After several sessions, you’ll walk into your real interview much more confident. You’ll know what phrases to use, how to present yourself, and how to respond professionally. It can significantly boost your chances of landing your dream job.
ar: بعد عدة جلسات، ستدخل إلى مقابلتك الحقيقية بثقة أكبر بكثير. ستعرف العبارات التي يجب استخدامها، وكيفية تقديم نفسك، وكيفية الرد بشكل احترافي. يمكن أن تزيد بشكل كبير من فرصك في الحصول على الوظيفة التي تحلم بها.
be: Пасля некалькіх сесій, вы пайдзеце на свае рэальнае інтэрв'ю набагато больш упэўненым у сабе. Вы будзеце ведаць, якія фразы выкарыстоўваць, як прадставіць сябе, і як прафесійна адказваць. Гэта можа сутыкнова павялічыць вашы шансы атрымаць працу сваёй мары.
da: Efter flere sessioner, vil du træde ind i dit rigtige interview meget mere selvsikker. Du vil vide, hvilke sætninger du skal bruge, hvordan du præsenterer dig selv, og hvordan du svarer professionelt. Det kan markant øge dine chancer for at få dit drømmejob.
de: Nach mehreren Sitzungen gehen Sie mit viel mehr Selbstvertrauen in Ihr echtes Vorstellungsgespräch. Sie wissen, welche Redewendungen Sie verwenden sollten, wie Sie sich präsentieren und wie Sie professionell reagieren können. Es kann Ihre Chancen, Ihren Traumjob zu bekommen, erheblich erhöhen.
es: Después de varias sesiones, entrarás en tu verdadera entrevista con mucha más confianza. Sabrás qué frases usar, cómo presentarte y cómo responder de manera profesional. Esto puede aumentar significativamente tus posibilidades de conseguir el trabajo de tus sueños.
fr: Après plusieurs séances, vous vous rendrez à votre véritable entretien avec beaucoup plus de confiance. Vous saurez quelles phrases utiliser, comment vous présenter et comment répondre de manière professionnelle. Cela peut considérablement augmenter vos chances de décrocher le travail de vos rêves.
id: Setelah beberapa sesi, Anda akan masuk ke wawancara sesungguhnya dengan lebih percaya diri. Anda akan tahu frasa apa yang harus digunakan, bagaimana cara mempresentasikan diri, dan bagaimana cara merespon secara profesional. Ini dapat meningkatkan peluang Anda secara signifikan untuk mendapatkan pekerjaan impian Anda.
it: Dopo diverse sessioni, entrerai nel tuo vero colloquio molto più sicuro. Saprai quali frasi usare, come presentarti e come rispondere in modo professionale. Può aumentare significativamente le tue possibilità di ottenere il lavoro dei tuoi sogni.
ja: 数回のセッションの後、あなたははるかに自信を持って本番の面接に臨むでしょう。どのフレーズを使うべきか、自己紹介の方法、そしてどのようにプロフェッショナルに対応するかを知るでしょう。それはあなたが夢の仕事を手に入れる確率を大幅に高めることができます。
ms: Selepas beberapa sesi, anda akan masuk ke temuduga sebenar anda dengan lebih yakin. Anda akan tahu frasa mana yang harus digunakan, bagaimana cara memperkenalkan diri, dan bagaimana untuk menjawab secara profesional. Ia boleh meningkatkan peluang anda untuk mendapatkan pekerjaan impian anda secara signifikan.
no: Etter flere økter, vil du gå inn i ditt virkelige intervju med mye mer selvtillit. Du vil vite hvilke setninger du skal bruke, hvordan du skal presentere deg selv, og hvordan du skal reagere profesjonelt. Det kan betydelig øke sjansene dine for å lande drømmejobben.
pl: Po kilku sesjach podejdziesz do swojego prawdziwego wywiadu z dużo większą pewnością siebie. Będziesz wiedział, jakie frazy użyć, jak się przedstawić i jak odpowiedzieć profesjonalnie. Może to znacznie zwiększyć Twoje szanse na zdobycie wymarzonej pracy.
pt: Após várias sessões, você entrará em sua entrevista real com muito mais confiança. Você saberá quais frases usar, como se apresentar e como responder profissionalmente. Isso pode aumentar significativamente suas chances de conseguir o emprego dos seus sonhos.
ru: После нескольких сессий вы придете на настоящее собеседование гораздо увереннее. Вы будете знать, какие фразы использовать, как презентовать себя, и как отвечать профессионально. Это может значительно увеличить ваши шансы получить работу мечты.
sv: Efter flera sessioner kommer du att gå in i din riktiga intervju mycket mer självsäker. Du kommer att veta vilka fraser att använda, hur du presenterar dig själv, och hur du svarar professionellt. Det kan avsevärt öka dina chanser att få ditt drömjobb.
th: หลังจากเรียนรู้หลายครั้งแล้ว คุณจะไปสัมภาษณ์งานด้วยความมั่นใจมากขึ้น คุณจะรู้ว่าควรใช้วลีอะไร วิธีการนำเสนอตัวเอง และวิธีการตอบสนองอย่างมืออาชีพ สิ่งนี้สามารถช่วยเพิ่มโอกาสที่คุณจะได้งานที่ฝันอยู่มากขึ้นได้อย่างมีนัยสำคัญ
tr: Birkaç oturumdan sonra, gerçek mülakatınıza çok daha özgüvenli bir şekilde gireceksiniz. Hangi ifadeleri kullanacağınızı, nasıl kendinizi sunacağınızı ve nasıl profesyonel bir şekilde cevap vereceğinizi bileceksiniz. Bu, hayal ettiğiniz işe yerleşme şansınızı önemli ölçüde artırabilir.
uk: Після кількох сесій ви з більшою впевненістю підійдете до свого справжнього співбесіди. Ви будете знати, які фрази використовувати, як презентувати себе, та як професійно відповідати на питання. Це може значно збільшити ваши шанси отримати роботу своєї мрії.
vi: Sau một số buổi học, bạn sẽ bước vào cuộc phỏng vấn thực tế với nhiều tự tin hơn. Bạn sẽ biết những cụm từ nào cần sử dụng, cách thể hiện bản thân, và cách trả lời một cách chuyên nghiệp. Điều này có thể tăng đáng kể cơ hội để bạn giành được công việc mơ ước của mình.

source: After the greeting, you'll usually hear:
ar: بعد التحية، عادة ما ستسمع:
be: Пасля вітання, вы звычайна чуеце:
da: Efter hilsenen vil du normalt høre:
de: Nach der Begrüßung hören Sie normalerweise:
es: Después del saludo, generalmente escucharás:
fr: Après la salutation, vous entendrez généralement :
id: Setelah ucapan selamat, biasanya Anda akan mendengar:
it: Dopo il saluto, di solito sentirai:
ja: あいさつの後、通常は次のように聞こえます:
ms: Selepas ucapan salam, biasanya anda akan mendengar:
no: Etter hilsenen, vil du vanligvis høre:
pl: Po powitaniu, zwykle usłyszysz:
pt: Após a saudação, você geralmente ouvirá:
ru: После приветствия, вы обычно услышите:
sv: Efter hälsningen hör du vanligtvis:
th: หลังจากทักทายแล้ว คุณมักจะได้ยิน:
tr: Selam verme işleminden sonra, genellikle duyarsınız:
uk: Після вітання, ви зазвичай почуєте:
vi: Sau lời chào, bạn thường sẽ nghe:

source: After the payment is completed, it may take a few minutes for the system to process it and grant you access. If you still do not have access after 10 minutes, please contact support via the chat above. We will assist you as soon as possible and make sure you receive the access you paid for.
id: Setelah pembayaran selesai, sistem mungkin memerlukan beberapa menit untuk memprosesnya dan memberikan Anda akses. Jika Anda masih belum mendapatkan akses setelah 10 menit, silakan hubungi dukungan melalui obrolan di atas. Kami akan membantu Anda secepat mungkin dan memastikan Anda menerima akses yang telah Anda bayar.
it: Dopo il completamento del pagamento, il sistema potrebbe impiegare alcuni minuti per elaborarlo e garantirti l'accesso. Se non hai ancora accesso dopo 10 minuti, ti preghiamo di contattare il supporto tramite la chat qui sopra. Ti assisteremo il prima possibile e ci assicureremo che tu riceva l'accesso per cui hai pagato.
ja: お支払いが完了すると、システムがそれを処理し、アクセス権を付与するまでに数分かかる場合があります。10分経ってもまだアクセスできない場合は、上記のチャットを通じてサポートに連絡してください。できるだけ早くお手伝いし、お支払い済みのアクセス権を確実に受け取れるようにいたします。
no: Når betalingen er fullført, kan det ta noen minutter før systemet behandler den og gir deg tilgang. Hvis du fortsatt ikke har tilgang etter 10 minutter, vennligst kontakt support via chatten ovenfor. Vi vil hjelpe deg så snart som mulig og sørge for at du mottar tilgangen du har betalt for.
pl: Po dokonaniu płatności, system może potrzebować kilku minut na jej przetworzenie i przyznanie dostępu. Jeśli po 10 minutach nadal nie masz dostępu, skontaktuj się z obsługą za pośrednictwem czatu powyżej. Pomożemy Ci jak najszybciej i upewnimy się, że otrzymasz dostęp, za który zapłaciłeś.
ru: После завершения оплаты системе может потребоваться несколько минут для её обработки и предоставления вам доступа. Если по истечении 10 минут у вас все еще нет доступа, пожалуйста, свяжитесь со службой поддержки через чат выше. Мы поможем вам как можно скорее и убедимся, что вы получите доступ, за который заплатили.
sv: Efter att betalningen är genomförd kan det ta några minuter för systemet att behandla den och ge dig åtkomst. Om du fortfarande inte har åtkomst efter 10 minuter, vänligen kontakta supporten via chatten ovan. Vi hjälper dig så snart som möjligt och ser till att du får den åtkomst du har betalat för.
uk: Після завершення оплати може знадобитися кілька хвилин, щоб система обробила її та надала вам доступ. Якщо через 10 хвилин у вас все ще немає доступу, будь ласка, зверніться до служби підтримки через чат вище. Ми допоможемо вам якнайшвидше та переконаємось, що ви отримаєте доступ, за який заплатили.

source: AI
de: KI
es: IA
pt: IA
ru: ИИ
th: เอไอ
uk: ШІ

source: AI and identity
ar: الذكاء الاصطناعي والهوية
be: AI і ідэнтычнасць
da: AI og identitet
de: AI und Identität
es: IA y identidad
fr: AI et identité
id: AI dan identitas
it: AI e identità
ja: AIとアイデンティティ
ms: AI dan identiti
no: AI og identitet
pl: AI i tożsamość
pt: AI e identidade
ru: AI и идентичность
sv: AI och identitet
th: AI และอัตลักษณ์
tr: AI ve kimlik
uk: ШІ та ідентичність
vi: AI và danh tính

source: AI conversation
ar: محادثة الذكاء الاصطناعي
be: Размова AI
da: AI-samtale
de: KI-Konversation
es: conversación de IA
fr: Conversation IA
id: Percakapan AI
it: Conversazione AI
ja: AI会話
no: AI-samtale
pl: Rozmowa AI
pt: conversa com IA
ru: AI разговор
sv: AI-konversation
th: การสนทนาด้วย AI
tr: AI konuşma
uk: Розмова з AI
vi: Cuộc trò chuyện AI

source: AI Decision
ar: قرار الذكاء الاصطناعي
be: Рашэнне AI
da: AI-beslutning
de: KI-Entscheidung
es: Decisión de IA
fr: Décision de l'IA
id: Keputusan AI
it: Decisione dell'IA
ja: AIの決定
no: AI-beslutning
pl: Decyzja AI
pt: Decisão da IA
ru: Решение ИИ
sv: AI-beslut
tr: AI Kararı
uk: AI Рішення
vi: Quyết Định AI
