Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Indonesian Learning Plan
ar: خطة التعلم الإندونيسية
be: План вучэння інданезійскай мовы
da: Indonesisk Læringsplan
de: Indonesischer Lernplan
es: Plan de Aprendizaje de Indonesio
fr: Plan d'apprentissage Indonésien
id: Rencana Belajar Bahasa Indonesia
it: Piano di Apprendimento dell'Indonesiano
ja: インドネシア語学習プラン
ms: Rancangan Pembelajaran Bahasa Indonesia
no: Læringsplan for Indonesisk
pl: Plan Nauki Indonezyjskiego
pt: Plano de Aprendizagem de Indonésio
ru: План изучения индонезийского языка
sv: Indonesiska Lärplan
th: แผนการเรียนรู้ภาษาอินโดนีเซีย
tr: Endonezya Öğrenme Planı
uk: План навчання індонезійської
vi: Kế Hoạch Học Tiếng Indonesia

source: Initiate brain connection
ar: بدء الاتصال الدماغي
be: Ініцыялізаваць злучэнне з мазгом
da: Start hjerneforbindelse
de: Initiiere Gehirnverbindung
es: Inicia la conexión cerebral
fr: Initier la connexion cérébrale
id: Mulai koneksi otak
it: Inizia la connessione cerebrale
ja: ブレイン接続を開始
ms: Mulakan sambungan otak
no: Start hjerneforbindelse
pl: Inicjuj połączenie mózgowe
pt: Inicie a conexão cerebral
ru: Инициировать связь с мозгом
sv: Initiera hjärnans anslutning
th: เริ่มต้นการเชื่อมต่อสมอง
tr: Beyin bağlantısını başlat
uk: Ініціюйте з'єднання з мозком
vi: Khởi tạo kết nối não

source: Install complete
ar: تم التثبيت بنجاح
be: Усталёўка завершана
da: Installation fuldført
de: Installation abgeschlossen
es: Instalación completa
fr: Installation terminée
id: Instalasi selesai
it: Installazione completata
ja: インストール完了
ms: Pemasangan lengkap
no: Installasjon fullført
pl: Instalacja zakończona
pt: Instalação completa
ru: Установка завершена
sv: Installationen klar
th: การติดตั้งเสร็จสมบูรณ์
tr: Kurulum tamamlandı
uk: Встановлення завершено
vi: Đã cài đặt xong

source: Install languages into my brain
ar: قم بتثبيت اللغات في عقلي
be: Устанавіць мовы ў мой мозг
da: Installer sprog i min hjerne
de: Installiere Sprachen in mein Gehirn
es: Instala idiomas en mi cerebro
fr: Installez des langues dans mon cerveau
id: Pasang bahasa ke dalam otak saya
it: Installa lingue nel mio cervello
ja: 私の脳に言語をインストールする
ms: Pasang bahasa dalam otak saya
no: Installer språk i hjernen min
pl: Zainstaluj języki w moim mózgu
pt: Instale idiomas no meu cérebro
ru: Установите языки в мой мозг
sv: Installera språk i min hjärna
th: ติดตั้งภาษาลงในสมองของฉัน
tr: Beynime dilleri yükleyin
uk: Встановіть мови у мій мозок
vi: Cài đặt ngôn ngữ vào não tôi

source: Install:
ar: تثبيت:
be: Усталяваць:
da: Installer:
de: Installieren:
es: Instalar:
fr: Installer:
id: Instal:
it: Installa:
ja: インストール：
ms: Pasang:
no: Installer:
pl: Instaluj:
pt: Instalar:
ru: Установить:
sv: Installera:
th: ติดตั้ง:
tr: Yükle:
uk: Встановити:
vi: Cài đặt:

source: Installing...
ar: جار التثبيت...
be: Усталёўка...
da: Installerer...
de: Installieren...
es: Instalando...
fr: Installation en cours...
id: Memasang...
it: In installazione...
ja: インストール中...
ms: Memasang...
no: Installerer...
pl: Instalowanie...
pt: Instalando...
ru: Установка...
sv: Installerar...
th: กำลังติดตั้ง...
tr: Yükleniyor...
uk: Встановлення...
vi: Đang cài đặt...

source: Instant Grammar Corrections
ar: تصحيحات القواعد الفورية
be: Мгновенныя граматычныя карэкціі
da: Øjeblikkelige grammatikfejlrettelser
de: Sofortige Grammatik-Korrekturen
es: Correcciones instantáneas de gramática
fr: Corrections Grammaticales Instantanées
id: Koreksi Tata Bahasa Instan
it: Correzioni di grammatica istantanee
ja: インスタント文法修正
ms: Pembetulan Tatabahasa Segera
no: Umiddelbare grammatikkorreksjoner
pl: Natychmiastowe poprawki gramatyczne
pt: Correções Instantâneas de Gramática
ru: Немедленные корректировки грамматики
sv: Omedelbara grammatikrättelser
th: คำแนะนำไวยากรณ์ทันที
tr: Anında Dilbilgisi Düzeltmeleri
uk: Миттєві виправлення граматики
vi: Sửa lỗi ngữ pháp ngay lập tức

source: Integration Testing
ar: اختبار التكامل
be: Тэсціраванне Інтэграцыі
da: Integrationstestning
de: Integrationstests
es: Pruebas de Integración
fr: Test d'intégration
id: Pengujian Integrasi
it: Test di Integrazione
ja: 統合テスト
ms: Pengujian Integrasi
no: Integrasjonstesting
pl: Testy integracyjne
pt: Teste de Integração
ru: Тестирование интеграции
sv: Integreringstestning
th: การทดสอบการผสาน
tr: Entegrasyon Testi
uk: Тестування інтеграції
vi: Kiểm thử tích hợp

source: Integration Tests
ar: اختبارات التكامل
be: Тэсты інтэграцыі
da: Integrationstests
de: Integrationstests
es: Pruebas de Integración
fr: Tests d'intégration
id: Tes Integrasi
it: Test di Integrazione
ja: 統合テスト
ms: Ujian Integrasi
no: Integrasjonstester
pl: Testy integracyjne
pt: Testes de Integração
ru: Интеграционные тесты
sv: Integrationstester
th: การทดสอบการรวมระบบ
tr: Entegrasyon Testleri
uk: Тести інтеграції
vi: Kiểm Tra Tích Hợp

source: Intermediate English Learners
ar: متعلمي الإنجليزية المتوسط
be: Сярэднія вучні англійскай
da: Mellemøvede engelsk elever
de: Fortgeschrittene Englischlerner
es: Aprendices de Inglés Intermedio
fr: Apprenants intermédiaires en anglais
id: Pelajar Bahasa Inggris Tingkat Menengah
it: Discenti di Inglese Intermedio
ja: 中級英語学習者
ms: Pelajar Bahasa Inggeris Pertengahan
no: Mellomliggende engelske elever
pl: Uczący się języka angielskiego na poziomie średnio zaawansowanym
pt: Aprendizes de Inglês Intermediário
ru: Продвинутые изучающие английский
sv: Mellanliggande Engelska Studerande
th: ผู้เรียนภาษาอังกฤษระดับกลาง
tr: Orta Seviye İngilizce Öğrenenler
uk: Студенти англійської мови середнього рівня
vi: Học viên Tiếng Anh Trung cấp

source: intermediate English learners
ar: متعلمي الإنجليزية المتوسطة
be: студэнты з англійскай мовы сярэдняга ўзроўню
da: mellemøvede engelske elever
de: Fortgeschrittene Englischlerner
es: estudiantes intermedios de inglés
fr: apprenants intermédiaires en anglais
id: pelajar Bahasa Inggris tingkat menengah
it: studenti intermedi di inglese
ja: 中級英語学習者
ms: pelajar Bahasa Inggeris peringkat pertengahan
no: mellomliggende engelsklærere
pl: uczniowie angielskiego na poziomie średnio zaawansowanym
pt: alunos de inglês intermediário
ru: ученики среднего уровня английского
sv: mellanliggande engelska elever
th: ผู้เรียนภาษาอังกฤษระดับกลาง
tr: orta düzey İngilizce öğrenenler
uk: учні англійської на середньому рівні
vi: người học tiếng Anh ở trình độ trung cấp

source: Interview English
ar: الإنجليزية في المقابلات
be: Інтэрв'ю па англійскуй
da: Interview Engelsk
de: Interview Englisch
es: Entrevista en inglés
fr: Interview Anglais
id: Wawancara Bahasa Inggris
it: Intervista Inglese
ja: 面接英語
ms: Temuduga Bahasa Inggeris
no: Intervju Engelsk
pl: Wywiad po angielsku
pt: Entrevista em Inglês
ru: Интервью на английском
sv: Intervju Engelska
th: สัมภาษณ์ภาษาอังกฤษ
tr: Mülakat İngilizcesi
uk: Інтерв'ю англійською
vi: Tiếng Anh Phỏng Vấn

source: Interview Practice
ar: ممارسة المقابلة
be: Практыка Субяседы
da: Interview Øvelse
de: Interview-Übung
es: Práctica de Entrevista
fr: Pratique d'entretien
id: Praktik Wawancara
it: Pratica di intervista
ja: インタビュープラクティス
ms: Latihan Temubual
no: Intervjuepraksis
pl: Praktyka rozmowy kwalifikacyjnej
pt: Prática de Entrevista
ru: Практика собеседований
sv: Intervjuförberedelse
th: ฝึกสัมภาษณ์
tr: Mülakat Pratiği
uk: Практика Інтерв'ю
vi: Luyện Tập Phỏng Vấn

source: Interview practice partner
ar: شريك ممارسة المقابلات
be: Партнёр для практыкі інтэрв'ю
da: Interview praksispartner
de: Interview-Übungspartner
es: Socio de práctica de entrevistas
fr: Partenaire de pratique d'entrevue
id: Mitra latihan wawancara
it: Partner di pratica per colloqui
ja: インタビュープラクティスパートナー
ms: Rakan latihan temu bual
no: Intervju treningspartner
pl: Partner do praktyki wywiadu
pt: Parceiro de prática de entrevistas
ru: Партнёр для практики интервью
sv: Intervjuövningspartner
th: พันธมิตรสำหรับฝึกการสัมภาษณ์
tr: Görüşme pratik ortağı
uk: Партнер для практики інтерв'ю
vi: Đối tác thực hành phỏng vấn

source: Interview Preparation
ar: إعداد المقابلة
be: Падрыхтоўка да інтэрв'ю
da: Interview Forberedelse
de: Vorbereitung auf das Vorstellungsgespräch
es: Preparación para Entrevistas
fr: Préparation à l'entretien
id: Persiapan Wawancara
it: Preparazione all'intervista
ja: インタビューの準備
ms: Persediaan Temuduga
no: Intervjuforberedelse
pl: Przygotowanie do rozmowy kwalifikacyjnej
pt: Preparação para Entrevista
ru: Подготовка к собеседованию
sv: Intervjuförberedelse
th: การเตรียมตัวสัมภาษณ์
tr: Mülakat Hazırlığı
uk: Підготовка до співбесіди
vi: Chuẩn bị Phỏng vấn

source: interview preparation
ar: إعداد للمقابلة
be: падрыхтоўка да інтэрв'ю
da: forberedelse til interview
de: Vorbereitung auf das Vorstellungsgespräch
es: preparación para la entrevista
fr: préparation à l'entretien
id: persiapan wawancara
it: preparazione per l'intervista
ja: 面接準備
ms: persediaan temuduga
no: forberedelse til intervju
pl: przygotowanie do rozmowy kwalifikacyjnej
pt: preparação para entrevista
ru: подготовка к собеседованию
sv: intervjuförberedelser
th: การเตรียมการสัมภาษณ์
tr: mülakat hazırlığı
uk: підготовка до співбесіди
vi: chuẩn bị phỏng vấn

source: Interview questions
ar: أسئلة المقابلة
be: Пытанні для інтэрв'ю
da: Interview spørgsmål
de: Interviewfragen
es: Preguntas de entrevista
fr: Questions d'entretien
id: Pertanyaan wawancara
it: Domande di intervista
ja: インタビューの質問
no: Intervjuspørsmål
pl: Pytania do rozmowy kwalifikacyjnej
pt: Perguntas de entrevista
ru: Вопросы для интервью
sv: Intervjufrågor
th: คำถามในการสัมภาษณ์
tr: Görüşme soruları
uk: Запитання для співбесіди
vi: Câu hỏi phỏng vấn

source: Interview questions matched to your exact tech stack
ar: plaintext أسئلة المقابلة مطابقة لدقة تقنية التكديس الخاصة بك
be: Пытанні на інтэрв'ю, якія адпавядаюць вашай дакладнай тэхналагічнай стэку
da: Interviewspørgsmål matchet til din præcise teknologistak
de: Interviewfragen, die genau auf Ihren Tech-Stack abgestimmt sind
es: Preguntas de entrevista acordes a tu pila tecnológica exacta
fr: Questions d'entretien correspondant exactement à votre pile technologique
id: Pertanyaan wawancara yang disesuaikan dengan teknologi yang Anda gunakan
it: Domande di colloquio corrispondenti al tuo esatto stack tecnologico
ja: 特定の技術スタックに合わせた面接質問
ms: Soalan temu bual dipadankan dengan timbunan teknologi anda yang tepat
no: Intervjuspørsmål tilpasset din eksakte teknologistabel
pl: Pytania do rozmowy kwalifikacyjnej dopasowane do Twojego dokładnego stosu technologicznego.
pt: Perguntas de entrevista correspondentes à sua pilha de tecnologia exata
ru: Вопросы для интервью, соответствующие вашей точной технологической базе
sv: Intervjufrågor matchade till din exakta teknikstack
th: คำถามสัมภาษณ์ที่ตรงกับชุดเทคโนโลยีของคุณอย่างแม่นยำ
tr: Tam olarak sizin teknoloji yığınıza uygun mülakat soruları
uk: Запитання для співбесіди, які відповідають вашому точному стеку технологій
vi: Câu hỏi phỏng vấn phù hợp với ngăn xếp công nghệ cụ thể của bạn

source: Interview Quiz
ar: مقابلة الاختبار
be: Інтэрв'ю Квіз
es: Cuestionario de Entrevista
fr: Questionnaire d'entretien
id: Kuis Wawancara
it: Quiz di interviste
ja: インタビュークイズ
ms: Kuiz Temuduga
no: Intervjuquiz
pl: Quiz rekrutacyjny
pt: Teste de Entrevista
ru: Интервью Викторина
sv: Intervjuquiz
th: แบบทดสอบสัมภาษณ์
tr: Mülakat Testi
uk: Інтерв'ю Квіз
vi: Cuộc phỏng vấn trắc nghiệm

source: Interview Readiness Score
ar: درجة الجاهزية للمقابلة
be: Ацэнка гатоўнасці да інтэрв'ю
da: Interviewparathedsscore
de: Interviewbereitschafts-Score
es: Puntuación de Preparación para la Entrevista
fr: Score de Prêt pour l'Entretien
id: Skor Kesiapan Wawancara
it: Punteggio di Preparazione all'Intervista
ja: インタビュー準備スコア
ms: Skor Kesediaan Temuduga
no: Intervju Klarhets Score
pl: Wynik Gotowości do Rozmowy Kwalifikacyjnej
pt: Pontuação de Prontidão para Entrevista
ru: Оценка Готовности к Собеседованию
sv: Intervjuberedskapspoäng
th: คะแนนความพร้อมสัมภาษณ์
tr: Mülakat Hazırlık Skoru
uk: Оцінка Готовності до Співбесіди
vi: Điểm Sẵn sàng Phỏng vấn

source: Interview Tips
ar: نصائح المقابلة
be: Парады на інтэрвію
de: Interview Tipps
es: Consejos para Entrevistas
fr: Conseils d'entretien
id: Tips Wawancara
it: Consigli per il colloquio
ja: 面接のヒント
ms: Tip Temuduga
no: Intervju Tips
pl: Porady dotyczące rozmowy kwalifikacyjnej
pt: Dicas para Entrevistas
ru: Советы по прохождению интервью
sv: Intervjutips
th: เคล็ดลับการสัมภาษณ์
tr: Mülakat İpuçları
uk: Поради для інтерв'ю
vi: Mẹo Phỏng Vấn

source: Interview vocabulary for intermediate learners
ar: مفردات المقابلة للمتعلمين المتوسطين
be: Лексіка для інтэрв'ю для сярэдніх вучнёў
da: Interviewordforråd for mellemniveau elever
de: Interview-Wortschatz für fortgeschrittene Lernende
es: Vocabulario de entrevista para estudiantes intermedios
fr: Vocabulaire d'entretien pour les apprenants intermédiaires
id: Kosa kata wawancara untuk pelajar tingkat menengah
it: Vocabolario per l'intervista per studenti di livello intermedio
ja: 中級学習者のための面接用語彙
ms: Kosa kata temuduga untuk pelajar peringkat sederhana
no: Intervjuordforråd for mellomliggende elever
pl: Słownictwo do rozmowy kwalifikacyjnej dla uczniów na poziomie średnio zaawansowanym
pt: Vocabulário de entrevista para aprendizes intermediários
ru: Словарь для собеседований для учеников среднего уровня
sv: Intervjuordförråd för mellannivåinlärare
th: คำศัพท์สำหรับการสัมภาษณ์สำหรับผู้เรียนระดับกลาง
tr: Orta düzey öğrenenler için mülakat kelime hazinesi
uk: Словник для інтерв'ю для учнів середнього рівня
vi: Từ vựng phỏng vấn dành cho người học trình độ trung cấp

source: Interviewers expect **architecture thinking**, not just clean code
ar: يتوقع المحاورون **الفكر المعماري**، وليس فقط الكود النظيف
be: Інтэрв'юеры чакаюць **мыслення архітэктурнага тыпу**, а не проста чысты код
da: Interviewere forventer **arkitekturtænkning**, ikke kun ren kode
de: Interviewpartner erwarten **architektonisches Denken**, nicht nur sauberen Code
es: Los entrevistadores esperan **pensamiento arquitectónico**, no solo código limpio
fr: Les intervieweurs attendent une **pensée architecturale**, pas seulement du code propre
id: Wawancara mengharapkan **pemikiran arsitektur**, bukan hanya kode yang bersih
it: Gli intervistatori si aspettano **pensiero architettonico**, non solo codice pulito
ja: 面接官は綺麗なコードだけでなく、**アーキテクチャ思考**を期待しています
no: Intervjuere forventer **arkitekturtenkning**, ikke bare ren kode
pl: Ankieterzy oczekują **myślenia architektonicznego**, a nie tylko czystego kodu
pt: Entrevistadores esperam **pensamento arquitetônico**, não apenas código limpo
ru: Интервьюеры ожидают **архитектурное мышление**, а не просто чистый код
sv: Intervjuare förväntar sig **arkitektur-tänkande**, inte bara ren kod
th: ผู้สัมภาษณ์คาดหวัง **การคิดโครงสร้างสถาปัตยกรรม** ไม่ใช่แค่โค้ดที่สะอาด
tr: Mülakatçılar sadece temiz kod değil, **mimari düşünce** beklerler.
uk: Інтерв'юери очікують **архітектурного мислення**, а не лише чистого коду
vi: Người phỏng vấn mong đợi **tư duy kiến trúc**, không chỉ là mã nguồn sạch.

source: Introduce Yourself
ar: عرف بنفسك
be: Прадстаўце сябе
da: Introducer dig selv
de: Stellen Sie sich vor
es: Preséntate
fr: Présentez-vous
id: Perkenalkan Diri Anda
it: Presentati
ja: 自己紹介
ms: Perkenalkan Diri Anda
no: Presenter deg selv
pl: Przedstaw Się
pt: Apresente-se
ru: Представьтесь
sv: Introducera dig själv
th: แนะนำตัวเอง
tr: Kendinizi Tanıtın
uk: Представтеся
vi: Giới thiệu bản thân

source: Introduce yourself as a backend engineer
ar: قدم نفسك كمبرمج خلفي
be: Прадстаўце сябе як інжынер па распрацоўцы сервернай часткі
da: Introducer dig selv som backend-ingeniør
de: Stell dich als Backend-Ingenieur vor
es: Preséntate como ingeniero de backend
fr: Présentez-vous en tant qu'ingénieur backend
id: Perkenalkan diri Anda sebagai seorang insinyur backend
it: Presentati come ingegnere backend
ja: バックエンドエンジニアとして自己紹介してください
ms: Perkenalkan diri anda sebagai jurutera backend
no: Introduser deg som en backend-ingeniør
pl: Przedstaw się jako inżynier backendu
pt: Apresente-se como engenheiro de backend
ru: Представьтесь как бэкенд-инженер
sv: Introducera dig själv som en backend-ingenjör
th: แนะนำตัวเองว่าเป็นวิศวกรแบ็กเอนด์
tr: Kendinizi bir backend mühendisi olarak tanıtın
uk: Представте себе як бекенд-інженера
vi: Giới thiệu bản thân như một kỹ sư backend

source: Introduction: Small Talk with the Interviewer
ar: مقدمة: الحديث العرضي مع المُقابِل
be: Увод: Нефармальная размова з інтэрв'юерам
da: Introduktion: Small Talk med Intervieweren
de: Einführung: Small Talk mit dem Interviewer
es: Introducción: Charla informal con el entrevistador
fr: Introduction : Petites discussions avec l'intervieweur
id: Pengantar: Percakapan Ringan dengan Pewawancara
it: Introduzione: Chiacchiere informali con l'intervistatore
ja: 紹介：面接者との小話
ms: Pendahuluan: Perbualan Ringan dengan Penginterview
no: Introduksjon: Småprat med intervjueren
pl: Wprowadzenie: Luźna rozmowa z osobą przeprowadzającą rozmowę kwalifikacyjną
pt: Introdução: Conversa Informal com o Entrevistador
ru: Введение: Неформальное общение с интервьюером
sv: Introduktion: Small Talk med Intervjuaren
th: บทนำ: การคุยเล่นกับผู้สัมภาษณ์
tr: Giriş: Mülakatçı ile Küçük Sohbet
uk: Вступ: Невимушена бесіда з інтерв'юером
vi: Giới thiệu: Trò chuyện nhỏ với người phỏng vấn

source: Invite Link Sent to:
ar: رابط الدعوة تم إرساله إلى:
be: Спасылка-запрашэнне адпраўлена:
da: Invite-link sendt til:
de: Einladungslink gesendet an:
es: Enlace de invitación enviado a:
fr: Lien d'invitation envoyé à :
id: Tautan Undangan Dikirim ke:
it: Link di invito inviato a:
ja: 招待リンク送信先：
no: Invite link sendt til:
pl: Link do zaproszenia wysłany do:
pt: Convite Enviado Para:
ru: Ссылка приглашения отправлена:
sv: Inbjudningslänk skickad till:
th: ลิงก์เชิญถูกส่งไปยัง:
tr: Davet Bağlantısı Şu Adrese Gönderildi:
uk: Запрошувальне посилання надіслано на:
vi: Liên kết mời đã được gửi tới:

source: Invite to a debate
ar: دعوة إلى مناظرة
be: Запрашэнне на дэбаты
da: Invitere til en debat
de: Zur Debatte einladen
es: Invitar a un debate
fr: Inviter à un débat
id: Undangan untuk debat
it: Invita a un dibattito
ja: 討論に招待
no: Invitasjon til en debatt
pl: Zaproszenie do debaty
pt: Convite para um debate
ru: Пригласить на дебаты
sv: Inbjudan till en debatt
th: เชิญเข้าร่วมการอภิปราย
tr: Bir tartışmaya davet et
uk: Запрос на дебати
vi: Mời tham gia tranh luận

source: Is FluencyPal a replacement for a human teacher?
ar: هل FluencyPal بديل للمعلم البشري؟
be: Ці з'яўляецца FluencyPal заменай чалавечаму настаўніку?
da: Er FluencyPal en erstatning for en menneskelig lærer?
de: Ist FluencyPal ein Ersatz für einen menschlichen Lehrer?
es: ¿Es FluencyPal un reemplazo para un profesor humano?
fr: FluencyPal est-il un remplacement pour un enseignant humain ?
id: Apakah FluencyPal pengganti untuk seorang guru manusia?
it: FluencyPal è un sostituto di un insegnante umano?
ja: FluencyPalは人間の教師の代わりになりますか？
no: Er FluencyPal en erstatning for en menneskelig lærer?
pl: Czy FluencyPal zastępuje nauczyciela?
pt: FluencyPal é uma substituição para um professor humano?
ru: Является ли FluencyPal заменой для учителя-человека?
sv: Är FluencyPal en ersättning för en mänsklig lärare?
th: FluencyPal เป็นการทดแทนครูมนุษย์หรือไม่?
tr: FluencyPal, insan öğretmenlerin yerine geçen bir uygulama mı?
uk: Чи є FluencyPal заміною для вчителя-людини?
vi: FluencyPal có phải là một sự thay thế cho giáo viên con người không?

source: Is my data used to train AI models?
ar: هل تُستخدم بياناتي لتدريب نماذج الذكاء الاصطناعي؟
be: Ці выкарыстоўваюцца мае дадзеныя для навучання AI-мадэляў?
da: Bliver mine data brugt til at træne AI-modeller?
de: Wird meine Daten genutzt, um KI-Modelle zu trainieren?
es: ¿Se utilizan mis datos para entrenar modelos de IA?
fr: Mes données sont-elles utilisées pour entraîner des modèles d'IA ?
id: Apakah data saya digunakan untuk melatih model AI?
it: I miei dati vengono utilizzati per addestrare modelli di intelligenza artificiale?
ja: 私のデータはAIモデルのトレーニングに使用されますか？
no: Blir dataene mine brukt til å trene AI-modeller?
pl: Czy moje dane są wykorzystywane do trenowania modeli AI?
pt: Meus dados são usados para treinar modelos de IA?
ru: Мои данные используются для обучения моделей ИИ?
sv: Används mina data för att träna AI-modeller?
th: ข้อมูลของฉันถูกใช้ในการฝึกโมเดล AI หรือไม่?
tr: Verilerim AI modellerini eğitmek için kullanılıyor mu?
uk: Чи використовуються мої дані для навчання AI моделей?
vi: Dữ liệu của tôi có được sử dụng để huấn luyện các mô hình AI không?

source: Is the payment recurring?
ar: هل الدفع متكرر؟
be: Ці вырабляецца аплата рэгулярна?
da: Er betalingen tilbagevendende?
de: Ist die Zahlung wiederkehrend?
es: ¿El pago es recurrente?
fr: Le paiement est-il récurrent ?
id: Apakah pembayarannya berulang?
it: Il pagamento è ricorrente?
ja: 支払いは定期的ですか？
no: Er betalingen tilbakevendende?
pl: Czy płatność jest cykliczna?
pt: O pagamento é recorrente?
ru: Производится ли оплата автоматически?
sv: Är betalningen återkommande?
th: การชำระเงินเป็นแบบประจำหรือไม่?
tr: Ödeme yineleniyor mu?
uk: Чи є платіж регулярним?
vi: Việc thanh toán có định kỳ không?

source: Is there a free trial?
ar: هل هناك تجربة مجانية؟
be: Ці ёсць бясплатны пробны перыяд?
da: Er der en gratis prøveperiode?
de: Gibt es eine kostenlose Testversion?
es: ¿Hay una prueba gratuita?
fr: Y a-t-il un essai gratuit ?
id: Apakah ada uji coba gratis?
it: C'è una prova gratuita?
ja: 無料試用期間はありますか？
no: Er det en gratis prøveperiode?
pl: Czy jest dostępny okres próbny?
pt: Existe uma avaliação gratuita?
ru: Есть ли бесплатная пробная версия?
sv: Finns det en gratis provperiod?
th: มีการทดลองใช้ฟรีไหม?
tr: Ücretsiz deneme var mı?
uk: Чи є безкоштовна пробна версія?
vi: Có thử nghiệm miễn phí không?

source: Is there content on resiliency and observability?
ar: هل هناك محتوى عن القدرة على التحمل والمراقبة؟
be: Ці ёсць змест пра ўстойлівасць і назіральнасць?
da: Er der indhold om modstandskraft og observabilitet?
de: Gibt es Inhalte zu Widerstandsfähigkeit und Beobachtbarkeit?
es: ¿Hay contenido sobre resiliencia y observabilidad?
fr: Y a-t-il du contenu sur la résilience et l'observabilité ?
id: Apakah ada konten tentang ketahanan dan keterlihatan?
it: C'è contenuto sulla resilienza e l'osservabilità?
ja: レジリエンシーと可観測性に関するコンテンツはありますか？
ms: Adakah terdapat kandungan mengenai ketahanan dan keberlihatan?
no: Er det innhold om motstandskraft og observabilitet?
pl: Czy istnieją treści na temat odporności i obserwowalności?
pt: Há conteúdo sobre resiliência e observabilidade?
ru: Есть ли контент о устойчивости и наблюдаемости?
sv: Finns det innehåll om motståndskraft och observabilitet?
th: มีเนื้อหาเกี่ยวกับความยืดหยุ่นและการสังเกตการณ์หรือไม่?
tr: Dayanıklılık ve gözlemlenebilirlik konusunda içerik var mı?
uk: Чи є матеріали про стійкість і спостережуваність?
vi: Có nội dung về khả năng phục hồi và khả năng quan sát không?

source: Is this a subscription?
de: Ist dies ein Abonnement?
es: ¿Es una suscripción?
id: Apakah ini berlangganan?
it: È un abbonamento?
ja: これはサブスクリプションですか？
no: Er dette et abonnement?
pl: Czy to jest subskrypcja?
pt: É uma assinatura?
ru: Это подписка?
sv: Är detta en prenumeration?
th: นี่คือการสมัครสมาชิกหรือไม่?
tr: Bu bir abonelik mi?
uk: Це підписка?
vi: Đây có phải là đăng ký không?

source: IT & Software Development
ar: تكنولوجيا المعلومات وتطوير البرمجيات
be: ІТ і распрацоўка праграмнага забеспячэння
da: IT & Softwareudvikling
de: IT & Software-Entwicklung
es: TI y Desarrollo de Software
fr: TI & Développement de logiciels
id: IT & Pengembangan Perangkat Lunak
it: IT e Sviluppo Software
ja: ＩＴ＆ソフトウェア開発
ms: IT & Pembangunan Perisian
no: IT og programvareutvikling
pl: IT i Rozwój Oprogramowania
pt: TI e Desenvolvimento de Software
ru: ИТ и разработка программного обеспечения
sv: IT & Programvaruutveckling
th: ไอทีและการพัฒนาซอฟต์แวร์
tr: IT ve Yazılım Geliştirme
uk: ІТ та розробка програмного забезпечення
vi: Công nghệ thông tin & Phát triển phần mềm
