Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Create a unique, personalized setting that fits your specific interests or challenges. This scenario lets you decide the context, characters, and conversation flow you want to practice. ## Why You Should Play *Your Custom Scenario* 1. Tailor the experience to your personal goals, from work situations to everyday social interactions. 2. Experiment with different conversation styles, topics, or tones in a setting of your choice. 3. Focus on the skills or vocabulary you need most, whether it’s technical terminology or casual chit-chat. 4. Enjoy full creative freedom to build a scenario that’s both realistic and engaging for you. 5. Gain valuable practice in scenarios that might not be covered by standard role-plays. ## How the Scenario Works You’ll outline your own role-play by providing a brief description of the setting, characters, and main objectives. The AI will adapt to your custom instructions and engage in dialogue aligned with your scenario’s theme. This flexible format helps you master the exact communication skills you need.
ar: قم بإنشاء إعداد فريد ومخصص يناسب اهتماماتك أو التحديات التي تواجهها. يتيح لك هذا السيناريو تحديد السياق والشخصيات وتدفق المحادثة الذي تود ممارسة. ## لماذا يجب عليك تجربة *سيناريوك المخصص* 1. قم بتعديل التجربة لتتناسب مع أهدافك الشخصية، من مواقف العمل إلى التفاعلات الاجتماعية اليومية. 2. جرب أنماط محادثة مختلفة، مواضيع، أو نغمات في إعداد من اختيارك. 3. ركز على المهارات أو المفردات التي تحتاجها أكثر، سواء كانت مصطلحات تقنية أو حديث عابر غير رسمي. 4. استمتع بحرية الإبداع الكاملة لبناء سيناريو يجسد الواقعية ويكون مثيرًا للاهتمام بالنسبة لك. 5. احصل على ممارسة قيمة في السيناريوهات التي قد لا تغطيها الأدوار التقليدية. ## كيفية عمل السيناريو سوف تقوم بوصف لعبتك التمثيلية الخاصة من خلال تقديم وصف موجز للإعداد والشخصيات والأهداف الرئيسية. سيتكيف الذكاء الاصطناعي مع تعليماتك المخصصة ويتفاعل في حوار يتماشى مع موضوع سيناريوك. يساعدك هذا التنسيق المرن على إتقان مهارات الاتصال التي تحتاجها بالضبط.
be: Стварыце унікальны, персаналізаваны сцэнар, які адпавядае вашым канкрэтным зацікавленням або выклікам. Гэты сцэнар дазваляе вам вызначыць кантэкст, персанажаў і паток размовы, з якімі вы хацелі б практыкавацца. ## Чаму варта гуляць *Ваш кастамны сцэнар* 1. Прыстасуйце вопыт пад вашыя асабістыя мэты, ад сітуацый на працы да штодзённых сацыяльных ўзаемадзеянняў. 2. Эксперыментуйце з рознымі стылямі размовы, тэмамі ці тонамі ў асяроддзі на ваш выбар. 3. Сканцэнтруйцеся на тых навыках або слоўніку, якiя вам патрэбны больш за ўсё, нягледзячы на тое, ці гэта тэхнічная тэрмінологія ці несур'ёзная балачка. 4. Атрымлівайце поўную творчую свабоду для стварэння сцэнара, які будзе рэалістычным і захапляльным для вас. 5. Здабывайце цэнны практычны досвед у сцэнарах, якія можа не пакрывацца стандартнымі ролевымі гульнямі. ## Як працуе сцэнар Вы размалявечайце сваю ролевую гульню, прадстаўляючы кароткі апісанне асяроддзя, персанажаў і асноўных мэтаў. AI адаптуецца да вашых кастамізаваных інструкцый і будзе ўяўляцца ў дыялог, які ўзгоднены з тэмай вашага сцэнара. Гэты гнуткі фармат дапамагае вам апанаваць тыя камунікатыўныя навыкі, якія вам неабходны.
da: Opret en unik, personlig indstilling der passer til dine specifikke interesser eller udfordringer. Denne situation giver dig mulighed for at bestemme konteksten, karaktererne og samtaleflowet, som du ønsker at øve. ## Hvorfor du skal spille *Dit Tilpassede Scenarie* 1. Tilpas oplevelsen til dine personlige mål, fra arbejdssituationer til dagligdags sociale interaktioner. 2. Eksperimenter med forskellige samtalestile, emner eller toner i en indstilling, du vælger. 3. Fokuser på de færdigheder eller ordforråd, du har brug for mest, hvad enten det er teknisk terminologi eller uformel small talk. 4. Nyd fuld kreativ frihed til at skabe et scenarie, der er både realistisk og engagerende for dig. 5. Få værdifuld øvelse i scenarier, som måske ikke dækkes af standard rollespil. ## Hvordan Scenariet Fungerer Du vil skitsere dit eget rollespil ved at give en kort beskrivelse af indstillingen, karaktererne og de vigtigste mål. AI'en vil tilpasse sig dine tilpassede instruktioner og engagere sig i dialog, der er i tråd med dit scenariets tema. Dette fleksible format hjælper dig med at mestre de præcise kommunikationsfærdigheder, du har brug for.
de: Erstellen Sie eine einzigartige, personalisierte Umgebung, die Ihren spezifischen Interessen oder Herausforderungen entspricht. Dieses Szenario ermöglicht es Ihnen, den Kontext, die Charaktere und den Gesprächsverlauf zu entscheiden, die Sie üben möchten. ## Warum Sie *Ihr benutzerdefiniertes Szenario* spielen sollten 1. Passen Sie das Erlebnis an Ihre persönlichen Ziele an, von Arbeitssituationen bis hin zu alltäglichen sozialen Interaktionen. 2. Experimentieren Sie mit verschiedenen Gesprächsstilen, Themen oder Tonlagen in einer von Ihnen gewählten Umgebung. 3. Konzentrieren Sie sich auf die Fähigkeiten oder das Vokabular, das Sie am meisten benötigen, sei es technisches Fachvokabular oder lockeres Geplänkel. 4. Genießen Sie vollständige kreative Freiheit, um ein Szenario zu erstellen, das sowohl realistisch als auch ansprechend für Sie ist. 5. Gewinnen Sie wertvolle Übung in Szenarien, die möglicherweise nicht in standardmäßigen Rollenspielen behandelt werden. ## Wie das Szenario funktioniert Sie skizzieren Ihr eigenes Rollenspiel, indem Sie eine kurze Beschreibung des Settings, der Charaktere und der Hauptziele bereitstellen. Die KI wird sich an Ihre benutzerdefinierten Anweisungen anpassen und in einen Dialog eintreten, der mit dem Thema Ihres Szenarios übereinstimmt. Dieses flexible Format hilft Ihnen, die genauen Kommunikationsfähigkeiten zu meistern, die Sie benötigen.
es: Crea un escenario único y personalizado que se ajuste a tus intereses o desafíos específicos. Este escenario te permite decidir el contexto, los personajes y el flujo de conversación que deseas practicar. ## Por qué deberías jugar *Tu Escenario Personalizado* 1. Adapta la experiencia a tus objetivos personales, desde situaciones laborales hasta interacciones sociales cotidianas. 2. Experimenta con diferentes estilos de conversación, temas o tonos en un escenario de tu elección. 3. Enfócate en las habilidades o el vocabulario que más necesitas, ya sea terminología técnica o charlas informales. 4. Disfruta de total libertad creativa para construir un escenario que sea tanto realista como atractivo para ti. 5. Obtén valiosa práctica en escenarios que pueden no estar cubiertos por los juegos de roles estándar. ## Cómo Funciona el Escenario Trazarás tu propio juego de roles proporcionando una breve descripción del escenario, los personajes y los objetivos principales. La IA se adaptará a tus instrucciones personalizadas y participará en un diálogo alineado con el tema de tu escenario. Este formato flexible te ayuda a dominar las habilidades de comunicación exactas que necesitas.
fr: Créez un cadre unique et personnalisé qui correspond à vos intérêts ou défis spécifiques. Ce scénario vous permet de décider du contexte, des personnages et du déroulement de la conversation que vous souhaitez pratiquer. ## Pourquoi vous devriez jouer à *Votre Scénario Personnalisé* 1. Personnalisez l'expérience en fonction de vos objectifs personnels, des situations de travail aux interactions sociales quotidiennes. 2. Expérimentez différents styles de conversation, sujets ou tons dans un cadre de votre choix. 3. Concentrez-vous sur les compétences ou le vocabulaire dont vous avez le plus besoin, qu'il s'agisse de terminologie technique ou de bavardage informel. 4. Profitez d'une liberté créative totale pour construire un scénario à la fois réaliste et engageant pour vous. 5. Bénéficiez d'une pratique précieuse dans des scénarios qui pourraient ne pas être couverts par des jeux de rôle standard. ## Comment fonctionne le scénario Vous allez décrire votre propre jeu de rôle en fournissant une brève description du cadre, des personnages et des objectifs principaux. L'IA s'adaptera à vos instructions personnalisées et s'engagera dans un dialogue en accord avec le thème de votre scénario. Ce format flexible vous aide à maîtriser les compétences de communication exactes dont vous avez besoin.
id: Buat setting yang unik dan dipersonalisasi yang sesuai dengan minat atau tantangan spesifik Anda. Skema ini memungkinkan Anda untuk menentukan konteks, karakter, dan alur percakapan yang ingin Anda praktikkan. ## Mengapa Anda Harus Memainkan *Skenario Kustom Anda* 1. Sesuaikan pengalaman dengan tujuan pribadi Anda, dari situasi kerja hingga interaksi sosial sehari-hari. 2. Eksperimen dengan berbagai gaya percakapan, topik, atau nada dalam setting pilihan Anda. 3. Fokus pada keterampilan atau kosakata yang paling Anda butuhkan, baik itu istilah teknis atau obrolan santai. 4. Nikmati kebebasan kreatif penuh untuk membangun skenario yang realistis dan menarik bagi Anda. 5. Dapatkan latihan berharga dalam skenario yang mungkin tidak tercakup oleh permainan peran standar. ## Cara Kerja Skenario Anda akan menguraikan peran Anda sendiri dengan memberikan deskripsi singkat tentang setting, karakter, dan tujuan utama. AI akan menyesuaikan dengan instruksi kustom Anda dan terlibat dalam dialog yang sesuai dengan tema skenario Anda. Format yang fleksibel ini membantu Anda menguasai keterampilan komunikasi yang tepat yang Anda butuhkan.
it: Crea un'ambientazione unica e personalizzata che si adatti ai tuoi specifici interessi o sfide. Questo scenario ti consente di decidere il contesto, i personaggi e il flusso della conversazione che vuoi praticare. ## Perché dovresti giocare a *Il Tuo Scenario Personalizzato* 1. Adatta l'esperienza ai tuoi obiettivi personali, dalle situazioni lavorative alle interazioni sociali quotidiane. 2. Sperimenta diversi stili di conversazione, argomenti o toni in un'ambientazione di tua scelta. 3. Concentrati sulle abilità o sul vocabolario di cui hai più bisogno, che si tratti di terminologie tecniche o chiacchiere informali. 4. Goditi la piena libertà creativa per costruire uno scenario che sia sia realistico che coinvolgente per te. 5. Ottieni preziosa pratica in scenari che potrebbero non essere coperti dai normali giochi di ruolo. ## Come funziona lo Scenario Dovrai delineare il tuo gioco di ruolo fornendo una breve descrizione dell'ambientazione, dei personaggi e degli obiettivi principali. L'IA si adatterà alle tue istruzioni personalizzate e parteciperà al dialogo in linea con il tema del tuo scenario. Questo formato flessibile ti aiuta a padroneggiare le esatte abilità comunicative di cui hai bisogno.
ja: ユニークで個別化された設定を作成し、あなたの特定の興味や課題に合わせましょう。このシナリオでは、練習したいコンテキスト、キャラクター、会話の流れを決めることができます。 ## *あなたのカスタムシナリオ* を楽しむべき理由 1. 仕事の状況から日常的な社交場面まで、あなたの個人的な目標に合わせて体験を調整できます。 2. お好きな設定で異なる会話スタイル、トピック、トーンを試すことができます。 3. 技術用語やカジュアルな雑談など、最も必要なスキルや語彙に集中できます。 4. あなたにとって現実的で魅力的なシナリオを作るための完全な創造的自由を楽しめます。 5. 標準的なロールプレイではカバーされていないシナリオで貴重な練習ができます。 ## シナリオの仕組み 設定、キャラクター、主要な目的の簡単な説明を提供して、自分自身のロールプレイを作成します。AIはあなたのカスタム指示に適応し、シナリオのテーマに沿った対話に従事します。この柔軟なフォーマットは、あなたが必要とする正確なコミュニケーションスキルを習得するのに役立ちます。
ms: Buat pengaturan unik dan peribadi yang sesuai dengan minat atau cabaran khusus anda. Senario ini membenarkan anda untuk memutuskan konteks, watak, dan aliran perbualan yang ingin anda amalkan. ## Kenapa Anda Perlu Bermain *Senario Kustom Anda* 1. Sesuaikan pengalaman kepada matlamat peribadi anda, daripada situasi kerja kepada interaksi sosial harian. 2. Bereksperimen dengan pelbagai gaya perbualan, topik, atau nada dalam suasana pilihan anda. 3. Fokus pada kemahiran atau perbendaharaan kata yang paling anda perlukan, sama ada terma teknikal atau sembang santai. 4. Nikmati kebebasan kreatif sepenuhnya untuk membina senario yang realistik dan menarik bagi anda. 5. Dapatkan amalan berharga dalam senario yang mungkin tidak diterangkan oleh permainan peranan standard. ## Cara Senario Berfungsi Anda akan menggambarkan permainan peranan anda sendiri dengan memberikan penerangan ringkas tentang suasana, watak, dan objektif utama. AI akan menyesuaikan kepada arahan kustom anda dan terlibat dalam dialog yang selaras dengan tema senario anda. Format yang fleksibel ini membantu anda menguasai kemahiran komunikasi tepat yang anda perlukan.
no: Lag et unikt, personlig tilpasset scenario som passer dine spesifikke interesser eller utfordringer. Dette scenariet lar deg bestemme konteksten, karakterene og samtalefluiden du ønsker å øve på. ## Hvorfor du bør spille *Ditt tilpassede scenario* 1. Skreddersy opplevelsen til dine personlige mål, fra arbeidssituasjoner til hverdagslige sosiale interaksjoner. 2. Eksperimenter med ulike samtalestiler, emner eller toner i et setting du velger. 3. Fokuser på ferdighetene eller ordforrådet du trenger mest, enten det er teknisk terminologi eller uformell småprat. 4. Nyt full kreativ frihet til å bygge et scenario som både er realistisk og engasjerende for deg. 5. Oppnå verdifull trening i scenarier som kanskje ikke dekkes av standard rollespill. ## Slik fungerer scenariet Du vil skissere ditt eget rollespill ved å gi en kort beskrivelse av settingen, karakterene og hovedmålene. AI-en vil tilpasse seg dine tilpassede instruksjoner og delta i dialog i samsvar med temaet i scenariet ditt. Dette fleksible formatet hjelper deg å mestre de spesifikke kommunikasjon ferdighetene du trenger.
pl: Stwórz unikalną, spersonalizowaną scenerię, która pasuje do Twoich specyficznych zainteresowań lub wyzwań. Ten scenariusz pozwala Ci zdecydować o kontekście, postaciach i przepływie rozmowy, które chcesz ćwiczyć. ## Dlaczego warto zagrać w *Twój Spersonalizowany Scenariusz* 1. Dostosuj doświadczenie do swoich osobistych celów, od sytuacji zawodowych po codzienne interakcje towarzyskie. 2. Eksperymentuj z różnymi stylami rozmowy, tematami lub tonami w wybranym przez siebie otoczeniu. 3. Skoncentruj się na umiejętnościach lub słownictwie, które są Ci najbardziej potrzebne, czy to terminologii technicznej, czy swobodnej rozmowie. 4. Ciesz się pełną swobodą twórczą, aby stworzyć scenariusz, który będzie zarówno realistyczny, jak i angażujący dla Ciebie. 5. Zyskaj cenne doświadczenie w scenariuszach, które mogą nie być objęte standardowymi odgrywaniem ról. ## Jak działa scenariusz Sporządzisz własne odgrywanie ról, podając krótką charakterystykę scenerii, postaci i głównych celów. Sztuczna inteligencja dostosuje się do Twoich niestandardowych instrukcji i weźmie udział w dialogu zgodnym z tematem Twojego scenariusza. Ten elastyczny format pomoże Ci opanować dokładnie te umiejętności komunikacyjne, których potrzebujesz.
pt: Crie um cenário único e personalizado que se encaixe em seus interesses ou desafios específicos. Este cenário permite que você decida o contexto, os personagens e o fluxo de conversa que deseja praticar. ## Por que você deve jogar *Seu Cenário Personalizado* 1. Ajuste a experiência aos seus objetivos pessoais, desde situações de trabalho até interações sociais do dia a dia. 2. Experimente diferentes estilos de conversa, tópicos ou tons em um ambiente de sua escolha. 3. Concentre-se nas habilidades ou no vocabulário que você mais precisa, seja terminologia técnica ou batatas de praia casuais. 4. Aproveite total liberdade criativa para construir um cenário que seja tanto realista quanto envolvente para você. 5. Ganhe prática valiosa em cenários que podem não ser cobertos por simulações padrão. ## Como o Cenário Funciona Você delineará seu próprio role-play fornecendo uma breve descrição do cenário, personagens e objetivos principais. A IA se adaptará às suas instruções personalizadas e se envolverá em um diálogo alinhado com o tema do seu cenário. Este formato flexível ajuda você a dominar exatamente as habilidades de comunicação de que precisa.
ru: Создайте уникальную, персонализированную обстановку, которая соответствует вашим специфическим интересам или проблемам. Этот сценарий позволяет вам решить контекст, персонажей и ход беседы, которые вы хотите отработать. ## Почему вам стоит сыграть в *Ваш индивидуальный сценарий* 1. Подстраивайте опыт под свои личные цели, от рабочих ситуаций до повседневных социальных взаимодействий. 2. Экспериментируйте с различными стилями беседы, темами или тонами в выбранной вами обстановке. 3. Сосредоточьтесь на навыках или словарном запасе, которые вам нужны больше всего, будь то техническая терминология или непринужденные разговоры. 4. Наслаждайтесь полной творческой свободой в создании сценария, который будет как реалистичным, так и увлекательным для вас. 5. Получите ценную практику в сценариях, которые могут не охватываться стандартными ролевыми играми. ## Как работает сценарий Вы опишете свою собственную ролевую игру, предоставив краткое описание обстановки, персонажей и основных целей. ИИ адаптируется к вашим индивидуальным инструкциям и будет вести диалог в соответствии с темой вашего сценария. Этот гибкий формат помогает вам овладеть точными навыками коммуникации, которые вам нужны.
sv: Skapa en unik, personlig inställning som passar dina specifika intressen eller utmaningar. Det här scenariot låter dig bestämma sammanhang, karaktärer och konversationsflöde som du vill öva på. ## Varför du bör spela *Ditt anpassade scenario* 1. Skräddarsy upplevelsen efter dina personliga mål, från arbetssituationer till vardagliga sociala interaktioner. 2. Experimentera med olika samtalsstilar, ämnen eller tonaliteter i en miljö du väljer. 3. Fokusera på de färdigheter eller det ordförråd du behöver mest, vare sig det är teknisk terminologi eller avslappnad småprat. 4. Njut av full kreativ frihet att bygga ett scenario som är både realistiskt och engagerande för dig. 5. Få värdefull övning i scenarier som kanske inte täcks av standard-rollspel. ## Hur scenariot fungerar Du kommer att skissera ditt eget rollspel genom att ge en kort beskrivning av inställningen, karaktärerna och de viktigaste målen. AI:n kommer att anpassa sig efter dina anpassade instruktioner och delta i dialog som är i linje med temat för ditt scenario. Detta flexibla format hjälper dig att bemästra just de kommunikationsfärdigheter du behöver.
th: สร้างการตั้งค่าที่ไม่เหมือนใครและเป็นส่วนตัวตามความสนใจหรือความท้าทายเฉพาะของคุณ สถานการณ์นี้จะช่วยให้คุณตัดสินใจว่า ต้องการฝึกบริบท ตัวละคร และการไหลของบทสนทนาอย่างไร ## ทำไมคุณควรเล่น *สถานการณ์ของคุณเอง* 1. ปรับแต่งประสบการณ์ให้ตรงตามเป้าหมายส่วนตัวของคุณ ตั้งแต่สถานการณ์ในที่ทำงานไปจนถึงการมีปฏิสัมพันธ์ทางสังคมในชีวิตประจำวัน 2. ทดลองกับสไตล์การสนทนา หัวข้อ หรือโทนเสียงที่แตกต่างกันในสภาพแวดล้อมที่คุณเลือก 3. มุ่งเน้นทักษะหรือคำศัพท์ที่คุณต้องการมากที่สุด ไม่ว่าจะเป็นศัพท์เทคนิคหรือการพูดคุยแบบสบายๆ 4. สนุกกับอิสระในการสร้างสรรค์เพื่อสร้างสถานการณ์ที่ทั้งสมจริงและน่าสนใจสำหรับคุณ 5. ได้รับการฝึกฝนที่มีค่าภายใต้สถานการณ์ที่อาจไม่ได้กล่าวถึงในบทบาทการเล่นมาตรฐาน ## วิธีการทำงานของสถานการณ์ คุณจะกำหนดบทบาทการเล่นของคุณเองโดยการให้คำอธิบายสั้น ๆ เกี่ยวกับการตั้งค่า ตัวละคร และเป้าหมายหลัก AI จะปรับตัวตามคำแนะนำที่กำหนดขึ้นเองของคุณและมีส่วนร่วมในการสนทนาที่ตรงตามธีมของสถานการณ์ของคุณ รูปแบบที่ยืดหยุ่นนี้จะช่วยให้คุณเชี่ยวชาญทักษะการสื่อสารที่คุณต้องการอย่างแท้จริง
tr: Benzersiz, kişiselleştirilmiş bir ortam yaratın; belirli ilgi alanlarınıza veya zorluklarınıza uygun bir ayar. Bu senaryo, uygulamak istediğiniz bağlamı, karakterleri ve konuşma akışını seçmenize olanak tanır. ## Neden *Özel Senaryonuzu* Oynamalısınız 1. Deneyimi, iş durumlarından günlük sosyal etkileşimlere kadar kişisel hedeflerinize uyacak şekilde özelleştirin. 2. Seçtiğiniz bir ortamda farklı konuşma tarzları, konular veya tonlar deneyin. 3. İhtiyacınız olan beceri veya kelime dağarcığına odaklanın; ister teknik terimler ister gündelik sohbet olsun. 4. Hem gerçekçi hem de ilgi çekici bir senaryo oluşturma konusunda tam yaratıcı özgürlüğün tadını çıkarın. 5. Standart rol oyunları tarafından kapsanmayan senaryolar üzerinde değerli pratik kazanın. ## Senaryonun İşleyişi Kendi rol oyununuzu belirleyerek ortam, karakterler ve ana hedeflerin kısa bir tanımını sağlayacaksınız. AI, özel talimatlarınıza uyum sağlayacak ve senaryonuzun temasına uygun bir diyalog sürdürmek için etkileşimde bulunacaktır. Bu esnek format, ihtiyaç duyduğunuz iletişim becerilerini tam olarak ustalaşmanıza yardımcı olur.
uk: Створіть унікальне, персоналізоване середовище, яке відповідає вашим конкретним інтересам або викликам. Цей сценарій дозволяє вам обрати контекст, персонажів та потік розмови, які ви хочете практикувати. ## Чому варто грати в *Ваш індивідуальний сценарій* 1. Налаштуйте досвід відповідно до власних цілей, від робочих ситуацій до повсякденних соціальних взаємодій. 2. Експериментуйте з різними стилями розмови, темами або тонами у вибраному вами середовищі. 3. Зосередьтесь на навичках або словниковому запасі, які вам найбільше потрібні, будь то технічні терміни чи повсякденні бесіди. 4. Насолоджуйтесь повною творчою свободою для створення сценарію, який буде як реалістичним, так і захоплюючим для вас. 5. Отримайте цінну практику в сценаріях, які можуть не бути охоплені стандартними рольовими іграми. ## Як працює сценарій Ви опишете ваш власний рольовий сценарій, надавши короткий опис середовища, персонажів та основних цілей. Штучний інтелект адаптується до ваших індивідуальних інструкцій і веде діалог, узгоджений з тематикою вашого сценарію. Цей гнучкий формат допоможе вам оволодіти саме тими навичками комунікації, які вам потрібні.
vi: Tạo một bối cảnh độc đáo, cá nhân hóa phù hợp với sở thích hoặc thách thức cụ thể của bạn. Tình huống này cho phép bạn quyết định ngữ cảnh, nhân vật và dòng chảy cuộc trò chuyện mà bạn muốn thực hành. ## Tại Sao Bạn Nên Chơi *Tình Huống Tùy Chỉnh Của Bạn* 1. Điều chỉnh trải nghiệm theo mục tiêu cá nhân của bạn, từ các tình huống công việc đến các tương tác xã hội hàng ngày. 2. Thử nghiệm với các phong cách trò chuyện, chủ đề hoặc giọng điệu khác nhau trong bối cảnh mà bạn chọn. 3. Tập trung vào các kỹ năng hoặc từ vựng mà bạn cần nhất, cho dù đó là thuật ngữ kỹ thuật hay những câu chuyện phiếm thường nhật. 4. Thoải mái sáng tạo để xây dựng một tình huống vừa thực tế vừa hấp dẫn cho bạn. 5. Được thực hành quý giá trong những tình huống có thể không được đề cập trong các vai diễn tiêu chuẩn. ## Cách Tình Huống Hoạt Động Bạn sẽ phác thảo vai diễn của riêng mình bằng cách cung cấp mô tả ngắn gọn về bối cảnh, nhân vật và mục tiêu chính. AI sẽ điều chỉnh theo hướng dẫn tùy chỉnh của bạn và tham gia vào cuộc đối thoại phù hợp với chủ đề của tình huống của bạn. Định dạng linh hoạt này giúp bạn làm chủ các kỹ năng giao tiếp chính xác mà bạn cần.

source: Create Your Own Role-Play Scenario
ar: أنشئ سيناريو لعب الأدوار الخاص بك
be: Стварыце свой уласны варыянт ролевай гульні
da: Opret Dit Eget Rollespilsscenarie
de: Erstelle dein eigenes Rollenspiel-Szenario
es: Crea Tu Propio Escenario de Juego de Roles
fr: Créez votre propre scénario de jeu de rôle
id: Buat Skenario Role-Play Anda Sendiri
it: Crea il tuo scenario di gioco di ruolo
ja: あなた自身のロールプレイシナリオを作成する
ms: Buat Senario Peranan Anda Sendiri
no: Lag ditt eget rollespillscenario
pl: Stwórz Swoją Własną Scenariusz Roli
pt: Crie Seu Próprio Cenário de Interpretação de Papéis
ru: Создайте свой собственный сценарий ролевой игры
sv: Skapa ditt eget rollspelscenario
th: สร้างสถานการณ์การเล่นบทบาทของคุณเอง
tr: Kendi Rol Oynama Senaryonuzu Oluşturun
uk: Створіть свій власний сценарій ролевої гри
vi: Tạo Kịch Bản Giao Diễn Của Bạn
