Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: No, you are purchasing full access for a selected period of time. There is no auto-renewal, you can buy full access again when your current period ends.
de: Nein, Sie erwerben den vollständigen Zugang für einen ausgewählten Zeitraum. Es gibt keine automatische Verlängerung, Sie können den vollständigen Zugang erneut erwerben, wenn Ihr aktueller Zeitraum endet.
es: No, estás comprando acceso completo por un período de tiempo seleccionado. No hay renovación automática, puedes comprar acceso completo nuevamente cuando tu período actual termine.
id: Tidak, Anda membeli akses penuh untuk periode waktu yang dipilih. Tidak ada perpanjangan otomatis, Anda dapat membeli akses penuh lagi ketika periode Anda saat ini berakhir.
it: No, stai acquistando l'accesso completo per un periodo di tempo selezionato. Non c'è rinnovo automatico, puoi acquistare di nuovo l'accesso completo quando termina il tuo periodo attuale.
ja: いいえ、特定の期間の完全なアクセスを購入しています。自動更新はありませんので、現在の期間が終了した時点で再度完全なアクセスを購入することができます。
no: Nei, du kjøper full tilgang for en valgt tidsperiode. Det er ingen automatisk fornyelse, du kan kjøpe full tilgang igjen når din nåværende periode utløper.
pl: Nie, kupujesz pełny dostęp na wybrany okres czasu. Nie ma automatycznego odnawiania, możesz ponownie kupić pełny dostęp, gdy Twój obecny okres się zakończy.
pt: Não, você está comprando acesso completo por um período de tempo selecionado. Não há renovação automática, você pode comprar acesso completo novamente quando o seu período atual terminar.
ru: Нет, вы приобретаете полный доступ на выбранный период времени. Автоматическое продление отсутствует, вы можете купить полный доступ снова, когда ваш текущий период закончится.
sv: Nej, du köper fullständig tillgång för en vald tidsperiod. Det finns ingen automatisk förnyelse, du kan köpa fullständig tillgång igen när din nuvarande period slutar.
th: ไม่, คุณกำลังซื้อลิขสิทธิ์แบบเต็มสำหรับระยะเวลาที่เลือก ไม่มีการต่ออายุอัตโนมัติ คุณสามารถซื้อลิขสิทธิ์แบบเต็มอีกครั้งเมื่อช่วงเวลาปัจจุบันของคุณสิ้นสุดลง
tr: Hayır, seçilen bir süre için tam erişim satın alıyorsunuz. Otomatik yenileme yoktur, mevcut süreniz bittiğinde tekrar tam erişim satın alabilirsiniz.
uk: Ні, ви купуєте повний доступ на вибраний період часу. Автопродовження не передбачається, ви можете придбати повний доступ знову після закінчення поточного періоду.
vi: Không, bạn đang mua quyền truy cập đầy đủ cho một khoảng thời gian đã chọn. Không có tự động gia hạn, bạn có thể mua quyền truy cập đầy đủ lần nữa khi thời gian hiện tại của bạn kết thúc.

source: No, you purchase resources. There is no automatic renewal; you can purchase them again when you need more.
uk: Ні, ви купуєте ресурси. Автоматичного поновлення немає; ви можете придбати їх знову, коли вам буде потрібно більше.

source: No. All sessions are on-demand. You can practice anytime with AI-powered mock interviews, review feedback immediately, and repeat questions as often as you want.
ar: لا. جميع الجلسات عند الطلب. يمكنك التدرب في أي وقت مع المقابلات الوهمية المدعومة بالذكاء الاصطناعي، ومراجعة التعليقات فورًا، وتكرار الأسئلة بالقدر الذي تريده.
be: Няма. Усе сесіі на запыт. Вы можаце практыкавацца ў любы час з дапамогай імітаваных інтэрв'ю на базе AI, неадкладна аглядаць зваротную сувязь і паўтараць пытанні столькі, колькі хочаце.
da: Nej. Alle sessioner er efter behov. Du kan øve dig når som helst med AI-drevne mock-interviews, gennemgå feedback med det samme og gentage spørgsmål så ofte du vil.
de: Nein. Alle Sitzungen sind nach Bedarf verfügbar. Sie können jederzeit mit KI-gestützten Probeinterviews üben, das Feedback sofort überprüfen und Fragen so oft wiederholen, wie Sie möchten.
es: No. Todas las sesiones son a demanda. Puedes practicar en cualquier momento con entrevistas simuladas impulsadas por IA, revisar los comentarios inmediatamente y repetir las preguntas tantas veces como desees.
fr: Non. Toutes les sessions sont à la demande. Vous pouvez pratiquer à tout moment avec des simulations d'entretiens alimentés par l'IA, consulter les commentaires immédiatement et répéter les questions autant de fois que vous le souhaitez.
id: Tidak. Semua sesi bersifat sesuai permintaan. Anda dapat berlatih kapan saja dengan wawancara tiruan yang didukung AI, langsung meninjau umpan balik, dan mengulangi pertanyaan sebanyak yang Anda mau.
it: No. Tutte le sessioni sono su richiesta. Puoi esercitarti in qualsiasi momento con simulazioni di colloqui alimentate dall'intelligenza artificiale, rivedere immediatamente il feedback e ripetere le domande tutte le volte che vuoi.
ja: 番号。すべてのセッションはオンデマンドです。AIを活用した模擬面接でいつでも練習ができ、フィードバックを即座にレビューし、質問を何度でも繰り返すことができます。
ms: Tidak. Semua sesi adalah atas permintaan. Anda boleh berlatih bila-bila masa dengan temuduga tiruan berkuasa AI, memahami maklum balas dengan serta-merta, dan mengulangi soalan sebanyak yang anda mahu.
no: Nei. Alle økter er på forespørsel. Du kan øve når som helst med AI-drevne simulert intervjuer, gjennomgå tilbakemeldinger umiddelbart, og gjenta spørsmål så ofte du vil.
pl: Nie. Wszystkie sesje są na żądanie. Możesz ćwiczyć w dowolnym momencie z wywiadami próbka wspieranymi przez AI, natychmiast przeglądać opinie i powtarzać pytania tak często, jak chcesz.
pt: Não. Todas as sessões são sob demanda. Você pode praticar a qualquer momento com entrevistas simuladas impulsionadas por IA, revisar o feedback imediatamente e repetir as perguntas quantas vezes desejar.
ru: Нет. Все сеансы проводятся по требованию. Вы можете практиковаться в любое время с помощью интервью-симуляторов на основе ИИ, сразу получать обратную связь и повторять вопросы столько раз, сколько захотите.
sv: Nej. Alla sessioner är on-demand. Du kan öva när som helst med AI-drivna simulerade intervjuer, granska feedback omedelbart och repetera frågor så ofta du vill.
th: ไม่ ทุกๆ เซสชันเป็นแบบออนดีมานด์ คุณสามารถฝึกฝนได้ทุกเมื่อด้วยการสัมภาษณ์จำลองที่ใช้ AI รับความคิดเห็นทันที และสามารถทำซ้ำคำถามได้ตามต้องการ
tr: Hayır. Tüm oturumlar isteğe bağlıdır. AI destekli sahte mülakatlarla istediğiniz zaman pratik yapabilir, geri bildirimleri hemen inceleyebilir ve soruları istediğiniz sıklıkta tekrarlayabilirsiniz.
uk: Ні. Усі сесії доступні за запитом. Ви можете практикуватися в будь-який час за допомогою інтерв'ю-практик, підтримуваних штучним інтелектом, негайно переглядати відгуки та повторювати запитання стільки разів, скільки забажаєте.
vi: Không. Tất cả các phiên đều theo yêu cầu. Bạn có thể luyện tập bất cứ lúc nào với các cuộc phỏng vấn mô phỏng được hỗ trợ bởi AI, xem lại phản hồi ngay lập tức, và lặp lại các câu hỏi thường xuyên như bạn muốn.

source: No. FluencyPal does not use automatic recurring payments. You decide each month whether you want to continue and pay again manually.
ar: لا. لا يستخدم FluencyPal المدفوعات التلقائية المتكررة. تقرر كل شهر إذا كنت تريد الاستمرار والدفع مرة أخرى يدويًا.
be: Не. FluencyPal не выкарыстоўвае аўтаматычныя паўтаральныя плацяжы. Вы самі вырашаеце кожны месяц, ці хочаце працягнуць, і зноў аплачваеце ўручную.
da: Nej. FluencyPal bruger ikke automatiske tilbagevendende betalinger. Du beslutter hver måned, om du vil fortsætte og betaler igen manuelt.
de: Nein. FluencyPal verwendet keine automatischen wiederkehrenden Zahlungen. Sie entscheiden jeden Monat, ob Sie fortfahren und erneut manuell bezahlen möchten.
es: No. FluencyPal no utiliza pagos automáticos recurrentes. Tú decides cada mes si deseas continuar y pagar nuevamente de forma manual.
fr: Non. FluencyPal n'utilise pas de paiements récurrents automatiques. Vous décidez chaque mois si vous souhaitez continuer et payer à nouveau manuellement.
id: Tidak. FluencyPal tidak menggunakan pembayaran berulang otomatis. Anda memutuskan setiap bulan apakah Anda ingin melanjutkan dan membayar lagi secara manual.
it: No. FluencyPal non utilizza pagamenti ricorrenti automatici. Ogni mese decidi se vuoi continuare e pagare nuovamente manualmente.
ja: いいえ。FluencyPalは自動的な定期支払いを使用しません。毎月続けるかどうかを決定し、手動で再度支払います。
no: Nei. FluencyPal bruker ikke automatiske, gjentakende betalinger. Du bestemmer hver måned om du vil fortsette og betale igjen manuelt.
pl: Nie. FluencyPal nie używa automatycznych płatności cyklicznych. Każdego miesiąca sam decydujesz, czy chcesz kontynuować i ponownie zapłacić ręcznie.
pt: Não. O FluencyPal não utiliza pagamentos automáticos recorrentes. Você decide a cada mês se deseja continuar e pagar novamente manualmente.
ru: Нет. FluencyPal не использует автоматические повторяющиеся платежи. Вы сами решаете каждый месяц, хотите ли вы продолжать и оплачивать снова вручную.
sv: Nej. FluencyPal använder inte automatiska återkommande betalningar. Du bestämmer varje månad om du vill fortsätta och betala igen manuellt.
th: ไม่ FluencyPal ไม่ได้ใช้การชำระเงินอัตโนมัติที่เกิดขึ้นประจำ คุณสามารถตัดสินใจได้ในแต่ละเดือนว่าคุณต้องการจะดำเนินการต่อและชำระเงินอีกครั้งด้วยตนเอง
tr: Hayır. FluencyPal otomatik tekrar eden ödemeler kullanmaz. Her ay devam etmek isteyip istemediğinize siz karar verirsiniz ve ödemeyi manuel olarak yeniden yaparsınız.
uk: Ні. FluencyPal не використовує автоматичні регулярні платежі. Ви самі вирішуєте кожен місяць, чи хочете продовжити та оплатити знову вручну.
vi: Không. FluencyPal không sử dụng thanh toán tự động định kỳ. Bạn quyết định mỗi tháng liệu có muốn tiếp tục và thanh toán lại theo cách thủ công hay không.

source: No. FluencyPal offers a free plan with limited features and a monthly plan for full access. You can use the free plan indefinitely to practice speaking and explore basic features before deciding to upgrade.
ar: لا. يقدم FluencyPal خطة مجانية بميزات محدودة وخطة شهرية للوصول الكامل. يمكنك استخدام الخطة المجانية إلى أجل غير مسمى لممارسة التحدث واستكشاف الميزات الأساسية قبل اتخاذ القرار بالترقية.
be: Не. FluencyPal прапануе бясплатны план з абмежаванымі функцыямі і штомесячны план для поўнага доступу. Вы можаце выкарыстоўваць бясплатны план неабмежаваны час, каб практыкавацца ў маўленні і даследаваць асноўныя функцыі, перш чым вырашыць перайсці на палепшаны план.
da: Nej. FluencyPal tilbyder en gratis plan med begrænsede funktioner og en månedlig plan for fuld adgang. Du kan bruge den gratis plan på ubestemt tid til at øve tale og udforske grundlæggende funktioner, inden du beslutter dig for at opgradere.
de: Nein. FluencyPal bietet einen kostenlosen Plan mit eingeschränkten Funktionen und einen monatlichen Plan für den vollständigen Zugriff an. Sie können den kostenlosen Plan unbegrenzt nutzen, um das Sprechen zu üben und grundlegende Funktionen zu erkunden, bevor Sie sich für ein Upgrade entscheiden.
es: No. FluencyPal ofrece un plan gratuito con funciones limitadas y un plan mensual para acceso completo. Puedes utilizar el plan gratuito indefinidamente para practicar el habla y explorar las funciones básicas antes de decidirte a actualizar.
fr: Non. FluencyPal propose un plan gratuit avec des fonctionnalités limitées et un plan mensuel pour un accès complet. Vous pouvez utiliser le plan gratuit indéfiniment pour pratiquer la parole et explorer les fonctionnalités de base avant de décider de passer à la version supérieure.
id: Tidak. FluencyPal menawarkan rencana gratis dengan fitur terbatas dan rencana bulanan untuk akses penuh. Anda dapat menggunakan rencana gratis tanpa batas waktu untuk berlatih berbicara dan menjelajahi fitur dasar sebelum memutuskan untuk meningkatkan.
it: No. FluencyPal offre un piano gratuito con funzionalità limitate e un piano mensile per l'accesso completo. Puoi utilizzare il piano gratuito a tempo indeterminato per praticare il parlato ed esplorare le funzionalità di base prima di decidere di passare all'upgrade.
ja: いいえ。FluencyPalは、機能が制限された無料プランと、全機能にアクセスできる月額プランを提供しています。アップグレードを決定する前に、無料プランを無期限に利用してスピーキングの練習や基本機能を探索できます。
no: Nei. FluencyPal tilbyr en gratis plan med begrensede funksjoner og en månedlig plan for full tilgang. Du kan bruke den gratis planen ubegrenset for å øve på å snakke og utforske grunnleggende funksjoner før du bestemmer deg for å oppgradere.
pl: Nie. FluencyPal oferuje darmowy plan z ograniczonymi funkcjami oraz miesięczny plan umożliwiający pełen dostęp. Możesz korzystać z darmowego planu bezterminowo, aby ćwiczyć mówienie i eksplorować podstawowe funkcje, zanim zdecydujesz się na upgrade.
pt: Não. O FluencyPal oferece um plano gratuito com recursos limitados e um plano mensal para acesso completo. Você pode usar o plano gratuito indefinidamente para praticar a fala e explorar recursos básicos antes de decidir fazer um upgrade.
ru: Нет. FluencyPal предлагает бесплатный план с ограниченными функциями и ежемесячный план для полного доступа. Вы можете использовать бесплатный план неограниченное время, чтобы практиковать речь и изучать базовые функции перед тем, как решить обновиться.
sv: Nej. FluencyPal erbjuder ett gratis abonnemang med begränsade funktioner och ett månatligt abonnemang för full åtkomst. Du kan använda gratisabonnemanget på obestämd tid för att öva på att tala och utforska grundläggande funktioner innan du beslutar dig för att uppgradera.
th: ไม่. FluencyPal มีแผนฟรีที่มีคุณสมบัติจำกัดและแผนรายเดือนสำหรับการเข้าถึงเต็มรูปแบบ คุณสามารถใช้แผนฟรีได้ไม่จำกัดเพื่อฝึกพูดและสำรวจคุณสมบัติพื้นฐานก่อนตัดสินใจอัปเกรด
tr: Hayır. FluencyPal, kısıtlı özelliklere sahip ücretsiz bir plan ve tam erişim için aylık bir plan sunar. Konuşma pratiği yapmak ve yükseltme kararı vermeden önce temel özellikleri keşfetmek için ücretsiz planı süresiz olarak kullanabilirsiniz.
uk: Ні. FluencyPal пропонує безкоштовний план з обмеженими функціями та щомісячний план для повного доступу. Ви можете використовувати безкоштовний план необмежено довго, щоб практикувати мовлення та ознайомитися з базовими функціями перед тим, як вирішити оновити план.
vi: Không. FluencyPal cung cấp gói miễn phí với các tính năng hạn chế và gói hàng tháng để truy cập đầy đủ. Bạn có thể sử dụng gói miễn phí vô thời hạn để thực hành nói và khám phá các tính năng cơ bản trước khi quyết định nâng cấp.

source: No. The price shown is the full price. There are no hidden fees or surprise charges.
ar: لا. السعر المعروض هو السعر الكامل. لا توجد رسوم خفية أو رسوم مفاجئة.
be: Не. Паказаная цана з'яўляецца поўнай. Няма ніякіх схаваных плацяжоў або нечаканых збораў.
da: Nej. Den viste pris er den fulde pris. Der er ingen skjulte gebyrer eller overraskelsesafgifter.
de: Nein. Der angezeigte Preis ist der volle Preis. Es gibt keine versteckten Gebühren oder Überraschungskosten.
es: No. El precio mostrado es el precio completo. No hay cargos ocultos ni sorpresas adicionales.
fr: Non. Le prix affiché est le prix total. Il n'y a pas de frais cachés ni de frais supplémentaires inattendus.
id: Tidak. Harga yang ditampilkan adalah harga penuh. Tidak ada biaya tersembunyi atau biaya kejutan.
it: No. Il prezzo indicato è il prezzo pieno. Non ci sono costi nascosti o addebiti a sorpresa.
ja: 番号。表示されている価格が全価格です。隠れた料金や驚きの請求はありません。
no: Nei. Prisen som vises er fullprisen. Det er ingen skjulte avgifter eller overraskende kostnader.
pl: Nie. Wyświetlana cena jest pełną ceną. Nie ma żadnych ukrytych opłat ani niespodziewanych kosztów.
pt: Não. O preço exibido é o preço total. Não há taxas ocultas ou cobranças surpresa.
ru: Нет. Указанная цена является полной. Никаких скрытых сборов или неожиданных начислений нет.
sv: Nej. Priset som visas är det fullständiga priset. Det finns inga dolda avgifter eller överraskningskostnader.
th: ไม่ ราคาที่แสดงคือราคาทั้งหมด ไม่มีค่าธรรมเนียมแอบแฝงหรือค่าใช้จ่ายเพิ่มเติมใดๆ
tr: Hayır. Gösterilen fiyat, tam fiyattır. Gizli ücretler veya sürpriz masraflar yoktur.
uk: Ні. Зазначена ціна є повною ціною. Немає жодних прихованих комісій або несподіваних платежів.
vi: Không. Giá hiển thị là giá đầy đủ. Không có phí ẩn hoặc các khoản phụ phí bất ngờ.

source: No. You can start the free plan without entering any payment details.
ar: لا. يمكنك البدء بالخطة المجانية دون إدخال أي تفاصيل دفع.
be: Не. Вы можаце пачаць з бясплатнага плана без уводу якіх-небудзь плацежных рэквізітаў.
da: Nej. Du kan starte den gratis plan uden at indtaste nogen betalingsoplysninger.
de: Nein. Sie können den kostenlosen Plan starten, ohne Zahlungsdetails einzugeben.
es: No. Puedes comenzar con el plan gratuito sin ingresar ningún detalle de pago.
fr: Non. Vous pouvez commencer le plan gratuit sans saisir de détails de paiement.
id: Tidak. Anda dapat memulai rencana gratis tanpa memasukkan detail pembayaran apa pun.
it: No. Puoi iniziare il piano gratuito senza inserire alcun dettaglio di pagamento.
ja: いいえ。支払い情報を入力せずに無料プランを始めることができます。
no: Nei. Du kan starte gratisplanen uten å oppgi noen betalingsdetaljer.
pl: Nie. Możesz rozpocząć darmowy plan bez wprowadzania jakichkolwiek danych płatności.
pt: Não. Você pode começar o plano gratuito sem inserir nenhum detalhe de pagamento.
ru: Нет. Вы можете начать использовать бесплатный план, не вводя данные для оплаты.
sv: Nej. Du kan starta den kostnadsfria planen utan att ange några betalningsuppgifter.
th: ไม่ คุณสามารถเริ่มแผนฟรีโดยไม่ต้องกรอกรายละเอียดการชำระเงินใด ๆ
tr: Hayır. Herhangi bir ödeme bilgisi girmeden ücretsiz plana başlayabilirsiniz.
uk: Ні. Ви можете розпочати безкоштовний план, не вводячи жодних платіжних реквізитів.
vi: Không. Bạn có thể bắt đầu gói miễn phí mà không cần nhập bất kỳ thông tin thanh toán nào.

source: non-native English speakers
ar: غير الناطقين بالإنجليزية بطلاقة
be: неродныя гаворкі англійскай мовы
da: ikke-engelsktalende
de: Nicht-Muttersprachler im Englischen
es: hablantes de inglés no nativos
fr: locuteurs non natifs de l'anglais
id: penutur bahasa Inggris non-pribumi
it: madrelingua non-inglese
ja: ネイティブでない英語話者
ms: penutur Inggeris bukan asli
no: ikke-morsmål engelske talere
pl: osoby mówiące w języku angielskim nie będącym ich ojczystym
pt: falantes não nativos de inglês
ru: носители языка, для которых английский не является родным
sv: icke-engelsktalande
th: ผู้พูดภาษาอังกฤษที่ไม่ใช่ภาษาแม่
tr: anadil olarak İngilizce konuşmayanlar
uk: нерідні користувачі англійської мови
vi: người nói tiếng Anh không phải người bản xứ

source: Normal
it: Normale
ja: 通常
ru: Нормальный
uk: Нормальний

source: Norwegian Learning Plan
ar: خطة تعلم النرويجية
be: План вучэння нарвежскай мовы
da: Norsk Læringsplan
de: Norwegischer Lernplan
es: Plan de Aprendizaje Noruego
fr: Plan d'Apprentissage Norvégien
id: Rencana Belajar Bahasa Norwegia
it: Piano di Apprendimento Norvegese
ja: ノルウェー語学習プラン
ms: Rancangan Pembelajaran Bahasa Norway
no: Norsk Læringsplan
pl: Plan Nauki Norweskiego
pt: Plano de Aprendizagem de Norueguês
ru: План изучения норвежского языка
sv: Norska Läroplanen
th: แผนการเรียนรู้ภาษานอร์เวย์
tr: Norveççe Öğrenme Planı
uk: План навчання норвезької
vi: Kế Hoạch Học Tiếng Na Uy

source: Not Found
ar: غير موجود
be: Не знойдзена
da: Ikke fundet
de: Nicht gefunden
es: No encontrado
fr: Non trouvé
id: Tidak Ditemukan
it: Non Trovato
ja: 見つかりません
ms: Tidak Ditemui
no: Ikke funnet
pl: Nie znaleziono
pt: Não Encontrado
ru: Не найдено
sv: Hittades inte
th: ไม่พบ
tr: Bulunamadı
uk: Не знайдено
vi: Không tìm thấy

source: not published
ar: غير منشور
be: не апублікавана
da: ikke offentliggjort
de: nicht veröffentlicht
es: no publicado
fr: non publié
id: belum diterbitkan
it: non pubblicato
ja: 未公開
ms: tidak diterbitkan
no: ikke publisert
pl: nie opublikowano
pt: não publicado
ru: не опубликовано
sv: inte publicerad
th: ยังไม่ได้เผยแพร่
tr: yayınlanmadı
uk: не опубліковано
vi: chưa xuất bản

source: Not running inside Telegram App
ar: plaintext لا يعمل داخل تطبيق تليجرام
be: Не запушчана ў дадатку Telegram
da: Ikke kørende inde i Telegram Appen
de: Nicht in der Telegram-App ausgeführt
es: No se está ejecutando dentro de la aplicación Telegram
fr: Ne fonctionne pas dans l'application Telegram
id: Tidak berjalan di dalam Aplikasi Telegram
it: Non in esecuzione all'interno dell'applicazione Telegram
ja: Telegramアプリ内で実行されていません
ms: Tidak menjalankan di dalam Aplikasi Telegram
no: Ikke kjører inne i Telegram Appen
pl: Nie uruchomiono w aplikacji Telegram
pt: Não está sendo executado dentro do aplicativo Telegram
ru: Не работает в приложении Telegram
sv: Körs inte i Telegram-appen
th: ไม่ได้ทำงานภายในแอป Telegram
tr: Telegram Uygulaması içinde çalışmıyor
uk: Не запущено в додатку Telegram
vi: Không chạy bên trong ứng dụng Telegram

source: Not sure what to write? Try one of these:
uk: Не впевнені, що писати? Спробуйте одне з цих:

source: Not sure yet?
uk: Ще не впевнені?

source: Notification was sent to the dev team. Sorry for that...
ar: تم إرسال الإشعار إلى فريق التطوير. عذرًا على ذلك...
be: Абвешчанне было адпраўлена ​​каманде распрацоўнікаў. Прабачце за гэта...
da: Notifikation blev sendt til dev teamet. Beklager det...
de: Die Benachrichtigung wurde an das Entwicklerteam gesendet. Tut uns leid...
es: Se envió una notificación al equipo de desarrollo. Lo sentimos por eso...
fr: La notification a été envoyée à l'équipe de dev. Désolé pour cela...
id: Notifikasi telah dikirim ke tim pengembang. Maaf atas hal ini...
it: La notifica è stata inviata al team di sviluppo. Ci dispiace per questo...
ja: デベロップメントチームに通知が送信されました。申し訳ありません...
ms: Pemberitahuan telah dihantar kepada pasukan dev. Maaf atas perkara itu...
no: Varsel ble sendt til utviklingsteamet. Beklager det...
pl: Powiadomienie zostało wysłane do zespołu deweloperskiego. Przepraszamy za to...
pt: A notificação foi enviada para a equipe de desenvolvimento. Desculpe por isso...
ru: Уведомление было отправлено команде разработчиков. Извините за это...
sv: Meddelandet skickades till utvecklingsteamet. Ledsen för det...
th: การแจ้งเตือนถูกส่งไปยังทีมพัฒนาแล้ว ขออภัยในความไม่สะดวก...
tr: Bildirim dev ekibine gönderildi. Bunun için özür dileriz...
uk: Повідомлення було відправлено команді розробників. Вибачте за це...
vi: Thông báo đã được gửi đến nhóm phát triển. Xin lỗi vì điều này...

source: Now
id: Sekarang
it: Adesso
ja: 今
no: Nå
ru: Сейчас
uk: Зараз

source: Number of rounds
id: Jumlah putaran
it: Numero di turni
ja: ラウンド数
no: Antall runder
ru: Количество раундов
uk: Кількість раундів

source: of the Website operated by Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" with its registered office in Warsaw.
uk: вебсайту, що управляється Фундацією Розвитку Підприємництва "Twój StartUp" з офісом в Варшаві.
