Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Analyzing your inputs...
ar: جارٍ تحليل مدخلاتك...
be: Аналізую вашыя ўводы...
da: Analyserer dine input...
de: Analysiere deine Eingaben...
es: Analizando tus entradas...
fr: Analyse de vos entrées...
id: Menganalisis masukan Anda...
it: Analizzando i tuoi input...
ja: 入力を分析中...
ms: Menganalisis input anda...
no: Analyserer dine innlegg...
pl: Analizowanie twoich danych wejściowych...
pt: Analisando seus dados de entrada...
ru: Анализ входных данных...
sv: Analyserar dina inmatningar...
th: กำลังวิเคราะห์ข้อมูลของคุณ...
tr: Girdi verilerinizi analiz ediliyor...
uk: Аналізуємо ваші введення...
vi: Đang phân tích các đầu vào của bạn...

source: Analyzing...
ar: جار التحليل...
be: Аналізуецца...
da: Analyserer...
de: Analysieren...
es: Analizando...
fr: Analyse en cours...
id: Menganalisis...
it: Analizzando...
ja: 解析中...
ms: Menganalisis...
no: Analyserer...
pl: Analizowanie...
pt: Analisando...
ru: Анализирую...
sv: Analyserar...
th: กำลังวิเคราะห์...
tr: Analiz ediliyor...
uk: Аналізуємо...
vi: Đang phân tích...

source: and
ar: و
be: і
da: og
de: und
es: y
fr: et
id: dan
it: e
ja: そして
ms: dan
no: og
pl: i
pt: e
ru: и
sv: och
th: และ
tr: ve
uk: та
vi: và

source: Angular & RxJS
th: แองกูลาร์ & RxJS
uk: Angular та RxJS

source: Answer questions correctly to climb the leaderboard!
de: Beantworte die Fragen korrekt, um auf der Rangliste aufzusteigen!
es: ¡Responde correctamente a las preguntas para subir en la clasificación!
id: Jawab pertanyaan dengan benar untuk naik peringkat di papan peringkat!
it: Rispondi correttamente alle domande per scalare la classifica!
ja: 質問に正しく答えて、リーダーボードを上りましょう！
no: Svar på spørsmålene riktig for å klatre på ledertavlen!
pl: Odpowiadaj poprawnie na pytania, aby wspiąć się na szczyt tabeli wyników!
pt: Responda às perguntas corretamente para subir no ranking!
ru: Отвечайте на вопросы правильно, чтобы подняться в таблице лидеров!
sv: Svara på frågor korrekt för att klättra på topplistan!
tr: Soruları doğru yanıtlayarak liderlik tablosunda yükselin!
uk: Відповідайте на запитання правильно, щоб піднятися в таблиці лідерів!

source: Answering Typical Interview Questions
ar: الإجابة على الأسئلة الشائعة في المقابلات
be: Адказы на типовыя пытанні падчас інтэрв'ю
da: Besvarelse af Typiske Interview Spørgsmål
de: Antworten auf typische Bewerbungsfragen
es: Responder a Preguntas Típicas de Entrevistas
fr: Répondre aux Questions d'Entretien Typiques
id: Menjawab Pertanyaan Wawancara yang Umum
it: Rispondere alle Domande Tipiche dell'Intervista
ja: 典型的な面接の質問への回答
ms: Menjawab Soalan Temuduga Biasa
no: Å svare på typiske intervju spørsmål
pl: Odpowiadanie na typowe pytania z rozmowy kwalifikacyjnej
pt: Respondendo a Perguntas Típicas de Entrevistas
ru: Ответ на типичные вопросы на собеседовании
sv: Svara på Typiska Intervjufrågor
th: การตอบคำถามสัมภาษณ์ทั่วไป
tr: Tipik Mülakat Sorularına Yanıt Verme
uk: Відповідь на Типові Питання під Час Співбесіди
vi: Trả lời những Câu hỏi Phỏng vấn Tiêu chuẩn

source: Anything else?
ar: هل من شيء آخر؟
be: Што яшчэ?
da: Noget andet?
de: Noch etwas?
es: ¿Algo más?
fr: Autre chose ?
id: Apa lagi?
it: Altro?
ja: 他に何か？
ms: Apa lagi?
no: Noe annet?
pl: Czy coś jeszcze?
pt: Mais alguma coisa?
ru: Что-нибудь еще?
sv: Något annat?
th: อีกอย่างไหม?
tr: Başka bir şey?
uk: Щось ще?
vi: Còn gì khác không?

source: API design and data modeling insights
ar: رؤى تصميم واجهة برمجة التطبيقات ونمذجة البيانات
be: Інсайты па дызайне API і мадэляванні дадзеных
da: API design og datamodeleringsindsigter
de: API-Design und Datenmodellierungs-Einblicke
es: Ideas sobre diseño de API y modelado de datos
fr: Conception d'API et idées de modélisation des données
id: Wawasan desain API dan pemodelan data
it: Approfondimenti sulla progettazione delle API e sulla modellazione dei dati
ja: APIの設計とデータモデリングの洞察
ms: Wawasan reka bentuk API dan pemodelan data
no: API-design og innsikt i datamodellering
pl: Informacje o projektowaniu interfejsów API i modelowaniu danych
pt: Insights sobre design de API e modelagem de dados
ru: Идеи по проектированию API и моделированию данных
sv: API-design och insikter om datamodellering
th: ข้อมูลเชิงลึกเกี่ยวกับการออกแบบ API และการจำลองข้อมูล
tr: API tasarımı ve veri modelleme içgörüleri
uk: Інсайти щодо проектування API та моделювання даних
vi: Các hiểu biết về thiết kế API và mô hình hóa dữ liệu

source: Appointment
ar: موعد
be: Прызначэнне
da: Aftale
de: Termin
es: Cita
fr: Rendez-vous
id: Janji temu
it: Appuntamento
ja: 予約
ms: Janji temu
no: Avtale
pl: Spotkanie
pt: Compromisso
ru: Встреча
sv: Möte
th: นัดหมาย
tr: Randevu
uk: Призначення
vi: Lịch hẹn

source: Arabic Learning Plan
ar: خطة التعلم باللغة العربية
be: План вучэння арабскай мовы
da: Arabisk Læringsplan
de: Arabischer Lernplan
es: Plan de Aprendizaje de Árabe
fr: Plan d'Apprentissage de l'Arabe
id: Rencana Belajar Bahasa Arab
it: Piano di apprendimento dell'arabo
ja: アラビア語学習プラン
ms: Rancangan Pembelajaran Arab
no: Arabisk Læringsplan
pl: Plan Nauki Języka Arabskiego
pt: Plano de Aprendizagem de Árabe
ru: План изучения арабского
sv: Arabisk inlärningsplan
th: แผนการเรียนรู้ภาษาอาหรับ
tr: Arapça Öğrenme Planı
uk: План вивчення арабської
vi: Kế Hoạch Học Tiếng Ả Rập

source: Architecture & Design
ar: الهندسة المعمارية والتصميم
be: Architecture & Design Архітэктура і дызайн
da: Arkitektur & Design
de: Architektur & Design
es: Arquitectura y Diseño
id: Arsitektur & Desain
it: Architettura e Design
ja: 建築 & デザイン
ms: Seni Bina & Reka Bentuk
no: Arkitektur & Design
pl: Architektura i Projektowanie
pt: Arquitetura & Design
ru: Архитектура и дизайн
sv: Arkitektur & Design
th: สถาปัตยกรรมและการออกแบบ
tr: Mimarlık & Tasarım
uk: Архітектура та дизайн
vi: Kiến trúc & Thiết kế

source: Architecture & Resiliency
ar: عمارة & المرونة
be: Архітэктура і Жываздольнасць
da: Arkitektur & Modstandsdygtighed
de: Architektur & Resilienz
es: Arquitectura y Resiliencia
fr: Architecture & Résilience
id: Arsitektur & Ketahanan
it: Architettura & Resilienza
ja: アーキテクチャ & レジリエンス
ms: Arkitektur & Ketahanan
no: Arkitektur & Motstandskraft
pl: Architektura i Odporność
pt: Arquitetura & Resiliência
ru: Архитектура и устойчивость
sv: Arkitektur & Motståndskraft
th: สถาปัตยกรรม & ความยืดหยุ่น
tr: Mimarlık ve Dayanıklılık
uk: Architecture & Resiliency - Архітектура та стійкість
vi: Kiến trúc & Khả năng phục hồi

source: Are there any hidden fees?
ar: هل هناك أي رسوم مخفية؟
be: Ці ёсць якія-небудзь схаваныя зборы?
da: Er der nogle skjulte gebyrer?
de: Gibt es versteckte Gebühren?
es: ¿Hay algún cargo oculto?
fr: Y a-t-il des frais cachés ?
id: Apakah ada biaya tersembunyi?
it: Ci sono costi nascosti?
ja: 隠れた手数料はありますか？
no: Er det noen skjulte gebyrer?
pl: Czy są jakieś ukryte opłaty?
pt: Existem taxas ocultas?
ru: Есть ли скрытые сборы?
sv: Finns det några dolda avgifter?
th: มีค่าธรรมเนียมแอบแฝงหรือไม่?
tr: Hiç gizli ücret var mı?
uk: Чи є приховані комісії?
vi: Có bất kỳ khoản phí ẩn nào không?

source: Are you sure you want to delete this attachment?
uk: Ви впевнені, що хочете видалити це вкладення?

source: Are you sure you want to delete this chat? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus percakapan ini? Tindakan ini tidak dapat dibatalkan.
it: Sei sicuro di voler eliminare questa chat? Questa azione non può essere annullata.
ja: チャットを削除してもよろしいですか？この操作は元に戻せません。
no: Er du sikker på at du vil slette denne chatten? Denne handlingen kan ikke angres.
pl: Czy na pewno chcesz usunąć tę rozmowę? Tej akcji nie można cofnąć.
ru: Вы уверены, что хотите удалить этот чат? Это действие нельзя отменить.
sv: Är du säker på att du vill radera denna chatt? Denna åtgärd kan inte ångras.
uk: Ви впевнені, що хочете видалити цей чат? Цю дію не можна скасувати.

source: Are you sure you want to delete this message?
ar: هل أنت متأكد أنك تريد حذف هذه الرسالة؟
be: Вы ўпэўнены, што хочаце выдаліць гэтае паведамленне?
de: Sind Sie sicher, dass Sie diese Nachricht löschen möchten?
es: ¿Está seguro de que desea eliminar este mensaje?
fr: Êtes-vous sûr de vouloir supprimer ce message ?
id: Apakah Anda yakin ingin menghapus pesan ini?
it: Sei sicuro di voler eliminare questo messaggio?
ja: このメッセージを削除してもよろしいですか？
no: Er du sikker på at du vil slette denne meldingen?
pl: Czy na pewno chcesz usunąć tę wiadomość?
pt: Tem certeza de que deseja excluir esta mensagem?
ru: Вы уверены, что хотите удалить это сообщение?
sv: Är du säker på att du vill radera det här meddelandet?
th: คุณแน่ใจหรือไม่ว่าต้องการลบข้อความนี้?
tr: Bu mesajı silmek istediğinizden emin misiniz?
uk: Ви впевнені, що хочете видалити це повідомлення?
vi: Bạn có chắc chắn muốn xóa tin nhắn này không?

source: Are you sure you want to delete your account?
ar: هل أنت متأكد أنك تريد حذف حسابك؟
be: Вы ўпэўнены, што хочаце выдаліць свой рахунак?
da: Er du sikker på, at du vil slette din konto?
de: Sind Sie sicher, dass Sie Ihr Konto löschen möchten?
es: ¿Estás seguro de que quieres eliminar tu cuenta?
fr: Êtes-vous sûr de vouloir supprimer votre compte ?
id: Apakah Anda yakin ingin menghapus akun Anda?
it: Sei sicuro di voler eliminare il tuo account?
ja: あなたのアカウントを削除してもよろしいですか？
ms: Adakah anda pasti anda mahu memadam akaun anda?
no: Er du sikker på at du vil slette kontoen din?
pl: Czy na pewno chcesz usunąć swoje konto?
pt: Tem certeza de que deseja excluir sua conta?
ru: Вы уверены, что хотите удалить свой аккаунт?
sv: Är du säker på att du vill radera ditt konto?
th: คุณแน่ใจหรือว่าต้องการลบบัญชีของคุณ?
tr: Hesabınızı silmek istediğinize emin misiniz?
uk: Ви впевнені, що хочете видалити свій аккаунт?
vi: Bạn có chắc chắn muốn xóa tài khoản của mình không?

source: Are you sure you want to delete your goal? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هدفك؟ لا يمكن التراجع عن هذا الإجراء.
be: Вы ўпэўнены, што хочаце выдаліць сваю мэту? Гэта дзеянне нельга адмяніць.
da: Er du sikker på, at du vil slette dit mål? Denne handling kan ikke fortrydes.
de: Sind Sie sicher, dass Sie Ihr Ziel löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que quieres eliminar tu objetivo? Esta acción no puede deshacerse.
fr: Êtes-vous sûr de vouloir supprimer votre objectif? Cette action ne peut pas être annulée.
id: Apakah Anda yakin ingin menghapus tujuan Anda? Tindakan ini tidak dapat dibatalkan.
it: Sei sicuro di voler cancellare il tuo obiettivo? Questa azione non può essere annullata.
ja: あなたの目標を削除してもよろしいですか？ この操作は元に戻すことができません。
ms: Adakah anda pasti mahu memadamkan matlamat anda? Tindakan ini tidak boleh dibatalkan.
no: Er du sikker på at du vil slette målet ditt? Denne handlingen kan ikke angres.
pl: Czy na pewno chcesz usunąć swój cel? Tej akcji nie można cofnąć.
pt: Tem certeza de que deseja excluir seu objetivo? Esta ação não pode ser desfeita.
ru: Вы уверены, что хотите удалить свою цель? Это действие невозможно отменить.
sv: Är du säker på att du vill radera ditt mål? Denna åtgärd kan inte göras ogjord.
th: คุณแน่ใจไหมว่าต้องการลบเป้าหมายของคุณ? การกระทำนี้ไม่สามารถยกเลิกได้.
tr: Hedefinizi silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.
uk: Ви впевнені, що хочете видалити свою мету? Цю дію не можна скасувати.
vi: Bạn có chắc chắn muốn xóa mục tiêu của mình không? Hành động này không thể hoàn tác.

source: Are you sure you want to reject this battle?
ar: هل أنت متأكد أنك تريد رفض هذه المعركة؟
be: Вы ўпэўнены, што хочаце адхіліць гэтую бітву?
da: Er du sikker på, at du vil afvise denne kamp?
de: Sind Sie sicher, dass Sie diesen Kampf ablehnen möchten?
es: ¿Estás seguro de que deseas rechazar esta batalla?
fr: Êtes-vous sûr de vouloir rejeter cette bataille ?
id: Apakah Anda yakin ingin menolak pertempuran ini?
it: Sei sicuro di voler rifiutare questa sfida?
ja: このバトルを拒否してもよろしいですか？
no: Er du sikker på at du vil avslå denne kampen?
pl: Czy na pewno chcesz odrzucić tę bitwę?
pt: Tem certeza de que deseja rejeitar esta batalha?
ru: Вы уверены, что хотите отклонить эту битву?
sv: Är du säker på att du vill avvisa denna utmaning?
th: คุณแน่ใจหรือว่าต้องการปฏิเสธการต่อสู้นี้?
tr: Bu savaşı reddetmek istediğinizden emin misiniz?
uk: Ви впевнені, що хочете відхилити цей виклик?
vi: Bạn có chắc chắn muốn từ chối trận đấu này không?

source: Articulate scalable solutions, performance optimization, and frontend architecture patterns.
ar: صياغة حلول قابلة للتوسع، تحسين الأداء، وأنماط بنية الواجهة الأمامية.
be: Афармляйце маштабуючыя рашэнні, аптымізацыю прадукцыйнасці і ўзоры архітэктуры фронтэнда.
da: Artikuler skalerbare løsninger, performance-optimering, og frontend-arkitektur mønstre.
de: Artikulieren Sie skalierbare Lösungen, Leistungsoptimierung und Frontend-Architekturpatterns.
es: Articular soluciones escalables, optimización del rendimiento y patrones de arquitectura frontend.
fr: Articuler des solutions évolutives, l'optimisation des performances et les modèles d'architecture frontale.
id: Mengartikulasikan solusi yang dapat diskalakan, optimisasi kinerja, dan pola arsitektur frontend.
it: Articolare soluzioni scalabili, ottimizzazione delle prestazioni e pattern di architettura del frontend.
ja: スケーラブルなソリューション、パフォーマンスの最適化、フロントエンドのアーキテクチャパターンを説明します。
ms: Artikulasi penyelesaian yang boleh diskala, pengoptimuman prestasi, dan corak seni bina frontend.
no: Artikuler skalerbare løsninger, ytelsesoptimalisering og frontend-arkitekturmønstre.
pl: Opracowanie skalowalnych rozwiązań, optymalizacja wydajności i wzorce w architekturze frontendowej.
pt: Articular soluções escaláveis, otimização de desempenho e padrões de arquitetura frontend.
ru: Сформулируйте масштабируемые решения, оптимизацию производительности и шаблоны архитектуры фронтенда.
sv: Artikulera skalbara lösningar, prestationsoptimering och frontendarkitektur mönster.
th: การระบุแนวทางแก้ไขที่สามารถขยายขนาดได้, การเพิ่มประสิทธิภาพในการทำงาน, และรูปแบบสถาปัตยกรรมส่วนหน้า
tr: Ölçeklenebilir çözümleri dile getirin, performans optimizasyonu ve ön uç mimari desenleri.
uk: Розробляйте масштабовані рішення, оптимізацію продуктивності та шаблони архітектури фронтенду.
vi: Trình bày giải pháp mở rộng, tối ưu hóa hiệu suất và mẫu kiến trúc frontend.

source: Ask a question you’d normally ask in real life
uk: Задайте питання, яке ви зазвичай ставите в реальному житті

source: Ask community
uk: Запитати спільноту

source: Ask how others practice speaking or pronunciation
uk: Запитайте, як інші практикують розмовні навички або вимову

source: Ask in support channel
uk: Запитайте в каналі підтримки

source: asp.net core interview prep
ar: التحضير لمقابلة asp.net core
be: падрыхтоўка да інтэрв'ю па asp.net core
da: asp.net core interview forberedelse
de: asp.net core Interview-Vorbereitung
es: prep de entrevista de asp.net core
fr: préparation à l'entretien asp.net core
id: persiapan wawancara asp.net core
it: preparazione per colloquio asp.net core
ja: asp.net core インタビュー準備
ms: persediaan temu bual asp.net core
no: asp.net kjerneteknologi intervju forberedelse
pl: przygotowanie do rozmowy kwalifikacyjnej z asp.net core
pt: preparação para entrevista de asp.net core
ru: подготовка к собеседованию по asp.net core
sv: asp.net core intervju preparation
th: การเตรียมสัมภาษณ์ asp.net core
tr: asp.net core mülakat hazırlığı
uk: підготовка до співбесіди asp.net core
vi: chuẩn bị phỏng vấn asp.net core

source: At the end of the interview, you’ll usually be asked:
ar: في نهاية المقابلة، عادة ما سيتم طرح السؤال التالي عليك:
be: На канцы інтэрв'ю вам звычайна задаюць:
da: Ved slutningen af interviewet, vil du normalt blive spurgt:
de: Am Ende des Interviews werden Sie normalerweise gefragt:
es: Al final de la entrevista, generalmente se te preguntará:
fr: À la fin de l'entretien, on vous demandera généralement :
id: Di akhir wawancara, biasanya Anda akan ditanyakan:
it: Alla fine del colloquio, di solito ti verrà chiesto:
ja: インタビューの最後に、通常以下のように尋ねられます：
ms: Pada akhir temu bual, anda biasanya akan ditanya:
no: Mot slutten av intervjuet vil du vanligvis bli spurt:
pl: Na końcu rozmowy kwalifikacyjnej, zazwyczaj zostaniesz zapytany:
pt: No final da entrevista, geralmente lhe perguntarão:
ru: В конце интервью вам обычно задают вопрос:
sv: Vid slutet av intervjun brukar du oftast bli tillfrågad:
th: ท้ายสัมภาษณ์ คุณมักจะถูกถามว่า:
tr: Mülakatın sonunda genellikle size şu sorular sorulur:
uk: Наприкінці співбесіди, вам зазвичай задають:
vi: Ở cuối buổi phỏng vấn, thường bạn sẽ được hỏi:

source: At the end, we’ll share a valuable tool for realistic interview practice.
ar: في النهاية، سنقدم أداة ثمينة للتدريب الواقعي على المقابلات.
be: У канцы, мы падзялімся каштоўным інструментам для рэалістычнай практыкі інтэрв'ю.
da: Til sidst vil vi dele et værdifuldt værktøj til realistisk interviewtræning.
de: Am Ende teilen wir ein wertvolles Tool für realistische Interviewübungen.
es: Al final, compartiremos una herramienta valiosa para la práctica realista de entrevistas.
fr: À la fin, nous partagerons un outil précieux pour une pratique d'entretien réaliste.
id: Pada akhirnya, kami akan membagikan alat berharga untuk latihan wawancara yang realistis.
it: Alla fine, condivideremo uno strumento prezioso per una pratica di intervista realistica.
ja: 最後に、リアルな面接練習に役立つ価値あるツールを共有します。
ms: Pada akhirnya, kami akan berkongsi alat yang berharga untuk latihan temuduga yang realistik.
no: Til slutt vil vi dele et verdifullt verktøy for realistisk intervjuøvelse.
pl: Na końcu podzielimy się cennym narzędziem do realistycznej praktyki przeprowadzania rozmów kwalifikacyjnych.
pt: No final, compartilharemos uma ferramenta valiosa para prática de entrevista realista.
ru: В конце мы поделимся ценным инструментом для реалистичной тренировки собеседования.
sv: I slutet kommer vi att dela ett värdefullt verktyg för realistisk intervjuträning.
th: ในท้ายที่สุด เราจะแบ่งปันเครื่องมือที่มีค่าใช้สอยในการฝึกฝนสัมภาษณ์ที่เป็นความจริง
tr: Sonunda, gerçekçi mülakat pratiği için değerli bir araç paylaşacağız.
uk: В кінці ми поділимося цінним інструментом для реалістичної практики інтерв'ю.
vi: Cuối cùng, chúng tôi sẽ chia sẻ một công cụ quý giá cho việc thực hành phỏng vấn thực tế.

source: Auth
ar: تفويض
be: Аўтарызацыя
da: Godkendelse
de: Authentifizierung
it: Autenticazione
ja: 認証
ms: Pengesahan
pl: Autoryzacja
pt: Autenticação
ru: Аутентификация
uk: Аутентифікація
vi: Xác thực

source: Available languages:
ar: اللغات المتاحة:
be: Даступныя мовы:
da: Tilgængelige sprog:
de: Verfügbare Sprachen:
es: Idiomas disponibles:
fr: Langues disponibles :
id: Bahasa yang tersedia:
it: Lingue disponibili:
ja: 利用可能な言語：
ms: Bahasa yang tersedia:
no: Tilgjengelige språk:
pl: Dostępne języki:
pt: Idiomas disponíveis:
ru: Доступные языки:
sv: Tillgängliga språk:
th: มีภาษาให้เลือก:
tr: Mevcut diller:
uk: Доступні мови:
vi: Ngôn ngữ có sẵn:

source: Avatar
ar: أفاتار
be: Аватар
ja: アバター
pl: Awatar
ru: Аватар
uk: Аватар
vi: Ảnh đại diện

source: Avoiding these mistakes will make you look more professional and increase your chances of success.
ar: تجنب هذه الأخطاء سيجعلك تبدو أكثر احترافية وسيزيد من فرصك في النجاح.
be: Уніканне гэтых памылак зробіць вас болей прафесійным і павялічыць шансы на паспяху.
da: Undgåelse af disse fejl vil få dig til at se mere professionel ud og øge dine chancer for succes.
de: Diese Fehler zu vermeiden, wird Sie professioneller wirken lassen und Ihre Erfolgschancen erhöhen.
es: Evitar estos errores te hará lucir más profesional y aumentará tus posibilidades de éxito.
fr: Éviter ces erreurs vous rendra plus professionnel et augmentera vos chances de réussite.
id: Menghindari kesalahan-kesalahan ini akan membuat Anda terlihat lebih profesional dan meningkatkan peluang Anda untuk sukses.
it: Evitare questi errori ti renderà più professionale e aumenterà le tue probabilità di successo.
ja: これらのミスを避けることで、よりプロフェッショナルに見え、成功の可能性を高めます。
ms: Mengelakkan kesilapan ini akan membuat anda kelihatan lebih profesional dan meningkatkan peluang kejayaan anda.
no: Å unngå disse feilene vil gjøre deg mer profesjonell og øke sjansene dine for suksess.
pl: Unikanie tych błędów sprawi, że będziesz wyglądać bardziej profesjonalnie i zwiększy szanse na sukces.
pt: Evitar esses erros fará com que você pareça mais profissional e aumentará suas chances de sucesso.
ru: Избегание этих ошибок заставит вас выглядеть более профессионально и увеличит ваши шансы на успех.
sv: Att undvika dessa misstag kommer att få dig att se mer professionell ut och öka dina chanser till framgång.
th: การหลีกเลี่ยงข้อผิดพลาดเหล่านี้จะทำให้คุณดูเหมือนมืออาชีพมากขึ้นและเพิ่มโอกาสในการประสบความสำเร็จของคุณ
tr: Bu hatalardan kaçınmak sizi daha profesyonel gösterecek ve başarı şansınızı artıracaktır.
uk: Уникнення цих помилок зробить вас більш професійним та збільшить ваші шанси на успіх.
vi: Tránh những sai lầm này sẽ khiến bạn trông chuyên nghiệp hơn và tăng cơ hội thành công của bạn.

source: Back
ar: عودة
be: Назад
da: Tilbage
de: Zurück
es: Regresar
fr: Retour
id: Kembali
it: Indietro
ja: 戻る
ms: Kembali
no: Tilbake
pl: Wstecz
pt: Voltar
ru: Назад
sv: Tillbaka
th: กลับ
tr: Geri
uk: Назад
vi: Quay lại

source: Back to chat list
de: Zurück zur Chatliste
es: Volver a la lista de chats
id: Kembali ke daftar obrolan
it: Torna all'elenco chat
ja: チャットリストに戻る
no: Tilbake til chatliste
pl: Wróć do listy czatów
pt: Voltar para a lista de conversas
ru: Назад к списку чатов
sv: Tillbaka till chattlistan
th: กลับไปที่รายการแชท
tr: Sohbet listesine geri dön
uk: Повернутися до списку чатів
vi: Quay lại danh sách trò chuyện

source: Backend engineers who improved their interviews
ar: plaintext مهندسو البرمجيات الخلفية الذين حسّنوا مقابلاتهم
be: Інжынеры-бэкэнды, якія палепшылі свае інтэрв'ю
da: Backend-ingeniører, der forbedrede deres interviews
de: Backend-Ingenieure, die ihre Vorstellungsgespräche verbessert haben
es: Ingenieros de backend que mejoraron sus entrevistas
fr: Ingénieurs backend qui ont amélioré leurs entretiens
id: Insinyur backend yang meningkatkan wawancara mereka
it: Ingegneri backend che hanno migliorato i loro colloqui
ja: インタビューを改善したバックエンドエンジニア
ms: Jurutera backend yang telah memperbaiki temu ramah mereka
no: Backend-ingeniører som forbedret intervjuene sine
pl: Backendowi inżynierowie, którzy poprawili swoje rozmowy kwalifikacyjne
pt: Engenheiros de backend que melhoraram suas entrevistas
ru: Инженеры backend, которые улучшили свои интервью
sv: Backend-ingenjörer som förbättrade sina intervjuer
th: วิศวกรแบ็กเอนด์ที่ปรับปรุงการสัมภาษณ์ของพวกเขา
tr: Mülakatlarını geliştiren backend mühendisleri
uk: Інженери бекенду, які покращили свої співбесіди
vi: Kỹ sư backend đã cải thiện buổi phỏng vấn của họ

source: Backend Interview Readiness Score
ar: درجة الاستعداد لمقابلة الخلفية
be: Падрыхтаванасць да Співбесіды для Бэкэнд Спецыялістаў: Ваша Ацэнка
da: Backend Interview Forberedelses Score
de: Backend-Interview-Bereitschafts-Score
es: Puntaje de Preparación para Entrevista de Backend
fr: Score de préparation à l'entretien backend
id: Skor Kesiapan Wawancara Backend
it: Punteggio di Prontezza per il Colloquio Backend
ja: バックエンドインタビュー準備度スコア
ms: Skor Kesiapsiagaan Temu Duga Backend
no: Backend-Intervjuberedskapsscore
pl: Wynik gotowości do rozmowy kwalifikacyjnej na backend
pt: Pontuação de Prontidão para Entrevista de Backend
ru: Итоговая оценка готовности к собеседованию на должность разработчика серверной части
sv: Backend-intervjuberedskapspoäng
th: คะแนนความพร้อมสำหรับการสัมภาษณ์ Backend
tr: Backend Mülakat Hazırlık Skoru
uk: Оцінка підготовленості до співбесіди бекенд-розробника
vi: Điểm Sẵn Sàng Phỏng Vấn Backend
