Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Expressing gratitude for the opportunity.
ar: التعبير عن الامتنان للفرصة.
be: Выказванне падзякі за магчымасць.
da: Udtrykker taknemmelighed for muligheden.
de: Dankbarkeit für die Gelegenheit ausdrücken.
es: Expresando gratitud por la oportunidad.
fr: Exprimer de la gratitude pour l'opportunité.
id: Menyampaikan rasa terima kasih atas kesempatan.
it: Esprimere gratitudine per l'opportunità.
ja: この機会に感謝を表す。
ms: Mengungkapkan rasa syukur untuk peluang ini.
no: Uttrykker takknemlighet for muligheten.
pl: Wyrażanie wdzięczności za możliwość.
pt: Expressando gratidão pela oportunidade.
ru: Выражение благодарности за возможность.
sv: Uttrycka tacksamhet för möjligheten.
th: แสดงความขอบคุณสำหรับโอกาสนี้.
tr: Fırsat için minnettarlık ifade etme.
uk: Виявляння вдячності за можливість.
vi: Bày tỏ lòng biết ơn cho cơ hội.

source: Extra Slow
id: Ekstra Lambat
it: Extra Lento
ja: エクストラスロー
no: Ekstra Sakte
ru: Очень медленно
uk: Дуже повільно

source: Failed to copy text. Please copy it manually.
ar: فشل في نسخ النص. يرجى نسخه يدويًا.
be: Не ўдалося скапіраваць тэкст. Скапіруйце яго ўручную, калі ласка.
da: Kunne ikke kopiere tekst. Kopier den venligst manuelt.
de: Fehler beim Kopieren des Textes. Bitte manuell kopieren.
es: Error al copiar el texto. Por favor, cópialo manualmente.
fr: Échec de la copie du texte. Veuillez le copier manuellement.
id: Gagal menyalin teks. Silakan salin secara manual.
it: Copia del testo non riuscita. Si prega di copiarlo manualmente.
ja: テキストのコピーに失敗しました。手動でコピーしてください。
ms: Gagal menyalin teks. Sila salin secara manual.
no: Kunne ikke kopiere tekst. Vennligst kopier den manuelt.
pl: Nie udało się skopiować tekstu. Proszę skopiować go ręcznie.
pt: Falha ao copiar o texto. Por favor, copie-o manualmente.
ru: Не удалось скопировать текст. Пожалуйста, скопируйте его вручную.
sv: Misslyckades med att kopiera texten. Vänligen kopiera den manuellt.
th: คัดลอกข้อความไม่สำเร็จ กรุณาคัดลอกด้วยตนเอง.
tr: Metin kopyalanamadı. Lütfen manuel olarak kopyalayın.
uk: Не вдалося скопіювати текст. Будь ласка, скопіюйте його вручну.
vi: Không thể sao chép văn bản. Vui lòng sao chép thủ công.

source: Failed to delete your account. Please try again later, or contact the developers.
ar: فشل في حذف حسابك. يرجى المحاولة مرة أخرى لاحقًا، أو الاتصال بالمطورين.
be: Не атрымалася выдаліць ваш рахунак. Паспрабуйце яшчэ раз пазней або звяжыцеся з распрацоўшчыкамі.
da: Fejlede i at slette din konto. Prøv igen senere, eller kontakt udviklerne.
de: Fehler beim Löschen Ihres Kontos. Bitte versuchen Sie es später erneut oder kontaktieren Sie die Entwickler.
es: No se pudo eliminar tu cuenta. Por favor, inténtalo de nuevo más tarde o contacta a los desarrolladores.
fr: Échec de la suppression de votre compte. Veuillez réessayer plus tard ou contacter les développeurs.
id: Gagal menghapus akun Anda. Silakan coba lagi nanti, atau hubungi pengembang.
it: Impossibile eliminare il tuo account. Riprova più tardi o contatta gli sviluppatori.
ja: アカウントの削除に失敗しました。後で再試行するか、開発者に連絡してください。
ms: Gagal untuk padam akaun anda. Sila cuba lagi kemudian, atau hubungi para pembangun.
no: Kunne ikke slette kontoen din. Vennligst prøv igjen senere, eller kontakt utviklerne.
pl: Nie udało się usunąć twojego konta. Spróbuj ponownie później lub skontaktuj się z programistami.
pt: Falha ao excluir sua conta. Por favor, tente novamente mais tarde, ou entre em contato com os desenvolvedores.
ru: Не удалось удалить вашу учетную запись. Попробуйте снова позже или свяжитесь с разработчиками.
sv: Misslyckades med att radera ditt konto. Försök igen senare, eller kontakta utvecklarna.
th: ไม่สามารถลบบัญชีของคุณได้ โปรดลองอีกครั้งในภายหลัง หรือติดต่อนักพัฒนา
tr: Hesabınızı silme başarısız oldu. Lütfen daha sonra tekrar deneyin veya geliştiricilerle iletişime geçin.
uk: Не вдалося видалити ваш обліковий запис. Будь ласка, спробуйте знову пізніше, або зверніться до розробників.
vi: Không thể xóa tài khoản của bạn. Vui lòng thử lại sau, hoặc liên hệ với nhà phát triển.

source: Failed to send feedback. Please try again later.
ar: فشل في إرسال التعليقات. يرجى المحاولة مرة أخرى لاحقا.
be: Не атрымалася адправіць водгук. Калі ласка, паспрабуйце яшчэ раз пазней.
da: Kunne ikke sende feedback. Prøv igen senere.
de: Feedback senden fehlgeschlagen. Bitte versuchen Sie es später erneut.
es: No se pudo enviar la retroalimentación. Por favor, inténtelo nuevamente más tarde.
fr: Échec de l'envoi des commentaires. Veuillez réessayer plus tard.
id: Gagal mengirim umpan balik. Silakan coba lagi nanti.
it: Impossibile inviare feedback. Si prega di riprovare più tardi.
ja: フィードバックの送信に失敗しました。後ほど再試行してください。
ms: Gagal menghantar maklum balas. Sila cuba lagi kemudian.
no: Kunne ikke sende tilbakemelding. Vennligst prøv igjen senere.
pl: Nie udało się wysłać opinii. Proszę spróbować ponownie później.
pt: Falha ao enviar feedback. Por favor, tente novamente mais tarde.
ru: Не удалось отправить отзыв. Пожалуйста, попробуйте еще раз позже.
sv: Misslyckades med att skicka feedback. Försök igen senare.
th: การส่งข้อเสนอแนะล้มเหลว โปรดลองใหม่อีกครั้งในภายหลัง
tr: Geri bildirim gönderilemedi. Lütfen daha sonra tekrar deneyin.
uk: Не вдалося відправити відгук. Будь ласка, спробуйте ще раз пізніше.
vi: Không thể gửi phản hồi. Vui lòng thử lại sau.

source: Failed to upload image. Please try again.
uk: Не вдалося завантажити зображення. Будь ласка, спробуйте ще раз.

source: Fast
id: Cepat
it: Veloce
ja: 速い
no: Rask
ru: Быстро
uk: Швидко

source: Fast Answer Practice
ar: تدريب على الإجابة السريعة
be: Практыка Шустрых Адказаў
da: Hurtig Svar Praksis
de: Schnelle Antwort Übung
es: Práctica de Respuesta Rápida
fr: Pratique de Réponse Rapide
id: Latihan Jawaban Cepat
it: Pratica di Risposta Veloce
ja: 速答練習
ms: Latihan Jawapan Pantas
no: Rask Svar Praksis
pl: Szybka Praktyka Odpowiedzi
pt: Prática de Resposta Rápida
ru: Практика Быстрых Ответов
sv: Snabbt Svarsövning
th: ฝึกฝนคำตอบอย่างรวดเร็ว
tr: Hızlı Yanıt Pratiği
uk: Практика Швидкої Відповіді
vi: Luyện tập Trả lời Nhanh

source: Feedback
ar: الملاحظات
be: Водгук
da: Tilbagemelding
de: Rückmeldung
es: Retroalimentación
fr: Retour d'information
id: Umpan Balik
it: Riscontro
ja: フィードバック
ms: Maklum Balas
no: Tilbakemelding
pl: Opinia
pt: Comentários
ru: Отзыв
sv: Återkoppling
th: คำติชม
tr: Geri Bildirim
uk: Відгук
vi: Phản hồi

source: Feedback is vague: "**not enough experience**" — but how do you get experience without a job?
ar: التغذية الراجعة غير واضحة: "**ليست لديك الخبرة الكافية**" — ولكن كيف يمكنك اكتساب الخبرة دون وظيفة؟
be: Зваротная сувязь няпэўная: "**недастаткова вопыту**" — але як атрымаць вопыт без працы?
da: Feedback er vag: "**ikke nok erfaring**" — men hvordan får du erfaring uden et job?
de: Feedback ist vage: "**nicht genug Erfahrung**" — aber wie bekommt man Erfahrung ohne einen Job?
es: La retroalimentación es vaga: "**no tienes suficiente experiencia**" — pero ¿cómo adquieres experiencia sin un trabajo?
fr: Le retour est vague : "**pas assez d'expérience**" — mais comment acquérir de l'expérience sans emploi ?
id: Umpan baliknya tidak jelas: "**tidak cukup pengalaman**" — tetapi bagaimana Anda bisa mendapatkan pengalaman tanpa pekerjaan?
it: Il Feedback è vago: "**non abbastanza esperienza**" — ma come si fa ad acquisire esperienza senza un lavoro?
ja: フィードバックが曖昧です：「**経験が不足している**」 — しかし、仕事なしでどうやって経験を得るのですか？
no: Tilbakemelding er vag: "**ikke nok erfaring**" — men hvordan får du erfaring uten en jobb?
pl: Informacja zwrotna jest niejasna: "**niewystarczające doświadczenie**" — ale jak zdobyć doświadczenie bez pracy?
pt: O feedback é vago: "**falta de experiência**" — mas como você ganha experiência sem um emprego?
ru: Обратная связь расплывчата: "**недостаточно опыта**" — но как получить опыт без работы?
sv: Feedbacken är vag: "**inte tillräckligt med erfarenhet**" — men hur får man erfarenhet utan ett jobb?
th: ข้อเสนอแนะยังคงคลุมเครือ: "**ประสบการณ์ไม่เพียงพอ**" — แต่จะมีประสบการณ์ได้อย่างไรถ้าไม่มีงาน?
tr: Geri bildirim belirsiz: "**yeterli deneyim yok**" — ama iş olmadan nasıl deneyim kazanırsınız?
uk: Відгук нечіткий: "**недостатньо досвіду**" — але як отримати досвід без роботи?
vi: Phản hồi mơ hồ: "**không đủ kinh nghiệm**" — nhưng làm sao bạn có thể có kinh nghiệm mà không có việc làm?

source: File size must be less than 50MB
uk: Розмір файлу має бути менше 50 МБ

source: Fill out a onboarding quiz to help FluencyPal understand your goals and preferences.
ar: املأ استبيان الترحيب لمساعدة FluencyPal في فهم أهدافك وتفضيلاتك.
be: Запоўніце апытанне для пачаткоўцаў, каб дапамагчы FluencyPal зразумець вашы мэты і перавагі.
da: udfyld en onboarding quiz for at hjælpe FluencyPal med at forstå dine mål og præferencer.
de: Füllen Sie ein Onboarding-Quiz aus, um FluencyPal zu helfen, Ihre Ziele und Vorlieben zu verstehen.
es: Complete un cuestionario de incorporación para ayudar a FluencyPal a comprender tus objetivos y preferencias.
fr: Remplissez un quiz d'intégration pour aider FluencyPal à comprendre vos objectifs et préférences.
id: Isi kuis onboarding untuk membantu FluencyPal memahami tujuan dan preferensi Anda.
it: Compila un quiz di onboarding per aiutare FluencyPal a comprendere i tuoi obiettivi e le tue preferenze.
ja: オンボーディングクイズに記入して、FluencyPalがあなたの目標や好みを理解するのを助けましょう。
ms: Isikan kuiz pendaftaran untuk membantu FluencyPal memahami matlamat dan pilihan anda.
no: Fyll ut en onboarding-quiz for å hjelpe FluencyPal med å forstå dine mål og preferanser.
pl: Wypełnij quiz powitalny, aby pomóc FluencyPal zrozumieć Twoje cele i preferencje.
pt: Preencha um questionário de integração para ajudar a FluencyPal a entender seus objetivos e preferências.
ru: Заполните квиз по адаптации, чтобы помочь FluencyPal понять ваши цели и предпочтения.
sv: Fyll i en introduktionsquiz för att hjälpa FluencyPal att förstå dina mål och preferenser.
th: กรุณาทำแบบทดสอบเริ่มต้นเพื่อช่วยให้ FluencyPal เข้าใจเป้าหมายและความชอบของคุณ
tr: FluencyPal'ın hedeflerinizi ve tercihlerinizi anlamasına yardımcı olması için bir katılım anketi doldurun.
uk: Заповніть опитування приєднання, щоб допомогти FluencyPal зрозуміти ваші цілі та вподобання.
vi: Điền vào bài kiểm tra khởi động để giúp FluencyPal hiểu được mục tiêu và sở thích của bạn.

source: Final Score: {winnerScore}
id: Skor Akhir: {winnerScore}
it: Punteggio finale: {winnerScore}
ja: 最終スコア: {winnerScore}
no: Sluttresultat: {winnerScore}
ru: Финальный счет: {winnerScore}
uk: uk Фінальний рахунок: {winnerScore}

source: Final Standings
id: Peringkat Akhir
it: Posizioni Finali
ja: 最終順位
no: Endelige Stilling
ru: Финальные результаты
uk: Підсумкова Турнірна Таблиця

source: Finalizing decision ...
ar: اتخاذ القرار النهائي ...
be: Прыняцце рашэнне ...
da: Træffer endelig beslutning ...
de: Entscheidung finalisieren ...
es: Finalizando decisión ...
fr: Finalisation de la décision ...
id: Mengambil keputusan akhir ...
it: Finalizzando la decisione ...
ja: 決定を最終化しています...
ms: Mengambil keputusan akhir ...
no: Tar en endelig beslutning ...
pl: Kończenie decyzji ...
pt: Finalizando decisão ...
ru: Принятие решения...
sv: Slutför beslut ...
th: การตัดสินใจสุดท้าย ...
tr: Kararı sonlandırma ...
uk: Приймаємо рішення ...
vi: Đang hoàn thiện quyết định ...

source: Finish with what you learned
ar: انتهِ بما تعلمته
be: Скончыце з тым, што вы даведаліся
da: Afslut med det, du har lært
de: Beenden Sie, was Sie gelernt haben.
es: Finaliza con lo que has aprendido
fr: Terminez avec ce que vous avez appris
id: Selesaikan dengan apa yang Anda pelajari
it: Finisci con ciò che hai imparato
ja: 学んだことを終える
no: Avslutt med det du har lært
pl: Zakończ na tym, czego się nauczyłeś
pt: Termine com o que você aprendeu
ru: Закончите с тем, что вы узнали
sv: Avsluta med vad du har lärt dig
th: จบด้วยสิ่งที่คุณได้เรียนรู้
tr: Ne öğrendiysen tamamla
uk: Закінчіть тим, що ви дізналися
vi: Hoàn thành với những gì bạn đã học được

source: Fixed words
id: Kata-kata tetap
it: Parole fisse
ja: 固定された単語
no: Faste ord
ru: Фиксированные слова
uk: Фіксовані слова

source: Fluency Goals
ar: أهداف الطلاقة
be: Мэты плыннасці
da: Fluency Mål
de: Fließziele
es: Objetivos de fluidez
fr: Objectifs de fluidité
id: Tujuan Kefasihan
it: Obiettivi di fluidità
ja: 流暢さの目標
ms: Matlamat Kefasihan
no: Mål for flyt
pl: Cele biegłości
pt: Objetivos de Fluência
ru: Цели свободного владения
sv: Flytande mål
th: เป้าหมายความคล่องแคล่ว
tr: Süreklilik Hedefleri
uk: Цілі флюентності
vi: Mục Tiêu Lưu Loát

source: Fluency Improvement
ar: تحسين الطلاقة
be: Палепшэнне валоднай плавучасці
da: Forbedring af flydende sprog
de: Flüssigkeitsverbesserung
es: Mejora de la fluidez
fr: Amélioration de la fluidité
id: Peningkatan Kelancaran
it: Miglioramento della fluidità
ja: 流暢さの向上
ms: Peningkatan Kefasihan
no: Forbedring av flyt
pl: Poprawa płynności
pt: Melhoria da Fluência
ru: Улучшение беглости
sv: Fluencyförbättring
th: การพัฒนาความคล่องแคล่ว
tr: Aksan Geliştirme
uk: Покращення плавності
vi: Cải thiện sự lưu loát

source: FluencyPal does not use your personal data or conversations to train AI models.
ar: FluencyPal لا يستخدم بياناتك الشخصية أو محادثاتك لتدريب نماذج الذكاء الاصطناعي.
be: FluencyPal не выкарыстоўвае вашыя асабістыя дадзеныя або размовы для навучання мадэляў штучнага інтэлекту.
da: FluencyPal bruger ikke dine personlige data eller samtaler til at træne AI-modeller.
de: FluencyPal verwendet Ihre persönlichen Daten oder Gespräche nicht, um KI-Modelle zu trainieren.
es: FluencyPal no utiliza sus datos personales o conversaciones para entrenar modelos de IA.
fr: FluencyPal n'utilise pas vos données personnelles ou conversations pour entraîner des modèles d'IA.
id: FluencyPal tidak menggunakan data pribadi atau percakapan Anda untuk melatih model AI.
it: FluencyPal non utilizza i tuoi dati personali o le tue conversazioni per addestrare modelli di intelligenza artificiale.
ja: FluencyPal は、AI モデルをトレーニングするためにあなたの個人データや会話を使用しません。
no: FluencyPal bruker ikke dine personlige data eller samtaler til å trene AI-modeller.
pl: FluencyPal nie wykorzystuje Twoich danych osobowych ani rozmów do trenowania modeli AI.
pt: FluencyPal não usa seus dados pessoais ou conversas para treinar modelos de IA.
ru: FluencyPal не использует ваши личные данные или разговоры для обучения моделей ИИ.
sv: FluencyPal använder inte dina personuppgifter eller konversationer för att träna AI-modeller.
th: FluencyPal ไม่ใช้ข้อมูลส่วนบุคคลหรือการสนทนาของคุณในการฝึกแบบจำลอง AI.
tr: FluencyPal, kişisel verilerinizi veya konuşmalarınızı AI modellerini eğitmek için kullanmaz.
uk: FluencyPal не використовує ваші особисті дані або розмови для навчання моделей ШІ.
vi: FluencyPal không sử dụng dữ liệu cá nhân hoặc các cuộc trò chuyện của bạn để huấn luyện các mô hình AI.

source: FluencyPal is a browser-based app, so you only need an internet browser to use it. You can run FluencyPal on a mobile phone, tablet, or desktop without installing anything.
ar: يساعدك على التحدث باللغة الإنجليزية دون خوف من ارتكاب الأخطاء. كل ما عليك فعله هو التحدث بأي موضوع تحبه، وسيتكفل بتصحيح أخطائك اللغوية تلقائيًا وفوريًا ودون الحاجة للتدخل من أي شخص آخر.
be: FluencyPal — гэта прыкладанне для браўзэра, таму для яго выкарыстання вам патрэбен толькі інтэрнэт-браўзэр. Вы можаце запускаць FluencyPal на мабільным тэлефоне, планшэце або настольным кампутары без устаноўкі чаго-небудзь.
da: FluencyPal er en browserbaseret app, så du behøver kun en internetbrowser for at bruge den. Du kan køre FluencyPal på en mobiltelefon, tablet eller desktop uden at installere noget.
de: FluencyPal ist eine browserbasierte App, daher benötigen Sie nur einen Internetbrowser, um sie zu nutzen. Sie können FluencyPal auf einem Mobiltelefon, Tablet oder Desktop ausführen, ohne etwas installieren zu müssen.
es: FluencyPal es una aplicación basada en navegador, por lo que solo necesitas un navegador de internet para utilizarla. Puedes ejecutar FluencyPal en un teléfono móvil, tablet o escritorio sin instalar nada.
fr: FluencyPal est une application basée sur un navigateur, vous n'avez donc besoin que d'un navigateur internet pour l'utiliser. Vous pouvez faire fonctionner FluencyPal sur un téléphone mobile, une tablette ou un ordinateur de bureau sans rien installer.
id: FluencyPal adalah aplikasi berbasis peramban, sehingga Anda hanya memerlukan peramban internet untuk menggunakannya. Anda dapat menjalankan FluencyPal pada ponsel, tablet, atau desktop tanpa perlu menginstal apa pun.
it: FluencyPal è un'app basata su browser, quindi hai bisogno solo di un browser internet per utilizzarla. Puoi eseguire FluencyPal su un telefono mobile, tablet o desktop senza installare nulla.
ja: FluencyPalはブラウザベースのアプリケーションであるため、使用するにはインターネットブラウザがあれば十分です。何もインストールせずに、携帯電話、タブレット、またはデスクトップでFluencyPalを実行できます。
no: FluencyPal er en nettleserbasert app, så du trenger kun en internettleser for å bruke den. Du kan bruke FluencyPal på en mobiltelefon, nettbrett eller stasjonær datamaskin uten å installere noe.
pl: FluencyPal to aplikacja działająca w przeglądarce, więc potrzebujesz tylko przeglądarki internetowej, aby z niej korzystać. FluencyPal można uruchomić na telefonie komórkowym, tablecie lub komputerze stacjonarnym bez instalowania czegokolwiek.
pt: FluencyPal é um aplicativo baseado em navegador, então você só precisa de um navegador de internet para usá-lo. Você pode executar o FluencyPal em um celular, tablet ou desktop sem instalar nada.
ru: FluencyPal — это приложение, работающее в браузере, поэтому для его использования вам нужен только интернет-браузер. Вы можете запускать FluencyPal на мобильном телефоне, планшете или настольном компьютере без установки чего-либо.
sv: FluencyPal är en webbläsarbaserad app, så du behöver bara en webbläsare för att använda den. Du kan köra FluencyPal på en mobiltelefon, surfplatta eller stationär dator utan att installera något.
th: FluencyPal เป็นแอปที่ทำงานบนเว็บเบราว์เซอร์ ดังนั้นคุณเพียงแค่ต้องมีอินเทอร์เน็ตเบราว์เซอร์ในการใช้งาน คุณสามารถใช้ FluencyPal บนโทรศัพท์มือถือ แท็บเล็ต หรือเดสก์ท็อปได้โดยไม่จำเป็นต้องติดตั้งอะไรเพิ่มเติม
tr: FluencyPal, tarayıcı tabanlı bir uygulamadır, bu yüzden kullanmak için yalnızca bir internet tarayıcısına ihtiyacınız vardır. FluencyPal'ı, herhangi bir şey yüklemeden, cep telefonu, tablet veya masaüstü bilgisayarda çalıştırabilirsiniz.
uk: FluencyPal — це додаток, заснований на браузері, тому вам потрібен лише інтернет-браузер, щоб ним користуватися. Ви можете запускати FluencyPal на мобільному телефоні, планшеті або настільному комп'ютері без встановлення чогось.
vi: FluencyPal là một ứng dụng dựa trên trình duyệt, vì vậy bạn chỉ cần một trình duyệt internet để sử dụng. Bạn có thể chạy FluencyPal trên điện thoại di động, máy tính bảng, hoặc máy tính để bàn mà không cần cài đặt bất kỳ thứ gì.

source: FluencyPal is an AI-powered conversation practice app designed for intermediate and advanced learners. It helps you improve speaking fluency, pronunciation, and confidence through realistic conversations and instant feedback.
ar: FluencyPal هو تطبيق للتدرب على المحادثة مدعوم بالذكاء الاصطناعي ومصمم للمتعلمين بمستوى متوسط ومتقدم. يساعدك على تحسين الطلاقة في التحدث، والنطق، والثقة من خلال محادثات واقعية وتغذية راجعة فورية.
be: FluencyPal — гэта дадатак для практыкі размоў з падтрымкай штучнага інтэлекту, распрацаваны для вучняў сярэдняга і прасунутага ўзроўняў. Ён дапаможа вам палепшыць бегласць маўлення, вымаўленне і ўпэўненасць праз рэалістычныя размовы і імгненную зваротную сувязь.
da: FluencyPal er en AI-drevet samtaleøvelsesapp designet til mellemliggende og avancerede elever. Den hjælper dig med at forbedre taleflydende, udtale og selvtillid gennem realistiske samtaler og øjeblikkelig feedback.
de: FluencyPal ist eine KI-gestützte Konversationsübungs-App, die für fortgeschrittene und fortgeschrittene Lernende entwickelt wurde. Sie hilft Ihnen, Ihre Sprechflüssigkeit, Aussprache und Selbstvertrauen durch realistische Gespräche und sofortiges Feedback zu verbessern.
es: FluencyPal es una aplicación de práctica conversacional impulsada por IA diseñada para estudiantes de nivel intermedio y avanzado. Te ayuda a mejorar la fluidez al hablar, la pronunciación y la confianza mediante conversaciones realistas y retroalimentación instantánea.
fr: FluencyPal est une application de pratique conversationnelle alimentée par l'IA, conçue pour les apprenants intermédiaires et avancés. Elle vous aide à améliorer votre fluidité d'expression, votre prononciation et votre confiance grâce à des conversations réalistes et un retour instantané.
id: FluencyPal adalah aplikasi latihan percakapan yang didukung oleh AI yang dirancang untuk pelajar tingkat menengah dan lanjutan. Aplikasi ini membantu meningkatkan kefasihan berbicara, pengucapan, dan rasa percaya diri melalui percakapan realistis dan umpan balik instan.
it: FluencyPal è un'app di pratica conversazionale basata sull'IA progettata per studenti di livello intermedio e avanzato. Ti aiuta a migliorare la fluidità del parlato, la pronuncia e la sicurezza attraverso conversazioni realistiche e feedback immediato.
ja: FluencyPalは、中級および上級の学習者向けに設計されたAI搭載の会話練習アプリです。リアルな会話と即時フィードバックを通じて、話す流暢さ、発音、自信を向上させる手助けをします。
no: FluencyPal er en AI-drevet samtaleøvelsesapp designet for mellomnivå og avanserte elever. Den hjelper deg med å forbedre taleflyt, uttale og selvtillit gjennom realistiske samtaler og umiddelbare tilbakemeldinger.
pl: FluencyPal to aplikacja do praktyki konwersacyjnej wspierana przez AI, zaprojektowana dla uczniów na poziomie średniozaawansowanym i zaawansowanym. Pomaga poprawić płynność mówienia, wymowę i pewność siebie poprzez realistyczne rozmowy i natychmiastowe informacje zwrotne.
pt: FluencyPal é um aplicativo de prática de conversação alimentado por IA, projetado para alunos de nível intermediário e avançado. Ele ajuda você a melhorar a fluência ao falar, a pronúncia e a confiança por meio de conversas realistas e feedback instantâneo.
ru: FluencyPal — это приложение для практики разговорной речи на базе ИИ, предназначенное для изучающих английский языка на среднем и продвинутом уровне. Оно помогает улучшить беглость речи, произношение и уверенность через реалистичные беседы и мгновенную обратную связь.
sv: FluencyPal är en AI-driven konversationsövningsapp designad för elever på mellannivå och avancerad nivå. Den hjälper dig att förbättra talflyt, uttal och självförtroende genom realistiska samtal och omedelbar feedback.
th: FluencyPal เป็นแอปฝึกฝนการสนทนาที่ขับเคลื่อนด้วย AI ซึ่งออกแบบมาสำหรับผู้เรียนระดับกลางและระดับสูง ช่วยให้คุณพัฒนาความคล่องแคล่วในการพูด การออกเสียง และความมั่นใจผ่านการสนทนาที่สมจริงและการตอบกลับอย่างทันที
tr: FluencyPal, orta ve ileri düzey öğrenciler için tasarlanmış yapay zeka destekli bir konuşma pratiği uygulamasıdır. Gerçekçi diyaloglar ve anında geri bildirim yoluyla konuşma akıcılığınızı, telaffuzunuzu ve kendinize olan güveninizi artırmanıza yardımcı olur.
uk: FluencyPal — це програма для практики розмов, що працює на основі штучного інтелекту, розроблена для учнів середнього та просунутого рівня. Вона допомагає покращити беглость мовлення, вимову та впевненість завдяки реалістичним розмовам і миттєвому зворотному зв'язку.
vi: FluencyPal là một ứng dụng thực hành hội thoại sử dụng trí tuệ nhân tạo, được thiết kế cho người học ở mức trung cấp và cao cấp. Ứng dụng giúp bạn cải thiện sự trôi chảy khi nói, phát âm và tự tin thông qua các cuộc hội thoại thực tế và phản hồi tức thì.
