Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: When you start, FluencyPal asks a short series of questions about your goals, current language level, and areas you want to improve. You answer using your voice. Based on your responses, FluencyPal creates a personalized practice plan for you. For example, business English focuses on professional vocabulary and scenarios, travel English focuses on real-life situations, and interview preparation simulates interview questions with feedback.
ar: عندما تبدأ، يطرح FluencyPal سلسلة قصيرة من الأسئلة حول أهدافك، مستوى لغتك الحالي، والمجالات التي ترغب في تحسينها. تجيب باستخدام صوتك. بناءً على إجاباتك، يقوم FluencyPal بإنشاء خطة ممارسة مخصصة لك. على سبيل المثال، يركز الإنجليزية للأعمال على المفردات المهنية والسيناريوهات، يركز الإنجليزية للسفر على المواقف الواقعية، وتحاكي تحضيرات المقابلات أسئلة المقابلات مع تغذية راجعة.
be: Калі вы пачынаеце, FluencyPal задае кароткую серыю пытанняў аб вашых мэтах, бягучым узроўні валодання мовай і сферах, якія вы хочаце палепшыць. Вы адказваеце, выкарыстоўваючы свой голас. На аснове вашых адказаў FluencyPal стварае персаналізаваны план практыкі для вас. Напрыклад, бізнэс англійская засяроджваецца на прафесійным слоўніку і сцэнарыях, англійская для падарожжаў — на рэальных жыццёвых сітуацыях, а падрыхтоўка да сумоўяў імітуе пытанні для сумоўяў з водгукамі.
da: Når du starter, stiller FluencyPal en kort række spørgsmål om dine mål, dit nuværende sprogniveau og de områder, du ønsker at forbedre. Du svarer ved at bruge din stemme. Baseret på dine svar laver FluencyPal en personlig øvelsesplan til dig. For eksempel fokuserer erhvervsengelsk på professionelt ordforråd og scenarier, rejseengelsk fokuserer på virkelige situationer, og interviewforberedelse simulerer interviewspørgsmål med feedback.
de: Wenn Sie beginnen, stellt FluencyPal eine kurze Reihe von Fragen zu Ihren Zielen, Ihrem aktuellen Sprachniveau und den Bereichen, die Sie verbessern möchten. Sie antworten mit Ihrer Stimme. Basierend auf Ihren Antworten erstellt FluencyPal einen personalisierten Übungsplan für Sie. Beispielsweise konzentriert sich Business English auf professionelles Vokabular und Szenarien, Reise-Englisch auf alltägliche Situationen und die Interviewvorbereitung simuliert Interviewfragen mit Feedback.
es: Cuando comienzas, FluencyPal te hace una breve serie de preguntas sobre tus objetivos, nivel actual de idioma y áreas que deseas mejorar. Respondes usando tu voz. Basado en tus respuestas, FluencyPal crea un plan de práctica personalizado para ti. Por ejemplo, inglés para negocios se enfoca en vocabulario y escenarios profesionales, inglés para viajes se centra en situaciones de la vida real, y la preparación para entrevistas simula preguntas de entrevista con retroalimentación.
fr: Lorsque vous commencez, FluencyPal pose une courte série de questions sur vos objectifs, votre niveau de langue actuel et les domaines que vous souhaitez améliorer. Vous répondez en utilisant votre voix. En fonction de vos réponses, FluencyPal crée un plan de pratique personnalisé pour vous. Par exemple, l'anglais des affaires se concentre sur le vocabulaire professionnel et les scénarios, l'anglais de voyage se concentre sur des situations réelles, et la préparation aux entretiens simule des questions d'entretien avec des retours d'information.
id: Ketika Anda memulai, FluencyPal mengajukan serangkaian pertanyaan singkat tentang tujuan Anda, tingkat bahasa saat ini, dan area yang ingin Anda tingkatkan. Anda menjawab menggunakan suara Anda. Berdasarkan tanggapan Anda, FluencyPal membuat rencana latihan yang dipersonalisasi untuk Anda. Misalnya, bahasa Inggris bisnis berfokus pada kosakata profesional dan skenario, bahasa Inggris untuk perjalanan berfokus pada situasi kehidupan nyata, dan persiapan wawancara mensimulasikan pertanyaan wawancara dengan umpan balik.
it: Quando inizi, FluencyPal ti fa una breve serie di domande sui tuoi obiettivi, il tuo livello attuale di lingua e le aree che desideri migliorare. Rispondi usando la tua voce. In base alle tue risposte, FluencyPal crea un piano di pratica personalizzato per te. Ad esempio, l'inglese commerciale si concentra su vocabolario e scenari professionali, l'inglese per viaggiare si concentra su situazioni reali e la preparazione per colloqui simula domande di colloquio con feedback.
ja: 開始すると、FluencyPalはあなたの目標、現在の語学レベル、改善したい分野に関する一連の短い質問をします。あなたは声で答えます。回答に基づいて、FluencyPalはあなた専用の練習プランを作成します。例えば、ビジネス英語は専門的な語彙やシナリオに焦点を当て、旅行英語は実際の生活状況に焦点を当て、面接準備はフィードバック付きで面接の質問をシミュレートします。
no: Når du starter, stiller FluencyPal en kort serie med spørsmål om dine mål, nåværende språkferdighetsnivå og områder du vil forbedre. Du svarer ved å bruke stemmen din. Basert på svarene dine, lager FluencyPal en personlig tilpasset øvingsplan for deg. For eksempel fokuserer forretningsengelsk på profesjonelt vokabular og scenarier, reiseengelsk fokuserer på virkelige situasjoner, og intervjuforberedelse simulerer intervjuspørsmål med tilbakemelding.
pl: Kiedy zaczniesz, FluencyPal zada krótką serię pytań dotyczących Twoich celów, obecnego poziomu języka i obszarów, które chcesz poprawić. Odpowiadasz za pomocą swojego głosu. Na podstawie Twoich odpowiedzi, FluencyPal tworzy dla Ciebie spersonalizowany plan ćwiczeń. Na przykład, angielski w biznesie koncentruje się na profesjonalnym słownictwie i scenariuszach, angielski w podróży skupia się na sytuacjach z życia codziennego, a przygotowanie do rozmowy kwalifikacyjnej symuluje pytania z rozmowy wraz z opinią zwrotną.
pt: Quando você começa, o FluencyPal faz uma série rápida de perguntas sobre seus objetivos, nível atual de idioma e áreas que deseja melhorar. Você responde usando sua voz. Com base em suas respostas, o FluencyPal cria um plano de prática personalizado para você. Por exemplo, o inglês para negócios foca em vocabulário profissional e cenários, o inglês para viagens foca em situações da vida real, e a preparação para entrevistas simula perguntas de entrevistas com feedback.
ru: Когда вы начинаете, FluencyPal задает короткую серию вопросов о ваших целях, текущем уровне языка и областях, которые вы хотите улучшить. Вы отвечаете, используя голос. На основе ваших ответов FluencyPal создает персонализированный план практики для вас. Например, деловой английский сосредотачивается на профессиональной лексике и сценариях, туристический английский фокусируется на реальных жизненных ситуациях, а подготовка к собеседованию имитирует вопросы интервью с обратной связью.
sv: När du börjar ställer FluencyPal en kort serie frågor om dina mål, din nuvarande språknivå och områden du vill förbättra. Du svarar med din röst. Baserat på dina svar skapar FluencyPal en personlig övningsplan för dig. Till exempel, affärsengelska fokuserar på professionellt ordförråd och scenarier, reseengelska fokuserar på verkliga situationer, och intervjuförberedelse simulerar intervjufrågor med feedback.
th: เมื่อคุณเริ่มต้น FluencyPal จะถามคำถามสั้น ๆ เกี่ยวกับเป้าหมาย ระดับภาษาในปัจจุบัน และด้านที่คุณต้องการพัฒนา คุณจะตอบด้วยเสียงของคุณ จากคำตอบที่คุณให้ FluencyPal จะสร้างแผนการฝึกที่ปรับให้เหมาะกับคุณ สำหรับตัวอย่างเช่น ภาษาอังกฤษธุรกิจจะเน้นคำศัพท์และสถานการณ์ทางวิชาชีพ ภาษาอังกฤษเพื่อการท่องเที่ยวจะเน้นสถานการณ์ในชีวิตจริง และการเตรียมสัมภาษณ์จะสร้างสถานการณ์คำถามสัมภาษณ์พร้อมทั้งข้อเสนอแนะ
tr: Başladığınızda, FluencyPal hedefleriniz, mevcut dil seviyeniz ve geliştirmek istediğiniz alanlar hakkında kısa bir soru dizisi sorar. Cevaplarınızı sesinizi kullanarak verirsiniz. Yanıtlarınıza dayanarak, FluencyPal sizin için kişiselleştirilmiş bir pratik planı oluşturur. Örneğin, iş İngilizcesi profesyonel kelime dağarcığına ve senaryolara odaklanırken, seyahat İngilizcesi gerçek yaşam durumlarına odaklanır ve mülakat hazırlığı, geri bildirimle birlikte mülakat sorularını simüle eder.
uk: Коли ви починаєте, FluencyPal ставить коротку серію запитань про ваші цілі, поточний рівень володіння мовою та сфери, які ви хочете покращити. Ви відповідаєте за допомогою свого голосу. На основі ваших відповідей FluencyPal створює персоналізований план практики для вас. Наприклад, ділова англійська зосереджується на професійній лексиці та ситуаціях, англійська для подорожей зосереджується на ситуаціях з реального життя, а підготовка до співбесіди симулює питання співбесіди з наданням зворотного зв'язку.
vi: Khi bạn bắt đầu, FluencyPal sẽ đặt ra một loạt câu hỏi ngắn về mục tiêu của bạn, trình độ ngôn ngữ hiện tại và các lĩnh vực bạn muốn cải thiện. Bạn sẽ trả lời bằng giọng nói của mình. Dựa trên câu trả lời của bạn, FluencyPal sẽ tạo ra một kế hoạch luyện tập cá nhân hóa cho bạn. Ví dụ, tiếng Anh thương mại tập trung vào vốn từ vựng và tình huống chuyên nghiệp, tiếng Anh du lịch tập trung vào các tình huống thực tế, và chuẩn bị phỏng vấn sẽ mô phỏng các câu hỏi phỏng vấn cùng với phản hồi.

source: Where can I use FluencyPal?
ar: أين يمكنني استخدام FluencyPal؟
be: Дзе я магу выкарыстоўваць FluencyPal?
da: Hvor kan jeg bruge FluencyPal?
de: Wo kann ich FluencyPal verwenden?
es: plaintext ¿Dónde puedo usar FluencyPal?
fr: Où puis-je utiliser FluencyPal ?
id: Di mana saya dapat menggunakan FluencyPal?
it: Dove posso usare FluencyPal?
ja: FluencyPalをどこで使用できますか？
no: Hvor kan jeg bruke FluencyPal?
pl: Gdzie mogę używać FluencyPal?
pt: Onde posso usar o FluencyPal?
ru: Где я могу использовать FluencyPal?
sv: Var kan jag använda FluencyPal?
th: ฉันสามารถใช้ FluencyPal ได้ที่ไหน?
tr: FluencyPal'i nerede kullanabilirim?
uk: Де я можу використовувати FluencyPal?
vi: Nơi nào tôi có thể sử dụng FluencyPal?

source: Who this is for
ar: لمن هذا موجه
be: Хто гэта для
da: Hvem dette er til
de: Für wen dies ist
es: Para quién es esto
fr: Pour qui est-ce destiné
id: Untuk siapa ini
it: Per chi è questo
ja: これは誰のためのものか
ms: Siapa ini untuk
no: Hvem dette er for
pl: Dla kogo to jest
pt: Para quem é isso
ru: Для кого это предназначено
sv: Vem detta är för
th: ใครคือผู้รับ
tr: Bu kimin için
uk: Для кого це
vi: Ai phù hợp sử dụng

source: Why backend candidates improve fast
ar: لماذا يتحسن المرشحون في الخلفية بسرعة
be: Чаму кандыдаты на пазіцыі бекэнда імкліва паляпшаюцца
da: Hvorfor backend-kandidater forbedrer sig hurtigt
de: Warum sich Backend-Kandidaten schnell verbessern
es: Por qué los candidatos de backend mejoran rápido
fr: Pourquoi les candidats backend s'améliorent-ils rapidement
id: Mengapa kandidat backend berkembang pesat
it: Perché i candidati del backend migliorano rapidamente
ja: なぜバックエンド候補者は速く成長するのか
ms: Mengapa calon backend memperbaiki dengan cepat
no: Hvorfor backendkandidater forbedrer seg raskt
pl: Dlaczego kandydaci na programistów backendu szybko się poprawiają
pt: Por que os candidatos a desenvolvedor backend melhoram rápido
ru: Почему кандидаты на backend быстро улучшают свои навыки
sv: Varför backend-kandidater förbättras snabbt
th: ทำไมผู้สมัครฝ่ายหลังถึงพัฒนารวดเร็ว
tr: Neden backend adayları hızlı gelişir?
uk: Чому кандидати на позиції бекенду швидко покращуються
vi: Tại sao ứng viên backend cải thiện nhanh chóng

source: Why candidates improve so quickly
ar: لماذا يتحسن المرشحون بسرعة كبيرة
be: Чаму кандыдаты паляпшаюцца так хутка
da: Hvorfor kandidater forbedrer sig så hurtigt
de: Warum sich Kandidaten so schnell verbessern
es: Por qué los candidatos mejoran tan rápidamente
fr: Pourquoi les candidats s'améliorent-ils si rapidement
id: Mengapa kandidat meningkat begitu cepat
it: Perché i candidati migliorano così rapidamente
ja: なぜ候補者はこんなに早く上達するのか
ms: Mengapa calon-calon bertambah baik dengan begitu cepat
no: Hvorfor kandidater forbedrer seg så raskt
pl: Dlaczego kandydaci poprawiają się tak szybko
pt: Por que os candidatos melhoram tão rapidamente
ru: Почему кандидаты улучшаются так быстро
sv: Varför kandidater förbättras så snabbt
th: ทำไมนักเรียนถึงพัฒนาได้เร็ว
tr: Neden adaylar bu kadar hızlı gelişiyor?
uk: Чому кандидати покращують так швидко
vi: Tại sao ứng viên cải thiện nhanh chóng như vậy

source: Winner gets {points} points
ar: plaintext الفائز يحصل على {points} نقطة
be: Пераможца атрымлівае {points} ачкоў
da: Vinder får {points} point
de: Der Gewinner erhält {points} Punkte
es: El ganador obtiene {points} puntos
fr: Le gagnant reçoit {points} points
id: Pemenang mendapatkan {points} poin
it: Il vincitore ottiene {points} punti
ja: 勝者には{points}ポイントが与えられます
no: Vinneren får {points} poeng
pl: Zwycięzca zdobywa {points} punktów
pt: Vencedor ganha {points} pontos
ru: Победитель получает {points} очков
sv: Vinnaren får {points} poäng
th: ผู้ชนะจะได้รับ {points} คะแนน
tr: Kazanan {points} puan alır
uk: Переможець отримує {points} очок
vi: Người thắng cuộc nhận được {points} điểm

source: Winner!
ar: فائز!
be: Пераможца!
da: Vinder!
de: Gewinner!
es: ¡Ganador!
fr: Gagnant !
id: Pemenang!
it: Vincitore!
ja: 勝者！
no: Vinner!
pl: Zwycięzca!
pt: Vencedor!
ru: Победитель!
sv: Vinnare!
th: ผู้ชนะ!
tr: Kazanan!
uk: Переможець!
vi: Người chiến thắng!

source: With FluencyPal, you can improve your learning experience with personalized feedback, real-time corrections, and a supportive community.
ar: مع FluencyPal، يمكنك تحسين تجربة التعلم الخاصة بك من خلال الاستفادة من الردود المخصصة، التصحيحات الفورية، والمجتمع المتعاون.
be: З дапамогай FluencyPal, вы можаце паляпшыць свой досвед навучання з персаналізаванай зваротнай сувяззю, карэкцыяй у рэальным часе і падтрымліўчай супольнасцю.
da: Med FluencyPal kan du forbedre din læringsoplevelse med personlig feedback, korrektioner i realtid, og et støttende fællesskab.
de: Mit FluencyPal können Sie Ihre Lernerfahrung mit personalisiertem Feedback, Korrekturen in Echtzeit und einer unterstützenden Gemeinschaft verbessern.
es: Con FluencyPal, puedes mejorar tu experiencia de aprendizaje con retroalimentación personalizada, correcciones en tiempo real y una comunidad de apoyo.
fr: Avec FluencyPal, vous pouvez améliorer votre expérience d'apprentissage avec des retours personnalisés, des corrections en temps réel et une communauté solidaire.
id: Dengan FluencyPal, anda dapat meningkatkan pengalaman belajar anda dengan umpan balik yang dipersonalisasi, koreksi real-time, dan komunitas yang mendukung.
it: Con FluencyPal, puoi migliorare la tua esperienza di apprendimento con feedback personalizzati, correzioni in tempo reale e una comunità di supporto.
ja: FluencyPalを使用すれば、パーソナライズされたフィードバック、リアルタイムの訂正、そして支援的なコミュニティを通じて学習体験を向上させることができます。
ms: Dengan FluencyPal, anda boleh meningkatkan pengalaman pembelajaran anda dengan maklum balas yang dipersonalisasikan, pembetulan masa sebenar, dan komuniti yang sokong menyokong.
no: Med FluencyPal kan du forbedre læringsopplevelsen din med personlig tilbakemelding, korreksjoner i sanntid, og et støttende fellesskap.
pl: Z FluencyPal możesz poprawić swoje doświadczenie w nauce dzięki spersonalizowanym uwagom, korektom w czasie rzeczywistym i wsparciu społeczności.
pt: Com FluencyPal, você pode melhorar sua experiência de aprendizado com feedback personalizado, correções em tempo real e uma comunidade solidária.
ru: С FluencyPal вы можете улучшить свой опыт обучения с помощью персонализированной обратной связи, корректировок в реальном времени и поддерживающего сообщества.
sv: Med FluencyPal kan du förbättra din inlärningsupplevelse med personlig återkoppling, korrigeringar i realtid och ett stödjande samhälle.
th: ด้วย FluencyPal, คุณสามารถเพิ่มประสบการณ์ในการเรียนรู้ของคุณด้วยคำติชมที่เป็นส่วนบุคคล, การแก้ไขแบบเรียลไทม์, และชุมชนที่สนับสนุน.
tr: FluencyPal ile kişiselleştirilmiş geri bildirimler, gerçek zamanlı düzeltmeler ve destekleyici bir toplulukla öğrenme deneyiminizi geliştirebilirsiniz.
uk: З FluencyPal ви можете покращити свій досвід навчання з персоналізованою зворотнім зв'язком, корекціями в реальному часі та підтримуючою спільнотою.
vi: Với FluencyPal, bạn có thể cải thiện trải nghiệm học của mình với phản hồi cá nhân hóa, sửa lỗi thời gian thực, và một cộng đồng hỗ trợ.

source: With time, AI will adapt to your learning style and it will be more personalized
ar: مع الوقت، ستتكيف الذكاء الاصطناعي مع أسلوب تعلمك وسيكون أكثر تخصيصًا
be: З часам, ШІ будзе адаптавацца да вашага стылю навучання, і гэта стане болей персаналізаваным
da: Med tiden vil AI tilpasse sig din læringsstil, og det vil blive mere personligt
de: Mit der Zeit wird sich die KI an Ihren Lernstil anpassen und es wird persönlicher
es: Con el tiempo, la IA se adaptará a tu estilo de aprendizaje y será más personalizada
fr: Avec le temps, l'IA s'adaptera à votre style d'apprentissage et sera plus personnalisée
id: Dengan waktu, AI akan menyesuaikan diri dengan gaya belajar Anda dan akan menjadi lebih personalisasi
it: Con il tempo, l'IA si adatterà al tuo stile di apprendimento e sarà più personalizzato
ja: 時間と共に、AIはあなたの学習スタイルに適応し、よりパーソナライズされます
ms: Dengan masa, AI akan menyesuaikan diri dengan gaya pembelajaran anda dan ia akan menjadi lebih peribadi
no: Med tiden vil AI tilpasse seg din læringsstil og det vil bli mer personlig
pl: Z czasem, AI dostosuje się do Twojego stylu uczenia się i stanie się bardziej personalizowany
pt: Com o tempo, a IA se adaptará ao seu estilo de aprendizado e será mais personalizada
ru: Со временем, AI будет адаптироваться к вашему стилю обучения и станет более персонализированным
sv: Med tiden kommer AI att anpassa sig till din inlärningsstil och det kommer att bli mer personligt
th: ตามเวลา, AI จะปรับตัวเองให้เหมาะสมกับรูปแบบการเรียนรู้ของคุณและมันจะเป็นการส่วนบุคคลที่มากขึ้น
tr: Zamanla, AI öğrenme stilinize uyum sağlayacak ve daha kişiselleşecek
uk: З часом, штучний інтелект адаптується до вашого стилю навчання, і він стане більш персоналізованим.
vi: Theo thời gian, AI sẽ thích ứng với phong cách học của bạn và nó sẽ trở nên cá nhân hóa hơn

source: Within 2 weeks I went from nervous to confident discussing architecture decisions. Got the job I wanted.
ar: خلال أسبوعين انتقلت من التوتر إلى الثقة في مناقشة قرارات الهندسة المعمارية. حصلت على الوظيفة التي أريدها.
be: На працягу 2 тыдняў я перайшоў ад нервовасці да ўпэўненасці ў абмеркаванні архітэктурных рашэнняў. Атрымаў працу, якую хацеў.
da: Inden for 2 uger gik jeg fra at være nervøs til selvsikker i diskussioner om arkitekturbeslutninger. Fik det job, jeg ønskede.
de: Innerhalb von 2 Wochen bin ich von nervös zu selbstbewusst geworden, was die Diskussion von Architekturentscheidungen angeht. Ich habe den Job bekommen, den ich wollte.
es: En 2 semanas pasé de estar nervioso a tener confianza al discutir decisiones de arquitectura. Conseguí el trabajo que quería.
fr: En 2 semaines, je suis passé de nerveux à confiant pour discuter des décisions architecturales. J'ai obtenu le travail que je voulais.
id: Dalam waktu 2 minggu saya berubah dari gugup menjadi percaya diri membahas keputusan arsitektur. Mendapatkan pekerjaan yang saya inginkan.
it: Nel giro di due settimane sono passato dall'essere nervoso all'avere fiducia nel discutere decisioni architetturali. Ho ottenuto il lavoro che desideravo.
ja: 2週間以内に、建築の決定についての議論において、緊張から自信に変わりました。望んでいた仕事を手に入れました。
ms: Dalam masa 2 minggu, saya berubah dari berasa gugup kepada yakin membincangkan keputusan seni bina. Mendapat pekerjaan yang saya inginkan.
no: Innen 2 uker gikk jeg fra å være nervøs til å være selvsikker i å diskutere arkitekturbeslutninger. Fikk jobben jeg ønsket.
pl: W ciągu 2 tygodni przeszedłem od zdenerwowanego do pewnego siebie omawiania decyzji architektonicznych. Zdobyłem pracę, której chciałem.
pt: Dentro de 2 semanas, passei de nervoso para confiante discutindo decisões de arquitetura. Consegui o emprego que queria.
ru: В течение 2 недель я прошел путь от нервозности до уверенного обсуждения архитектурных решений. Получил желаемую работу.
sv: Inom 2 veckor gick jag från nervös till självsäker när det gällde att diskutera arkitekturval. Fick det jobb jag ville ha.
th: ภายใน 2 สัปดาห์ฉันเปลี่ยนจากความกังวลเป็นความมั่นใจในการพูดคุยเรื่องการตัดสินใจด้านสถาปัตยกรรม ได้งานที่ฉันต้องการ
tr: 2 hafta içinde mimari kararları tartışmaktan tedirgin olmaktan güvenilir bir seviyeye geldim. İstediğim işi aldım.
uk: Протягом 2 тижнів я перейшов від хвилювання до впевненості в обговоренні архітектурних рішень. Отримав роботу, про яку мріяв.
vi: Trong vòng 2 tuần, tôi đã chuyển từ lo lắng sang tự tin khi thảo luận về các quyết định kiến trúc. Đã có được công việc tôi mong muốn.

source: Word Guessing Game
id: Permainan Menebak Kata
it: Gioco di Indovinare le Parole
ja: 単語推測ゲーム
no: Ordgjettelek
ru: Игра в угадывание слов
uk: Гра "Вгадай слово"

source: Word Stats
ar: إحصائيات الكلمات
be: Статыстыка слоў
da: Ord Stats
de: Wortstatistiken
es: Estadísticas de Palabras
fr: Statistiques de Mots
id: Statistik Kata
it: Statistiche delle Parole
ja: 単語統計
ms: Statistik Kata
no: Ordstatistikk
pl: Statystyki słów
pt: Estatísticas de Palavras
ru: Статистика слов
sv: Ordstatistik
th: สถิติคำศัพท์
tr: Kelime İstatistikleri
uk: Статистика слів
vi: Thống kê từ vựng

source: Words
ar: كلمات
be: Словы
da: Ord
de: Wörter
es: Palabras
fr: Mots
id: Kata-kata
it: Parole
ja: 単語
ms: Kata-kata
no: Ord
pl: Słowa
pt: Palavras
ru: Слова
sv: Ord
th: คำศัพท์
tr: Kelimeler
uk: Слова
vi: Từ vựng

source: Words Attempted
id: Kata yang Dicoba
it: Parole Tentate
ja: 試行した単語
no: Ord Forsøkt
ru: Слов попыток
uk: Спробувані слова

source: words per turn
id: kata per giliran
it: parole per turno
ja: ターンごとの単語数
no: ord per tur
uk: кількість слів за захід

source: Words per turn
id: Jumlah kata per putaran
it: Parole per turno
ja: 各ターンごとの単語数
no: Ord per tur
ru: Слова за ход
uk: Кількість слів за хід

source: Words to Learn
es: Palabras para Aprender
id: Kata-kata untuk Dipelajari
it: Parole da Imparare
ja: 学習する単語
no: Ord å lære
pl: Słowa do Nauki
pt: Palavras para Aprender
ru: Слова для изучения
sv: Ord att Lära Sig
uk: Слова для вивчення
