Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: I'll ask you two more questions before I make your plan.
de: Ich werde Ihnen zwei weitere Fragen stellen, bevor ich Ihren Plan erstelle.
es: Voy a hacerte dos preguntas más antes de elaborar tu plan.
id: Saya akan menanyakan dua pertanyaan lagi sebelum saya membuat rencana Anda.
it: Ti farò due domande in più prima di elaborare il tuo piano.
ja: プランを作成する前に、あなたにあと2つ質問します。
no: Jeg vil stille deg to spørsmål til før jeg lager planen din.
pl: Zadam ci jeszcze dwa pytania, zanim stworzę twój plan.
pt: Vou fazer mais duas perguntas antes de criar seu plano.
ru: Я задам вам еще два вопроса, прежде чем составить ваш план.
sv: Jag kommer att ställa ytterligare två frågor innan jag gör din plan.
th: ฉันจะถามคุณอีกสองคำถามก่อนที่จะสร้างแผนของคุณ
tr: Planınızı yapmadan önce size iki soru daha soracağım.
uk: Я задам вам ще два запитання, перш ніж підготую ваш план.
vi: Tôi sẽ hỏi bạn hai câu hỏi nữa trước khi lập kế hoạch cho bạn.

source: I've been working on this project for about a year already, and I think I'll keep working on it for a long time. There's no risk of funding being cut or the project going bankrupt — because there is no funding. The project lives as long as there's money for servers. And if one day I'm poor enough that I can't afford them… well, I'll rent cheaper servers 🙂
no: Jeg har jobbet med dette prosjektet i omtrent ett år allerede, og jeg tror jeg vil fortsette å jobbe med det i lang tid fremover. Det er ingen risiko for at finansieringen blir kuttet eller at prosjektet går konkurs — fordi det ikke finnes noen finansiering. Prosjektet lever så lenge det er penger til servere. Og hvis jeg en dag er så fattig at jeg ikke har råd til dem... vel, da leier jeg billigere servere 🙂
uk: Я вже працюю над цим проєктом близько року і думаю, що буду продовжувати працювати над ним ще довго. Немає ризику, що фінансування буде припинено або проєкт стане банкрутом — тому що фінансування немає. Проєкт існує доти, поки є гроші на сервери. І якщо одного дня я стану настільки бідним, що не зможу їх собі дозволити… ну, орендую дешевші сервери 🙂

source: Idea for your message:
es: Idea para tu mensaje:
id: Ide untuk pesan Anda:
it: Idea per il tuo messaggio:
ja: あなたのメッセージのアイデア：
no: Idé for meldingen din:
pl: Pomysł na Twoją wiadomość:
pt: Ideia para a sua mensagem:
ru: Идея для вашего сообщения:
sv: Idé för ditt meddelande:
uk: Ідея для вашого повідомлення:

source: Identify and correct these frequent errors to enhance your interview performance.
ar: حدد وصحح هذه الأخطاء المتكررة لتعزيز أداءك في المقابلة.
be: Выяўляйце і выпраўляйце гэтыя частыя памылкі, каб паляпшыць выкананне на інтэрв'ю.
da: Identificer og ret disse hyppige fejl for at forbedre din interviewpræstation.
de: Identifizieren und korrigieren Sie diese häufigen Fehler, um Ihre Interviewleistung zu verbessern.
es: Identifica y corrige estos errores frecuentes para mejorar tu desempeño en la entrevista.
fr: Identifiez et corrigez ces erreurs fréquentes pour améliorer votre performance en entretien.
id: Identifikasi dan perbaiki kesalahan yang sering terjadi ini untuk meningkatkan performa wawancara Anda.
it: Identifica e correggi questi errori frequenti per migliorare la tua prestazione nel colloquio.
ja: これらの頻繁なエラーを特定し、修正して面接のパフォーマンスを向上させましょう。
ms: Kenal pasti dan betulkan kesilapan yang kerap ini untuk meningkatkan prestasi temuduga anda.
no: Identifiser og korriger disse vanlige feilene for å forbedre din ytelse i intervjuet.
pl: Zidentyfikuj i popraw te częste błędy, aby poprawić swoje wyniki w czasie rozmowy kwalifikacyjnej.
pt: Identifique e corrija esses erros frequentes para melhorar seu desempenho na entrevista.
ru: Определите и исправьте эти частые ошибки, чтобы улучшить ваши результаты на собеседовании.
sv: Identifiera och rätta till dessa vanliga misstag för att förbättra din intervjuprestation.
th: ระบุและแก้ไขข้อผิดพลาดที่เกิดขึ้นบ่อยเพื่อเพิ่มประสิทธิภาพในการสัมภาษณ์ของคุณ.
tr: Bu sık hataları tanıyın ve düzeltin, böylece mülakat performansınızı artırın.
uk: Виявляйте та виправляйте ці поширені помилки, щоб покращити вашу роботу під час співбесіди.
vi: Xác định và sửa những lỗi thường gặp để nâng cao hiệu suất phỏng vấn của bạn.

source: If it doesn’t feel like the right fit for you, you can request a refund from your Profile → Payment history. No stress, no complicated steps.
id: Jika itu tidak terasa cocok untuk Anda, Anda dapat meminta pengembalian dana dari Profil Anda → Riwayat pembayaran. Tanpa stres, tanpa langkah-langkah yang rumit.
it: Se non ti sembra la soluzione giusta per te, puoi richiedere un rimborso dal tuo Profilo → Cronologia pagamenti. Nessun stress, nessun passaggio complicato.
ja: お客様に合わないと感じた場合は、プロファイル→支払い履歴から返金をリクエストできます。ストレスもなく、複雑な手順もありません。
no: Hvis det ikke føles som den rette løsningen for deg, kan du be om refusjon fra din Profil → Betalingshistorikk. Ingen stress, ingen kompliserte trinn.
ru: Если вам кажется, что это не совсем то, что вам подходит, вы можете запросить возврат средств из вашего Профиля → История платежей. Без стресса, без сложных шагов.
sv: Om det inte känns som rätt val för dig, kan du begära en återbetalning från din Profil → Betalningshistorik. Inga bekymmer, inga komplicerade steg.
uk: Якщо це не підходить вам, ви можете запросити повернення коштів у вашому Профілі → Історія платежів. Без стресу, без складних кроків.

source: If it was an in-person interview, shake hands and maintain eye contact. If it was online, say goodbye with a friendly tone. Consider sending a thank-you email the next day:
ar: إذا كانت المقابلة وجهًا لوجه، قم بمصافحة الشخص وحافظ على الاتصال البصري. إذا كانت عبر الإنترنت، قل وداعاً بنبرة ودية. ضع في اعتبارك إرسال بريد إلكتروني لتقديم الشكر في اليوم التالي:
be: Калі гэта было асабістае спатканне, паціскайце руку і падтрымлівайце зрокавы кантакт. Калі гэта было ў інтэрнэце, прасціцеся зь дружалюбным тонам. Разгледзіце магчымасць адправіць ліст з падзякамі на наступны дзень:
da: Hvis det var et personligt interview, skal du ryste hænder og opretholde øjenkontakt. Hvis det var online, skal du sige farvel med en venlig tone. Overvej at sende en tak-email næste dag:
de: Wenn es ein persönliches Gespräch war, geben Sie die Hand und halten Sie den Augenkontakt. Wenn es online war, verabschieden Sie sich mit einem freundlichen Ton. Erwägen Sie, am nächsten Tag eine Dankes-E-Mail zu senden:
es: Si fue una entrevista en persona, estreche la mano y mantenga contacto visual. Si fue en línea, despídase con un tono amistoso. Considere enviar un correo electrónico de agradecimiento al día siguiente:
fr: Si c'était un entretien en personne, serrez la main et maintenez un contact visuel. Si c'était en ligne, dites au revoir avec un ton amical. Envisagez d'envoyer un email de remerciement le lendemain:
id: Jika itu adalah wawancara langsung, berjabat tangan dan jaga kontak mata. Jika itu online, ucapkan selamat tinggal dengan nada yang ramah. Pertimbangkan untuk mengirim email ucapan terima kasih pada hari berikutnya:
it: Se fosse un colloquio di persona, stringi la mano e mantieni il contatto visivo. Se fosse online, saluta con un tono amichevole. Considera l'idea di inviare un'email di ringraziamento il giorno successivo:
ja: 対面のインタビューであれば、握手をし、アイコンタクトを保つこと。オンラインの場合は、友好的なトーンでさようならを言うこと。次の日に感謝のメールを送ることを考えてみてください：
ms: Jika ia adalah temu duga secara langsung, salam dengan berjabat tangan dan jaga kontak mata. Jika ia dilakukan secara dalam talian, ucap selamat tinggal dengan nada yang mesra. Pertimbangkan untuk menghantar emel ucapan terima kasih pada keesokan harinya:
no: Hvis det var et personlig intervju, håndhilse og oppretthold øyekontakt. Hvis det ble gjennomført online, si farvel med en vennlig tone. Vurder å sende en takkemail neste dag:
pl: Jeśli był to wywiad osobisty, uścisnij dłoń i utrzymuj kontakt wzrokowy. Jeśli było to online, pożegnaj się przyjaznym tonem. Rozważ wysłanie podziękowania na email następnego dnia:
pt: Se fosse uma entrevista presencial, aperte a mão e mantenha contato visual. Se fosse online, despeça-se com um tom amigável. Considere enviar um email de agradecimento no dia seguinte:
ru: Если это было интервью очно, пожмите руку и поддерживайте зрительный контакт. Если это было онлайн, попрощайтесь дружелюбным тоном. Рассмотрите возможность отправки письма с благодарностью на следующий день:
sv: Om det var en intervju personligen, skaka hand och behåll ögonkontakt. Om det var online, säg adjö med en vänlig ton. Överväg att skicka ett tack-email nästa dag:
th: ถ้าเป็นการสัมภาษณ์ด้วยตัวเอง, จงจับมือและรักษาการมองตา. ถ้าเป็นออนไลน์, กล่าวลาด้วยท่องเสียงที่เป็นมิตร. ควรพิจารณาส่งอีเมลขอบคุณในวันถัดไป:
tr: Eğer yüz yüze bir mülakat ise, el sıkışın ve göz temasını koruyun. Eğer çevrimiçi olduysa, dostça bir tonla veda edin. Ertesi gün bir teşekkür e-postası göndermeyi düşünün:
uk: Якщо це було особисте співбесіда, подайте руку та утримуйте контакт очима. Якщо це було в мережі, попрощайтеся у дружньому тоні. Розгляньте можливість надіслати лист з подякою на наступний день:
vi: Nếu đó là cuộc phỏng vấn trực tiếp, hãy bắt tay và duy trì ánh mắt. Nếu đó là trực tuyến, hãy nói lời tạm biệt với giọng điệu thân thiện. Cân nhắc gửi một email cảm ơn vào ngày hôm sau:

source: If you don’t understand a question, don’t panic — ask politely:
ar: إذا لم تفهم سؤالًا، لا تقلق - اسأل بأدب:
be: Калі вы не разумееце пытанне, не панікуйце — пытайцеся палітака:
da: Hvis du ikke forstår et spørgsmål, så få ikke panik - spørg høfligt:
de: Wenn Sie eine Frage nicht verstehen, geraten Sie nicht in Panik - fragen Sie höflich:
es: Si no entiendes una pregunta, no te alarmes — pregunta cortésmente:
fr: Si vous ne comprenez pas une question, ne paniquez pas — demandez poliment :
id: Jika Anda tidak mengerti sebuah pertanyaan, jangan panik — tanyakan dengan sopan:
it: Se non capisci una domanda, non entrare in panico - chiedi educatamente:
ja: 質問が理解できない場合でも、パニックにならずに丁寧に尋ねてください：
ms: Jika anda tidak memahami soalan, jangan panik — tanya dengan sopan:
no: Hvis du ikke forstår et spørsmål, ikke få panikk - spør høflig:
pl: Jeśli nie rozumiesz pytania, nie panikuj — zapytaj uprzejmie:
pt: Se você não entender uma pergunta, não entre em pânico - pergunte educadamente:
ru: Если вы не понимаете вопрос, не паникуйте — вежливо спросите:
sv: Om du inte förstår en fråga, bli inte panik - fråga artigt:
th: ถ้าคุณไม่เข้าใจคำถาม ไม่ต้องตื่นตระหนก — ขอคำแนะนำอย่างสุภาพ:
tr: Bir soruyu anlamazsanız, panik yapmayın — kibarca sorun:
uk: Якщо ви не розумієте питання, не панікуйте — вічливо запитайте:
vi: Nếu bạn không hiểu một câu hỏi, đừng hoảng loạn — hãy vui lòng hỏi:

source: If you have any questions regarding your payment history, you can write message here. We will answer you as soon as possible.
id: Jika Anda memiliki pertanyaan mengenai riwayat pembayaran Anda, Anda dapat menulis pesan di sini. Kami akan menjawabnya sesegera mungkin.
it: Se hai domande riguardanti la tua cronologia dei pagamenti, puoi scrivere un messaggio qui. Ti risponderemo il prima possibile.
ja: お支払い履歴に関してご質問がある場合は、ここにメッセージを書いてください。できるだけ早くお答えいたします。
no: Hvis du har spørsmål angående din betalingshistorikk, kan du skrive en melding her. Vi vil svare deg så snart som mulig.
pl: Jeśli masz jakiekolwiek pytania dotyczące historii płatności, możesz napisać tutaj wiadomość. Odpowiemy tak szybko, jak to możliwe.
ru: Если у вас есть какие-либо вопросы относительно вашей истории платежей, вы можете написать сообщение здесь. Мы ответим вам как можно скорее.
sv: Om du har några frågor angående din betalningshistorik, kan du skriva ett meddelande här. Vi kommer att svara dig så snart som möjligt.
uk: Якщо у вас є будь-які запитання щодо історії ваших платежів, ви можете написати повідомлення тут. Ми відповімо вам якомога швидше.

source: If you want more tailored practice, I can create a plan based on your goals. Otherwise, you can skip this step and start practicing right away!
id: Jika Anda ingin latihan yang lebih disesuaikan, saya dapat membuat rencana berdasarkan tujuan Anda. Jika tidak, Anda dapat melewati langkah ini dan mulai berlatih segera!
it: Se desideri un allenamento più su misura, posso creare un piano basato sui tuoi obiettivi. Altrimenti, puoi saltare questo passaggio e iniziare a praticare subito!
ja: 目標に基づいてプランを作成することで、よりカスタマイズされた練習を提供できます。それ以外の場合、このステップをスキップしてすぐに練習を始めることもできます！
no: Hvis du ønsker mer skreddersydd øving, kan jeg lage en plan basert på dine mål. Hvis ikke, kan du hoppe over dette trinnet og begynne å øve med en gang!
pl: Jeśli chcesz bardziej dopasowane ćwiczenia, mogę stworzyć plan oparty na Twoich celach. W przeciwnym razie możesz pominąć ten krok i rozpocząć ćwiczenia od razu!
ru: Если вы хотите более индивидуальную практику, я могу создать план на основе ваших целей. В противном случае вы можете пропустить этот шаг и начать практику прямо сейчас!
sv: Om du vill ha mer skräddarsydd träning kan jag skapa en plan baserad på dina mål. Annars kan du hoppa över det här steget och börja träna direkt!
uk: Якщо ви хочете більш індивідуальне заняття, я можу створити план на основі ваших цілей. Інакше, ви можете пропустити цей крок і почати практикуватися прямо зараз!

source: If you want to reach me, here are the ways:
ja: 私に連絡を取りたい場合は、以下の方法があります：
no: Hvis du vil nå meg, her er måtene:
uk: Якщо ви хочете зв'язатися зі мною, ось способи:

source: If you want to remove all information, including your balance, please contact us.
ar: إذا كنت ترغب في إزالة جميع المعلومات، بما في ذلك رصيدك، الرجاء الاتصال بنا.
be: Калі вы хочаце выдаліць усю інфармацыю, уключаючы свой баланс, калі ласка, звяжыцеся з намі.
da: Hvis du ønsker at fjerne al information, inklusiv din saldo, bedes du kontakte os.
de: Wenn Sie alle Informationen, einschließlich Ihres Guthabens, entfernen möchten, kontaktieren Sie uns bitte.
es: Si desea eliminar toda la información, incluyendo su saldo, por favor contáctenos.
fr: Si vous souhaitez supprimer toutes les informations, y compris votre solde, veuillez nous contacter.
id: Jika Anda ingin menghapus semua informasi, termasuk saldo Anda, silakan hubungi kami.
it: Se desideri eliminare tutte le informazioni, incluso il tuo saldo, ti preghiamo di contattarci.
ja: すべての情報、残高を含む、を削除したい場合は、お問い合わせください。
ms: Jika anda ingin menghapus semua maklumat, termasuk baki anda, sila hubungi kami.
no: Hvis du vil fjerne all informasjon, inkludert saldoen din, vennligst kontakt oss.
pl: Jeśli chcesz usunąć wszystkie informacje, w tym saldo, skontaktuj się z nami.
pt: Se você deseja remover todas as informações, incluindo seu saldo, entre em contato conosco.
ru: Если вы хотите удалить всю информацию, включая ваш баланс, пожалуйста, свяжитесь с нами.
sv: Om du vill ta bort all information, inklusive ditt saldo, vänligen kontakta oss.
th: ถ้าคุณต้องการลบข้อมูลทั้งหมด รวมถึงยอดคงเหลือของคุณ กรุณาติดต่อเรา
tr: Tüm bilgilerinizi, bakiyeniz dahil olmak üzere silmek isterseniz, lütfen bizimle iletişime geçin.
uk: Якщо ви хочете видалити всю інформацію, включаючи ваш баланс, будь ласка, зв'яжіться з нами.
vi: Nếu bạn muốn xóa tất cả thông tin, bao gồm số dư, vui lòng liên hệ với chúng tôi.

source: If you want to try before you buy.
id: Jika Anda ingin mencoba sebelum membeli.
it: Se vuoi provare prima di acquistare.
ja: 購入前に試したい場合。
no: Hvis du vil prøve før du kjøper.
ru: Если вы хотите попробовать перед покупкой.
sv: Om du vill prova innan du köper.
uk: Якщо ви хочете спробувати перед покупкою.

source: Images
de: Bilder
es: Imágenes
id: Gambar-gambar
it: Immagini
ja: 画像
no: Bilder
pl: Obrazy
pt: Imagens
ru: Изображения
sv: Bilder
th: รูปภาพ
tr: Görseller
uk: Зображення
vi: Hình ảnh

source: Immerse Yourself in Business English Daily
ar: انغمس في الإنجليزية التجارية يوميا
be: Занурцеся ў Бізнес-англійскую кожны дзень
da: Forsænk dig selv i erhvervsengelsk dagligt
de: Tauchen Sie täglich in Business Englisch ein
es: Sumérgete en el Inglés de Negocios a Diario
fr: Immergez-vous dans l'anglais des affaires quotidiennement
id: Rendamlah Diri Anda Dalam Bahasa Inggris Bisnis Setiap Hari
it: Immergiti nel Business English Quotidianamente
ja: ビジネス英語に毎日没頭しましょう
ms: Rendamkan Diri Anda dalam Bahasa Inggeris Perniagaan Setiap Hari
no: Dykk Ned i Forretningsengelsk Daglig
pl: Zanurz się w codziennym Biznesowym Angielskim
pt: Mergulhe Diariamente no Inglês Comercial
ru: Погрузитесь в Бизнес-английский Ежедневно
sv: Omgiv Dig Själv Med Affärsengelska Dagligen
th: จงมุ่งหัวในภาษาอังกฤษทางธุรกิจทุกวัน
tr: Kendinizi Günlük İş İngilizcesine Kaptırın
uk: Занурюйтесь щодня в англійську мову для бізнесу
vi: Hòa mình vào Tiếng Anh Kinh doanh hàng ngày

source: Improve architecture, data, and resiliency answers.
ar: تحسين الإجابات المتعلقة بالهندسة المعمارية والبيانات والقدرة على التحمل.
be: Паляпшайце адказы пра архітэктуру, дадзеныя і ўстойлівасць.
da: Forbedre svarene på arkitektur, data og modstandsdygtighed.
de: Verbessere Architektur-, Daten- und Resilienzantworten.
es: Mejorar las respuestas de arquitectura, datos y resiliencia.
fr: Améliorer les réponses en matière d'architecture, de données et de résilience.
id: Tingkatkan jawaban arsitektur, data, dan ketahanan.
it: Migliorare le risposte di architettura, dati e resilienza.
ja: アーキテクチャ、データ、および回復力の回答を向上させる。
ms: Tingkatkan jawapan seni bina, data, dan ketahanan.
no: Forbedre arkitektur, data og svar på motstandskraft.
pl: Popraw odpowiedzi dotyczące architektury, danych i odporności.
pt: Melhorar respostas de arquitetura, dados e resiliência.
ru: Улучшите архитектуру, данные и ответы на вопросы устойчивости.
sv: Förbättra arkitektur, data och svar kring motståndskraft.
th: ปรับปรุงสถาปัตยกรรม, ข้อมูล, และคำตอบที่มีความยืดหยุ่นสูง.
tr: Mimariyi, verileri ve dayanıklılık yanıtlarını geliştirin.
uk: Покращити архітектуру, дані та відповіді на стійкість.
vi: Cải thiện kiến trúc, dữ liệu, và câu trả lời khả năng phục hồi.

source: improve English fluency
ar: تحسين الطلاقة في اللغة الإنجليزية
be: павысіць валодаўладанне англійскай
da: forbedre engelsk færdigheder
de: Verbessern Sie die Englischkenntnisse
es: mejorar la fluidez en inglés
fr: améliorer la fluidité en anglais
id: meningkatkan kefasihan bahasa Inggris
it: migliorare la fluenza in inglese
ja: 英語の流暢さを向上させる
ms: meningkatkan kelancaran bahasa Inggeris
no: forbedre engelsk flyt
pl: ulepsz płynność w języku angielskim
pt: melhorar a fluência em inglês
ru: улучшить разговорную речь на английском
sv: förbättra engelsk språklighet
th: ปรับปรุงความคล่องแคล่วในการใช้ภาษาอังกฤษ
tr: İngilizce akıcılığını geliştir
uk: покращити володіння англійською мовою
vi: cải thiện sự lưu loát tiếng Anh

source: Improve English Skills
ar: تحسين مهارات اللغة الإنجليزية
be: Палепшыце навыкі англійскай мовы
da: Forbedre engelske færdigheder
de: Verbessern Sie Ihre Englischkenntnisse
es: Mejora tus habilidades en inglés
fr: Améliorez vos compétences en anglais
id: Tingkatkan Kemampuan Bahasa Inggris
it: Migliora le competenze in inglese
ja: 英語スキルを向上させる
ms: Tingkatkan Kemahiran Bahasa Inggeris
no: Forbedre engelskferdigheter
pl: Udoskonal umiejętności języka angielskiego
pt: Melhore as habilidades em inglês
ru: Улучшите навыки английского
sv: Förbättra engelska färdigheter
th: ปรับปรุงทักษะภาษาอังกฤษ
tr: İngilizce Becerilerini Geliştir
uk: Покращте знання англійської
vi: Nâng cao kỹ năng Tiếng Anh

source: improve English speaking
ar: تحسين التحدث بالإنجليزية
be: палепшыць размаўлянне па-англійску
da: forbedre engelsk tale
de: Verbessern Sie Ihr Englisch Sprechen
es: mejora el habla en inglés
fr: améliorer l'anglais parlant
id: tingkatkan kemampuan berbicara bahasa Inggris
it: migliora la parlata inglese
ja: 英語の話す能力を向上させる
ms: meningkatkan kemahiran berbahasa Inggeris
no: forbedre engelsk tale
pl: popraw mówienie po angielsku
pt: melhore a fala em inglês
ru: улучшите английскую речь
sv: förbättra engelskt talande
th: ปรับปรุงทักษะการพูดภาษาอังกฤษ
tr: İngilizce konuşmayı geliştirin
uk: покращте англійську мову
vi: cải thiện khả năng nói tiếng Anh

source: Improve fluency with interactive chat sessions
ar: حسّن الطلاقة من خلال جلسات الدردشة التفاعلية
be: Палепшыце плавучасць з дапамогай інтэрактыўных сесій чату
da: Forbedr din flydende tale med interaktive chatsessioner
de: Verbessern Sie Ihre Sprachgewandtheit mit interaktiven Chatsitzungen
es: Mejora la fluidez con sesiones de chat interactivas
fr: Améliorez votre fluidité avec des sessions de chat interactives
id: Tingkatkan kelancaran dengan sesi obrolan interaktif
it: Migliora la fluidità con sessioni di chat interattive
ja: インタラクティブなチャットセッションで流暢さを向上させる
ms: Tingkatkan kelancaran dengan sesi sembang interaktif
no: Forbedre flyt med interaktive chatsesjoner
pl: Popraw płynność dzięki interaktywnym sesjom czatu
pt: Aprimore a fluência com sessões de chat interativas
ru: Улучшите беглость с помощью интерактивных чат-сессий
sv: Förbättra flytande med interaktiva chattpassager
th: ปรับปรุงความคล่องแคล่วด้วยการสนทนาผ่านช่องทางสนทนาที่โต้ตอบได้
tr: Etkileşimli sohbet oturumları ile akıcılığı geliştirin
uk: Поліпште своє володіння мовою за допомогою інтерактивних чат-сесій
vi: Cải thiện sự lưu loát với các phiên trò chuyện tương tác

source: Improve listening skills as you interpret descriptions.
ar: تحسين مهارات الاستماع بينما تفسر الأوصاف.
be: Паляпшайце навыкі праслухоўвання, калі вы тлумачыце апісанні.
da: Forbedr lyttefærdigheder, når du fortolker beskrivelser.
de: Verbessern Sie Ihre Hörverständnisfähigkeiten, während Sie Beschreibungen interpretieren.
es: Mejora las habilidades de escucha mientras interpretas descripciones.
fr: Améliorez vos compétences d'écoute pendant que vous interprétez des descriptions.
id: Tingkatkan keterampilan mendengarkan saat Anda menafsirkan deskripsi.
it: Migliora le competenze di ascolto mentre interpreti le descrizioni.
ja: 説明を解釈することでリスニングスキルを向上させます。
ms: Tingkatkan kemahiran mendengar anda ketika anda mentafsirkan keterangan.
no: Forbedre lytteferdighetene dine mens du tolker beskrivelser.
pl: Popraw umiejętności słuchania, interpretując opisy.
pt: Melhore as habilidades de escuta enquanto você interpreta descrições.
ru: Улучшайте навыки прослушивания, интерпретируя описания.
sv: Förbättra lyssningsfärdigheter när du tolkar beskrivningar.
th: ปรับปรุงทักษะการฟังขณะที่คุณตีความจากคำอธิบาย
tr: Açıklamaları yorumlarken dinleme becerilerinizi geliştirin.
uk: Покращуйте навички слухання, інтерпретуючи описи.
vi: Cải thiện kỹ năng nghe khi bạn diễn giải các mô tả.

source: Improve your ability to answer quickly and clearly in conversations.
ar: حسّن قدرتك على الرد بسرعة ووضوح في المحادثات.
be: Паляпшыце сваё здольнасць хутка і ясна адказваць у размовах.
da: Forbedr din evne til hurtigt og klart at svare i samtaler.
de: Verbessern Sie Ihre Fähigkeit, schnell und klar in Gesprächen zu antworten.
es: Mejora tu capacidad para responder rápidamente y claramente en las conversaciones.
fr: Améliorez votre capacité à répondre rapidement et clairement dans les conversations.
id: Tingkatkan kemampuan Anda untuk menjawab dengan cepat dan jelas dalam percakapan.
it: Migliora la tua capacità di rispondere rapidamente e chiaramente nelle conversazioni.
ja: 会話で迅速かつ明瞭に回答する能力を向上させましょう。
ms: Tingkatkan kemampuan anda untuk menjawab dengan cepat dan jelas dalam perbualan.
no: Forbedre evnen din til raskt og klart å svare i samtaler.
pl: Popraw swoją zdolność do szybkiego i jasnego odpowiadania w rozmowach.
pt: Melhore sua habilidade de responder rapidamente e claramente em conversas.
ru: Улучшите свою способность быстро и четко отвечать в разговорах.
sv: Förbättra din förmåga att snabbt och klart svara i konversationer.
th: ปรับปรุงความสามารถในการตอบสนองอย่างรวดเร็วและชัดเจนในการสนทนา.
tr: Konuşmalarda hızlı ve net bir şekilde cevap verme yeteneğinizi geliştirin.
uk: Покращте свою здатність швидко та ясно відповідати в розмовах.
vi: Cải thiện khả năng trả lời nhanh chóng và rõ ràng trong cuộc trò chuyện.
