Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Do I need to schedule time with a real interviewer?
ar: هل أحتاج إلى تحديد موعد مع مقابِل حقيقي؟
be: Ці трэба мне запісацца на сустрэчу з сапраўдным інтэрв'юерам?
da: Skal jeg planlægge tid med en rigtig interviewer?
de: Muss ich Zeit mit einem echten Interviewer einplanen?
es: ¿Necesito programar una cita con un entrevistador real?
fr: Ai-je besoin de planifier un rendez-vous avec un véritable interviewer ?
id: Apakah saya perlu menjadwalkan waktu dengan pewawancara sungguhan?
it: Devo programmare un orario con un vero intervistatore?
ja: 実際の面接官と時間を予約する必要がありますか？
ms: Adakah saya perlu menjadualkan masa dengan pewawancara sebenar?
no: Må jeg avtale tid med en ekte intervjuer?
pl: Czy muszę umówić się na spotkanie z prawdziwym rozmówcą?
pt: Preciso agendar um horário com um entrevistador real?
ru: Мне нужно назначить время с настоящим интервьюером?
sv: Behöver jag boka tid med en riktig intervjuare?
th: ฉันต้องกำหนดเวลาให้กับผู้สัมภาษณ์จริงหรือไม่?
tr: Gerçek bir görüşmeci ile zaman ayarlamam gerekiyor mu?
uk: Чи потрібно запланувати час з реальним інтерв'юером?
vi: Tôi có cần phải sắp xếp thời gian với một người phỏng vấn thực không?

source: Do you cover databases and transactions?
ar: هل تغطي قواعد البيانات والمعاملات؟
be: Ці ахопліваеце вы базы дадзеных і транзакцыі?
da: Dækker du databaser og transaktioner?
de: Behandeln Sie Datenbanken und Transaktionen?
es: ¿Cubre bases de datos y transacciones?
fr: Couvrez-vous les bases de données et les transactions ?
id: Apakah Anda membahas basis data dan transaksi?
it: Copri argomenti su database e transazioni?
ja: データベースとトランザクションについて教えてくれますか？
ms: Adakah anda merangkumi pangkalan data dan transaksi?
no: Dekker du databaser og transaksjoner?
pl: Czy obejmujecie bazy danych i transakcje?
pt: Você cobre bancos de dados e transações?
ru: Вы охватываете базы данных и транзакции?
sv: Täcker ni databaser och transaktioner?
th: คุณครอบคลุมฐานข้อมูลและธุรกรรมหรือไม่?
tr: Veritabanları ve işlemleri kapsıyor musunuz?
uk: Ви охоплюєте бази даних та транзакції?
vi: Bạn có bao gồm cơ sở dữ liệu và giao dịch không?

source: Do you need a personalized plan?
id: Apakah Anda memerlukan rencana yang dipersonalisasi?
it: Hai bisogno di un piano personalizzato?
ja: パーソナライズされたプランが必要ですか？
no: Trenger du en personlig tilpasset plan?
pl: Czy potrzebujesz spersonalizowanego planu?
ru: Вам нужен персонализированный план?
sv: Behöver du en personlig plan?
uk: Вам потрібен персоналізований план?

source: Doctor
ar: دكتور
be: Доктар
da: Doktor
de: Doktor
fr: Docteur
id: Dokter
it: Dottore
ja: ドクター
ms: Doktor
no: Doktor
pl: Doktor
pt: Doutor
ru: Доктор
sv: Doktor
th: หมอ
tr: Doktor
uk: Доктор
vi: Bác sĩ

source: Dog Owner
ar: مالك الكلب
be: Уладальнік сабакі
da: Hundeejer
de: Hundebesitzer
es: Dueño de perro
fr: Propriétaire de chien
id: Pemilik Anjing
it: Proprietario di cane
ja: 犬の飼い主
ms: Pemilik Anjing
no: Hundeeier
pl: Właściciel psa
pt: Proprietário de Cão
ru: Владелец собаки
sv: Hundägare
th: เจ้าของสุนัข
tr: Köpek Sahibi
uk: Власник собаки
vi: Chủ chó

source: Don't forget to try call mode in the practice section!
ar: لا تنسَ تجربة وضع المكالمة في قسم التدريب!
be: Не забудзьцеся паспрабаваць рэжым выкліку ў раздзеле практыкаванняў!
da: Glem ikke at prøve opkaldstilstand i øvelsessektionen!
de: Vergessen Sie nicht, den Anrufmodus im Übungsbereich auszuprobieren!
es: ¡No olvides probar el modo de llamada en la sección de práctica!
fr: N'oubliez pas d'essayer le mode appel dans la section pratique !
id: Jangan lupa untuk mencoba mode panggilan di bagian latihan!
it: Non dimenticare di provare la modalità chiamata nella sezione pratica!
ja: 練習セクションで通話モードを試すのを忘れないでください！
no: Glem ikke å prøve samtalemodus i praksisdelen!
pl: Nie zapomnij wypróbować trybu połączeń w sekcji ćwiczeń!
pt: Não se esqueça de experimentar o modo de chamada na seção de prática!
ru: Не забудьте попробовать режим звонка в разделе практики!
sv: Glöm inte att prova samtalsläge i övningssektionen!
th: อย่าลืมลองโหมดการโทรในส่วนการฝึกฝน!
tr: Unutmayın, pratik bölümündeki arama modunu da deneyin!
uk: Не забудьте спробувати режим дзвінка в розділі практики!
vi: Đừng quên thử chế độ gọi trong phần thực hành!

source: Done
ar: تم
be: Выканана
da: Færdig
de: Erledigt
es: Hecho
fr: Fait
id: Selesai
it: Fatto
ja: 完了
ms: Siap
no: Gjort
pl: Zrobione
pt: Feito
ru: Выполнено
sv: Klar
th: เสร็จแล้ว
tr: Tamamlandı
uk: Виконано
vi: Hoàn thành

source: Done recording
es: Hecho de grabar
id: Selesai merekam
it: Registrazione completata
ja: 録音完了
no: plaintext Ferdig innspilt
pl: Zakończono nagrywanie
pt: Concluído a gravação
ru: Готово, запись завершена
sv: Klar med inspelning
uk: Готово записано

source: Don’t let mistakes stop you.
ar: لا تدع الأخطاء توقفك.
be: Не дазваляйце памылкам спыняць вас.
da: Lad ikke fejl stoppe dig.
de: Lassen Sie sich von Fehlern nicht aufhalten.
es: No dejes que los errores te detengan.
fr: Ne laissez pas les erreurs vous arrêter.
id: Jangan biarkan kesalahan menghentikanmu.
it: Non lasciare che gli errori ti fermino.
ja: ミスがあなたを止めることを許さないでください。
no: Ikke la feil stoppe deg.
pl: Nie pozwól, aby błędy cię powstrzymywały.
pt: Não deixe que erros te parem.
ru: Не позволяйте ошибкам останавливать вас.
sv: Låt inte misstag stoppa dig.
th: อย่าให้ความผิดพลาดหยุดยั้งคุณ
tr: Hataların seni durdurmasına izin verme.
uk: Не дозволяйте помилкам зупиняти вас.
vi: Đừng để những sai lầm ngăn cản bạn.

source: Don’t skip small talk
ar: لا تتجاهل الحديث العابر
be: Не праглядайце невялікі размовы
da: Spring ikke småsnak over
de: Überspringen Sie nicht den Smalltalk
es: No te saltes la charla informal
fr: Ne sautez pas les petites discussions
id: Jangan lewatkan obrolan ringan
it: Non saltare le chiacchiere informali
ja: 小話をスキップしないでください
ms: Jangan abaikan perbualan ringan
no: Ikke hopp over småprat
pl: Nie pomijaj drobnej rozmowy
pt: Não pule o papo casual
ru: Не пропускайте незначительные беседы
sv: Hoppa inte över småpratet
th: อย่าข้ามการพูดคุยเล็กๆ
tr: Küçük sohbetleri atlamayın
uk: Не уникаюте невеликого обговорення
vi: Đừng bỏ qua cuộc trò chuyện nhỏ

source: Duration
id: Durasi
it: Durata
ja: 期間
no: Varighet
ru: Продолжительность
uk: Тривалість

source: Duration:
de: Dauer:
es: Duración:
id: Durasi:
it: Durata:
ja: 期間:
no: Varighet:
pl: Czas trwania:
pt: Duração:
ru: Длительность:
sv: Varaktighet:
th: ระยะเวลา:
tr: Süre:
uk: Тривалість:
vi: Thời lượng:

source: Each time you use AI features (like conversation or Role Play), it consumes a certain amount of computational power, which we measure in "hours of AI usage." This allows us to fairly allocate resources based on your activity level. I call it "AI hours" because it`s approximate time of which you will consume the AI if you will use it continuously.
uk: Кожного разу, коли ви використовуєте функції штучного інтелекту (наприклад, бесіди або рольові ігри), це споживає певну кількість обчислювальної потужності, яку ми вимірюємо в "годинах використання ШІ". Це дозволяє нам справедливо розподіляти ресурси на основі вашої активності. Я називаю це "годинами ШІ", тому що це приблизний час, протягом якого ви будете використовувати ШІ, якщо будете використовувати його безперервно.

source: Early access to new tools
ar: الوصول المبكر إلى الأدوات الجديدة
be: Ранні доступ да новых інструментаў
da: Tidlig adgang til nye værktøjer
de: Früher Zugang zu neuen Tools
es: Acceso anticipado a nuevas herramientas
fr: Accès anticipé aux nouveaux outils
id: Akses awal ke alat baru
it: Accesso anticipato a nuovi strumenti
ja: 新しいツールへの早期アクセス
no: Tidlig tilgang til nye verktøy
pl: Wczesny dostęp do nowych narzędzi
pt: Acesso antecipado a novas ferramentas
ru: Ранний доступ к новым инструментам
sv: Tidigt tillträde till nya verktyg
th: การเข้าถึงเครื่องมือใหม่ล่วงหน้า
tr: Yeni araçlara erken erişim
uk: Ранній доступ до нових інструментів
vi: Quyền truy cập sớm vào công cụ mới

source: Edit
de: Bearbeiten
es: Editar
it: Modifica
ja: 編集
no: Rediger
pl: Edytuj
pt: Editar
ru: Редактировать
sv: Redigera
th: แก้ไข
tr: Düzenle
uk: Редагувати
vi: Chỉnh sửa

source: edited
ar: مُحرَّر
be: адрэдагаваны
da: redigeret
de: bearbeitet
es: editado
fr: édité
id: diedit
it: modificato
ja: 編集済み
no: redigert
pl: przeredagowane
pt: editado
ru: отредактировано
sv: redigerad
th: แก้ไขแล้ว
tr: düzenlendi
uk: відредаговано
vi: chỉnh sửa

source: EF Core insights were spot-on. The demo feedback made my answers sharper.
ar: كانت تحليلات EF Core دقيقة للغاية. جعلتني ملاحظات العرض التجريبي أعطي إجابات أكثر دقة.
be: Узнёслыя зацемкі пра EF Core былі трапнымі. Водгук з дэманстрацыі зрабіў мае адказы больш дакладнымі.
da: EF Core indsigter var præcise. Demo-feedback gjorde mine svar skarpere.
de: EF Core-Einblicke waren treffend. Das Demo-Feedback hat meine Antworten geschärft.
es: La visión de EF Core fue acertada. Los comentarios de la demostración hicieron que mis respuestas fueran más precisas.
fr: Les insights d'EF Core étaient parfaits. Les retours de la démo ont rendu mes réponses plus précises.
id: Wawasan EF Core sangat tepat. Umpan balik demo membuat jawaban saya lebih tajam.
it: Le intuizioni di EF Core erano precise. Il feedback della demo ha reso le mie risposte più incisive.
ja: EF Core のインサイトは的確でした。デモのフィードバックが私の答えをより鋭くしました。
ms: Tinjauan EF Core sangat tepat. Maklum balas demo menjadikan jawapan saya lebih tajam.
no: EF Core innsiktene var spot-on. Tilbakemeldingene fra demoen gjorde svarene mine skarpere.
pl: Spostrzeżenia EF Core były trafne. Opinie z demonstracji sprawiły, że moje odpowiedzi stały się bardziej precyzyjne.
pt: EF Core insights foram precisas. O feedback da demonstração tornou minhas respostas mais detalhadas.
ru: EF Core insights были очень точны. Отзывы о демонстрации сделали мои ответы более четкими.
sv: EF Core-insikterna var helt rätt. Demoåterkopplingen gjorde mina svar skarpare.
th: EF Core ข้อมูลเชิงลึกตรงประเด็นมาก การตอบรับจากการสาธิตทำให้คำตอบของฉันชัดเจนขึ้น
tr: EF Core içgörüleri tam isabetti. Demo geri bildirimi, cevaplarımı daha keskin hale getirdi.
uk: Інсайти EF Core були точними. Відгуки після демо зробили мої відповіді гострішими.
vi: Những hiểu biết về EF Core rất chính xác. Phản hồi từ bản demo đã làm cho câu trả lời của tôi sắc bén hơn.

source: EF Core tracked vs. no-tracking
ar: EF Core تعقب مقابل عدم التعقب
be: EF Core адсочваемы vs. без адсочвання
da: EF Core sporet vs. ikke-sporet
de: EF Core nachverfolgt vs. kein Tracking
es: EF Core rastreado vs. sin rastreo
fr: EF Core suivi vs. sans suivi
id: EF Core dilacak vs. tanpa pelacakan
it: EF Core con tracciamento vs. senza tracciamento
ja: EF Core の追跡 vs. 非追跡
ms: EF Core: diikuti vs. tiada penjejakan
no: EF Core sporing vs. ikke-sporing
pl: Śledzenie i brak śledzenia w EF Core
pt: EF Core rastreado vs. não-rastreado
ru: EF Core отслеживание vs. без отслеживания
sv: EF Core spårad vs. icke-spårning
th: EF Core ติดตาม vs. ไม่ติดตาม
tr: EF Core izlenen vs. izlenmeyen
uk: EF Core відстежуваний vs. невідстежуваний
vi: EF Core theo dõi vs. không theo dõi

source: Effective strategies to enhance your English speaking skills amidst a hectic schedule.
ar: استراتيجيات فعالة لتعزيز مهاراتك في التحدث بالإنجليزية في وسط جدولك الزمني المزدحم.
be: Эфектыўныя стратегіі для паляпшэння ваших навыкаў гаворкі на англійскай мове ўмежах застаялага графіка.
da: Effektive strategier til at forbedre dine engelske talefærdigheder midt i en travl tidsplan.
de: Effektive Strategien zur Verbesserung Ihrer Englisch-Sprachkenntnisse trotz eines hektischen Zeitplans.
es: Estrategias efectivas para mejorar tus habilidades de habla en inglés en medio de una agenda apretada.
fr: Des stratégies efficaces pour améliorer vos compétences en anglais malgré un emploi du temps chargé.
id: Strategi efektif untuk meningkatkan kemampuan berbicara Bahasa Inggris Anda di tengah jadwal yang padat.
it: Strategie efficaci per migliorare le tue competenze di inglese parlato nonostante un programma impegnativo.
ja: 忙しいスケジュールの中で英語のスピーキングスキルを向上させるための効果的な戦略。
ms: Strategi berkesan untuk meningkatkan kemahiran berbahasa Inggeris anda di tengah-tengah jadual yang sibuk.
no: Effektive strategier for å forbedre dine engelske taleferdigheter midt i en travel timeplan.
pl: Efektywne strategie na poprawę umiejętności mówienia po angielsku wśród napiętego harmonogramu.
pt: Estratégias eficazes para melhorar suas habilidades de falar inglês em meio a uma agenda agitada.
ru: Эффективные стратегии для улучшения ваших навыков английского языка на фоне напряженного графика.
sv: Effektiva strategier för att förbättra dina engelska talfärdigheter trots ett hektiskt schema.
th: กลยุทธ์ที่มีประสิทธิภาพในการพัฒนาทักษะการพูดภาษาอังกฤษของคุณในหมู่วันที่มีกำหนดการที่ยุ่งยาก
tr: Yoğun bir program arasında İngilizce konuşma becerilerinizi geliştirmek için etkili stratejiler.
uk: Ефективні стратегії для покращення ваших навичок англійської мови на тлі напруженого розкладу.
vi: Các chiến lược hiệu quả để nâng cao kỹ năng nói tiếng Anh trong lịch trình bận rộn.

source: Email
ar: البريد الإلكتروني
be: Электронная пошта
es: Correo electrónico
id: Sure, here is the translation in the requested format: Email
ja: メール
no: E-post
ru: Электронная почта
sv: E-post
th: อีเมล
tr: E-posta
uk: Електронна пошта

source: Enable Microphone
id: Aktifkan Mikrofon
it: Abilita Microfono
ja: マイクを有効にする
no: Aktiver mikrofon
pl: Włącz Mikrofon
ru: Включить микрофон
sv: Aktivera mikrofon
uk: Ввімкнути мікрофон

source: Enable microphone
id: Aktifkan mikrofon
it: Abilita microfono
ja: マイクを有効にする
no: Aktiver mikrofon
pl: Włącz mikrofon
ru: Включить микрофон
sv: Aktivera mikrofon
uk: Увімкнути мікрофон

source: Enabling ai voice is a premium feature. Please upgrade your balance to access this feature.
uk: Увімкнення голосу AI є преміальною функцією. Будь ласка, поповніть свій баланс, щоб отримати доступ до цієї функції.

source: Ending the Interview: Final Phrases
ar: إنهاء المقابلة: العبارات النهائية
be: Заканчэнне інтэрв'ю: канчатковыя фразы
da: Afslutning af interviewet: Afsluttende sætninger
de: Beendigung des Interviews: Abschließende Phrasen
es: Finalizando la Entrevista: Frases Finales
fr: Fin de l'entretien : Phrases finales
id: Mengakhiri Wawancara: Frase Terakhir
it: Terminare l'Intervista: Frasi Finali
ja: インタビューの終了：最終フレーズ
ms: Menamatkan Temubual: Frasa Akhir
no: Avslutte intervjuet: Sluttfaser
pl: Zakończenie rozmowy: Końcowe zwroty
pt: Encerrando a Entrevista: Frases Finais
ru: Завершение интервью: заключительные фразы
sv: Avsluta intervjun: Slutliga fraser
th: การสิ้นสุดการสัมภาษณ์: วลีสุดท้าย
tr: Mülakatı Bitirme: Son ifadeler
uk: Закінчення інтерв'ю: заключні фрази
vi: Kết thúc Cuộc Phỏng vấn: Cụm từ Cuối cùng

source: Engage in a casual conversation with a friendly stranger at a social event. Perfect for practicing how to break the ice and keep the chat going naturally.
ar: انخرط في محادثة عادية مع شخص غريب ودود في حدث اجتماعي. مثالي لممارسة كيفية كسر حاجز الصمت والحفاظ على سير المحادثة بشكل طبيعي.
be: Удзельнічайце ў нязмушанай размове з прыязным незнаёмцам на сацыяльнай падзеі. Ідэальна падыходзіць для практыкі таго, як парушыць лёд і весці размову натуральна.
da: Deltag i en afslappet samtale med en venlig fremmed til en social begivenhed. Perfekt til at øve sig i at bryde isen og holde samtalen i gang naturligt.
de: Führen Sie ein lockeres Gespräch mit einem freundlichen Fremden bei einer gesellschaftlichen Veranstaltung. Perfekt, um zu üben, wie man das Eis bricht und das Gespräch natürlich am Laufen hält.
es: Inicia una conversación casual con un extraño amigable en un evento social. Perfecto para practicar cómo romper el hielo y mantener la conversación de manera natural.
fr: Engagez une conversation détendue avec un étranger sympathique lors d'un événement social. Parfait pour s'entraîner à briser la glace et à maintenir la discussion de manière naturelle.
id: Berkasualah dalam percakapan santai dengan orang asing yang ramah di acara sosial. Sempurna untuk berlatih cara memulai percakapan dan menjaga percakapan tetap mengalir dengan alami.
it: Impegnati in una conversazione informale con uno sconosciuto amichevole a un evento sociale. Perfetto per esercitarti a rompere il ghiaccio e mantenere la conversazione in modo naturale.
ja: 社交イベントでフレンドリーな見知らぬ人とカジュアルな会話を楽しもう。アイスブレイクの方法を練習し、自然に会話を続けるのに最適です。
ms: Berbual secara santai dengan seorang yang tak dikenali di acara sosial. Sesuai untuk berlatih cara memecahkan kebuntuan dan memastikan perbualan berjalan lancar secara semula jadi.
no: Delta deg inn i en uformell samtale med en vennlig fremmed på en sosial begivenhet. Perfekt for å øve på hvordan du kan bryte isen og holde samtalen gående naturlig.
pl: Nawiąż swobodną rozmowę z życzliwym nieznajomym na wydarzeniu towarzyskim. Idealne do ćwiczenia przełamywania lodów i naturalnego podtrzymywania rozmowy.
pt: Engaje em uma conversa casual com um desconhecido amigável em um evento social. Perfeito para praticar como quebrar o gelo e manter a conversa fluindo naturalmente.
ru: Завяжите непринужденную беседу с дружелюбным незнакомцем на социальном мероприятии. Отлично подходит для практики навыков "разбивания льда" и естественного поддержания беседы.
sv: Inled en avslappnad konversation med en vänlig främling vid en social tillställning. Perfekt för att öva på hur man bryter isen och håller samtalet igång naturligt.
th: พูดคุยสบาย ๆ กับคนแปลกหน้าที่เป็นมิตรในงานสังคม เหมาะสำหรับฝึกฝนวิธีการเริ่มต้นการสนทนาด้วยบรรยากาศสบาย ๆ และรักษาบทสนทนาให้ดำเนินไปอย่างเป็นธรรมชาติ
tr: Sosyal bir etkinlikte arkadaş canlısı bir yabancıyla hoş bir sohbet gerçekleştirin. Buzları kırmak ve sohbeti doğal bir şekilde sürdürmek için harika bir fırsat.
uk: Заведіть невимушену розмову з дружнім незнайомцем на соціальному заході. Ідеально підходить для практики того, як "розтопити лід" і підтримувати бесіду природним чином.
vi: Tham gia vào một cuộc trò chuyện thân mật với một người lạ thân thiện tại một sự kiện xã hội. Hoàn hảo để thực hành cách phá băng và giữ cho cuộc trò chuyện diễn ra một cách tự nhiên.
