Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Free vs Paid Plan
ar: خطة مجانية مقابل خطة مدفوعة
be: Бясплатны супраць Платны План
da: Gratis vs Betalt Plan
de: Kostenloser vs Bezahlter Plan
es: Gratis vs Plan de Pago
fr: Gratuit vs Plan Payant
id: Gratis vs Berbayar Paket
it: Gratuito vs Piano a Pagamento
ja: 無料プランと有料プラン
no: Gratis vs Betalt Plan
pl: Bezpłatny vs Płatny Plan
pt: Grátis vs Plano Pago
ru: Бесплатный vs Платный план
sv: Gratis vs Betald Plan
th: ฟรี vs แผนชำระเงิน
tr: Ücretsiz vs Ücretli Plan
uk: Безкоштовний vs Платний план
vi: Miễn phí và Gói trả phí

source: Free-for-All
id: Bebas untuk Semua
it: Libero per tutti
ja: フリーオール
no: Fritt for alle
ru: Свободный доступ для всех
uk: Вільний для всіх

source: French Learning Plan
ar: خطة تعلم الفرنسية
be: План вучэбы французскай мовы
da: Fransk Læringsplan
de: Französischer Lernplan
es: Plan de Aprendizaje de Francés
fr: Plan d'Apprentissage du Français
id: Rencana Belajar Prancis
it: Piano di apprendimento del francese
ja: フランス語学習計画
ms: Rancangan Pembelajaran Perancis
no: Fransk Læringsplan
pl: Plan Nauki Francuskiego
pt: Plano de Aprendizagem de Francês
ru: План изучения французского
sv: Franska Lärplan
th: แผนการเรียนภาษาฝรั่งเศส
tr: Fransızca Öğrenme Planı
uk: План навчання французької
vi: Kế Hoạch Học Tiếng Pháp

source: Frequent users who need more value
ar: مستخدمون متكررون يحتاجون إلى قيمة أكبر
be: Частыя карыстальнікі, якім патрэбнае большая вартасць
da: Hyppige brugere, der har brug for mere værdi
de: Häufige Nutzer, die mehr Wert benötigen
es: Usuarios frecuentes que necesitan más valor
fr: Utilisateurs fréquents qui ont besoin de plus de valeur
id: Pengguna yang sering membutuhkan lebih banyak nilai
it: Utenti frequenti che necessitano di maggiore valore
ja: 頻繁に利用するユーザーがより多くの価値を必要とする
ms: Pengguna yang kerap memerlukan lebih banyak nilai
no: Hyppige brukere som trenger mer verdi
pl: Częste użytkownicy, którzy potrzebują więcej wartości
pt: Usuários frequentes que precisam de mais valor
ru: Частые пользователи, которым нужно больше ценности
th: ผู้ใช้ที่ใช้งานบ่อยซึ่งต้องการคุณค่ามากขึ้น
tr: Sık kullanan kullanıcılar, daha fazla değere ihtiyaç duyarlar
uk: Часті користувачі, які потребують більше цінності
vi: Những người dùng thường xuyên cần nhiều giá trị hơn

source: Frequently Asked Questions
id: Pertanyaan yang Sering Diajukan
it: Domande Frequenti
ja: よくある質問
no: Ofte stilte spørsmål
pl: Najczęściej Zadawane Pytania
ru: Часто задаваемые вопросы
sv: Vanliga frågor
uk: Часті запитання

source: From mistakes and hesitation to confident conversations
ar: من الأخطاء والتردد إلى المحادثات بثقة
be: Ад памылак і ваганняў да ўпэўненых размоў
da: Fra fejl og tøven til selvsikre samtaler
de: Von Fehlern und Zögern zu selbstbewussten Gesprächen
es: De errores y vacilaciones a conversaciones seguras
fr: Des erreurs et hésitations aux conversations confiantes
id: Dari kesalahan dan keragu-raguan menuju percakapan percaya diri
it: Dagli errori e esitazioni a conversazioni sicure
ja: 間違いやためらいから自信を持った会話へ
ms: Dari kesilapan dan keraguan kepada perbualan yang yakin
no: Fra feil og nøling til selvsikre samtaler
pl: Od błędów i wahania do pewnych siebie konwersacji
pt: De erros e hesitação a conversas confiantes
ru: От ошибок и колебаний к уверенным беседам
sv: Från misstag och tvekan till självsäkra konversationer
th: จากความผิดพลาดและความลังเลไปสู่การสนทนาที่มั่นใจ
tr: Hatalardan ve tereddütten kendinden emin konuşmalara
uk: Від помилок і вагань до впевнених розмов
vi: Từ sai lầm và do dự đến những cuộc trò chuyện tự tin

source: From Onboarding to Confidence
ar: من الإعداد إلى الثقة
be: Ад знаёмства да ўпэўненасці
da: Fra Introduktion til Selvsikkerhed
de: Von der Einarbeitung zur Selbstsicherheit
es: De la Incorporación a la Confianza
fr: De l'intégration à la confiance
id: Dari Memulai Hingga Percaya Diri
it: Dall'Orientamento alla Fiducia
ja: オンボーディングから自信へ
ms: Dari Pengenalan ke Keyakinan
no: Fra introduksjon til selvtillit
pl: Od wprowadzenia do pewności siebie
pt: De Introdução à Confiança
ru: От адаптации до уверенности
sv: Från Ombordstigning till Självförtroende
th: จากการเริ่มต้นไปสู่ความมั่นใจ
tr: Onboarding'den Güvene
uk: Від першої зустрічі до впевненості
vi: plaintext Từ Khởi động đến Tự tin

source: frontend developer interview prep
ar: الإعداد لمقابلة مطور الواجهة الأمامية
be: падрыхтоўка да сумоўя для frontend-распрацоўніка
da: forberedelse til interview med frontend-udvikler
de: Frontend-Entwickler Vorstellungsgespräch Vorbereitung
es: preparación para entrevistas de desarrollador frontend
fr: préparation à l'entretien de développeur frontend
id: persiapan wawancara developer frontend
it: preparazione per il colloquio da sviluppatore frontend
ja: フロントエンド開発者面接対策
ms: persediaan temuduga pembangun frontend
no: frontend utvikler intervju forberedelse
pl: przygotowanie do rozmowy kwalifikacyjnej na stanowisko programisty frontendu
pt: preparação para entrevista de desenvolvedor frontend
ru: подготовка к интервью на должность фронтенд-разработчика
sv: frontend utvecklare intervju förberedelse
th: เตรียมตัวสัมภาษณ์ตำแหน่งนักพัฒนาฟรอนต์เอนด์
tr: frontend developer mülakat hazırlığı
uk: підготовка до співбесіди на посаду фронтенд-розробника
vi: chuẩn bị phỏng vấn lập trình viên frontend

source: Frontend engineers interviewing for Senior, Lead, or Staff positions
ar: مهندسو الواجهة الأمامية الذين يجرون مقابلات للحصول على مناصب كبير أو قائد أو فريق.
be: Фронтэнд інжынеры, якія праходзяць сумоўе на пасады Старэйшага, Вядучага або Штатнага спецыяліста
da: Frontend-ingeniører, der interviewer til Senior-, Lead- eller Staff-positioner
de: Frontend-Ingenieure, die sich für Senior-, Lead- oder Staff-Positionen bewerben
es: Ingenieros de frontend entrevistándose para posiciones de Senior, Líder o Personal
fr: Ingénieurs front-end en entretien pour des postes de Senior, Lead ou Staff
id: Frontend engineer yang melamar posisi Senior, Lead, atau Staf
it: Ingegneri frontend in fase di colloquio per posizioni di Senior, Lead o Staff
ja: シニア、リード、またはスタッフのポジションを目指すフロントエンドエンジニアの面接
ms: Jurutera frontend ditemuduga untuk jawatan Senior, Lead, atau Staf
no: Frontend-ingeniører som intervjuer for Senior-, Lead- eller Staff-stillinger
pl: Inżynierowie front-endu przeprowadzający rozmowy kwalifikacyjne na stanowiska starszego programisty, lidera lub starszego specjalisty
pt: Engenheiros frontend entrevistando para posições de Sênior, Líder ou Staff
ru: Фронтенд-инженеры, проходящие собеседование на позиции старшего, ведущего или ведущего специалиста
sv: Frontend-ingenjörer som intervjuar för Senior-, Lead- eller Staff-positioner
th: วิศวกรส่วนหน้าที่สัมภาษณ์สำหรับตำแหน่งอาวุโส หัวหน้า หรือเจ้าหน้าที่
tr: Kıdemli, Lider veya Uzman pozisyonları için görüşme yapan Ön Uç mühendisleri
uk: Фронтенд-інженери, які проходять співбесіду на позиції Сеньйора, Ліда або Старшого спеціаліста
vi: Các kỹ sư frontend phỏng vấn cho các vị trí Senior, Lead, hoặc Staff

source: Frontend System Design
ar: تصميم نظام الواجهة الأمامية
be: Праектаванне Пярэдняга Канца Сістэмы
es: Diseño del Sistema Frontend
fr: Conception de Système Frontend
id: Desain Sistem Frontend
it: Progettazione del sistema frontend
ja: フロントエンドシステム設計
ms: Reka Bentuk Sistem Frontend
pl: Projektowanie systemu frontendu
pt: Design do Sistema de Frontend
th: การออกแบบระบบ Frontend
tr: Önyüz Sistem Tasarımı
uk: Системне проектування фронтенду
vi: Thiết Kế Hệ Thống Giao Diện Người Dùng

source: frontend system design interview
ar: plaintext مقابلة التصميم الأمامي لنظام
be: фронтэнд сістэма дызайн інтэрв'ю
es: entrevista de diseño de sistema de frontend
fr: entretien sur la conception de système frontend
id: wawancara desain sistem frontend
it: colloquio di progettazione del sistema frontend
ja: フロントエンドシステム設計面接
ms: temu duga reka bentuk sistem frontend
no: frontend system design intervju
pl: projektowanie systemu frontendowego - rozmowa kwalifikacyjna
pt: entrevista de design de sistema frontend
ru: передний план системы проектирование интервью
sv: frontend system design intervju
th: การสัมภาษณ์ออกแบบระบบส่วนหน้าของผู้ใช้
tr: frontend system tasarım mülakatı
uk: інтерв’ю з проектування систем фронтенду
vi: phỏng vấn thiết kế hệ thống frontend

source: Full Access
ar: الوصول الكامل
be: Поўны доступ
da: Fuld Adgang
de: Vollständiger Zugriff
es: Acceso Completo
fr: Accès Complet
id: Akses Penuh
it: Accesso completo
ja: フルアクセス
ms: Akses Penuh
no: Full Tilgang
pl: Pełny dostęp
pt: Acesso Completo
ru: Полный доступ
sv: Fullständig Åtkomst
th: เข้าถึงเต็มรูปแบบ
tr: Tam Erişim
uk: Повний доступ
vi: Truy cập đầy đủ

source: Full access - Expiring soon
id: Akses penuh - Akan segera berakhir
it: Accesso completo - In scadenza presto
ja: 完全アクセス - まもなく期限切れ
no: Full tilgang - Utløper snart
pl: Pełny dostęp - Wkrótce wygaśnie
ru: Полный доступ - Скоро закончится
sv: Fullständig åtkomst - Utlöper snart
uk: Повний доступ - Має закінчитися найближчим часом

source: Full Access for 1 day
de: Voller Zugriff für 1 Tag
es: Acceso completo por 1 día
id: Akses Penuh selama 1 hari
it: Accesso completo per 1 giorno
ja: 1日間のフルアクセス
no: Full tilgang i 1 dag
pl: Pełny dostęp na 1 dzień
pt: Acesso completo por 1 dia
ru: Полный доступ на 1 день
sv: Full åtkomst i 1 dag
th: Full Access for 1 day การเข้าถึงทั้งหมดเป็นเวลา 1 วัน
tr: 1 gün için tam erişim
uk: Повний доступ на 1 день
vi: Truy cập đầy đủ trong 1 ngày

source: Full Access for 1 month
de: Vollzugriff für 1 Monat
es: Acceso completo por 1 mes
id: Full Access untuk 1 bulan
it: Accesso completo per 1 mese
ja: 1か月間のフルアクセス
no: Full tilgang i 1 måned
pl: Pełny dostęp na 1 miesiąc
pt: Acesso Completo por 1 mês
ru: Полный доступ на 1 месяц
sv: Full åtkomst i 1 månad
th: เข้าถึงแบบเต็มรูปแบบ 1 เดือน
tr: Tam Erişim 1 ay boyunca
uk: Повний доступ на 1 місяць
vi: Truy cập đầy đủ trong 1 tháng

source: Full Access for 1 week
de: Voller Zugriff für 1 Woche
es: Acceso completo por 1 semana
id: Akses Penuh selama 1 minggu
it: Accesso completo per 1 settimana
ja: 1週間のフルアクセス
no: Full tilgang i 1 uke
pl: Pełen dostęp na 1 tydzień
pt: Acesso Completo por 1 semana
ru: Полный доступ на 1 неделю
sv: Full tillgång i 1 vecka
th: เข้าถึงได้เต็มรูปแบบเป็นเวลา 1 สัปดาห์
tr: 1 haftalık Tam Erişim
uk: Повний доступ на 1 тиждень
vi: Quyền truy cập đầy đủ trong 1 tuần

source: Full Access for 1 year
id: Akses Penuh selama 1 tahun
it: Accesso Completo per 1 anno
ja: 1年間のフルアクセス
no: Full tilgang i 1 år
pl: Pełny dostęp na 1 rok
ru: Полный доступ на 1 год
sv: Full åtkomst i 1 år
uk: Повний доступ на 1 рік

source: Full access to all simulations
ar: الوصول الكامل إلى جميع المحاكاة
be: Поўны доступ да ўсіх сімуляцыяў
da: Fuld adgang til alle simulationer
de: Vollständiger Zugang zu allen Simulationen
es: Acceso completo a todas las simulaciones
fr: Accès complet à toutes les simulations
id: Akses penuh ke semua simulasi
it: Accesso completo a tutte le simulazioni
ja: すべてのシミュレーションへの完全アクセス
ms: Akses penuh kepada semua simulasi
no: Full tilgang til alle simuleringer
pl: Pełny dostęp do wszystkich symulacji
pt: Acesso total a todas as simulações
ru: Полный доступ ко всем симуляциям
sv: Fullständig tillgång till alla simuleringar
th: การเข้าถึงการจำลองทั้งหมด
tr: Tüm simülasyonlara tam erişim
uk: Повний доступ до всіх симуляцій
vi: Toàn quyền truy cập vào tất cả các mô phỏng

source: Full AI interview coach access
ar: الوصول الكامل لمدرب المقابلات بالذكاء الاصطناعي
be: Поўны доступ да штучнага інтэлекту трэнера па інтэрв'ю
da: Fuld adgang til AI-interviewcoach
de: Vollständiger Zugriff auf den AI-Interview-Coach
es: Acceso completo al entrenador de entrevistas de IA
fr: Accès complet au coach d'entretien IA
id: Akses penuh pelatih wawancara AI
it: Accesso completo all'allenatore AI per i colloqui
ja: フル AI 面接コーチアクセス
no: Full AI intervjutrenertilgang
pl: Pełny dostęp do coachingu z wykorzystaniem AI na rozmowy kwalifikacyjne
pt: Acesso completo ao treinador de entrevista com IA
ru: Полный доступ к AI тренеру для интервью
sv: Full AI-intervjutränaråtkomst
th: การเข้าถึงผู้ฝึกสอนการสัมภาษณ์ด้วย AI ทั้งหมด
tr: Tam AI mülakat koçu erişimi
uk: Повний доступ до AI-тренера для співбесід
vi: Truy cập đầy đủ huấn luyện viên phỏng vấn AI

source: Full AI tutor access
ar: الوصول الكامل إلى معلم الذكاء الاصطناعي
be: Поўны доступ да AI-тутара
de: Vollständiger Zugriff auf den KI-Tutor
es: Acceso completo al tutor de IA
fr: Accès complet au tuteur IA
id: Akses penuh tutor AI
it: Accesso completo al tutor AI
ja: フルAIチューターアクセス
ms: Akses penuh tutor AI
no: Full AI-tilgang til veileder
pl: Pełny dostęp do AI nauczyciela
pt: Acesso completo ao tutor de IA
ru: Полный доступ к ИИ-наставнику
sv: Full AI-handled tillgång
th: การเข้าถึงครูสอน AI เต็มรูปแบบ
tr: Tam AI öğretmen erişimi
uk: Повний доступ до AI репетитора
vi: Truy cập đầy đủ vào gia sư AI

source: Full voice features
id: Fitur suara penuh
it: Funzioni vocali complete
ja: フルボイス機能
no: Full voice features Komplett stemmefunksjonalitet
ru: Полные голосовые функции
sv: Fullständiga röstfunktioner
uk: Повний голосовий функціонал

source: Game
ar: لعبة
be: Гульня
da: Spil
de: Spiel
es: Juego
fr: Jeu
it: Gioco
ja: ゲーム
ms: Permainan
no: Spill
pl: Gra
pt: Jogo
ru: Игра
sv: Spel
th: เกม
tr: Oyun
uk: Гра

source: Game Over!
it: Gioco Finito!
ja: ゲームオーバー！
no: Spill Over!
ru: Игра окончена!
uk: Гра закінчена!

source: Game settings are missing. Please go back.
id: Pengaturan permainan hilang. Silakan kembali.
it: Le impostazioni di gioco mancano. Per favore torna indietro.
ja: ゲーム設定がありません。戻ってください。
no: Innstillinger for spillet mangler. Vennligst gå tilbake.
ru: Настройки игры отсутствуют. Пожалуйста, вернитесь назад.
uk: Налаштування гри відсутні. Будь ласка, поверніться назад.

source: Game Statistics
id: Statistik Permainan
it: Statistiche del Gioco
ja: ゲーム統計
no: Spillstatistikk
ru: Статистика игры
uk: Статистика гри

source: Game-based practice
ar: ممارسة مبنية على الألعاب
be: Практыка на аснове гульні
da: Spilbaseret praksis
de: Spielbasierte Übung
es: Práctica basada en juegos
fr: Pratique basée sur le jeu
id: Latihan berbasis permainan
it: Pratica basata sul gioco
ja: ゲームベースの練習
no: Spillbasert praksis
pl: Praktyka oparta na grze
pt: Prática baseada em jogos
ru: Практика в игровой форме
sv: Spelbaserad träning
th: การฝึกฝนแบบเกม
tr: Oyun tabanlı pratik
uk: Практика на базі гри
vi: Thực hành dựa trên trò chơi

source: Gameplay
it: Gioco
ja: ゲームプレイ
no: Spillopplevelse
ru: Игровой процесс
uk: Ігровий процес

source: Generate more lessons to achieve your goal faster.
de: Erstellen Sie mehr Lektionen, um Ihr Ziel schneller zu erreichen.
es: Genera más lecciones para lograr tu objetivo más rápido.
id: Hasilkan lebih banyak pelajaran untuk mencapai tujuan Anda lebih cepat.
it: Genera più lezioni per raggiungere il tuo obiettivo più velocemente.
ja: 目標をより早く達成するために、さらに多くのレッスンを生成しましょう。
no: Generer flere leksjoner for å nå målet ditt raskere.
pl: Wygeneruj więcej lekcji, aby szybciej osiągnąć swój cel.
pt: Gere mais lições para alcançar seu objetivo mais rapidamente.
ru: Сгенерируйте больше уроков, чтобы достичь вашей цели быстрее.
sv: Generera fler lektioner för att uppnå ditt mål snabbare.
th: สร้างบทเรียนเพิ่มเติมเพื่อให้บรรลุเป้าหมายของคุณได้เร็วยิ่งขึ้น
tr: Hedefinize daha hızlı ulaşmak için daha fazla ders oluşturun.
uk: Згенеруйте більше уроків, щоб досягти своєї мети швидше.
vi: Tạo thêm bài học để đạt được mục tiêu của bạn nhanh hơn.

source: Generate more unique lessons
ar: قم بإنشاء دروس فريدة أكثر
be: Генеруй больш унікальных урокаў
da: Generer flere unikke lektioner
de: Generiere mehr einzigartige Lektionen
es: Genera más lecciones únicas
fr: Générer plus de leçons uniques
id: Hasilkan lebih banyak pelajaran unik
it: Genera lezioni più uniche
ja: もっとユニークなレッスンを生成する
ms: Hasilkan lebih banyak pelajaran yang unik
no: Generer flere unike leksjoner
pl: Generuj więcej unikalnych lekcji
pt: Gere mais lições únicas
ru: Создавайте больше уникальных уроков
sv: Generera fler unika lektioner
th: สร้างบทเรียนที่ไม่ซ้ำซ้อนมากขึ้น
tr: Daha eşsiz dersler oluşturun
uk: Створюйте більше унікальних уроків
vi: Tạo thêm nhiều bài học độc đáo

source: Generating...
ar: جار الإنشاء...
be: Генеруецца...
da: Genererer...
de: Generieren...
es: Generando...
fr: Génération...
id: Membuat...
it: Generando...
ja: 生成中...
ms: Menghasilkan...
no: Genererer...
pl: Generowanie...
pt: Gerando...
ru: Генерация...
sv: Genererar...
th: กำลังสร้าง...
tr: Oluşturuluyor...
uk: Генеруємо...
vi: Đang tạo...

source: German Learning Plan
ar: خطة تعلم الألمانية
be: План вучэння нямецкай мовы
da: Tysk Læringsplan
de: Deutscher Lernplan
es: Plan de Aprendizaje de Alemán
fr: Plan d'Apprentissage de l'Allemand
id: Rencana Belajar Jerman
it: Piano di Apprendimento Tedesco
ja: ドイツ語学習プラン
ms: Rancangan Pembelajaran Jerman
no: Tysk Læringsplan
pl: Plan Nauki Niemieckiego
pt: Plano de Aprendizagem de Alemão
ru: План изучения немецкого
sv: Tyska inlärningsplan
th: แผนการเรียนภาษาเยอรมัน
tr: Almanca Öğrenme Planı
uk: План вивчення німецької
vi: Kế Hoạch Học Tiếng Đức

source: Get a full access for free!
de: Erhalte kostenlosen Vollzugriff!
es: ¡Obtén acceso completo gratis!
fr: Obtenez un accès complet gratuitement !
id: Dapatkan akses penuh secara gratis!
it: Ottieni un accesso completo gratuito!
ja: 無料でフルアクセスを取得！
no: Få full tilgang gratis!
pl: Uzyskaj pełen dostęp za darmo!
pt: Obtenha acesso completo gratuitamente!
ru: Получите полный доступ бесплатно!
sv: Få fullständig tillgång gratis!
th: ได้เข้าถึงแบบเต็มรูปแบบฟรี!
tr: Tam erişimi ücretsiz edinin!
uk: Отримайте повний доступ безкоштовно!
vi: Nhận quyền truy cập đầy đủ miễn phí!

source: Get a personal grammar rule to learn
ar: احصل على قاعدة نحوية شخصية لتتعلمها
be: Атрымаць асабістае правіла граматыкі для вучэння
da: Få en personlig grammatikregel at lære
de: Erhalte eine persönliche Grammatikregel zum Lernen
es: Obtén una regla gramatical personal para aprender
fr: Obtenez une règle de grammaire personnelle à apprendre
id: Dapatkan aturan tata bahasa pribadi untuk dipelajari
it: Ottieni una regola grammaticale personale da imparare
ja: 個人的な文法ルールを学ぶ
ms: Dapatkan peraturan tatabahasa peribadi untuk dipelajari
no: Få en personlig grammatikkregel å lære
pl: Otrzymaj osobistą zasadę gramatyczną do nauki
pt: Obtenha uma regra gramatical pessoal para aprender
ru: Получите личное правило грамматики для изучения
sv: Få en personlig grammatiksregel att lära dig
th: รับกฎไวยากรณ์ส่วนตัวเพื่อเรียนรู้
tr: Kişisel bir dilbilgisi kuralı öğrenin
uk: Отримайте особисте правило граматики для вивчення
vi: Nhận một quy tắc ngữ pháp cá nhân để học

source: Get cheaper AI hours for bulk use
ar: احصل على ساعات ذكية أقل تكلفة للاستخدام بالجملة
be: Атрымаць больш танкія гадзіны AI за масавае выкарыстанне
da: Få billigere AI timer til storkøb
de: Erhalten Sie günstigere KI-Stunden für die Nutzung in großen Mengen
es: Consigue horas de IA más baratas para uso en masa
fr: Obtenez des heures d'IA à prix réduit pour une utilisation en gros
id: Dapatkan jam AI yang lebih murah untuk penggunaan massal
it: Ottieni ore di intelligenza artificiale a un prezzo più basso per un utilizzo in bulk
ja: バルク使用のためのより安価なAI時間を取得する
ms: Dapatkan jam AI lebih murah untuk penggunaan dalam jumlah besar
no: Få billigere AI-timer for storkjøp
pl: Uzyskaj tańsze godziny AI przy dużym zużyciu
pt: Obtenha horas de IA mais baratas para uso em grande quantidade
ru: Получите более дешевые часы ИИ для оптового использования
sv: Få billigare AI-timmar för volymanvändning
th: รับชั่วโมง AI ราคาถูกกว่าสำหรับการใช้เป็นจำนวนมาก
tr: Toplu kullanım için daha ucuz AI saatleri alın
uk: Отримайте дешевші години використання ШІ при оптових закупівлях
vi: Nhận giờ AI rẻ hơn khi sử dụng số lượng lớn

source: Get clear, actionable AI feedback
ar: احصل على ملاحظات واضحة وقابلة للتنفيذ من الذكاء الاصطناعي
be: Атрымайце ясную, дзеючую зваротную сувязь ад AI
da: Få klar, handlingsorienteret AI feedback
de: Erhalten Sie klare, umsetzbare KI-Rückmeldungen
es: Obtén comentarios claros y prácticos de IA
fr: Obtenez des retours d'IA clairs et exploitables
id: Dapatkan umpan balik AI yang jelas dan dapat ditindaklanjuti
it: Ottieni feedback chiaro e attuabile dall'IA
ja: 明確で実行可能なAIフィードバックを取得
no: Få tydelige, handlingsrettede tilbakemeldinger fra AI
pl: Uzyskaj jasną, konkretną opinię od AI
pt: Obtenha feedback claro e acionável de IA
ru: Получите понятную и действенную обратную связь от ИИ
sv: Få tydlig, handlingsbar AI-återkoppling
th: รับข้อเสนอแนะจาก AI ที่ชัดเจนและนำไปใช้ได้
tr: Net, uygulanabilir AI geri bildirimi alın
uk: Отримайте чіткий, практичний зворотний зв'язок від ШІ
vi: Nhận phản hồi từ AI rõ ràng, có thể thực hiện
