Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: You will answer short questions about .NET, APIs, databases, concurrency, and system design.
ar: سوف تجيب على أسئلة قصيرة حول .NET، واجهات برمجة التطبيقات (APIs)، قواعد البيانات، التزامن، وتصميم الأنظمة.
be: Вы будзеце адказваць на кароткія пытанні пра .NET, API, базы даных, канкурэнцыю і дызайн сістэм.
da: Du vil besvare korte spørgsmål om .NET, API'er, databaser, samtidighed og systemdesign.
de: Sie werden kurze Fragen zu .NET, APIs, Datenbanken, Nebenläufigkeit und Systemdesign beantworten.
es: Responderás preguntas cortas sobre .NET, APIs, bases de datos, concurrencia y diseño de sistemas.
fr: Vous répondrez à de courtes questions sur .NET, les API, les bases de données, la concurrence et la conception de systèmes.
id: Anda akan menjawab pertanyaan singkat tentang .NET, API, basis data, konkuren, dan desain sistem.
it: Risponderai a brevi domande su .NET, API, database, concorrenza e progettazione dei sistemi.
ja: .NET、API、データベース、並行処理、システム設計に関する短い質問に答えます。
ms: Anda akan menjawab soalan-soalan pendek tentang .NET, API, pangkalan data, kebersamaan, dan reka bentuk sistem.
no: Du vil svare på korte spørsmål om .NET, API-er, databaser, samtidighet og systemdesign.
pl: Będziesz odpowiadać na krótkie pytania dotyczące .NET, API, baz danych, współbieżności i projektowania systemów.
pt: Você responderá a perguntas curtas sobre .NET, APIs, bancos de dados, concorrência e design de sistemas.
ru: Вы будете отвечать на короткие вопросы о .NET, API, базах данных, многопоточности и проектировании систем.
sv: Du kommer att svara på korta frågor om .NET, API:er, databaser, samtidig bearbetning och systemdesign.
th: คุณจะตอบคำถามสั้นเกี่ยวกับ .NET, APIs, ฐานข้อมูล, การดำเนินการพร้อมกัน และการออกแบบระบบ
tr: .NET, API'ler, veritabanları, eşzamanlılık ve sistem tasarımı hakkında kısa soruları yanıtlayacaksınız.
uk: Ви будете відповідати на короткі запитання про .NET, API, бази даних, багатозадачність і проектування систем.
vi: Bạn sẽ trả lời các câu hỏi ngắn về .NET, API, cơ sở dữ liệu, đồng thời và thiết kế hệ thống.

source: You will get a trial period of full access for free
ar: plaintext سوف تحصل على فترة تجريبية للوصول الكامل مجانًا
be: Вы атрымаеце пробны перыяд поўнага доступу бясплатна
da: Du vil få en prøveperiode med fuld adgang gratis
de: Sie erhalten eine Testphase mit vollem Zugriff kostenlos
es: Obtendrás un período de prueba con acceso completo de forma gratuita
fr: Vous bénéficierez d'une période d'essai avec un accès complet gratuitement
id: Anda akan mendapatkan masa percobaan dengan akses penuh secara gratis
it: Avrai un periodo di prova di accesso completo gratuitamente
ja: 完全なアクセスを無料で試用できる期間があります
no: Du vil få en prøveperiode med full tilgang gratis
pl: Otrzymasz okres próbny z pełnym dostępem za darmo
pt: Você terá um período de teste com acesso completo gratuitamente
ru: Вы получите пробный период с полным доступом бесплатно
sv: Du kommer att få en provperiod med full åtkomst gratis
th: คุณจะได้รับช่วงทดลองใช้งานฟรีที่สามารถเข้าถึงได้อย่างเต็มที่
tr: Tam erişim deneme süresini ücretsiz olarak alacaksınız
uk: Ви отримаєте безкоштовний пробний період з повним доступом
vi: Bạn sẽ nhận được thời gian dùng thử với quyền truy cập đầy đủ miễn phí

source: You're All Set!
ar: أنت مستعد تمامًا!
be: Вы гатовы!
da: Du er klar!
de: Du bist startklar!
es: ¡Todo Listo!
fr: Vous êtes prêt!
id: Kamu Siap!
it: Sei pronto!
ja: あなたの準備は整いました！
ms: Anda Sudah Selesai!
no: Du er klar!
pl: Jesteś gotów!
pt: Você está pronto!
ru: Вы готовы!
sv: Du är klar!
th: คุณพร้อมแล้ว!
tr: Hazırsınız!
uk: Ви всі готові!
vi: Bạn đã sẵn sàng!

source: You're not sure what **salary to ask for** or how to negotiate
ar: أنت لست متأكدًا من **الراتب الذي يجب طلبه** أو كيفية التفاوض
be: Вы не ўпэўнены, якую **заробак прасіць** або як весці перамовы
da: Du er ikke sikker på, hvilken **løn du skal bede om**, eller hvordan du forhandler
de: Du bist dir nicht sicher, welches **Gehalt du verlangen** sollst oder wie du verhandeln sollst
es: No estás seguro de qué **sueldo pedir** o cómo negociar
fr: Vous ne savez pas quel **salaire demander** ou comment négocier
id: Anda tidak yakin berapa **gaji yang harus diminta** atau bagaimana cara bernegosiasi
it: Non sei sicuro di quale **stipendio chiedere** o come negoziare
ja: あなたは**求めるべき給与**が分からないか、どう交渉すべきか分からない
no: Du er ikke sikker på hvilken **lønn du skal be om** eller hvordan du skal forhandle
pl: Nie jesteś pewien, jakiej **pensji żądać** lub jak negocjować
pt: Você não tem certeza de qual **salário pedir** ou como negociar
ru: Вы не уверены, какую **зарплату запрашивать** или как вести переговоры
sv: Du är inte säker på vilken **lön du ska be om** eller hur du ska förhandla
th: คุณไม่แน่ใจว่าจะ **ขอเงินเดือนเท่าไหร่** หรือจะเจรจาต่อรองอย่างไรดี
tr: Hangi **maaşı isteyeceğinizden** emin değilsiniz veya nasıl müzakere edeceğinizden emin değilsiniz
uk: Ви не знаєте, яку **зарплату просити** або як вести переговори
vi: Bạn không chắc nên **yêu cầu mức lương** nào hoặc cách thương lượng.

source: You're unsure how to **explain your thinking process** while coding
ar: أنت غير متأكد من كيفية **شرح عملية تفكيرك** أثناء البرمجة
be: Вы не ўпэўнены, як **растлумачыць свой працэс мыслення** падчас кадавання
da: Du er usikker på, hvordan du skal **forklare din tankeproces** under kodning
de: Du bist dir unsicher, wie du deinen **Denkprozess beim Programmieren erklären** sollst
es: No estás seguro de cómo **explicar tu proceso de pensamiento** mientras codificas
fr: Vous n'êtes pas sûr de **vous expliquer** pendant le codage
id: Anda tidak yakin bagaimana cara **menjelaskan proses berpikir Anda** saat coding
it: Sei incerto su come **spiegare il tuo processo di pensiero** mentre programmi
ja: あなたはコーディング中に**自分の思考プロセスを説明する**方法がわからない
no: Du er usikker på hvordan du skal **forklare tankeprosessen din** mens du koder
pl: Jesteś niepewny, jak **wyjaśnić swój proces myślenia** podczas kodowania
pt: Você não tem certeza de como **explicar seu processo de pensamento** enquanto codifica
ru: Вы не уверены, как **объяснить процесс своего мышления**, когда кодируете
sv: Du är osäker på hur du ska **förklara din tankegång** när du kodar
th: คุณไม่แน่ใจว่าจะ **อธิบายกระบวนการคิดของคุณ** อย่างไรในขณะที่เขียนโค้ด
tr: Kodlama sırasında **düşünme sürecinizi açıklamak** konusunda emin değilsiniz.
uk: Ви не впевнені, як **пояснити процес вашого мислення** під час кодування
vi: Bạn không chắc chắn làm thế nào để **giải thích quá trình suy nghĩ của mình** khi lập trình

source: You've learned to code, but interviews test much more than just syntax and tutorials.
ar: لقد تعلمت البرمجة، لكن المقابلات تختبر أكثر بكثير من مجرد بناء الجملة والدروس التعليمية.
be: Вы навучыліся праграмаванню, але на інтэрв'ю выпрабоўваюцца значна больш, чым проста сінтаксіс і навучальныя матэрыялы.
da: Du har lært at kode, men interviews tester meget mere end blot syntaks og tutorials.
de: Du hast gelernt zu programmieren, aber Vorstellungsgespräche testen viel mehr als nur Syntax und Tutorials.
es: Has aprendido a programar, pero las entrevistas evalúan mucho más que solo sintaxis y tutoriales.
fr: Vous avez appris à coder, mais les entretiens testent bien plus que simplement la syntaxe et les tutoriels.
id: Kamu telah belajar pemrograman, tetapi wawancara menguji jauh lebih dari sekadar sintaks dan tutorial.
it: Hai imparato a programmare, ma i colloqui testano molto più della semplice sintassi e dei tutorial.
ja: あなたはコーディングを学びましたが、面接では単なる構文やチュートリアル以上のことが試されます。
no: Du har lært deg å programmere, men intervjuer tester mye mer enn bare syntaks og opplæringskurs.
pl: Nauczyłeś się kodować, ale rozmowy kwalifikacyjne sprawdzają znacznie więcej niż tylko składnię i samouczki.
pt: Você aprendeu a programar, mas as entrevistas testam muito mais do que apenas sintaxe e tutoriais.
ru: Вы научились программировать, но интервью проверяют гораздо больше, чем просто синтаксис и учебные материалы.
sv: Du har lärt dig att koda, men intervjuer testar mycket mer än bara syntax och handledningar.
th: คุณได้เรียนรู้การเขียนโค้ด แต่การสัมภาษณ์นั้นทดสอบมากกว่าความรู้ทางด้านไวยากรณ์และบทเรียน
tr: Kod yazmayı öğrendiniz, ancak mülakatlar sadece sözdizimi ve derslerle sınırlı kalmaz, çok daha fazlasını test eder.
uk: Ви навчилися програмувати, але на співбесідах перевіряють набагато більше, ніж просто синтаксис та підручники.
vi: Bạn đã học lập trình, nhưng các buổi phỏng vấn kiểm tra nhiều thứ hơn cả cú pháp và hướng dẫn.

source: You've made amazing progress. Let’s keep going.
ar: لقد أحرزت تقدمًا مذهلاً. دعنا نواصل.
be: Вы зрабілі вялікі прагрэс. Давайце працягваем.
da: Du har gjort fantastiske fremskridt. Lad os fortsætte.
de: Du hast erstaunliche Fortschritte gemacht. Lass uns weitermachen.
es: Has hecho un progreso increíble. Sigamos adelante.
fr: Vous avez fait des progrès incroyables. Continuons.
id: Anda telah membuat kemajuan yang luar biasa. Mari kita lanjutkan.
it: Hai fatto progressi incredibili. Continuiamo così.
ja: あなたは素晴らしい進歩を遂げています。続けましょう。
ms: Anda telah membuat kemajuan yang menakjubkan. Mari teruskan.
no: Du har gjort utrolige fremskritt. La oss fortsette.
pl: Zrobiłeś niesamowity postęp. Kontynuujmy.
pt: Você fez um progresso incrível. Vamos continuar.
ru: Вы достигли великолепных результатов. Давайте продолжим.
sv: Du har gjort fantastiska framsteg. Låt oss fortsätta.
th: คุณพัฒนาความสามารถไปได้ดีมาก โปรดทำต่อไป
tr: Harika bir ilerleme kaydettiniz. Hadi devam edelim.
uk: Ви досягли чудових результатів. Давайте продовжуємо.
vi: Bạn đã tiến bộ đáng kể. Hãy tiếp tục nhé.

source: You:
ar: أنت:
be: Вы:
da: Du:
de: Du:
es: Tú:
fr: Vous:
id: Anda:
it: Tu:
ja: あなた:
ms: Anda:
no: Du:
pl: Ty:
pt: Você:
ru: Вы:
sv: Du:
th: คุณ:
tr: Sen:
uk: Ви:
vi: Bạn:

source: Your account has been successfully deleted. We are sorry to see you go!
ar: تم حذف حسابك بنجاح. يؤسفنا رؤيتك تذهب!
be: Ваш акаўнт быў паспяхова выдалены. Нам шкада, што вы адходзіце!
da: Din konto er blevet slettet succesfuldt. Vi er kede af at se dig gå!
de: Ihr Konto wurde erfolgreich gelöscht. Wir bedauern, dass Sie uns verlassen!
es: Su cuenta ha sido eliminada con éxito. ¡Lamentamos verte ir!
fr: Votre compte a été supprimé avec succès. Nous sommes désolés de vous voir partir !
id: Akun Anda telah berhasil dihapus. Kami merasa sedih melihat Anda pergi!
it: Il tuo account è stato cancellato con successo. Ci dispiace vederti andare via!
ja: あなたのアカウントは正常に削除されました。お別れするのは残念です！
ms: Akaun anda telah berjaya dihapuskan. Kami sedih untuk melihat anda pergi!
no: Kontoen din er vellykket slettet. Vi beklager å se deg gå!
pl: Twoje konto zostało pomyślnie usunięte. Przykro nam, że odchodzisz!
pt: Sua conta foi excluída com sucesso. Lamentamos vê-lo partir!
ru: Ваш аккаунт успешно удален. Нам жаль, что вы уходите!
sv: Ditt konto har framgångsrikt raderats. Vi är ledsna att se dig gå!
th: บัญชีของคุณได้ถูกลบออกเรียบร้อยแล้ว ขออภัยที่ต้องอำลาคุณ!
tr: Hesabınız başarıyla silindi. Sizi göndermekten üzgünüz!
uk: Ваш обліковий запис успішно видалено. Нам шкода, що ви йдете!
vi: Tài khoản của bạn đã được xóa thành công. Chúng tôi rất tiếc khi bạn ra đi!

source: Your achievements
ar: إنجازاتك
be: Вашыя дасягненні
da: Dine resultater
de: Deine Errungenschaften
es: Tus logros
fr: Vos réalisations
id: Prestasi Anda
it: I tuoi successi
ja: あなたの成果
ms: Pencapaian anda
no: Dine prestasjoner
pl: Twoje osiągnięcia
pt: As suas conquistas
ru: Ваши достижения
sv: Dina prestationer
th: ความสำเร็จของคุณ
tr: Başarılarınız
uk: Ваші досягнення
vi: Thành tích của bạn

source: Your AI speaking partner
ar: شريكك للحديث بالذكاء الاصطناعي
be: Ваш AI партнёр для размоў
da: Din AI samtalepartner
de: Ihr KI-Gesprächspartner
es: Tu compañero de conversación de IA
fr: Votre partenaire de conversation IA
id: Mitra bicara AI Anda
it: Il tuo partner di conversazione AI
ja: あなたのAIスピーキングパートナー
ms: Rakan berbicara AI anda
no: Din AI-samtalepartner
pl: Twój AI partner do rozmów
pt: Seu parceiro de conversação com IA
ru: Ваш AI собеседник
sv: Din AI-pratpartner
th: คู่สนทนา AI ของคุณ
tr: AI Konuşma Partneriniz
uk: Ваш AI-співрозмовник
vi: Đối tác nói chuyện AI của bạn

source: Your AI teacher voice:
id: Suara AI guru Anda:
it: La voce del tuo insegnante AI:
ja: あなたのAI教師の声:
no: Din AI-lærer-stemme:
pl: Twój głos nauczyciela AI:
ru: Ваш голос ИИ-учителя:
sv: Din AI-lärarröst:
uk: Голос вашого AI вчителя:

source: Your answer
ar: إجابتك
be: Ваш адказ
da: Dit svar
de: Ihre Antwort
es: Tu respuesta
fr: Votre réponse
id: Jawaban Anda
it: La tua risposta
ja: あなたの答え
ms: Jawapan anda
no: Svaret ditt
pl: Twoja odpowiedź
pt: Sua resposta
ru: Ваш ответ
sv: Ditt svar
th: คำตอบของคุณ
tr: Cevabınız
uk: Ваша відповідь
vi: Câu trả lời của bạn

source: Your answers will be visible to your opponent after you submit them.
ar: إجاباتك ستكون مرئية لمنافسك بعد إرسالها.
be: Вашы адказы будуць бачныя вашаму суперніку пасля таго, як вы іх адпраўце.
da: Dine svar vil være synlige for din modstander, efter du har indsendt dem.
de: Ihre Antworten werden Ihrem Gegner nach dem Einreichen angezeigt.
es: Sus respuestas serán visibles para su oponente después de que las envíe.
fr: Vos réponses seront visibles par votre adversaire après que vous les ayez soumises.
id: Jawaban Anda akan terlihat oleh lawan Anda setelah Anda mengirimkannya.
it: Le tue risposte saranno visibili al tuo avversario dopo che le avrai inviate.
ja: あなたの回答は、提出後に対戦相手に表示されます。
no: Dine svar vil være synlige for motstanderen din etter at du har sendt dem inn.
pl: Twoje odpowiedzi będą widoczne dla twojego przeciwnika po ich przesłaniu.
pt: Suas respostas serão visíveis para o seu adversário após você enviá-las.
ru: Ваши ответы будут видны вашему оппоненту после их отправки.
sv: Dina svar kommer att synas för din motståndare efter att du skickat in dem.
th: คำตอบของคุณจะถูกมองเห็นโดยคู่แข่งของคุณหลังจากที่คุณส่งคำตอบแล้ว
tr: Cevaplarınız gönderdikten sonra rakibiniz tarafından görülecektir.
uk: Ваші відповіді будуть видні вашому супротивнику після того, як ви їх надішлете.
vi: Câu trả lời của bạn sẽ hiển thị cho đối thủ sau khi bạn gửi chúng.

source: Your Avatar:
ar: صورتك الرمزية:
be: Ваш Аватар:
da: Dit Avatar:
de: Dein Avatar:
es: Tu Avatar:
fr: Votre Avatar:
id: Avatar Anda:
it: Il tuo Avatar:
ja: あなたのアバター:
ms: Avatar Anda:
no: Din Avatar:
pl: Twój Avatar:
pt: Seu Avatar:
ru: Ваш Аватар:
sv: Din Avatar:
th: อวตารของคุณ:
tr: Senin Avatarın:
uk: Ваш Аватар:
vi: Avatar của bạn:

source: Your card is used only to activate secure access and will not be billed unless you decide to continue.
ar: بطاقتك تُستخدم فقط لتفعيل الوصول الآمن ولن يتم الفوترة إلا إذا قررت الاستمرار.
be: Ваша карта выкарыстоўваецца толькі для актывацыі бяспечнага доступу і не будзе знята, калі вы не прымеце рашэнне працягваць.
da: Dit kort bruges kun til at aktivere sikker adgang og vil ikke blive faktureret, medmindre du beslutter at fortsætte.
de: Ihre Karte wird nur zur Aktivierung des sicheren Zugangs verwendet und wird nicht belastet, es sei denn, Sie entscheiden sich für eine Fortsetzung.
es: Tu tarjeta se utiliza únicamente para activar el acceso seguro y no se cobrará a menos que decidas continuar.
fr: Votre carte est utilisée uniquement pour activer l'accès sécurisé et ne sera pas facturée sauf si vous décidez de continuer.
id: Kartu Anda digunakan hanya untuk mengaktifkan akses aman dan tidak akan ditagih kecuali Anda memutuskan untuk melanjutkan.
it: La tua carta viene utilizzata solo per attivare l'accesso sicuro e non verrà addebitata a meno che tu non decida di continuare.
ja: あなたのカードは、安全なアクセスを有効にするためにのみ使用され、続行を決定しない限り請求されることはありません。
ms: Kad anda hanya digunakan untuk mengaktifkan akses selamat dan tidak akan dikenakan bayaran melainkan anda memutuskan untuk meneruskan.
no: Kortet ditt brukes kun til å aktivere sikker tilgang og vil ikke bli belastet med mindre du bestemmer deg for å fortsette.
pl: Twoja karta jest używana tylko do aktywacji bezpiecznego dostępu i nie zostanie obciążona, chyba że zdecydujesz się kontynuować.
pt: Seu cartão é usado apenas para ativar o acesso seguro e não será cobrado, a menos que você decida continuar.
ru: Ваша карта используется только для активации безопасного доступа и не будет выставлена к оплате, если вы не решите продолжить.
sv: Ditt kort används endast för att aktivera säker åtkomst och kommer inte att debiteras om du inte bestämmer dig för att fortsätta.
th: บัตรของคุณถูกใช้เพื่อเปิดใช้งานการเข้าถึงระบบอย่างปลอดภัยเท่านั้น และจะไม่มีการเรียกเก็บเงิน เว้นแต่คุณจะตัดสินใจที่จะใช้งานต่อ
tr: Kartınız yalnızca güvenli erişimi etkinleştirmek için kullanılır ve devam etmeye karar vermediğiniz sürece ücretlendirilmez.
uk: Ваша карта використовується лише для активації безпечного доступу і не буде стягнуто жодних коштів, якщо ви не вирішите продовжити.
vi: Thẻ của bạn chỉ được sử dụng để kích hoạt truy cập an toàn và sẽ không bị tính phí trừ khi bạn quyết định tiếp tục.

source: Your credit card has already been confirmed. You can proceed to the next step.
ar: بطاقتك الائتمانية قد تم تأكيدها بالفعل. يمكنك المتابعة إلى الخطوة التالية.
be: Ваша крэдытная карта ўжо пацверджана. Вы можаце перайсці да наступнага кроку.
da: Din kreditkort er allerede blevet bekræftet. Du kan fortsætte til næste trin.
de: Ihre Kreditkarte wurde bereits bestätigt. Sie können mit dem nächsten Schritt fortfahren.
es: Tu tarjeta de crédito ya ha sido confirmada. Puedes proceder al siguiente paso.
fr: Votre carte de crédit a déjà été confirmée. Vous pouvez passer à l'étape suivante.
id: Kartu kredit Anda telah dikonfirmasi. Anda dapat melanjutkan ke langkah berikutnya.
it: La tua carta di credito è già stata confermata. Puoi procedere al passaggio successivo.
ja: あなたのクレジットカードはすでに確認されています。次のステップに進むことができます。
ms: Kad kredit anda telah disahkan. Anda boleh meneruskan ke langkah seterusnya.
no: Kredittkortet ditt er allerede bekreftet. Du kan fortsette til neste steg.
pl: Twoja karta kredytowa została już potwierdzona. Możesz przejść do następnego kroku.
pt: Seu cartão de crédito já foi confirmado. Você pode prosseguir para a próxima etapa.
ru: Ваша кредитная карта уже подтверждена. Вы можете перейти к следующему шагу.
sv: Ditt kreditkort har redan bekräftats. Du kan gå vidare till nästa steg.
th: บัตรเครดิตของคุณได้รับการยืนยันเรียบร้อยแล้ว คุณสามารถดำเนินการไปยังขั้นตอนถัดไปได้
tr: Kredi kartınız zaten onaylandı. Bir sonraki adıma geçebilirsiniz.
uk: Вашу кредитну картку вже підтверджено. Ви можете переходити до наступного кроку.
vi: Thẻ tín dụng của bạn đã được xác nhận. Bạn có thể chuyển sang bước tiếp theo.

source: Your desired job title. Like Designer, Shop-Assistant, Fitness Trainer, etc.
ar: عنوان الوظيفة المرغوب. مثل مصمم، مساعد متجر، مدرب لياقة، إلخ.
be: Ваша бажаная пасада. Напрыклад, Дызайнер, Касір, Трэнер па фітнесу і г.д.
da: Din ønskede jobtitel. Som Designer, Butikassistent, Fitnessinstruktør, osv.
de: Ihr gewünschter Jobtitel. Wie Designer, Verkäufer, Fitnesstrainer usw.
es: Tu título de trabajo deseado. Como Diseñador, Asistente de Tienda, Entrenador Personal, etc.
fr: Votre titre de poste souhaité. Comme Designer, Vendeur, Entraîneur de Fitness, etc.
id: Judul pekerjaan yang Anda inginkan. Seperti Desainer, Asisten Toko, Pelatih Kebugaran, dll.
it: Il titolo di lavoro desiderato. Come Designer, Assistente di Negozio, Allenatore di Fitness, ecc.
ja: あなたの希望する職種名。デザイナー、ショップアシスタント、フィットネストレーナーなど。
ms: Jawatan yang anda inginkan. Seperti Pereka, Pembantu Kedai, Jurulatih Kecergasan, dll.
no: Din ønskede stillingstittel. Som Designer, Butikkmedarbeider, Treningsinstruktør, osv.
pl: Twój pożądany tytuł zawodowy. Na przykład Projektant, Sprzedawca, Trener Fitness, itd.
pt: Seu título de trabalho desejado. Como Designer, Assistente de Loja, Treinador de Fitness, etc.
ru: Ваше желаемое должностное название. Например, Дизайнер, Продавец, Фитнес-тренер и т.д.
sv: Ditt önskade jobbtitel. Som Designer, Butiksassistent, Fitnessinstruktör, osv.
th: ตำแหน่งงานที่คุณต้องการ เช่น นักออกแบบ, ผู้ช่วยในร้าน, เทรนเนอร์ฟิตเนส เป็นต้น
tr: İstediğiniz iş unvanı. Tasarımcı, Mağaza Asistanı, Fitness Eğitmeni vb. gibi.
uk: Ваша бажана назва посади. Як-от Дизайнер, Продавець, Тренер з фітнесу тощо.
vi: Chức danh công việc bạn mong muốn. Như Nhà thiết kế, Nhân viên cửa hàng, Huấn luyện viên thể dục, v.v.

source: Your experience
ar: تجربتك
be: Ваш досвед
da: Din oplevelse
de: Ihre Erfahrung
es: Tu experiencia
fr: Votre expérience
id: Pengalaman Anda
it: La tua esperienza
ja: あなたの体験
ms: Pengalaman anda
no: Din erfaring
pl: Twoje doświadczenie
pt: Sua experiência
ru: Ваш опыт
sv: Din upplevelse
th: ประสบการณ์ของคุณ
tr: Deneyiminiz
uk: Ваш досвід
vi: Kinh nghiệm của bạn

source: Your full access is active until
de: Ihr voller Zugang ist aktiv bis
es: Tu acceso completo está activo hasta
id: Akses penuh Anda aktif hingga
it: Il tuo accesso completo è attivo fino al
ja: あなたのフルアクセスは以下の日付まで有効です
no: Din fullstendige tilgang er aktiv frem til
pl: Twój pełny dostęp jest aktywny do
pt: Seu acesso completo está ativo até
ru: Ваш полный доступ активен до
sv: Din fullständiga åtkomst är aktiv till
th: การเข้าถึงเต็มรูปแบบของคุณจะใช้งานได้ถึง
tr: Tam erişiminiz şu tarihe kadar aktiftir:
uk: Ваш повний доступ активний до
vi: Quyền truy cập đầy đủ của bạn có hiệu lực cho đến khi

source: Your full access is active until {activeTill}
de: Ihr Vollzugriff ist bis {activeTill} aktiv
es: Tu acceso completo está activo hasta {activeTill}
id: Akses penuh Anda aktif hingga {activeTill}
it: Il tuo accesso completo è attivo fino al {activeTill}
ja: あなたのフルアクセスは{activeTill}まで有効です
no: Din full tilgang er aktiv frem til {activeTill}
pl: Twój pełny dostęp jest aktywny do {activeTill}
pt: Seu acesso completo está ativo até {activeTill}
ru: Ваш полный доступ активен до {activeTill}
sv: Din fullständiga tillgång är aktiv tills {activeTill}
th: การเข้าถึงแบบเต็มของคุณจะใช้งานได้จนถึง {activeTill}
tr: Tam erişiminiz {activeTill} tarihine kadar aktiftir.
uk: Ваш повний доступ активний до {activeTill}
vi: Quyền truy cập đầy đủ của bạn sẽ hoạt động đến {activeTill}

source: Your goal is not to be perfect, but to surpass your opponent.
ar: هدفك ليس أن تكون مثاليًا، بل أن تتفوق على خصمك.
be: Ваша мэта не ў тым, каб быць ідэальным, а ў тым, каб перасягнуць свайго суперніка.
da: Dit mål er ikke at være perfekt, men at overgå din modstander.
de: Ihr Ziel ist es nicht, perfekt zu sein, sondern Ihren Gegner zu übertreffen.
es: Tu objetivo no es ser perfecto, sino superar a tu oponente.
fr: Votre objectif n'est pas d'être parfait, mais de surpasser votre adversaire.
id: Tujuan Anda bukanlah untuk menjadi sempurna, tetapi untuk melampaui lawan Anda.
it: Il tuo obiettivo non è essere perfetto, ma superare il tuo avversario.
ja: あなたの目標は完璧になることではなく、相手を超えることです。
no: Målet ditt er ikke å være perfekt, men å overgå motstanderen din.
pl: Twoim celem nie jest bycie perfekcyjnym, ale przewyższenie swojego przeciwnika.
pt: Seu objetivo não é ser perfeito, mas superar seu oponente.
ru: Ваша цель — не быть идеальным, а превзойти своего соперника.
sv: Ditt mål är inte att vara perfekt, utan att överträffa din motståndare.
th: เป้าหมายของคุณไม่ใช่การเป็นที่สมบูรณ์แบบ แต่คือการเอาชนะคู่ต่อสู้ของคุณ
tr: Amacınız mükemmel olmak değil, rakibinizi geçmektir.
uk: Вашою метою є не бути досконалим, а перевершити свого суперника.
vi: Mục tiêu của bạn không phải là hoàn hảo, mà là vượt qua đối thủ của bạn.
