Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Grammar Correction Preview
ar: معاينة تصحيح القواعد
be: Папярэдні прагляд выпраўлення граматыкі
da: Forhåndsvisning af grammatikretning
de: Grammatik-Korrekturvorschau
es: Vista previa de corrección gramatical
fr: Aperçu de la Correction Grammaticale
id: Pratinjau Koreksi Tata Bahasa
it: Anteprima Correzione Grammaticale
ja: 文法訂正プレビュー
no: Forhåndsvisning av grammatikkorreksjon
pl: Podgląd Poprawy Gramatycznej
pt: Visualização de Correção Gramatical
ru: Предварительный просмотр исправления грамматики
sv: Grammatikkorrigeringsförhandsgranskning
th: การแสดงตัวอย่างการแก้ไขไวยากรณ์
tr: Dilbilgisi Düzeltme Önizlemesi
uk: Попередній перегляд виправлення граматики
vi: Xem Trước Sửa Ngữ Pháp

source: Grammar Corrections
ar: تصحيحات القواعد
be: Граматычныя Папраўкі
da: Grammatik Rettelser
de: Grammatik Korrekturen
es: Correcciones Gramaticales
fr: Corrections de grammaire
id: Koreksi Tata Bahasa
it: Correzioni Grammaticali
ja: 文法訂正
ms: Betulkanan Tatabahasa
no: Grammatikk Korreksjoner
pl: Poprawki gramatyczne
pt: Correções de Gramática
ru: Исправления грамматики
sv: Grammatikkorrigeringar
th: การแก้ไขไวยากรณ์
tr: Dilbilgisi Düzeltmeleri
uk: Виправлення Граматики
vi: Sửa lỗi ngữ pháp

source: Grammar corrections to boost your confidence
ar: تصحيحات القواعد لزيادة ثقتك بنفسك
be: Карэкцыя граматыкі, каб узмацніць вашу ўпэўненасць
da: Grammatikkorrekturer for at styrke din selvtillid
de: Grammatik Korrekturen, um Ihr Selbstvertrauen zu stärken
es: Correcciones gramaticales para aumentar tu confianza
fr: Corrections grammaticales pour renforcer votre confiance
id: Koreksi tata bahasa untuk meningkatkan kepercayaan diri Anda
it: Correzioni grammaticali per aumentare la tua fiducia
ja: 文法の修正で自信を高めましょう
ms: Pembetulan tatabahasa untuk meningkatkan keyakinan anda
no: Grammatikkorreksjoner for å styrke selvtilliten din
pl: Poprawki gramatyczne, aby zwiększyć Twoją pewność siebie
pt: Correções gramaticais para aumentar sua confiança
ru: Грамматические исправления для увеличения вашей уверенности
sv: Grammatikkorrigeringar för att öka ditt självförtroende
th: การแก้ไขไวยากรณ์เพื่อเพิ่มความมั่นใจของคุณ
tr: Gramer düzeltmeleri ile güveninizi artırın
uk: Граматичні виправлення для підвищення вашої впевненості
vi: Sửa ngữ pháp để tăng cường sự tự tin của bạn

source: Great!
ar: رائع!
be: Выдатна!
da: Fantastisk!
de: Großartig!
es: ¡Genial!
fr: Génial !
id: Hebat!
it: Ottimo!
ja: 素晴らしい！
ms: Hebat!
no: Flott!
pl: Świetnie!
pt: Ótimo!
ru: Отлично!
sv: Bra!
th: ที่สุด!
tr: Harika!
uk: Чудово!
vi: Tuyệt vời!

source: Grocery Store
ar: متجر البقالة
be: Гандлявы магазін
da: Dagligvarebutik
de: Lebensmittelgeschäft
es: Tienda de comestibles
fr: Épicerie
id: Toko Kelontong
it: Negozio di alimentari
ja: 食料品店
ms: Kedai Runcit
no: Matbutikk
pl: Sklep spożywczy
pt: Supermercado
ru: Продуктовый магазин
sv: Livsmedelsbutik
th: ร้านขายของชำ
tr: Market
uk: Продуктовий магазин
vi: Cửa hàng tạp hóa

source: Grow Your Vocabulary Daily
ar: أضف إلى مفرداتك يوميًا
be: Развівайце свой слоўнік кожны дзень
da: Udvid dit ordforråd dagligt
de: Erweitern Sie täglich Ihren Wortschatz
es: Mejora Tu Vocabulario Diariamente
fr: Développez votre vocabulaire quotidiennement
id: Tumbuhkan Kosakata Anda Setiap Hari
it: Espandi il tuo vocabolario quotidianamente
ja: 毎日語彙を増やそう
ms: Besarkan Perbendaharaan Kata Anda Setiap Hari
no: Utvid ordforrådet ditt daglig
pl: Rozwijaj swoje słownictwo codziennie
pt: Aumente Seu Vocabulário Diariamente
ru: Расширяйте свой словарный запас ежедневно
sv: Väx ditt ordförråd dagligen
th: ขยายคำศัพท์ของคุณทุกวัน
tr: Günlük Kelime Dağarcığınızı Geliştirin
uk: Збагачуйте свій словниковий запас щодня
vi: Mở Rộng Từ Vựng Mỗi Ngày

source: Guessed words:
ar: كلمات مُقترحة:
be: Здагаданыя словы:
da: Gættede ord:
de: Vermutete Wörter:
es: Palabras adivinadas:
fr: Mots supposés :
id: Kata yang ditebak:
it: Parole indovinate:
ja: 推測された単語:
ms: Kata-kata yang diteka:
no: Gjettede ord:
pl: Przypuszczalne słowa:
pt: Palavras adivinhadas:
ru: Предположительные слова:
sv: Gissade ord:
th: คำที่เดา:
tr: Tahmin edilen kelimeler:
uk: Здогадані слова:
vi: Từ đoán:

source: Handle a return at a customer service desk by describing what went wrong and exploring options for a refund or exchange. Perfect for practicing calm, clear communication in a shopping context. #### Why You Should Play *Returning an Item in a Store* 1. Understand how to explain an issue or defect politely. 2. Learn to provide necessary details for a smooth return process. 3. Practice receiving instructions about refunds or exchanges. 4. Explore different scenarios, such as missing receipts or store policies. 5. Build confidence handling a common retail interaction. #### How the Scenario Works You’ll step into the role of a customer returning a product, while the AI acts as the store employee. The AI will ask why you’re returning the item and discuss available options. This practical scenario helps you master polite, efficient communication in retail situations.
ar: تعامل مع إرجاع في مكتب خدمة العملاء من خلال وصف ما حدث بشكل خاطئ واستكشاف خيارات استرداد أو تبادل. مثالي لممارسة التواصل الهادئ والواضح في سياق التسوق. #### لماذا يجب عليك تجربة *إرجاع عنصر في المتجر* 1. فهم كيفية شرح مشكلة أو عيب بأدب. 2. تعلم تقديم التفاصيل اللازمة لعملية إرجاع سلسة. 3. ممارسة تلقي التعليمات بشأن الاستردادات أو التبادلات. 4. استكشاف سيناريوهات مختلفة، مثل الفواتير المفقودة أو سياسات المتجر. 5. بناء الثقة في التعامل مع تفاعل تجاري شائع. #### كيف يعمل السيناريو ستدخل في دور عميل يقوم بإرجاع منتج، بينما تعمل الذكاء الاصطناعي كموظف المتجر. سيطرح الذكاء الاصطناعي سبب إرجاعك للعنصر ويبحث في الخيارات المتاحة. يساعدك هذا السيناريو العملي على إتقان التواصل المهذب والفعال في المواقف التجارية.
be: Апрацоўвайце вяртанне ў службу пасляпрадажнага абслугоўвання, апісваючы, што пайшло не так, і даследуючы варыянты вяртання грошай або абмену. Выдатна падыходзіць для практыкі спакойнай, яснай камунікацыі ў кантэксце куплі ў магазіне. #### Чаму варта гуляць у *Вяртанне тавара ў магазін* 1. Разумець, як ввейчліва апісаць праблему або дэфект. 2. Даведацца, як забяспечваць неабходныя дэтали для гладкага працэсу вяртання. 3. Практаваць у атрыманні інструкцый пра вяртанне грошай або абмен. 4. Даследаваць розныя сцэнары, такія як адсутнасць квітанцый або правілы магазіну. 5. Пабудаваць упэўненасць у абслугоўванні распаўсюджанай рознічай транзакцыі. #### Як працуе гэты сцэнарый Вы ўвойдзеце ў ролю кліента, які вяртае тавар, а штучны інтэлект будзе дзейнічаць у ролі працоўніка магазіну. Штучны інтэлект спытае, чаму вы вяртаеце тавар, і абмеркаваць даступныя варыянты. Гэты практычны сцэнарый дапамагае вам авладзець ввейчлівае, эфектыўнае спілкуванне ў сітуацыях рознічнай торговлі.
da: Håndter en returnering ved en kundeservice desk ved at beskrive, hvad der gik galt, og undersøge mulighederne for en refundering eller ombytning. Perfekt til at øve rolig, klar kommunikation i en shoppingkontekst. #### Hvorfor du bør spille *At returnere en vare i en butik* 1. Forstå, hvordan du høfligt forklarer et problem eller en fejl. 2. Lær at give nødvendige detaljer for en glat returneringsproces. 3. Øv dig i at modtage instruktioner om refunderinger eller ombytninger. 4. Udforsk forskellige scenarier, såsom manglende kvitteringer eller butikspolitikker. 5. Byg selvtillid til at håndtere en almindelig detailinteraktion. #### Sådan fungerer scenariet Du træder ind i rollen som en kunde, der returnerer et produkt, mens AI'en fungerer som butiksmedarbejder. AI'en vil spørge, hvorfor du returnerer varen, og diskutere tilgængelige muligheder. Dette praktiske scenarie hjælper dig med at mestre høflig, effektiv kommunikation i detail situationer.
de: Handle einen Rückgabe an einem Kundenservicetresen, indem Sie beschreiben, was schiefgegangen ist, und Optionen für eine Rückerstattung oder einen Umtausch erkunden. Perfekt zum Üben ruhiger, klarer Kommunikation im Einkaufskontext. #### Warum Sie *Einen Artikel im Geschäft zurückgeben* spielen sollten 1. Verstehen, wie man ein Problem oder einen Defekt höflich erklärt. 2. Lernen, notwendige Details für einen reibungslosen Rückgabeprozess bereitzustellen. 3. Üben, Anweisungen zu Rückerstattungen oder Umtausch zu erhalten. 4. Verschiedene Szenarien erkunden, wie fehlende Quittungen oder Geschäftsrichtlinien. 5. Vertrauen aufbauen im Umgang mit einer gängigen Einzelhandelsinteraktion. #### Wie das Szenario funktioniert Sie schlüpfen in die Rolle eines Kunden, der ein Produkt zurückgibt, während die KI als Mitarbeiter des Geschäfts agiert. Die KI wird fragen, warum Sie den Artikel zurückgeben und die verfügbaren Optionen besprechen. Dieses praktische Szenario hilft Ihnen, höfliche, effiziente Kommunikation in Einzelhandelssituationen zu meistern.
es: Manejar un retorno en un mostrador de servicio al cliente describiendo qué salió mal y explorando opciones para un reembolso o cambio. Perfecto para practicar una comunicación calmada y clara en un contexto de compras. #### Por qué deberías jugar *Devolviendo un artículo en una tienda* 1. Entender cómo explicar un problema o defecto de manera educada. 2. Aprender a proporcionar detalles necesarios para un proceso de devolución fluido. 3. Practicar la recepción de instrucciones sobre reembolsos o cambios. 4. Explorar diferentes escenarios, como recibos faltantes o políticas de la tienda. 5. Construir confianza al manejar una interacción minorista común. #### Cómo funciona el escenario Asumirás el rol de un cliente devolviendo un producto, mientras que la IA actúa como el empleado de la tienda. La IA preguntará por qué estás devolviendo el artículo y discutirá las opciones disponibles. Este escenario práctico te ayuda a dominar una comunicación educada y eficiente en situaciones de retail.
fr: Gérez un retour au bureau de service client en décrivant ce qui a mal tourné et en explorant les options pour un remboursement ou un échange. Parfait pour pratiquer une communication calme et claire dans un contexte de shopping. #### Pourquoi vous devriez jouer *Retourner un article en magasin* 1. Comprendre comment expliquer un problème ou un défaut avec politesse. 2. Apprendre à fournir les détails nécessaires pour un processus de retour fluide. 3. Pratiquer la réception d'instructions concernant les remboursements ou les échanges. 4. Explorer différents scénarios, tels que les reçus manquants ou les politiques du magasin. 5. Renforcer votre confiance dans la gestion d'une interaction courante dans le commerce de détail. #### Comment le scénario fonctionne Vous entrerez dans le rôle d'un client retournant un produit, tandis que l'IA agira en tant qu'employé du magasin. L'IA demandera pourquoi vous retournez l'article et discutera des options disponibles. Ce scénario pratique vous aide à maîtriser une communication polie et efficace dans des situations de commerce de détail.
id: Handle a return at a customer service desk by describing what went wrong and exploring options for a refund or exchange. Perfect for practicing calm, clear communication in a shopping context. #### Mengapa Anda Harus Bermain *Mengembalikan Barang di Toko* 1. Memahami cara menjelaskan masalah atau cacat dengan sopan. 2. Belajar memberikan rincian yang diperlukan untuk proses pengembalian yang lancar. 3. Berlatih menerima instruksi tentang pengembalian uang atau pertukaran. 4. Menjelajahi berbagai skenario, seperti tanda terima yang hilang atau kebijakan toko. 5. Membangun kepercayaan diri dalam menangani interaksi ritel yang umum. #### Bagaimana Skenario Ini Bekerja Anda akan berperan sebagai pelanggan yang mengembalikan produk, sementara AI bertindak sebagai karyawan toko. AI akan bertanya mengapa Anda mengembalikan barang dan mendiskusikan pilihan yang tersedia. Skenario praktis ini membantu Anda menguasai komunikasi yang sopan dan efisien dalam situasi ritel.
it: Gestire un reso presso un banco di assistenza clienti descrivendo cosa è andato storto ed esplorando opzioni per un rimborso o un cambio. Perfetto per esercitarsi in una comunicazione calma e chiara in un contesto di shopping. #### Perché dovresti giocare a *Restituire un articolo in un negozio* 1. Comprendere come spiegare un problema o un difetto in modo educato. 2. Imparare a fornire i dettagli necessari per un processo di reso fluido. 3. Esercitarsi a ricevere istruzioni sui rimborsi o sui cambi. 4. Esplorare diversi scenari, come scontrini mancanti o politiche del negozio. 5. Costruire fiducia nel gestire un'interazione comune al dettaglio. #### Come funziona lo scenario Assumerai il ruolo di un cliente che restituisce un prodotto, mentre l'IA agirà come dipendente del negozio. L'IA chiederà perché stai restituendo l'articolo e discuterà le opzioni disponibili. Questo scenario pratico ti aiuta a padroneggiare una comunicazione educata ed efficiente nelle situazioni di vendita al dettaglio.
ja: 顧客サービスデスクで返品を処理する際に、何がうまくいかなかったのかを説明し、返金または交換のオプションを探ります。ショッピングの文脈で落ち着いて明確なコミュニケーションを練習するのに最適です。 #### あなたが *店舗でのアイテムの返品* をプレイすべき理由 1. 問題や欠陥を丁寧に説明する方法を理解する。 2. スムーズな返品プロセスのために必要な詳細を提供することを学ぶ。 3. 返金や交換に関する指示を受け取る練習をする。 4. 領収書がない場合や店の方針など、さまざまなシナリオを探る。 5. 一般的な小売のやり取りを処理する自信を高める。 #### シナリオの進行方法 あなたは商品の返品をする顧客の役割を担い、AIは店舗の従業員として行動します。AIはなぜアイテムを返品するのかを尋ね、利用可能なオプションについて話し合います。この実践的なシナリオは、小売の状況で丁寧で効率的なコミュニケーションを習得するのに役立ちます。
ms: Handle a return at a customer service desk by describing what went wrong and exploring options for a refund or exchange. Perfect for practicing calm, clear communication in a shopping context. #### Mengapa Anda Perlu Bermain *Mengembalikan Barang di Kedai* 1. Memahami cara menjelaskan isu atau kecacatan dengan sopan. 2. Belajar memberikan butiran yang diperlukan untuk proses pengembalian yang lancar. 3. Berlatih menerima arahan mengenai pengembalian wang atau pertukaran. 4. Meneroka pelbagai senario, seperti resit yang hilang atau polisi kedai. 5. Membangunkan keyakinan dalam mengendalikan interaksi runcit yang biasa. #### Cara Senario Berfungsi Anda akan mengambil peranan sebagai pelanggan yang mengembalikan produk, sementara AI berperanan sebagai pekerja kedai. AI akan bertanya mengapa anda mengembalikan item tersebut dan membincangkan pilihan yang ada. Senario praktikal ini membantu anda menguasai komunikasi yang sopan dan efisien dalam situasi runcit.
no: Handle et retur ved en kundeservicedisk ved å beskrive hva som gikk galt og utforske alternativer for refusjon eller bytte. Perfekt for å øve på rolig, klar kommunikasjon i en butikksammenheng. #### Hvorfor Du Bør Spille *Å Returnere en Vare i en Butikk* 1. Forstå hvordan man høflig forklarer et problem eller en defekt. 2. Lær å gi nødvendige detaljer for en smidig returprosess. 3. Øv deg på å motta instruksjoner om refusjoner eller bytter. 4. Utforsk forskjellige scenarier, som manglende kvitteringer eller butikkens retningslinjer. 5. Bygg selvtillit i håndtering av en vanlig detaljhandelinteraksjon. #### Hvordan Scenariet Fungerer Du vil innta rollen som en kunde som returnerer et produkt, mens AI-en fungerer som butikkmedarbeider. AI-en vil spørre hvorfor du returnerer varen og diskutere tilgjengelige alternativer. Dette praktiske scenariet hjelper deg med å mestre høflig, effektiv kommunikasjon i detaljhandel situasjoner.
pt: Lide com um retorno no balcão de atendimento ao cliente descrevendo o que deu errado e explorando opções para um reembolso ou troca. Perfeito para praticar uma comunicação calma e clara em um contexto de compras. #### Por Que Você Deve Jogar *Devolvendo um Item na Loja* 1. Entenda como explicar um problema ou defeito educadamente. 2. Aprenda a fornecer os detalhes necessários para um processo de devolução suave. 3. Pratique receber instruções sobre reembolsos ou trocas. 4. Explore diferentes cenários, como recibos faltando ou políticas da loja. 5. Construa confiança lidando com uma interação comum no varejo. #### Como o Cenário Funciona Você assumirá o papel de um cliente devolvendo um produto, enquanto a IA atua como o funcionário da loja. A IA perguntará por que você está devolvendo o item e discutirá as opções disponíveis. Este cenário prático ajuda você a dominar a comunicação educada e eficiente em situações de varejo.
ru: Обработайте возврат на стойке обслуживания клиентов, описав, что пошло не так, и исследуя варианты возврата или обмена. Идеально подходит для практики спокойного и ясного общения в контексте покупок. #### Почему стоит сыграть в *Возвращение товара в магазине* 1. Понять, как вежливо объяснять проблему или дефект. 2. Узнать, как предоставить необходимые детали для беспроblemsьного процесса возврата. 3. Попрактиковаться в получении инструкций о возвратах или обменах. 4. Изучить различные сценарии, такие как отсутствие чеков или политика магазина. 5. Укрепить уверенность в обращении с распространенным розничным взаимодействием. #### Как работает сценарий Вы примете на себя роль покупателя, возвращающего продукт, пока AI выступает в роли сотрудника магазина. AI спросит, почему вы возвращаете этот товар, и обсудит доступные варианты. Этот практический сценарий поможет вам овладеть вежливым и эффективным общением в розничных ситуациях.
sv: Hantera en retur vid en kundservicedisk genom att beskriva vad som gick fel och utforska alternativ för en återbetalning eller byte. Perfekt för att öva lugn, tydlig kommunikation i en shoppingkontext. #### Varför du ska spela *Att returnera en vara i en butik* 1. Förstå hur man artigt förklarar ett problem eller en defekt. 2. Lär dig att ge nödvändiga detaljer för en smidig returprocess. 3. Öva på att ta emot instruktioner om återbetalningar eller byten. 4. Utforska olika scenarier, såsom saknade kvitton eller butikspolicyer. 5. Bygg självförtroende i hanteringen av en vanlig detaljhandelsinteraktion. #### Hur scenariot fungerar Du kommer att ta rollen som en kund som returnerar en produkt, medan AI:n agerar som butikens anställd. AI:n kommer att fråga varför du returnerar varan och diskutera tillgängliga alternativ. Detta praktiska scenario hjälper dig att bemästra artig, effektiv kommunikation i detaljhandelsituationer.
tr: Bir müşteri hizmetleri masasında bir iadeyi işleme alma sürecini, neyin yanlış gittiğini açıklayarak ve geri ödeme veya değişim seçeneklerini keşfederek gerçekleştirin. Alışveriş bağlamında sakin, net iletişimi pratiğe dökmek için mükemmel. #### Neden *Bir Ürünü Mağazada İade Etme* Oyununu Oynamalısınız 1. Bir sorunu veya kusuru nazikçe açıklamayı anlayın. 2. Sorunsuz bir iade süreci için gerekli ayrıntıları sağlamayı öğrenin. 3. Geri ödemeler veya değişimler hakkında talimatları alma pratiği yapın. 4. Fatura eksikliği veya mağaza politikaları gibi farklı senaryoları keşfedin. 5. Yaygın bir perakende etkileşimini yönetme konusunda güven inşa edin. #### Senaryonun Nasıl Çalıştığı Bir ürünü iade eden bir müşteri rolüne gireceksiniz, AI ise mağaza çalışanı olarak hareket edecek. AI, neden ürünü iade ettiğinizi soracak ve mevcut seçenekleri tartışacak. Bu pratik senaryo, perakende durumlarında nazik ve etkili iletişimi ustalaşmanıza yardımcı olur.
uk: Обробіть повернення на стійці обслуговування клієнтів, описуючи, що пішло не так, та досліджуючи варіанти повернення коштів або обміну. Ідеально для практики спокійної, чіткої комунікації в контексті покупок. #### Чому варто зіграти у *Повернення товару в магазині* 1. Зрозумійте, як ввічливо пояснити проблему або дефект. 2. Навчіться надавати необхідні деталі для плавного процесу повернення. 3. Практикуйте отримання інструкцій щодо повернень або обмінів. 4. Досліджуйте різні ситуації, такі як відсутність чеків або політики магазину. 5. Зміцнюйте впевненість у вирішенні поширеної ситуації в роздрібній торгівлі. #### Як працює сценарій Ви візьмете на себе роль клієнта, який повертає продукт, тоді як ШІ виступає в ролі працівника магазину. ШІ запитає, чому ви повертаєте товар, і обговорить доступні варіанти. Цей практичний сценарій допоможе вам освоїти ввічливу, ефективну комунікацію в роздрібних ситуаціях.
vi: Handle a return at a customer service desk by describing what went wrong and exploring options for a refund or exchange. Perfect for practicing calm, clear communication in a shopping context. #### Tại Sao Bạn Nên Chơi *Trả Lại Một Mặt Hàng Tại Cửa Hàng* 1. Hiểu cách giải thích một vấn đề hoặc khiếm khuyết một cách lịch sự. 2. Học cách cung cấp thông tin cần thiết cho quy trình trả hàng suôn sẻ. 3. Thực hành nhận hướng dẫn về hoàn tiền hoặc đổi hàng. 4. Khám phá các tình huống khác nhau, như thiếu biên lai hoặc chính sách của cửa hàng. 5. Xây dựng sự tự tin trong việc xử lý tương tác bán lẻ phổ biến. #### Cách Tình Huống Hoạt Động Bạn sẽ vào vai một khách hàng trả lại một sản phẩm, trong khi AI đóng vai trò là nhân viên cửa hàng. AI sẽ hỏi lý do bạn trả lại mặt hàng và thảo luận về các tùy chọn có sẵn. Tình huống thực tiễn này giúp bạn làm chủ giao tiếp lịch sự, hiệu quả trong các tình huống bán lẻ.

source: Handle concurrency confidently
ar: التعامل مع التزامن بثقة
be: Кіруйце канкурэнцыяй упэўнена
da: Håndter samtidighed med selvsikkerhed
de: Gehe sicher mit Nebenläufigkeit um
es: Maneja la concurrencia con confianza
fr: Gérez la concurrence en toute confiance
id: Tangani konkurensi dengan percaya diri
it: Gestisci la concorrenza con fiducia
ja: 同時実行を安心して処理する
ms: Kendalikan keserentakan dengan yakin
no: Håndter samtidighet med selvtillit
pl: Obsługuj współbieżność z pewnością siebie
pt: Manuseie a concorrência com confiança
ru: Уверенно управляйте параллельностью
sv: Hantera samtidighet med självförtroende
th: จัดการความพร้อมในการทำงานพร้อมกันอย่างมั่นใจ
tr: Eşzamanlılığı güvenle yönetin
uk: Рішуче вирішуйте питання паралельності
vi: Xử lý đồng thời một cách tự tin

source: Happy April 1st!
ar: !أبريل الأول سعيد
be: З Днём 1 красавіка!
da: Glædelig 1. april!
de: Frohen 1. April!
es: ¡Feliz 1 de abril!
fr: Joyeux 1er avril !
id: Selamat 1 April!
it: Buon 1 Aprile!
ja: 4月1日おめでとう！
ms: Selamat 1 April!
no: God 1. april!
pl: Szczęśliwego 1 kwietnia!
pt: Feliz 1 de Abril!
ru: Счастливого 1 апреля!
sv: Glad 1:a april!
th: สุขสันต์วันที่ 1 เมษายน!
tr: 1 Nisan Kutlu Olsun!
uk: З Днем 1 Квітня!
vi: Chúc mừng ngày 1 tháng 4!

source: Have fun!
ar: استمتع!
be: Развяжыся!
da: Hav det sjovt!
de: Viel Spaß!
es: ¡Diviértete!
fr: Amusez-vous bien !
id: Bersenang-senanglah!
it: Divertiti!
ja: 楽しんでください！
ms: Selamat berseronok!
no: Ha det gøy!
pl: Baw się dobrze!
pt: Divirta-se!
ru: Веселись!
sv: Ha kul!
th: สนุกสนานนะ!
tr: Eğlenin!
uk: Насолоджуйтесь!
vi: Vui vẻ!

source: Health
ar: الصحة
be: Здароўе
da: Sundhed
de: Gesundheit
es: Salud
fr: Santé
id: Kesehatan
it: Salute
ja: 健康
ms: Kesihatan
no: Helse
pl: Zdrowie
pt: Saúde
ru: Здоровье
sv: Hälsa
th: สุขภาพ
tr: Sağlık
uk: Здоров'я
vi: Sức khỏe

source: Help
ar: مساعدة
be: Дапамога
da: Hjælp
de: Hilfe
es: Ayuda
fr: Aide
id: Bantuan
it: Aiuto
ja: ヘルプ
ms: Bantuan
no: Hjelp
pl: Pomoc
pt: Ajuda
ru: Помощь
sv: Hjälp
th: ขอความช่วยเหลือ
tr: Yardım
uk: Допомога
vi: Trợ giúp

source: Here are some new rules for you to learn:
es: Aquí tienes algunas reglas nuevas para que aprendas:
id: Berikut adalah beberapa aturan baru untuk Anda pelajari:
it: Ecco alcune nuove regole che devi imparare:
ja: 以下は、学ぶべき新しいルールです：
no: Her er noen nye regler for deg å lære:
pl: Oto kilka nowych zasad do nauczenia się:
pt: Aqui estão algumas novas regras para você aprender:
ru: Вот некоторые новые правила, которые тебе нужно изучить:
sv: Här är några nya regler för dig att lära dig:
uk: Ось декілька нових правил, які вам слід вивчити:
