Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Get comfortable shopping in a real store setting by asking questions about product locations, prices, and deals. Perfect for building confidence in navigating aisles, comparing items, and checking out. #### Why You Should Play *At the Grocery Store* 1. Practice finding specific items on your shopping list. 2. Learn to ask questions about prices, promotions, and product details. 3. Explore how to handle polite small talk with store employees. 4. Improve your communication when making quick decisions or comparing options. 5. Gain valuable experience in a common, everyday scenario. #### How the Scenario Works You’ll take the role of a customer shopping for groceries. The AI, as a store employee, will ask what you’re looking for, suggest deals, and guide you to the right products. This interactive role-play simulates a realistic shopping experience, helping you build essential communication skills.
ar: احصل على الراحة أثناء التسوق في بيئة المتجر الحقيقية من خلال طرح أسئلة حول مواقع المنتجات والأسعار والعروض. مثالي لبناء الثقة في التنقل بين الممرات، ومقارنة العناصر، والدفع. #### لماذا يجب عليك لعب *في متجر البقالة* 1. ممارسة العثور على العناصر المحددة في قائمة التسوق الخاصة بك. 2. تعلم كيفية طرح الأسئلة حول الأسعار والعروض وتفاصيل المنتجات. 3. استكشاف كيفية التعامل مع المحادثات الودية بأدب مع موظفي المتجر. 4. تحسين مهارات التواصل لديك عند اتخاذ قرارات سريعة أو مقارنة الخيارات. 5. اكتساب خبرة قيمة في سيناريو شائع ويومي. #### كيف تعمل السيناريو ستتولى دور عميل يتسوق لشراء البقالة. ستسأل الذكاء الاصطناعي، كموظف في المتجر، عن ما تبحث عنه، وتقترح عروضاً، وتوجهك إلى المنتجات الصحيحة. هذه اللعبة التفاعلية تحاكي تجربة تسوق واقعية، مما يساعدك على بناء مهارات التواصل الأساسية.
be: Здабыцца камфортам пакупак у рэальных крамавых умовах, задаючы пытанні пра месцазнаходжанне тавараў, цэны і спецпрапановы. Вельмі добрай для развіцця ўпэўненасці ў арыентацыі па локацыям, параўнанні прадметаў і праверцы чекаў. #### Чаму варта гуляць у *У краме* 1. Практававаць пошук канкрэтных прадметаў з вашага спісу пакупак. 2. Вывучаць ставіць пытанні пра кошт, акцыі, дэтали прадукту. 3. Даследуйце як праводзіць вежлівы невыкладчы размова з работнікамі магазіна. 4. Паляпшыце сваю камунікацыю пры хуткіх рашэннях або параўнанні варыянтаў. 5. Атрымайце каштоўны досвед у рэгулярных, штодзённых сітуацыях. #### Як працуе гэты сценарый Вы будзеце граць ролю пакупніка, які купляе прадукты. Штучны інтэлект у ролі работніка магазіна спытае, што вы шукаеце, прапануе спецпрапановы і направіце вас да правільных прадуктаў. Гэта інтэрактыўная ролевая гульня сімулюе рэалістычны шопінг, дапамагаючы вам развіваць неабходныя навыкі камунікацыі.
da: Bliv komfortabel med at handle i en rigtig butiksindstilling ved at stille spørgsmål om produktplaceringer, priser og tilbud. Perfekt til at opbygge selvtillid til at navigere i gangene, sammenligne varer og betale. #### Hvorfor Du Skal Spille *I Supermarkedet* 1. Øv dig i at finde specifikke varer på din indkøbsliste. 2. Lær at stille spørgsmål om priser, kampagnetilbud og produktdetaljer. 3. Udforsk hvordan man håndterer venlig small talk med butiksansatte. 4. Forbedr din kommunikation når du træffer hurtige beslutninger eller sammenligner valgmuligheder. 5. Få værdifuld erfaring i en almindelig, hverdagsagtig situation. #### Hvordan Scenariet Fungerer Du vil tage rollen som en kunde, der handler dagligvarer. AI'en, som en butiksansat, vil spørge, hvad du leder efter, foreslå tilbud og lede dig til de rigtige produkter. Denne interaktive rolleleg simulerer en realistisk shoppingoplevelse, der hjælper dig med at opbygge essentielle kommunikationsevner.
de: Mach dich mit dem Einkaufen in einem echten Geschäft vertraut, indem du Fragen zu Produktstandorten, Preisen und Angeboten stellst. Perfekt, um Selbstvertrauen im Navigieren durch die Gänge, im Vergleichen von Artikeln und beim Bezahlen aufzubauen. #### Warum du *Im Lebensmittelgeschäft* spielen solltest 1. Übe das Finden bestimmter Artikel auf deiner Einkaufsliste. 2. Lerne, Fragen zu Preisen, Angeboten und Produktdetails zu stellen. 3. Erkunde, wie man höfliche Smalltalk mit den Mitarbeitern des Geschäfts führt. 4. Verbessere deine Kommunikation, wenn du schnelle Entscheidungen triffst oder Optionen vergleichst. 5. Sammle wertvolle Erfahrungen in einem alltäglichen Szenario. #### Wie das Szenario funktioniert Du übernimmst die Rolle eines Kunden, der Lebensmittel einkauft. Die KI, als Mitarbeiter des Geschäfts, wird fragen, wonach du suchst, Angebote vorschlagen und dich zu den richtigen Produkten führen. Dieses interaktive Rollenspiel simuliert ein realistisches Einkaufserlebnis und hilft dir, grundlegende Kommunikationsfähigkeiten aufzubauen.
fr: Obtenez des habitudes de shopping dans un vrai magasin en posant des questions sur les emplacements des produits, les prix et les offres. Parfait pour renforcer votre confiance dans la navigation dans les allées, la comparaison d'articles et le passage en caisse. #### Pourquoi vous devriez jouer *Au supermarché* 1. Pratiquez à trouver des articles spécifiques sur votre liste de courses. 2. Apprenez à poser des questions sur les prix, les promotions et les détails des produits. 3. Explorez comment gérer une conversation polie avec les employés du magasin. 4. Améliorez votre communication lors de prises de décisions rapides ou de comparaisons d'options. 5. Acquérez une expérience précieuse dans un scénario commun et quotidien. #### Comment le scénario fonctionne Vous prendrez le rôle d'un client faisant ses courses. L'IA, en tant qu'employé du magasin, vous demandera ce que vous cherchez, suggérera des offres et vous guidera vers les bons produits. Ce jeu de rôle interactif simule une expérience de shopping réaliste, vous aidant à développer des compétences de communication essentielles.
id: Dapatkan kenyamanan berbelanja di pengaturan toko yang sebenarnya dengan mengajukan pertanyaan tentang lokasi produk, harga, dan penawaran. Sempurna untuk membangun kepercayaan diri dalam menjelajahi lorong, membandingkan barang, dan melakukan pembayaran. #### Kenapa Anda Harus Bermain *Di Toko Grosir* 1. Berlatih menemukan barang-barang spesifik dalam daftar belanja Anda. 2. Belajar mengajukan pertanyaan tentang harga, promosi, dan detail produk. 3. Jelajahi cara menangani obrolan kecil yang sopan dengan karyawan toko. 4. Tingkatkan komunikasi Anda saat membuat keputusan cepat atau membandingkan opsi. 5. Dapatkan pengalaman berharga dalam skenario sehari-hari yang umum. #### Bagaimana Skenario Ini Bekerja Anda akan mengambil peran sebagai pelanggan yang berbelanja bahan makanan. AI, sebagai karyawan toko, akan bertanya apa yang Anda cari, memberi saran tentang penawaran, dan membimbing Anda ke produk yang tepat. Peran interaktif ini mensimulasikan pengalaman berbelanja yang realistis, membantu Anda membangun keterampilan komunikasi yang penting.
ja: お店の設定で、商品場所、価格、特売について質問することで、快適に買い物をする練習をしましょう。通路を移動したり、商品を比較したり、チェックアウトする自信を築くのに最適です。 #### *食料品店で遊ぶべき理由* 1. お買い物リストの特定の商品を見つける練習ができる。 2. 価格、プロモーション、商品詳細について質問する方法を学べる。 3. 店員との礼儀正しい雑談を扱う方法を探求できる。 4. 短時間で決定を下したり、選択肢を比較したりする際のコミュニケーションを改善できる。 5. 日常的で一般的なシナリオにおいて貴重な経験を得られる。 #### シナリオの仕組み あなたは食料品を買いに行く顧客の役割を担います。AIは店員として、あなたが何を探しているかを尋ね、特売を提案し、正しい商品に案内します。このインタラクティブなロールプレイは、リアルな買い物体験をシミュレーションし、必要なコミュニケーションスキルを構築するのに役立ちます。
ms: Dapatkan keselesaan membeli-belah dalam suasana kedai sebenar dengan bertanya soalan mengenai lokasi produk, harga, dan tawaran. Sesuai untuk membina keyakinan dalam menavigasi lorong, membandingkan barang, dan pembayaran. #### Mengapa Anda Perlu Bermain *Di Kedai Runcit* 1. Amalkan mencari item tertentu dalam senarai beli-belah anda. 2. Pelajari cara untuk bertanya soalan mengenai harga, promosi, dan butiran produk. 3. Terokai bagaimana untuk mengendalikan perbualan ringan yang sopan dengan pekerja kedai. 4. Tingkatkan komunikasi anda semasa membuat keputusan cepat atau membandingkan pilihan. 5. Dapatkan pengalaman berharga dalam situasi biasa seharian. #### Bagaimana Senario Ini Berfungsi Anda akan mengambil peranan sebagai pelanggan yang membeli barangan runcit. AI, sebagai pekerja kedai, akan bertanya apa yang anda cari, mencadangkan tawaran, dan membimbing anda ke produk yang betul. Peranan interaktif ini mensimulasikan pengalaman membeli-belah yang realistik, membantu anda membina kemahiran komunikasi yang penting.
no: Få deg komfortabel med å handle i en virkelig butikk ved å stille spørsmål om produktplasseringer, priser og tilbud. Perfekt for å bygge selvtillit i å navigere i gangene, sammenligne varer og betale. #### Hvorfor du bør spille *I Matbutikken* 1. Øv på å finne spesifikke varer på handlelisten din. 2. Lær å stille spørsmål om priser, kampanjer og produktdetaljer. 3. Utforsk hvordan du håndterer høflig småprat med butikkansatte. 4. Forbedre kommunikasjonen din når du tar raske beslutninger eller sammenligner alternativer. 5. Få verdifull erfaring i en vanlig, hverdagslig situasjon. #### Hvordan scenarioet fungerer Du vil ta rollen som en kunde som handler dagligvarer. AI-en, som en butikkansatt, vil spørre hva du leter etter, foreslå tilbud og veilede deg til de riktige produktene. Dette interaktive rollespillet simulerer en realistisk handleopplevelse, og hjelper deg med å bygge viktige kommunikasjonsevner.
pt: Fique à vontade para fazer compras em um ambiente de loja real, fazendo perguntas sobre a localização dos produtos, preços e promoções. Perfeito para construir confiança na navegação pelos corredores, comparar itens e realizar o pagamento. #### Por que você deve jogar *No Supermercado* 1. Pratique encontrar itens específicos na sua lista de compras. 2. Aprenda a fazer perguntas sobre preços, promoções e detalhes dos produtos. 3. Explore como lidar com pequenas conversas educadas com os funcionários da loja. 4. Melhore sua comunicação ao tomar decisões rápidas ou comparar opções. 5. Ganhe experiência valiosa em um cenário comum do dia a dia. #### Como o cenário funciona Você assumirá o papel de um cliente fazendo compras de supermercado. A IA, como um funcionário da loja, perguntará o que você está procurando, sugerirá promoções e o guiará até os produtos certos. Esta simulação interativa simula uma experiência de compras realista, ajudando você a desenvolver habilidades de comunicação essenciais.
ru: Получите комфорт при покупках в реальном магазине, задавая вопросы о местонахождении товаров, ценах и акциях. Идеально подходит для уверенности в навигации по проходам, сравнении товаров и оплате. #### Почему вам стоит играть *В продуктовом магазине* 1. Практикуйте нахождение конкретных товаров в вашем списке покупок. 2. Учитесь задавать вопросы о ценах, акциях и подробностях товаров. 3. Исследуйте, как вести вежливый разговор с сотрудниками магазина. 4. Улучшайте свои коммуникативные навыки при принятии быстрых решений или сравнении вариантов. 5. Получите ценный опыт в распространенном повседневном сценарии. #### Как работает сценарий Вы возьмете на себя роль покупателя, покупающего продукты. ИИ, в роли сотрудника магазина, будет спрашивать, что вы ищете, предлагать акции и направлять вас к нужным товарам. Эта интерактивная ролевя игра имитирует реалистичный опыт покупок, помогая вам развивать основные коммуникативные навыки.
sv: Få bekväm med att handla i en riktig butik genom att ställa frågor om produktplaceringar, priser och erbjudanden. Perfekt för att bygga självförtroende när du navigerar i gångarna, jämför varor och gör dina inköp. #### Varför du bör spela *På livsmedelsbutiken* 1. Öva på att hitta specifika varor på din inköpslista. 2. Lär dig ställa frågor om priser, kampanjer och produktinformation. 3. Utforska hur du hanterar artigt småprat med butikens anställda. 4. Förbättra din kommunikation när du fattar snabba beslut eller jämför alternativ. 5. Få värdefull erfarenhet i en vanlig, vardaglig situation. #### Hur scenariot fungerar Du kommer att ta rollen som en kund som handlar livsmedel. AI:n, som en butikanställd, kommer att fråga vad du söker, föreslå erbjudanden och vägleda dig till de rätta produkterna. Denna interaktiva rollspel simulerar en realistisk shoppingupplevelse, vilket hjälper dig att bygga viktiga kommunikationsfärdigheter.
th: เริ่มต้นการช็อปปิ้งในสภาพแวดล้อมของร้านค้าโดยการถามคำถามเกี่ยวกับสถานที่ผลิตภัณฑ์ ราคา และโปรโมชั่น เป็นการฝึกฝนที่สมบูรณ์แบบในการสร้างความมั่นใจในการเดินตามช่องทาง เปรียบเทียบสินค้า และเช็คเอาท์ #### ทำไมคุณควรเล่น *ที่ร้านขายของชำ* 1. ฝึกหาสินค้าเฉพาะในรายการช้อปปิ้งของคุณ 2. เรียนรู้การตั้งคำถามเกี่ยวกับราคา โปรโมชั่น และรายละเอียดผลิตภัณฑ์ 3. สำรวจวิธีการจัดการกับการพูดคุยเล็กน้อยอย่างสุภาพกับพนักงานในร้าน 4. พัฒนาทักษะการสื่อสารเมื่อทำการตัดสินใจอย่างรวดเร็วหรือเปรียบเทียบตัวเลือก 5. สร้างประสบการณ์ที่มีค่าในสถานการณ์ทั่วไปในชีวิตประจำวัน #### วิธีการทำงานของสถานการณ์ คุณจะรับบทเป็นลูกค้าที่กำลังช็อปปิ้งของชำ AI จะทำหน้าที่เป็นพนักงานในร้าน จะถามว่าคุณกำลังมองหาอะไร แนะนำโปรโมชั่น และพาคุณไปยังผลิตภัณฑ์ที่ถูกต้อง การแสดงบทบาทแบบโต้ตอบนี้จำลองประสบการณ์การช็อปปิ้งที่สมจริง ช่วยให้คุณพัฒนาทักษะการสื่อสารที่จำเป็น
tr: Gerçek bir mağaza ortamında ürünlerin yerleri, fiyatları ve fırsatları hakkında sorular sorarak alışveriş yapma konforunu kazanın. Koridorlarda rahatça dolaşma, ürünleri karşılaştırma ve ödeme yapma becerilerinizi geliştirmek için mükemmel. #### Neden *Market Alışverişi* Oynamalısınız 1. Alışveriş listenizdeki belirli ürünleri bulma pratiği yapın. 2. Fiyatlar, kampanyalar ve ürün detayları hakkında sorular sormayı öğrenin. 3. Mağaza çalışanları ile nazik küçük sohbetleri nasıl yapacağınızı keşfedin. 4. Hızlı kararlar alırken veya seçenekleri karşılaştırırken iletişiminizi geliştirin. 5. Yaygın bir günlük senaryoda değerli deneyim kazanın. #### Senaryo Nasıl İşliyor Siz, grocery shopping (gıda alışverişi) yapan bir müşteri rolünü üstleneceksiniz. AI, mağaza çalışanı olarak, ne aradığınızı soracak, fırsatlar önerecek ve sizi doğru ürünlere yönlendirecek. Bu etkileşimli rol yapma, gerçeğe yakın bir alışveriş deneyimini simüle ederek temel iletişim becerilerinizi geliştirmenize yardımcı olur.
uk: Зручно здійснюйте покупки в реальному магазині, ставлячи питання про розташування товарів, ціни та акції. Ідеально підходить для розвитку впевненості у навігації між рядами, порівнянні товарів та під час розрахунку. #### Чому варто грати *В продуктовому магазині* 1. Практикуйтеся у пошуку конкретних товарів з вашого списку покупок. 2. Дізнайтеся, як ставити запитання про ціни, акції та деталі товарів. 3. Досліджуйте, як вести ввічливу бесіду з співробітниками магазину. 4. Поліпшуйте свою комунікацію, коли потрібно швидко приймати рішення або порівнювати варіанти. 5. Отримайте цінний досвід у поширеній повсякденній ситуації. #### Як працює цей сценарій Ви будете в ролі клієнта, що купує продукти. ШІ, як співробітник магазину, запитає, що ви шукаєте, запропонує акції та проведе вас до потрібних товарів. Ця інтерактивна рольова гра імітує реальний шопінг-досвід, допомагаючи вам розвивати основні комунікаційні навички.
vi: Làm quen với việc mua sắm trong một cửa hàng thực bằng cách hỏi về vị trí sản phẩm, giá cả và các chương trình khuyến mãi. Hoàn hảo để xây dựng sự tự tin khi di chuyển trong các lối đi, so sánh các mặt hàng và thanh toán. #### Tại Sao Bạn Nên Chơi *Tại Cửa Hàng Tạp Hóa* 1. Thực hành tìm kiếm những mặt hàng cụ thể trong danh sách mua sắm của bạn. 2. Học cách hỏi về giá cả, khuyến mãi và chi tiết sản phẩm. 3. Khám phá cách xử lý những cuộc trò chuyện lịch sự với nhân viên cửa hàng. 4. Cải thiện khả năng giao tiếp khi đưa ra quyết định nhanh chóng hoặc so sánh các lựa chọn. 5. Đạt được kinh nghiệm quý giá trong một tình huống phổ biến hàng ngày. #### Cách Tình Huống Hoạt Động Bạn sẽ đảm nhận vai trò của một khách hàng mua sắm tạp hóa. AI, với vai trò là nhân viên cửa hàng, sẽ hỏi bạn đang tìm kiếm gì, gợi ý các chương trình khuyến mãi và dẫn bạn đến những sản phẩm phù hợp. Trò chơi nhập vai tương tác này mô phỏng một trải nghiệm mua sắm thực tế, giúp bạn xây dựng các kỹ năng giao tiếp thiết yếu.

source: Get confidence with AI support
de: Gewinnen Sie Vertrauen mit KI-Unterstützung
es: Gana confianza con el apoyo de la IA
id: Dapatkan kepercayaan diri dengan dukungan AI
it: Ottieni fiducia con il supporto dell'IA
ja: AIのサポートで自信をつける
no: Få selvtillit med AI-støtte
pl: Zyskaj pewność siebie dzięki wsparciu AI
pt: Ganhe confiança com o suporte da IA
ru: Получите уверенность с поддержкой ИИ
sv: Få självförtroende med AI-stöd
th: ได้รับความมั่นใจด้วยการสนับสนุนจาก AI
tr: Yapay zeka desteğiyle güven kazanın
uk: Отримайте впевненість із підтримкою AI
vi: Có được sự tự tin với sự hỗ trợ từ AI

source: Get flexible pricing with FluencyPal. Start with 3 free days, and enjoy AI-powered language practice with no subscriptions or hidden fees.
ar: احصل على تسعير مرن مع FluencyPal. ابدأ بثلاثة أيام مجانية، واستمتع بممارسة اللغة بدعم من الذكاء الاصطناعي بدون اشتراكات أو رسوم مخفية.
be: Атрымаеце гнучкае коштаванне з FluencyPal. Пачніце з 3 бясплатнымі днямі, і насолоджвайцеся навучаннем мовы, якім кіруе AI, без падпісак або схаваных платежоў.
da: Få fleksibel prisfastsættelse med FluencyPal. Start med 3 gratis dage, og nyd AI-drevet sprogpraksis uden abonnementer eller skjulte gebyrer.
de: Erhalten Sie flexible Preise mit FluencyPal. Beginnen Sie mit 3 kostenlosen Tagen und genießen Sie AI-gesteuertes Sprachtraining ohne Abonnements oder versteckte Gebühren.
es: Obtén precios flexibles con FluencyPal. Comienza con 3 días gratis, y disfruta de la práctica de idiomas impulsada por IA sin suscripciones ni tarifas ocultas.
fr: Obtenez une tarification flexible avec FluencyPal. Commencez avec 3 jours gratuits, et profitez de la pratique de la langue propulsée par l'IA sans abonnements ou frais cachés.
id: Dapatkan harga yang fleksibel dengan FluencyPal. Mulai dengan 3 hari gratis, dan nikmati latihan bahasa yang ditenagai AI tanpa langganan atau biaya tersembunyi.
it: Ottieni una tariffazione flessibile con FluencyPal. Inizia con 3 giorni gratuiti, e goditi la pratica linguistica potenziata dall'IA senza abbonamenti o costi nascosti.
ja: FluencyPalの柔軟な価格設定を利用しましょう。最初の3日間は無料で、サブスクリプションや隠れた料金なしでAIが支援する言語練習を楽しむことができます。
ms: Dapatkan harga yang fleksibel dengan FluencyPal. Mulakan dengan 3 hari percuma, dan nikmati latihan bahasa yang dikuasai oleh AI tanpa langganan atau bayaran tersembunyi.
no: Få fleksibel prising med FluencyPal. Start med 3 gratis dager, og nyt AI-drevet språkpraksis uten abonnement eller skjulte gebyrer.
pl: Uzyskaj elastyczną wycenę z FluencyPal. Zacznij od 3 darmowych dni i ciesz się praktyką językową zasilaną przez AI, bez subskrypcji czy ukrytych opłat.
pt: Obtenha preços flexíveis com o FluencyPal. Comece com 3 dias gratuitos e aproveite a prática de idiomas alimentada por IA sem assinaturas ou taxas ocultas.
ru: Получите гибкую ценовую политику с FluencyPal. Начните с 3 бесплатных дней и наслаждайтесь практикой иностранного языка с помощью AI без подписок или скрытых платежей.
sv: Få flexibel prissättning med FluencyPal. Börja med 3 gratisdagar, och njut av AI-driven språkträning utan prenumerationer eller dolda avgifter.
th: รับราคาที่ยืดหยุ่นได้กับ FluencyPal. เริ่มต้นด้วย 3 วันฟรี, และเพลิดเพลินกับการฝึกภาษาที่ขับเคลื่อนด้วย AI โดยไม่ต้องสมัครสมาชิกหรือค่าซ่อน.
tr: FluencyPal ile esnek fiyatlandırmayı edinin. 3 ücretsiz günle başlayın ve hiçbir abonelik ya da gizli ücret olmadan AI destekli dil pratiğinin tadını çıkarın.
uk: Отримайте гнучке ціноутворення з FluencyPal. Почніть з 3 безкоштовних днів та насолоджуйтесь практикою мови, підсиланої AI, без підписок або прихованих платежів.
vi: Nhận mức giá linh hoạt với FluencyPal. Bắt đầu với 3 ngày miễn phí, và thưởng thức việc luyện tập ngôn ngữ được hỗ trợ bởi AI mà không cần đăng ký hay phí ẩn.

source: Get Full Access
ar: احصل على الوصول الكامل
be: Атрымаць Поўны Доступ
da: Få Fuld Adgang
de: Erhalten Sie vollen Zugang
es: Obtén Acceso Completo
fr: Obtenez un Accès Complet
id: Dapatkan Akses Penuh
it: Ottieni Accesso Completo
ja: フルアクセスを取得する
ms: Dapatkan Akses Penuh
no: Få Full Tilgang
pl: Uzyskaj Pełny Dostęp
pt: Obter Acesso Total
ru: Получить полный доступ
sv: Få Full Åtkomst
th: รับการเข้าถึงแบบเต็มรูปแบบ
tr: Tam Erişim Alın
uk: Отримайте Повний Доступ
vi: Đạt Quyền Truy Cập Đầy Đủ
