Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: What is Git and how do you use basic commands like commit, push, and pull?
ar: ما هو Git وكيف يمكنك استخدام الأوامر الأساسية مثل commit و push و pull؟
be: Што такое Git і як выкарыстоўваць асноўныя каманды, такія як commit, push і pull?
da: Hvad er Git, og hvordan bruger du grundlæggende kommandoer som commit, push og pull?
de: Was ist Git und wie verwendet man grundlegende Befehle wie commit, push und pull?
es: ¿Qué es Git y cómo se utilizan comandos básicos como commit, push y pull?
fr: Qu'est-ce que Git et comment utilisez-vous les commandes de base telles que commit, push et pull ?
id: Apa itu Git dan bagaimana cara menggunakan perintah dasar seperti commit, push, dan pull?
it: Cos'è Git e come usi i comandi di base come commit, push e pull?
ja: Gitとは何か、commit、push、pullのような基本的なコマンドをどのように使用するか？
no: Hva er Git, og hvordan bruker du grunnleggende kommandoer som commit, push og pull?
pl: Czym jest Git i jak używać podstawowych poleceń takich jak commit, push i pull?
pt: O que é Git e como usar comandos básicos como commit, push e pull?
ru: Что такое Git и как использовать основные команды, такие как commit, push и pull?
sv: Vad är Git och hur använder du grundläggande kommandon som commit, push och pull?
th: Git คืออะไร และคุณจะใช้คำสั่งพื้นฐาน เช่น commit, push และ pull ได้อย่างไร?
tr: Git nedir ve commit, push, pull gibi temel komutlar nasıl kullanılır?
uk: Що таке Git і як користуватися базовими командами, такими як commit, push і pull?
vi: Git là gì và làm thế nào để bạn sử dụng các lệnh cơ bản như commit, push và pull?

source: What is the CSS box model and how does it work?
ar: ما هو نموذج مربع CSS وكيف يعمل؟
be: Што такое мадэль блока CSS і як яна працуе?
da: Hvad er CSS-boksmodellen, og hvordan fungerer den?
de: Was ist das CSS-Boxmodell und wie funktioniert es?
es: ¿Cuál es el modelo de caja de CSS y cómo funciona?
fr: Qu'est-ce que le modèle de boîte CSS et comment fonctionne-t-il ?
id: Apa itu model kotak CSS dan bagaimana cara kerjanya?
it: Cos'è il modello box di CSS e come funziona?
ja: CSSボックスモデルとは何ですか、それはどのように機能しますか？
no: Hva er CSS-boksmodellen og hvordan fungerer den?
pl: Czym jest model pudełkowy CSS i jak działa?
pt: O que é o modelo de caixa CSS e como ele funciona?
ru: Что такое CSS box model и как он работает?
sv: Vad är CSS-lådmodellen och hur fungerar den?
th: โมเดลกล่องของ CSS คืออะไรและทำงานอย่างไร?
tr: CSS kutu modeli nedir ve nasıl çalışır?
uk: Що таке модель CSS box і як вона працює?
vi: Mô hình hộp CSS là gì và nó hoạt động như thế nào?

source: What is the difference between let, const, and var in JavaScript?
ar: ما هو الفرق بين let و const و var في JavaScript؟
be: Якая розніца паміж let, const і var у JavaScript?
da: Hvad er forskellen mellem let, const og var i JavaScript?
de: Was ist der Unterschied zwischen let, const und var in JavaScript?
es: ¿Cuál es la diferencia entre let, const y var en JavaScript?
fr: Quelle est la différence entre let, const et var en JavaScript ?
id: Apa perbedaan antara let, const, dan var dalam JavaScript?
it: Qual è la differenza tra let, const e var in JavaScript?
ja: JavaScriptにおけるlet、const、varの違いは何ですか？
no: Hva er forskjellen mellom let, const og var i JavaScript?
pl: Jaka jest różnica między let, const i var w JavaScript?
pt: Qual é a diferença entre let, const e var em JavaScript?
ru: В чем разница между let, const и var в JavaScript?
sv: Vad är skillnaden mellan let, const och var i JavaScript?
th: ความแตกต่างระหว่าง let, const, และ var ใน JavaScript คืออะไร?
tr: JavaScript'te let, const ve var arasındaki fark nedir?
uk: У чому різниця між let, const і var у JavaScript?
vi: Sự khác biệt giữa let, const và var trong JavaScript là gì?

source: What is the difference between var, let, and const in JavaScript?
ar: ما الفرق بين var و let و const في جافا سكريبت؟
be: Якая розніца паміж var, let і const у JavaScript?
da: Hvad er forskellen mellem var, let og const i JavaScript?
de: Was ist der Unterschied zwischen var, let, und const in JavaScript?
es: ¿Cuál es la diferencia entre var, let y const en JavaScript?
fr: Quelle est la différence entre var, let et const en JavaScript ?
id: Apa perbedaan antara var, let, dan const dalam JavaScript?
it: Qual è la differenza tra var, let e const in JavaScript?
ja: JavaScriptにおけるvar、let、およびconstの違いは何ですか?
no: Hva er forskjellen mellom var, let og const i JavaScript?
pl: Jaka jest różnica między var, let i const w JavaScript?
pt: Qual é a diferença entre var, let e const em JavaScript?
ru: Какова разница между var, let и const в JavaScript?
sv: Vad är skillnaden mellan var, let och const i JavaScript?
th: ความแตกต่างระหว่าง var, let, และ const ใน JavaScript คืออะไร?
tr: JavaScript'te var, let ve const arasındaki fark nedir?
uk: У чому різниця між var, let та const в JavaScript?
vi: Sự khác biệt giữa var, let, và const trong JavaScript là gì?

source: What is the main focus of FluencyPal?
ar: ما هو التركيز الرئيسي في FluencyPal؟
be: Якая галоўная задача FluencyPal?
da: Hvad er det primære fokus for FluencyPal?
de: Was ist der Hauptfokus von FluencyPal?
es: ¿Cuál es el enfoque principal de FluencyPal?
fr: Quel est le principal objectif de FluencyPal ?
id: Apa fokus utama FluencyPal?
it: Qual è l'obiettivo principale di FluencyPal?
ja: FluencyPalの主な焦点は何ですか？
no: Hva er hovedfokuset til FluencyPal?
pl: Jaki jest główny cel FluencyPal?
pt: Qual é o foco principal do FluencyPal?
ru: Какова главная цель FluencyPal?
sv: Vad är huvudfokus för FluencyPal?
th: FluencyPal มีจุดมุ่งหมายหลักคืออะไร?
tr: FluencyPal'in ana odak noktası nedir?
uk: Яка основна мета FluencyPal?
vi: Trọng tâm chính của FluencyPal là gì?

source: What kinds of backend interviews can I practice for?
ar: ما هي أنواع المقابلات الخلفية التي يمكنني التدرب عليها؟
be: На якія віды інтэрв'ю па backend я магу падрыхтавацца?
da: Hvilke slags backend-interviews kan jeg øve mig til?
de: Welche Arten von Backend-Interviews kann ich üben?
es: ¿Qué tipos de entrevistas de backend puedo practicar?
fr: Quels types d'entretiens backend puis-je pratiquer ?
id: Jenis wawancara backend apa yang bisa saya latih?
it: Che tipi di interviste per il backend posso praticare?
ja: どのようなバックエンド面接の練習ができますか？
ms: Apakah jenis temu bual backend yang boleh saya latih?
no: Hvilke typer backend-intervjuer kan jeg øve på?
pl: Jakie rodzaje rozmów kwalifikacyjnych na backend mogę ćwiczyć?
pt: Quais tipos de entrevistas de backend posso praticar?
ru: На какие виды интервью по backend-разработке я могу попрактиковаться?
sv: Vilka typer av backend-intervjuer kan jag öva inför?
th: ฉันสามารถฝึกสัมภาษณ์ประเภทใดได้บ้างสำหรับทางด้านแบ็กเอนด์?
tr: Ne tür backend görüşmeleri için alıştırma yapabilirim?
uk: Які види співбесід з бекенду я можу практикувати?
vi: Tôi có thể thực hành cho những loại phỏng vấn backend nào?

source: What language do you speak
ar: ما هي اللغة التي تتحدثها
be: Якую мову вы размаўляеце
da: Hvilket sprog taler du
de: Welche Sprache sprichst du?
es: ¿Qué idioma hablas?
fr: Quelle langue parles-tu
id: Bahasa apa yang Anda bicarakan
it: Quale lingua parli
ja: 何語を話しますか
ms: Bahasa apa yang anda tuturkan
no: Hvilket språk snakker du
pl: Jakim językiem mówisz
pt: Qual língua você fala
ru: На каком языке вы говорите
sv: Vilket språk talar du
th: คุณพูดภาษาอะไร
tr: Hangi dili konuşuyorsun?
uk: Якою мовою ви розмовляєте
vi: Bạn nói ngôn ngữ nào

source: What learning modes are available?
ar: ما أوضاع التعلم المتاحة؟
be: Якія рэжымы навучання даступныя?
da: Hvilke læringsmetoder er tilgængelige?
de: Welche Lernmodi sind verfügbar?
es: ¿Qué modos de aprendizaje están disponibles?
fr: Quels modes d'apprentissage sont disponibles ?
id: Mode pembelajaran apa yang tersedia?
it: Quali modalità di apprendimento sono disponibili?
ja: どのような学習モードがありますか？
ms: Mod pembelajaran apa yang tersedia?
no: Hvilke læringsmoduser er tilgjengelige?
pl: Jakie tryby nauki są dostępne?
pt: Quais modos de aprendizagem estão disponíveis?
ru: Какие режимы обучения доступны?
sv: Vilka inlärningslägen finns tillgängliga?
th: โหมดการเรียนรู้อะไรบ้างที่มีให้เลือก?
tr: Hangi öğrenme modları mevcut?
uk: Які режими навчання доступні?
vi: Có những chế độ học nào có sẵn?

source: What level of speaking should I have?
ar: ما هو مستوى التحدث الذي يجب أن أمتلكه؟
be: Які ўзровень размоўных навыкаў павінен быць у мяне?
da: Hvilket niveau af tale skal jeg have?
de: Welches Sprachniveau sollte ich haben?
es: ¿Qué nivel de habla debería tener?
fr: Quel niveau de conversation devrais-je avoir ?
id: Tingkat berbicara seperti apa yang harus saya miliki?
it: Quale livello di espressione orale dovrei avere?
ja: スピーキングはどの程度のレベルが必要ですか？
no: Hvilket nivå av taleferdighet bør jeg ha?
pl: Jaki poziom mówienia powinienem mieć?
pt: Qual nível de fala devo ter?
ru: Какого уровня владения языком я должен достичь?
sv: Vilken nivå av talförmåga bör jag ha?
th: ระดับการพูดของฉันควรเป็นอย่างไร?
tr: Konuşma seviyem ne olmalı?
uk: Який рівень розмовної мови я повинен мати?
vi: Tôi nên có trình độ nói như thế nào?

source: What means "hours of AI usage"?
uk: Що означає "години використання AI"?

source: What recently made you happy?
de: Was hat dich kürzlich glücklich gemacht?
es: ¿Qué te ha hecho feliz recientemente?
id: Apa yang baru-baru ini membuatmu bahagia?
it: Cosa ti ha reso felice di recente?
ja: 最近、あなたを幸せにしたことは何ですか？
no: Hva gjorde deg nylig glad?
pl: Co niedawno sprawiło, że byłeś szczęśliwy?
pt: O que recentemente te fez feliz?
ru: Что недавно сделало вас счастливым?
sv: Vad gjorde dig glad nyligen?
tr: Sizi yakın zamanda mutlu eden ne oldu?
uk: Що нещодавно вас порадувало?

source: What to focus on next time
es: En qué enfocarse la próxima vez
id: Apa yang harus difokuskan pada lain waktu
it: Su cosa concentrarsi la prossima volta
ja: 次回に焦点を当てるべきこと
no: Hva du bør fokusere på neste gang
pl: Na czym skupić się następnym razem
pt: No que focar da próxima vez
ru: На что обратить внимание в следующий раз
sv: Vad du ska fokusera på nästa gång
uk: На що звернути увагу наступного разу

source: What to say?
id: Apa yang harus dikatakan?
it: Cosa dire?
ja: 何を言うべきですか？
no: Hva skal jeg si?
pl: Co powiedzieć?
ru: Что сказать?
sv: Vad ska jag säga?
uk: Що сказати?

source: What types of frontend interviews can I practice for?
ar: ما أنواع مقابلات الواجهة الأمامية التي يمكنني التدرب عليها؟
be: Якія віды інтэрв'ю па фронтэндзе я магу практыкаваць?
da: Hvilke typer frontend-interviews kan jeg øve mig til?
de: Für welche Arten von Frontend-Interviews kann ich üben?
es: ¿Qué tipos de entrevistas de frontend puedo practicar?
fr: Quels types d'entretiens de frontend puis-je pratiquer ?
id: Jenis wawancara frontend apa yang bisa saya latih?
it: Quali tipi di colloqui frontend posso esercitare?
ja: どのような種類のフロントエンド面接を練習できますか？
ms: Apakah jenis temu duga frontend yang boleh saya berlatih?
no: Hvilke typer frontend-intervjuer kan jeg øve meg på?
pl: Jakie rodzaje rozmów kwalifikacyjnych na frontend mogę ćwiczyć?
pt: Quais tipos de entrevistas de frontend posso praticar?
ru: Какие типы интервью по фронтенду я могу отработать?
sv: Vilka typer av frontendintervjuer kan jag öva på?
th: ฉันสามารถฝึกซ้อมสำหรับการสัมภาษณ์ส่วนหน้าแบบใดได้บ้าง?
tr: Hangi türde front-end mülakatlarını pratik yapabilirim?
uk: Які типи фронтенд-інтерв'ю я можу практикувати?
vi: Có những loại phỏng vấn frontend nào mà tôi có thể luyện tập?

source: What you can improve
es: Lo que puedes mejorar
id: Apa yang dapat Anda tingkatkan
it: Cosa puoi migliorare
ja: 改善できる点
no: Hva du kan forbedre
pl: Co możesz poprawić
pt: O que você pode melhorar
ru: Что вы можете улучшить
sv: Vad du kan förbättra
uk: Що ви можете покращити

source: What you can say:
id: Apa yang dapat Anda katakan:
it: Quello che puoi dire:
ja: 言えること:
no: Hva du kan si:
pl: Co możesz powiedzieć:
ru: Что вы можете сказать:
sv: Vad du kan säga:
uk: Що ви можете сказати:

source: What you did well
es: Lo que hiciste bien
id: Apa yang telah Anda lakukan dengan baik
it: Quello che hai fatto bene
ja: あなたがうまくできたこと
no: Det du gjorde bra
pl: Co zrobiłeś dobrze
pt: O que você fez bem
ru: Что у вас получилось хорошо
sv: Vad du gjorde bra
uk: Що вам вдалося добре

source: What you get with FluencyPal
ar: ما الذي تحصل عليه مع FluencyPal
be: Што вы атрымаеце з FluencyPal
da: Hvad du får med FluencyPal
de: Was Sie mit FluencyPal erhalten
es: Lo que obtienes con FluencyPal
fr: Ce que vous obtenez avec FluencyPal
id: Apa yang Anda dapatkan dengan FluencyPal
it: Cosa ottieni con FluencyPal
ja: FluencyPalで得られるもの
ms: Apa yang anda dapatkan dengan FluencyPal
no: Hva du får med FluencyPal
pl: Co otrzymujesz z FluencyPal
pt: O que você recebe com o FluencyPal
ru: Что вы получаете с FluencyPal
sv: Vad du får med FluencyPal
th: สิ่งที่คุณจะได้รับจาก FluencyPal
tr: FluencyPal ile ne elde edersiniz?
uk: Що ви отримуєте з FluencyPal
vi: Những gì bạn nhận được với FluencyPal

source: What you want to achieve
de: Was Sie erreichen möchten
es: Lo que quieres lograr
id: Apa yang ingin Anda capai
it: Cosa vuoi ottenere
ja: あなたが達成したいこと
no: Hva du ønsker å oppnå
pl: Co chcesz osiągnąć
pt: O que você quer alcançar
ru: Что вы хотите достичь
sv: Vad du vill uppnå
th: สิ่งที่คุณต้องการบรรลุ
tr: Ne elde etmek istiyorsunuz?
uk: Що ви хочете досягти
vi: Điều bạn muốn đạt được

source: What you will achieve
ar: plaintext ما الذي ستحققه
be: Што вы дасягнеце
da: Hvad du vil opnå
de: Was Sie erreichen werden
es: Lo que lograrás
fr: Ce que vous allez accomplir
id: Apa yang akan Anda capai
it: Quello che otterrai
ja: 達成すること
ms: Perkara yang akan anda capai
no: Hva du vil oppnå
pl: Co osiągniesz
pt: O que você vai alcançar
ru: Что вы достигнете
sv: Vad du kommer att uppnå
th: สิ่งที่คุณจะบรรลุ
tr: Ne elde edeceksiniz
uk: Що ви досягнете
vi: Bạn sẽ đạt được gì?

source: What's new?
de: Was ist neu?
es: ¿Qué hay de nuevo?
id: Apa yang baru?
it: Cosa c'è di nuovo?
ja: 新機能は何ですか？
no: Hva er nytt?
pl: Co nowego?
pt: O que há de novo?
ru: Что нового?
sv: Vad är nytt?
th: มีอะไรใหม่?
tr: Yenilikler neler?
uk: Що нового?
vi: Có gì mới?

source: What’s the price?
ar: ما السعر؟
be: Колькі гэта каштуе?
da: Hvad er prisen?
de: Was kostet es?
es: ¿Cuál es el precio?
fr: Quel est le prix ?
id: Berapa harganya?
it: Qual è il prezzo?
ja: 価格はいくらですか？
no: Hva er prisen?
pl: Jaka jest cena?
pt: Qual é o preço?
ru: Какая цена?
sv: Vad kostar det?
th: ราคาคือเท่าไหร่?
tr: Fiyatı nedir?
uk: Яка ціна?
vi: Giá bao nhiêu?

source: When do you use AsNoTracking and what are the trade-offs?
ar: متى تستخدم AsNoTracking وما هي المقايضات؟
be: Калі варта выкарыстоўваць AsNoTracking і якія існуюць кампрамісы?
da: Hvornår bruger du AsNoTracking, og hvad er fordelene og ulemperne?
de: Wann verwendet man AsNoTracking und welche Kompromisse gibt es?
es: ¿Cuándo se usa AsNoTracking y cuáles son las compensaciones?
fr: Quand utilisez-vous AsNoTracking et quels sont les compromis ?
id: Kapan Anda menggunakan AsNoTracking dan apa saja perdagangannya?
it: Quando usi AsNoTracking e quali sono i compromessi?
ja: AsNoTrackingを使用するのはいつで、どのようなトレードオフがありますか？
ms: Bilakah anda menggunakan AsNoTracking dan apakah komprominya?
no: Når bruker du AsNoTracking, og hva er kompromissene?
pl: Kiedy używasz AsNoTracking i jakie są tego kompromisy?
pt: Quando você usa AsNoTracking e quais são as compensações?
ru: Когда вы используете AsNoTracking и каковы его компромиссы?
sv: När använder du AsNoTracking och vilka är kompromisserna?
th: เมื่อใดที่คุณใช้ AsNoTracking และมีการแลกเปลี่ยนอะไรบ้าง?
tr: AsNoTracking ne zaman kullanılır ve ne gibi ödünleşimler vardır?
uk: Коли ви використовуєте AsNoTracking і які компроміси?
vi: Khi nào bạn sử dụng AsNoTracking và các đánh đổi là gì?
