Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: How would you implement idempotency for POST endpoints to avoid duplicates in distributed systems?
ar: كيف تقوم بتنفيذ خاصية الأيديمبونتسي لنقاط النهاية من نوع POST لتجنب التكرار في الأنظمة الموزعة؟
be: Як бы вы рэалізавалі ідэмпатэнтнасць для POST-канчатковых кропак, каб пазбегнуць дублікатаў у размеркаваных сістэмах?
da: Hvordan ville du implementere idempotens for POST-endpoints for at undgå dubletter i distribuerede systemer?
de: Wie würden Sie Idempotenz für POST-Endpunkte implementieren, um Duplikate in verteilten Systemen zu vermeiden?
es: ¿Cómo implementarías la idempotencia para los endpoints POST para evitar duplicados en sistemas distribuidos?
fr: Comment implémenter l'idempotence pour les points de terminaison POST afin d'éviter les doublons dans les systèmes distribués ?
id: Bagaimana Anda akan mengimplementasikan idempoten untuk endpoint POST guna menghindari duplikasi dalam sistem terdistribusi?
it: Come implementeresti l'idempotenza per gli endpoint POST per evitare duplicati nei sistemi distribuiti?
ja: 分散システムにおいて、重複を回避するためにPOSTエンドポイントで冪等性を実装するにはどうすればよいですか？
ms: Bagaimanakah anda akan melaksanakan idempoten untuk titik hujung POST bagi mengelakkan pendua dalam sistem yang diedarkan?
no: Hvordan ville du implementert idempotens for POST-endepunkter for å unngå duplikater i distribuerte systemer?
pl: Jak zaimplementować idempotencję dla punktów końcowych POST, aby uniknąć duplikatów w systemach rozproszonych?
pt: Como você implementaria idempotência para endpoints POST para evitar duplicatas em sistemas distribuídos?
ru: Как реализовать идемпотентность для конечных точек POST, чтобы избежать дубликатов в распределенных системах?
sv: Hur skulle du implementera idempotens för POST-endpunkter för att undvika dupliceringar i distribuerade system?
th: คุณจะนำหลักการ idempotency มาใช้สำหรับ POST endpoints เพื่อหลีกเลี่ยงข้อมูลซ้ำในระบบที่กระจายศูนย์ได้อย่างไร?
tr: Dağıtık sistemlerde POST uç noktaları için yineleyememe durumunu (idempotency) nasıl uygulardınız?
uk: Як би ви реалізували ідемпотентність для кінцевих точок POST, щоб уникнути дублювання у розподілених системах?
vi: Làm thế nào bạn thực hiện tính chất idempotency cho các điểm cuối POST để tránh trùng lặp trong các hệ thống phân tán?

source: How would you improve performance for a read-heavy endpoint?
ar: كيف يمكن تحسين الأداء لنقطة نهاية تركز على القراءة؟
be: Як вы маглі б палепшыць прадукцыйнасць для канчатковай кропкі з вялікай колькасцю запытаў на чытанне?
da: Hvordan vil du forbedre ydeevnen for en læsetung endepunkt?
de: Wie würden Sie die Leistung für einen leseintensiven Endpunkt verbessern?
es: ¿Cómo mejorarías el rendimiento de un endpoint con muchas lecturas?
fr: Comment amélioreriez-vous les performances d'un point de terminaison à lecture intensive ?
id: Bagaimana Anda akan meningkatkan kinerja untuk endpoint yang banyak membaca?
it: Come miglioreresti le prestazioni per un endpoint con molte letture?
ja: 読み取りが多いエンドポイントのパフォーマンスをどのように改善しますか？
ms: Bagaimana anda akan memperbaiki prestasi untuk titik akhir yang banyak bacaan?
no: Hvordan vil du forbedre ytelsen for et leseintensivt endepunkt?
pl: Jak poprawiłbyś wydajność dla punktu końcowego o dużym natężeniu odczytów?
pt: Como você melhoraria o desempenho de um endpoint com grande carga de leitura?
ru: Как вы бы улучшили производительность для точки с интенсивной нагрузкой на чтение?
sv: Hur skulle du förbättra prestandan för en läsintensiv slutpunkt?
th: คุณจะปรับปรุงประสิทธิภาพของจุดสิ้นสุดที่มีการอ่านหนักได้อย่างไร?
tr: Okuma ağırlıklı bir uç noktasının performansını nasıl artırırsınız?
uk: Як ви покращите продуктивність для кінцевої точки з великою кількістю запитів на читання?
vi: Làm thế nào để cải thiện hiệu suất cho một điểm cuối chủ yếu là đọc?

source: How would you improve the performance of a React app that feels slow?
ar: كيف يمكن تحسين أداء تطبيق React الذي يبدو بطيئًا؟
be: Як палепшыць прадукцыйнасць React дадатку, які здаецца павольным?
da: Hvordan vil du forbedre ydeevnen af en React-app, der føles langsom?
de: Wie würden Sie die Leistung einer React-Anwendung verbessern, die sich langsam anfühlt?
es: ¿Cómo mejorarías el rendimiento de una aplicación React que se siente lenta?
fr: Comment améliorer les performances d'une application React qui semble lente ?
id: Bagaimana Anda akan meningkatkan kinerja aplikasi React yang terasa lambat?
it: Come miglioreresti le prestazioni di un'app React che risulta lenta?
ja: Reactアプリのパフォーマンスが遅いと感じる場合、どのように改善しますか？
ms: Bagaimana anda akan meningkatkan prestasi aplikasi React yang terasa perlahan?
no: Hvordan ville du forbedret ytelsen til en React-app som føles treg?
pl: Jak poprawić wydajność aplikacji React, która działa wolno?
pt: Como você melhoraria o desempenho de um aplicativo React que parece lento?
ru: Как вы бы улучшили производительность React-приложения, которое кажется медленным?
sv: Hur skulle du förbättra prestandan för en React-app som känns långsam?
th: คุณจะปรับปรุงประสิทธิภาพของแอป React ที่รู้สึกว่าช้าได้อย่างไร?
tr: Bir React uygulamasının performansını hızlandırmak için nasıl iyileştirmeler yapardınız?
uk: Як можна покращити продуктивність програми React, яка здається повільною?
vi: Làm thế nào để cải thiện hiệu suất của một ứng dụng React cảm thấy chậm?

source: How would you like to practice?
id: Bagaimana Anda ingin berlatih?
it: Come ti piacerebbe praticare?
ja: どのように練習したいですか？
no: Hvordan vil du øve?
pl: Jak chciałbyś ćwiczyć?
ru: Как бы вы хотели практиковаться?
sv: Hur skulle du vilja öva?
uk: Який тип практики ви віддаєте перевагу?

source: How would you structure state management for a complex application with nested components and async data?
ar: كيف ستقوم بتنظيم إدارة الحالة لتطبيق معقد يحتوي على مكونات متداخلة وبيانات غير متزامنة؟
be: Як бы вы структуравалі кіраванне станам для складанага прыкладання з уключанымі кампанентамі і асінхроннымі данымі?
da: Hvordan ville du strukturere tilstandshåndtering for en kompleks applikation med indlejrede komponenter og asynkrone data?
de: Wie würden Sie das Zustandsmanagement für eine komplexe Anwendung mit verschachtelten Komponenten und asynchronen Daten strukturieren?
es: ¿Cómo estructurarías la gestión del estado para una aplicación compleja con componentes anidados y datos asíncronos?
fr: Comment structureriez-vous la gestion d'état pour une application complexe avec des composants imbriqués et des données asynchrones ?
id: Bagaimana Anda akan menyusun manajemen state untuk aplikasi yang kompleks dengan komponen bersarang dan data asinkron?
it: Come struttureresti la gestione dello stato per un'applicazione complessa con componenti nidificati e dati asincroni?
ja: 複雑なアプリケーションにおける状態管理の構築方法は？特にネストされたコンポーネントと非同期データが含まれる場合。
ms: Bagaimana anda akan menyusun pengurusan keadaan untuk aplikasi kompleks dengan komponen bersarang dan data async?
no: Hvordan ville du strukturert tilstandsadministrasjonen for en kompleks applikasjon med nestede komponenter og asynkrone data?
pl: Jak zorganizowałbyś zarządzanie stanem dla złożonej aplikacji z zagnieżdżonymi komponentami i asynchronicznymi danymi?
pt: Como você estruturaria o gerenciamento de estado para um aplicativo complexo com componentes aninhados e dados assíncronos?
ru: Как вы бы организовали управление состоянием для сложного приложения с вложенными компонентами и асинхронными данными?
sv: Hur skulle du strukturera tillståndshantering för en komplex applikation med nästlade komponenter och asynkron data?
th: คุณจะจัดโครงสร้างการจัดการสถานะสำหรับแอปพลิเคชันที่ซับซ้อนซึ่งมีส่วนประกอบซ้อนและข้อมูลแบบอะซิงโครนัสอย่างไร?
tr: Kompleks bir uygulama için, iç içe geçmiş bileşenler ve asenkron veri ile durum yönetimini nasıl yapılandırırsınız?
uk: Як би ви структуризували управління станом для складного застосунку з вкладеними компонентами та асинхронними даними?
vi: Làm thế nào bạn sẽ cấu trúc quản lý trạng thái cho một ứng dụng phức tạp với các thành phần lồng nhau và dữ liệu không đồng bộ?

source: I accept the
ar: أقبل ال
be: Я прымаю
da: Jeg accepterer
de: Ich akzeptiere die
es: Acepto el
fr: J'accepte le
id: Saya menerima
it: Accetto il
ja: 私は受け入れます
ms: Saya terima
no: Jeg aksepterer
pl: Akceptuję
pt: Eu aceito o
ru: Я принимаю
sv: Jag accepterar
th: ฉันยอมรับ
tr: Kabul ediyorum
uk: Я приймаю
vi: Tôi chấp nhận

source: I agree
ar: أوافق
be: Я згодны
da: Jeg er enig
de: Ich stimme zu
es: Estoy de acuerdo
fr: Je suis d'accord
id: Saya setuju
it: Sono d'accordo
ja: 私は同意します
ms: Saya setuju
no: Jeg er enig
pl: Zgadzam się
pt: Concordo
ru: Я согласен
sv: Jag håller med
th: ฉันยอมรับ
tr: Katılıyorum
uk: Я згоден
vi: Tôi đồng ý
