Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Improving your English speaking skills doesn't have to be complicated. With FluencyPal, anyone can practice confidently and see real progress in minutes, regardless of their current level.
ar: تحسين مهاراتك في التحدث باللغة الإنجليزية لا يجب أن يكون معقدًا. مع FluencyPal، يمكن لأي شخص ممارسة الثقة ورؤية تقدم حقيقي في دقائق، بغض النظر عن مستواه الحالي.
be: Паляпшэнне вашых навыкаў гаварэння на англійскай мове не павінна быць складаным. З дапамогай FluencyPal любы чалавек можа ўпэўнена практыкавацца і бачыць рэальны прагрэс за некалькі хвілін, незалежна ад свайго цяперашняга ўзроўню.
da: At forbedre dine engelsktalende færdigheder behøver ikke at være kompliceret. Med FluencyPal kan alle øve sig trygt og se reel fremgang på få minutter, uanset hvilket niveau de er på.
de: Die Verbesserung Ihrer englischen Sprachfähigkeiten muss nicht kompliziert sein. Mit FluencyPal kann jeder selbstbewusst üben und in kürzester Zeit echten Fortschritt sehen, unabhängig von seinem aktuellen Niveau.
es: Mejorar tus habilidades de habla en inglés no tiene por qué ser complicado. Con FluencyPal, cualquiera puede practicar con confianza y ver un progreso real en minutos, sin importar su nivel actual.
fr: Améliorer vos compétences en expression orale en anglais n'a pas besoin d'être compliqué. Avec FluencyPal, tout le monde peut s'entraîner en toute confiance et constater de réels progrès en quelques minutes, quel que soit leur niveau actuel.
id: Meningkatkan keterampilan berbicara bahasa Inggris Anda tidak harus rumit. Dengan FluencyPal, siapa pun dapat berlatih dengan percaya diri dan melihat kemajuan nyata dalam beberapa menit, terlepas dari tingkat mereka saat ini.
it: Migliorare le tue abilità di conversazione in inglese non deve essere complicato. Con FluencyPal, chiunque può esercitarsi con sicurezza e vedere progressi reali in pochi minuti, indipendentemente dal loro livello attuale.
ja: 英語のスピーキングスキルを向上させることは、複雑である必要はありません。フルーエンシーパルを使えば、現在のレベルに関係なく、誰でも自信を持って練習し、数分で実際の進歩を確認することができます。
no: Å forbedre dine engelsktalende ferdigheter trenger ikke være komplisert. Med FluencyPal kan alle øve trygt og se reelle fremskritt i løpet av minutter, uansett hvilket nivå de er på.
pl: Poprawa umiejętności mówienia po angielsku nie musi być skomplikowana. Dzięki FluencyPal każdy może ćwiczyć z pewnością siebie i zobaczyć realny postęp w ciągu kilku minut, niezależnie od swojego obecnego poziomu.
pt: Melhorar suas habilidades de fala em inglês não precisa ser complicado. Com o FluencyPal, qualquer pessoa pode praticar com confiança e ver um progresso real em minutos, independentemente do seu nível atual.
ru: Улучшение навыков разговорного английского не обязательно должно быть сложным. С FluencyPal каждый может уверенно практиковаться и видеть реальный прогресс за считанные минуты, независимо от их текущего уровня.
sv: Att förbättra dina engelska talfärdigheter behöver inte vara komplicerat. Med FluencyPal kan vem som helst öva med självförtroende och se verkliga framsteg på några minuter, oavsett deras nuvarande nivå.
th: การพัฒนาทักษะการพูดภาษาอังกฤษของคุณไม่จำเป็นต้องซับซ้อน ด้วย FluencyPal ใครๆ ก็สามารถฝึกฝนอย่างมั่นใจและเห็นความก้าวหน้าอย่างแท้จริงภายในไม่กี่นาที ไม่ว่าระดับปัจจุบันของพวกเขาจะเป็นอย่างไร
tr: İngilizce konuşma becerilerinizi geliştirmenin karmaşık olması gerekmez. FluencyPal ile herkes, mevcut seviyesine bakılmaksızın, güvenle pratik yapabilir ve gerçek ilerlemeyi dakikalar içinde görebilir.
uk: Покращення ваших навичок розмовної англійської мови не повинно бути складним. З FluencyPal кожен може впевнено практикуватися та бачити реальний прогрес за лічені хвилини, незалежно від свого поточного рівня.
vi: Cải thiện kỹ năng nói tiếng Anh của bạn không cần phải phức tạp. Với FluencyPal, bất kỳ ai cũng có thể thực hành một cách tự tin và thấy tiến bộ thực sự chỉ trong vài phút, bất kể trình độ hiện tại của họ.

source: In less than 5 minutes, you'll get:
ar: خلال أقل من 5 دقائق، ستحصل على:
be: Менш чым за 5 хвілін вы атрымаеце:
da: Inden for mindre end 5 minutter får du:
de: In weniger als 5 Minuten erhalten Sie:
es: En menos de 5 minutos, obtendrás:
fr: En moins de 5 minutes, vous obtiendrez :
id: Dalam waktu kurang dari 5 menit, Anda akan mendapatkan:
it: In meno di 5 minuti, otterrai:
ja: 5分以内に次のものが得られます：
ms: Dalam masa kurang dari 5 minit, anda akan mendapat:
no: I løpet av mindre enn 5 minutter vil du få:
pl: W mniej niż 5 minut otrzymasz:
pt: Em menos de 5 minutos, você receberá:
ru: Менее чем через 5 минут вы получите:
sv: Inom mindre än 5 minuter kommer du att få:
th: ในเวลาน้อยกว่า 5 นาที คุณจะได้รับ:
tr: 5 dakikadan kısa sürede şunları alacaksınız:
uk: Менш ніж за 5 хвилин ви отримаєте:
vi: Trong chưa đầy 5 phút, bạn sẽ nhận được:

source: In order to generate more lessons, you need to complete at least 3 lessons
ar: لكي تتمكن من إنشاء المزيد من الدروس، يجب عليك إتمام ثلاث دروس على الأقل
be: Каб стварыць больш урокаў, вам трэба завершыць прынамсі 3 урокі.
da: For at generere flere lektioner skal du gennemføre mindst 3 lektioner
de: Um mehr Lektionen zu generieren, müssen Sie mindestens 3 Lektionen absolvieren.
es: Para generar más lecciones, necesita completar al menos 3 lecciones
fr: Pour générer plus de leçons, vous devez compléter au moins 3 leçons
id: Untuk menghasilkan lebih banyak pelajaran, Anda perlu menyelesaikan setidaknya 3 pelajaran
it: Per generare più lezioni, devi completare almeno 3 lezioni
ja: より多くのレッスンを生成するためには、少なくとも3つのレッスンを完了する必要があります
ms: Untuk menghasilkan lebih banyak pelajaran, anda perlu menyelesaikan sekurang-kurangnya 3 pelajaran
no: For å generere flere leksjoner, må du fullføre minst 3 leksjoner
pl: Aby wygenerować więcej lekcji, musisz ukończyć przynajmniej 3 lekcje
pt: Para gerar mais lições, você precisa completar pelo menos 3 lições
ru: Чтобы создать больше уроков, вам нужно выполнить минимум 3 урока
sv: För att generera fler lektioner måste du slutföra minst 3 lektioner
th: เพื่อสร้างบทเรียนเพิ่มเติม คุณต้องสมบูรณ์อย่างน้อย 3 บทเรียน
tr: Daha fazla ders oluşturmak için en az 3 dersi tamamlamanız gerekmektedir.
uk: Щоб генерувати більше уроків, вам потрібно завершити принаймні 3 уроки
vi: Để tạo thêm nhiều bài học, bạn cần hoàn thành ít nhất 3 bài học

source: In React, what's the difference between state and props? Give a simple example.
ar: في React، ما الفرق بين الحالة (state) والخصائص (props)؟ أعطِ مثالاً بسيطاً.
be: У React, якія адрозненні паміж state і props? Прывядзіце просты прыклад.
da: I React, hvad er forskellen mellem state og props? Giv et simpelt eksempel.
de: In React, was ist der Unterschied zwischen State und Props? Gib ein einfaches Beispiel.
es: En React, ¿cuál es la diferencia entre estado y props? Da un ejemplo simple.
fr: Dans React, quelle est la différence entre state et props ? Donnez un exemple simple.
id: Pada React, apa perbedaan antara state dan props? Berikan contoh sederhana.
it: In React, qual è la differenza tra state e props? Fornisci un esempio semplice.
ja: Reactでは、stateとpropsの違いは何ですか？ 簡単な例を挙げてください。
no: I React, hva er forskjellen mellom state og props? Gi et enkelt eksempel.
pl: W React, jaka jest różnica między stanem a właściwościami? Podaj prosty przykład.
pt: No React, qual é a diferença entre estado e props? Dê um exemplo simples.
ru: В React, в чем разница между state и props? Приведите простой пример.
sv: I React, vad är skillnaden mellan state och props? Ge ett enkelt exempel.
th: ใน React ความแตกต่างระหว่าง state กับ props คืออะไร? ยกตัวอย่างง่ายๆ
tr: txt React'te state ve props arasındaki fark nedir? Basit bir örnek verin.
uk: У React, яка різниця між state і props? Наведіть простий приклад.
vi: Trong React, sự khác biệt giữa state và props là gì? Cho một ví dụ đơn giản.

source: In the next step, you'll need to record audio. Please verify your microphone is ready and allow access when asked.
ar: في الخطوة التالية، ستحتاج إلى تسجيل الصوت. يرجى التأكد من أن الميكروفون جاهز والسماح بالوصول عند الطلب.
be: На наступным кроку вам трэба будзе запісаць аўдыя. Калі ласка, пераканайцеся, што ваш мікрафон гатовы, і дазвольце доступ, калі вас папросяць.
da: I det næste trin skal du optage lyd. Bekræft venligst, at din mikrofon er klar, og tillad adgang, når du bliver spurgt.
de: Im nächsten Schritt müssen Sie Audio aufnehmen. Bitte überprüfen Sie, ob Ihr Mikrofon bereit ist, und erteilen Sie Zugriff, wenn Sie dazu aufgefordert werden.
es: En el siguiente paso, necesitarás grabar audio. Por favor, verifica que tu micrófono esté listo y permite el acceso cuando se te solicite.
fr: Dans l'étape suivante, vous devrez enregistrer l'audio. Veuillez vérifier que votre microphone est prêt et autorisez l'accès lorsqu'on vous le demande.
id: Pada langkah berikutnya, Anda perlu merekam audio. Silakan pastikan mikrofon Anda siap dan izinkan akses saat diminta.
it: Nel passaggio successivo, dovrai registrare dell'audio. Verifica che il tuo microfono sia pronto e consenti l'accesso quando richiesto.
ja: 次のステップでは、音声を録音する必要があります。マイクの準備ができていることを確認し、アクセスの許可を求められた際には許可してください。
ms: Dalam langkah seterusnya, anda perlu merakam audio. Sila pastikan mikrofon anda siap dan benarkan akses apabila diminta.
no: I neste trinn må du ta opp lyd. Vennligst sjekk at mikrofonen din er klar og tillat tilgang når du blir spurt.
pl: W następnym kroku będziesz musiał nagrać dźwięk. Upewnij się, że twój mikrofon jest gotowy i zezwól na dostęp, gdy zostaniesz o to poproszony.
pt: No próximo passo, você precisará gravar áudio. Por favor, verifique se o seu microfone está pronto e permita o acesso quando solicitado.
ru: На следующем этапе вам нужно будет записать аудио. Пожалуйста, убедитесь, что ваш микрофон готов, и предоставьте доступ, когда вас попросят.
sv: I nästa steg behöver du spela in ljud. Vänligen kontrollera att din mikrofon är redo och ge tillåtelse när du blir tillfrågad.
th: ในขั้นตอนถัดไป คุณจำเป็นต้องบันทึกเสียง โปรดตรวจสอบว่าไมโครโฟนของคุณพร้อมแล้วและยอมรับการเข้าถึงเมื่อมีการร้องขอ
tr: Sonraki adımda ses kaydı yapmanız gerekecek. Lütfen mikrofonunuzun hazır olduğunu doğrulayın ve sorulduğunda erişime izin verin.
uk: На наступному кроці вам потрібно буде записати аудіо. Будь ласка, переконайтеся, що ваш мікрофон готовий, і дозвольте доступ, коли вас про це запитають.
vi: Trong bước tiếp theo, bạn sẽ cần ghi âm. Vui lòng kiểm tra xem micro của bạn đã sẵn sàng chưa và cho phép truy cập khi được yêu cầu.

source: In the next step, you'll record audio. Please check your microphone and allow access when asked.
ar: في الخطوة التالية، ستقوم بتسجيل الصوت. يرجى التحقق من الميكروفون والسماح بالوصول عند الطلب.
be: На наступным этапе вы будзеце запісваць аўдыё. Калі будзе прапанавана, праверце ваш мікрафон і дазвольце доступ.
da: I det næste trin optager du lyd. Kontroller venligst din mikrofon og giv adgang, når der bliver spurgt.
de: Im nächsten Schritt nehmen Sie Audio auf. Bitte überprüfen Sie Ihr Mikrofon und erlauben Sie den Zugriff, wenn Sie dazu aufgefordert werden.
es: En el siguiente paso, grabarás audio. Por favor, revisa tu micrófono y permite el acceso cuando se te solicite.
fr: Dans l'étape suivante, vous enregistrerez de l'audio. Veuillez vérifier votre microphone et autoriser l'accès lorsqu'il vous sera demandé.
id: Pada langkah berikutnya, Anda akan merekam audio. Silakan periksa mikrofon Anda dan izinkan akses ketika diminta.
it: Nel passaggio successivo, registrerai l'audio. Controlla il tuo microfono e consenti l'accesso quando richiesto.
ja: 次のステップでは、音声を録音します。マイクを確認し、アクセスを求められた際には許可してください。
no: I neste trinn vil du spille inn lyd. Vennligst sjekk mikrofonen din og tillat tilgang når du blir spurt.
pl: W następnym kroku nagrasz dźwięk. Sprawdź swój mikrofon i zezwól na dostęp, gdy zostaniesz o to poproszony.
pt: No próximo passo, você gravará áudio. Por favor, verifique seu microfone e permita o acesso quando solicitado.
ru: На следующем этапе вы будете записывать аудио. Пожалуйста, проверьте ваш микрофон и предоставьте доступ, когда вас об этом попросят.
sv: I nästa steg kommer du att spela in ljud. Vänligen kontrollera din mikrofon och ge tillåtelse när du tillfrågas.
th: ในขั้นตอนถัดไป คุณจะบันทึกเสียง โปรดตรวจสอบไมโครโฟนของคุณและอนุญาตการเข้าถึงเมื่อมีการขอ
tr: Bir sonraki adımda ses kaydı yapacaksınız. Lütfen mikrofonunuzu kontrol edin ve istendiğinde erişime izin verin.
uk: На наступному кроці ви запишете аудіо. Будь ласка, перевірте свій мікрофон і надайте доступ, коли вас попросять.
vi: Trong bước tiếp theo, bạn sẽ ghi âm thanh. Vui lòng kiểm tra micro của bạn và cho phép truy cập khi được yêu cầu.

source: In the Restaurant
ar: في المطعم
be: У рэстаране
da: I Restauranten
de: Im Restaurant
es: En el Restaurante
fr: Dans le restaurant
id: Di Restoran
it: Nel Ristorante
ja: レストランで
ms: Di Restoran
no: I restauranten
pl: W restauracji
pt: No Restaurante
ru: В ресторане
sv: I restaurangen
th: ในร้านอาหาร
tr: Restoranda
uk: В ресторані
vi: Trong nhà hàng
