Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: FluencyPal offers several learning modes: Casual Conversation for uninterrupted speaking practice, Talk & Correct for instant grammar and pronunciation feedback, Role-Play Scenarios for real-life situations, as well as grammar practice, vocabulary building, and progress tracking.
ar: يوفر FluencyPal عدة أوضاع تعليمية: محادثة غير رسمية لممارسة التحدث بدون انقطاع، تحدث وصحح للحصول على ملاحظات فورية حول القواعد والنطق، سيناريوهات لعب الأدوار للمواقف الحقيقية، بالإضافة إلى ممارسة القواعد، وبناء المفردات، وتتبع التقدم.
be: FluencyPal прапануе некалькі рэжымаў навучання: Нефармальная размова для бесперапыннай практыкі гутарковай мовы, Размова & Карэкцыя для імгненнай зваротнай сувязі па граматыцы і вымаўленні, Сцэнарыі Ролевай Гульні для сітуацый з рэальнага жыцця, а таксама практыка граматыкі, папаўненне слоўнікавага запасу і адсочванне прагрэсу.
da: FluencyPal tilbyder flere læringstilstande: Uformel Samtale for uafbrudt taletræning, Tal & Ret for øjeblikkelig feedback på grammatik og udtale, Rollespilsscenarier for virkelige situationer, samt grammatikøvelser, ordforrådsopbygning og fremskridtssporing.
de: FluencyPal bietet mehrere Lernmodi: Ungezwungenes Gespräch für ununterbrochene Sprechpraxis, Sprechen & Korrigieren für sofortiges Feedback zur Grammatik und Aussprache, Rollenspielszenarien für reale Situationen sowie Grammatikübungen, Wortschatzaufbau und Fortschrittsverfolgung.
es: FluencyPal ofrece varios modos de aprendizaje: Conversación Casual para practicar el habla sin interrupciones, Habla y Corrige para recibir retroalimentación instantánea sobre gramática y pronunciación, Escenarios de Juego de Roles para situaciones de la vida real, así como práctica de gramática, desarrollo de vocabulario y seguimiento del progreso.
fr: FluencyPal offre plusieurs modes d'apprentissage : Conversation informelle pour une pratique de parole ininterrompue, Parler et Corriger pour un retour instantané sur la grammaire et la prononciation, Scénarios de jeu de rôle pour des situations réelles, ainsi que des exercices de grammaire, l'enrichissement du vocabulaire, et le suivi des progrès.
id: FluencyPal menawarkan beberapa mode pembelajaran: Percakapan Santai untuk latihan berbicara tanpa gangguan, Bicara & Koreksi untuk umpan balik segera tentang tata bahasa dan pengucapan, Skenario Bermain Peran untuk situasi kehidupan nyata, serta latihan tata bahasa, membangun kosakata, dan pelacakan kemajuan.
it: FluencyPal offre diverse modalità di apprendimento: Conversazione Casual per una pratica di conversazione senza interruzioni, Parla & Correggi per un feedback istantaneo su grammatica e pronuncia, Scenari di Ruolo per situazioni reali, nonché pratica grammaticale, ampliamento del vocabolario e monitoraggio dei progressi.
ja: FluencyPal は、途切れることのないスピーキング練習のためのカジュアル会話モード、文法や発音の即時フィードバックを受けられるトーク & コレクト、実生活の状況を想定したロールプレイシナリオ、さらに文法練習、語彙の強化、進捗の追跡といった複数の学習モードを提供します。
no: FluencyPal tilbyr flere læringsmoduser: Uformell Samtale for uavbrutt taleøvelse, Snakk & Korriger for umiddelbare tilbakemeldinger på grammatikk og uttale, Rollespillscenarier for virkelige situasjoner, så vel som grammatikkøvelse, ordforrådsbygging og fremdriftssporing.
pl: FluencyPal oferuje kilka trybów nauki: Swobodną Konwersację do nieprzerwanej praktyki mówienia, Rozmowę i Korektę do natychmiastowego feedbacku dotyczącego gramatyki i wymowy, Scenariusze Odgrywania Ról w sytuacjach z życia codziennego, a także ćwiczenia gramatyczne, budowanie słownictwa i śledzenie postępów.
pt: FluencyPal oferece vários modos de aprendizagem: Conversa Casual para prática de fala ininterrupta, Falar & Corrigir para feedback instantâneo de gramática e pronúncia, Cenários de Role-Play para situações da vida real, além de prática de gramática, construção de vocabulário e acompanhamento de progresso.
ru: FluencyPal предлагает несколько режимов обучения: Непринужденная беседа для непрерывной тренировки говорения, Говорите и исправляйте для мгновенной обратной связи по грамматике и произношению, Сценарии ролевых игр для реальных ситуаций, а также практику грамматики, расширение словарного запаса и отслеживание прогресса.
sv: FluencyPal erbjuder flera inlärningslägen: Ledig konversation för oavbruten talövning, Prata & Korrigera för omedelbar feedback på grammatik och uttal, Rollspelscenarier för verkliga situationer, samt grammatikövning, ordförrådsutveckling och framstegsspårning.
th: FluencyPal มีโหมดการเรียนรู้หลายแบบ: บทสนทนาแบบกันเองสำหรับการฝึกพูดโดยไม่หยุดยั้ง, พูด & แก้ไขสำหรับคำแนะนำไวยากรณ์และการออกเสียงทันที, สถานการณ์จำลองบทบาทสำหรับสถานการณ์จริง, รวมถึงการฝึกไวยากรณ์, การสร้างคำศัพท์, และการติดตามความก้าวหน้า.
tr: FluencyPal, kesintisiz konuşma pratiği için Günlük Konuşma, anlık dilbilgisi ve telaffuz geri bildirimi için Konuş & Düzelt, gerçek yaşam durumları için Rol-Oynama Senaryoları, ayrıca dilbilgisi pratiği, kelime dağarcığı geliştirme ve ilerleme takibi gibi çeşitli öğrenme modları sunar.
uk: FluencyPal пропонує кілька режимів навчання: Невимушена розмова для безперервної практики мовлення, Розмова та Корекція для миттєвого зворотного зв'язку щодо граматики та вимови, Рольові сценарії для реальних ситуацій, а також практика граматики, збагачення словникового запасу та відстеження прогресу.
vi: FluencyPal cung cấp nhiều chế độ học tập: Hội thoại Thông thường để thực hành nói không bị gián đoạn, Nói & Sửa để nhận phản hồi ngay lập tức về ngữ pháp và phát âm, Tình huống Đóng vai cho các tình huống thực tế, cũng như thực hành ngữ pháp, xây dựng từ vựng, và theo dõi tiến trình.

source: FluencyPal stores conversation transcripts in its database to improve your learning experience. You can permanently delete your personal data at any time from the app settings. Voice processing is handled using OpenAI services, and FluencyPal does not store your voice recordings. Webcam data is not stored either — it is processed in real time by the AI and then immediately discarded.
ar: يقوم FluencyPal بتخزين نصوص المحادثات في قاعدة بياناته لتحسين تجربة التعلم الخاصة بك. يمكنك حذف بياناتك الشخصية بشكل دائم في أي وقت من إعدادات التطبيق. تتم معالجة الصوت باستخدام خدمات OpenAI، ولا يقوم FluencyPal بتخزين تسجيلات صوتك. كما أن بيانات الكاميرا لا تُخزن أيضًا — حيث يتم معالجتها في الوقت الحقيقي بواسطة الذكاء الاصطناعي ثم يتم التخلص منها فورًا.
be: FluencyPal захоўвае стэнаграмы размоў у сваёй базе даных, каб палепшыць ваш вопыт навучання. Вы заўсёды можаце назаўсёды выдаліць вашыя асабістыя даныя з налад прыкладання. Апрацоўка галасу ажыццяўляецца з дапамогай службаў OpenAI, і FluencyPal не захоўвае вашыя галасавыя запісы. Дадзеныя з вэб-камеры таксама не захоўваюцца — яны апрацоўваюцца ў рэальным часе AI і затым неадкладна выдаляюцца.
da: FluencyPal gemmer samtaletransskriptioner i sin database for at forbedre din læringsoplevelse. Du kan permanent slette dine personlige data når som helst fra app-indstillingerne. Stemmebehandling håndteres ved hjælp af OpenAI-tjenester, og FluencyPal gemmer ikke dine stemmeoptagelser. Webcam-data gemmes heller ikke — det behandles i realtid af AI'en og bliver derefter straks kasseret.
de: FluencyPal speichert Gesprächstranskripte in seiner Datenbank, um Ihr Lernerlebnis zu verbessern. Sie können Ihre persönlichen Daten jederzeit in den App-Einstellungen dauerhaft löschen. Die Sprachverarbeitung erfolgt über OpenAI-Dienste, und FluencyPal speichert Ihre Sprachaufzeichnungen nicht. Webcam-Daten werden ebenfalls nicht gespeichert — sie werden in Echtzeit von der KI verarbeitet und dann sofort verworfen.
es: FluencyPal almacena transcripciones de conversaciones en su base de datos para mejorar su experiencia de aprendizaje. Puede eliminar permanentemente sus datos personales en cualquier momento desde la configuración de la aplicación. El procesamiento de voz se lleva a cabo utilizando servicios de OpenAI, y FluencyPal no almacena sus grabaciones de voz. Los datos de la cámara web tampoco se almacenan; son procesados en tiempo real por la IA y luego se descartan inmediatamente.
fr: FluencyPal stocke les transcriptions des conversations dans sa base de données pour améliorer votre expérience d'apprentissage. Vous pouvez supprimer définitivement vos données personnelles à tout moment dans les paramètres de l'application. Le traitement vocal est géré à l'aide des services d'OpenAI, et FluencyPal ne stocke pas vos enregistrements vocaux. Les données de la webcam ne sont pas non plus stockées — elles sont traitées en temps réel par l'IA puis immédiatement supprimées.
id: FluencyPal menyimpan transkrip percakapan dalam databasenya untuk meningkatkan pengalaman belajar Anda. Anda dapat menghapus data pribadi Anda secara permanen kapan saja dari pengaturan aplikasi. Pemrosesan suara dilakukan menggunakan layanan OpenAI, dan FluencyPal tidak menyimpan rekaman suara Anda. Data webcam juga tidak disimpan — data tersebut diproses secara real-time oleh AI dan kemudian segera dihapus.
it: FluencyPal archivia le trascrizioni delle conversazioni nel suo database per migliorare la tua esperienza di apprendimento. Puoi eliminare definitivamente i tuoi dati personali in qualsiasi momento dalle impostazioni dell'app. L'elaborazione vocale viene gestita utilizzando i servizi di OpenAI, e FluencyPal non memorizza le tue registrazioni vocali. I dati della webcam non vengono memorizzati nemmeno — vengono elaborati in tempo reale dall'AI e poi immediatamente eliminati.
ja: FluencyPalは、学習体験を向上させるために会話の文字起こしをデータベースに保存します。アプリの設定からいつでも個人データを永久に削除することができます。音声処理はOpenAIのサービスを利用して行われ、FluencyPalは音声録音を保存しません。ウェブカメラのデータも保存されず、AIによってリアルタイムで処理され、その後すぐに破棄されます。
no: FluencyPal lagrer samtaleutskrifter i sin database for å forbedre din læringsopplevelse. Du kan permanent slette dine personlige data når som helst fra appinnstillingene. Stemmebehandling håndteres ved bruk av OpenAI-tjenester, og FluencyPal lagrer ikke dine stemmeopptak. Webkameradata lagres heller ikke — de behandles i sanntid av AI-en og deretter straks forkastes.
pl: FluencyPal przechowuje transkrypcje rozmów w swojej bazie danych, aby poprawić Twoje doświadczenia w nauce. Możesz trwale usunąć swoje dane osobowe w dowolnym momencie w ustawieniach aplikacji. Przetwarzanie głosu odbywa się za pomocą usług OpenAI, a FluencyPal nie przechowuje nagrań Twojego głosu. Dane z kamery internetowej również nie są przechowywane — są przetwarzane w czasie rzeczywistym przez AI, a następnie natychmiast usuwane.
pt: O FluencyPal armazena transcrições de conversas em seu banco de dados para melhorar sua experiência de aprendizagem. Você pode excluir permanentemente seus dados pessoais a qualquer momento nas configurações do aplicativo. O processamento de voz é realizado usando os serviços da OpenAI, e o FluencyPal não armazena suas gravações de voz. Dados da webcam também não são armazenados — eles são processados em tempo real pela IA e, em seguida, descartados imediatamente.
ru: FluencyPal сохраняет расшифровки разговоров в своей базе данных для улучшения вашего опыта обучения. Вы можете навсегда удалить свои личные данные в любое время в настройках приложения. Обработка голоса осуществляется с использованием сервисов OpenAI, и FluencyPal не хранит ваши голосовые записи. Данные с веб-камер также не сохраняются — они обрабатываются в реальном времени AI, а затем сразу удаляются.
sv: FluencyPal lagrar samtalstranskript i sin databas för att förbättra din inlärningsupplevelse. Du kan permanent radera dina personuppgifter när som helst från appinställningarna. Röstbearbetning hanteras med OpenAI-tjänster, och FluencyPal lagrar inte dina röstinspelningar. Webbkameradata lagras inte heller — de bearbetas i realtid av AI och raderas omedelbart därefter.
th: FluencyPal เก็บบันทึกการสนทนาในฐานข้อมูลเพื่อพัฒนาประสบการณ์การเรียนรู้ของคุณ คุณสามารถลบข้อมูลส่วนตัวของคุณได้ตลอดเวลาในแอปการตั้งค่า การประมวลผลเสียงใช้บริการของ OpenAI และ FluencyPal จะไม่เก็บบันทึกเสียงของคุณ ข้อมูลจากเว็บแคมจะไม่ถูกเก็บเช่นกัน — ข้อมูลจะถูกประมวลผลแบบเรียลไทม์โดย AI และจะถูกลบทันที
tr: FluencyPal, öğrenme deneyiminizi geliştirmek için konuşma transkriptlerini veritabanında saklar. Uygulama ayarlarından kişisel verilerinizi istediğiniz zaman kalıcı olarak silebilirsiniz. Ses işleme OpenAI hizmetleri kullanılarak gerçekleştirilir ve FluencyPal ses kayıtlarınızı saklamaz. Webcam verileri de saklanmaz — AI tarafından gerçek zamanlı olarak işlenir ve ardından hemen silinir.
uk: FluencyPal зберігає стенограми розмов у своїй базі даних, щоб покращити ваш досвід навчання. Ви можете назавжди видалити свої особисті дані у будь-який час з налаштувань застосунку. Обробка голосу здійснюється за допомогою сервісів OpenAI, а FluencyPal не зберігає ваші голосові записи. Дані з веб-камери також не зберігаються — вони обробляються штучним інтелектом в реальному часі та одразу видаляються.
vi: FluencyPal lưu trữ bản ghi hội thoại trong cơ sở dữ liệu của mình để cải thiện trải nghiệm học tập của bạn. Bạn có thể xóa vĩnh viễn dữ liệu cá nhân của mình bất kỳ lúc nào từ cài đặt ứng dụng. Quá trình xử lý giọng nói được thực hiện bằng các dịch vụ của OpenAI, và FluencyPal không lưu trữ bản ghi giọng nói của bạn. Dữ liệu webcam cũng không được lưu trữ — nó được xử lý theo thời gian thực bởi AI và sau đó bị loại bỏ ngay lập tức.

source: FluencyPal tracks your activity and completed tasks over time. As you practice regularly, conversations become more complex and feedback adapts to your level, helping you notice improvements in fluency, confidence, and accuracy.
ar: يتتبع FluencyPal نشاطك والمهام المكتملة مع مرور الوقت. مع ممارستك بانتظام، تصبح المحادثات أكثر تعقيدًا ويتكيف التغذية الراجعة مع مستواك، مما يساعدك على ملاحظة التحسن في الطلاقة والثقة والدقة.
be: FluencyPal адсочвае вашу актыўнасць і выкананыя заданні з цягам часу. Па меры таго, як вы рэгулярна практыкуецеся, размовы становяцца больш складанымі, а зваротная сувязь адаптуецца да вашага ўзроўню, дапамагаючы вам заўважаць паляпшэнні ў бегласці, упэўненасці і дакладнасці.
da: FluencyPal sporer din aktivitet og gennemførte opgaver over tid. Efterhånden som du øver regelmæssigt, bliver samtalerne mere komplekse, og feedback tilpasser sig dit niveau, hvilket hjælper dig med at bemærke forbedringer i flydende tale, selvtillid og nøjagtighed.
de: FluencyPal verfolgt Ihre Aktivität und abgeschlossenen Aufgaben über die Zeit. Während Sie regelmäßig üben, werden die Gespräche komplexer und das Feedback passt sich Ihrem Niveau an, was Ihnen hilft, Verbesserungen in Flüssigkeit, Selbstvertrauen und Genauigkeit zu bemerken.
es: FluencyPal realiza un seguimiento de tu actividad y las tareas completadas a lo largo del tiempo. A medida que practicas regularmente, las conversaciones se vuelven más complejas y la retroalimentación se adapta a tu nivel, ayudándote a notar mejoras en fluidez, confianza y precisión.
fr: FluencyPal suit votre activité et les tâches accomplies au fil du temps. Au fur et à mesure que vous pratiquez régulièrement, les conversations deviennent plus complexes et les retours s'adaptent à votre niveau, vous aidant à remarquer des améliorations en termes de fluidité, de confiance et de précision.
id: FluencyPal melacak aktivitas dan tugas yang telah Anda selesaikan seiring waktu. Seiring Anda berlatih secara teratur, percakapan menjadi lebih kompleks dan umpan balik menyesuaikan dengan level Anda, membantu Anda melihat peningkatan dalam kefasihan, kepercayaan diri, dan ketepatan.
it: FluencyPal traccia la tua attività e i compiti completati nel tempo. Man mano che pratichi regolarmente, le conversazioni diventano più complesse e il feedback si adatta al tuo livello, aiutandoti a notare miglioramenti in fluidità, sicurezza e accuratezza.
ja: FluencyPalは、時間の経過とともにあなたのアクティビティと完了したタスクを追跡します。定期的に練習することで、会話はより複雑になり、フィードバックはあなたのレベルに応じて適応し、流暢さ、自信、正確さの向上を実感しやすくなります。
no: FluencyPal sporer aktiviteten din og fullførte oppgaver over tid. Når du øver regelmessig, blir samtalene mer komplekse, og tilbakemeldingen tilpasser seg ditt nivå, noe som hjelper deg å merke forbedringer i flyt, selvtillit og nøyaktighet.
pl: FluencyPal śledzi Twoją aktywność i wykonane zadania w czasie. W miarę regularnego ćwiczenia, rozmowy stają się bardziej złożone, a opinie dostosowują się do Twojego poziomu, pomagając Ci zauważyć poprawę w płynności, pewności siebie i dokładności.
pt: FluencyPal acompanha sua atividade e tarefas concluídas ao longo do tempo. À medida que você pratica regularmente, as conversas se tornam mais complexas e o feedback se adapta ao seu nível, ajudando você a perceber melhorias na fluência, confiança e precisão.
ru: FluencyPal отслеживает вашу активность и выполненные задания с течением времени. По мере того как вы регулярно практикуетесь, разговоры становятся более сложными, а обратная связь адаптируется к вашему уровню, помогая вам замечать улучшения в беглости, уверенности и точности.
sv: FluencyPal spårar din aktivitet och slutförda uppgifter över tid. När du övar regelbundet blir konversationerna mer komplexa och feedback anpassas till din nivå, vilket hjälper dig att märka förbättringar i flyt, förtroende och noggrannhet.
th: FluencyPal ติดตามกิจกรรมและงานที่คุณทำเสร็จเรียบร้อยตามกาลเวลา เมื่อคุณฝึกฝนอย่างสม่ำเสมอ การสนทนาจะมีความซับซ้อนขึ้นและคำติชมจะปรับให้เหมาะสมกับระดับของคุณ ซึ่งช่วยให้คุณสังเกตเห็นการพัฒนาในด้านความคล่องแคล่ว ความมั่นใจ และความถูกต้อง
tr: FluencyPal, zamanla etkinliklerinizi ve tamamlanan görevlerinizi takip eder. Düzenli olarak pratik yaptıkça, sohbetler daha karmaşık hale gelir ve geri bildirim seviyenize göre uyum sağlar. Bu da akıcılık, güven ve doğruluk konularında gelişmeleri fark etmenize yardımcı olur.
uk: FluencyPal відстежує вашу активність і виконані завдання з часом. Завдяки регулярній практиці, розмови стають більш складними, а зворотний зв'язок адаптується до вашого рівня, допомагаючи помічати покращення в біглості, впевненості та точності.
vi: FluencyPal theo dõi hoạt động và nhiệm vụ đã hoàn thành của bạn theo thời gian. Khi bạn luyện tập thường xuyên, các cuộc trò chuyện trở nên phức tạp hơn và phản hồi được điều chỉnh phù hợp với trình độ của bạn, giúp bạn nhận ra sự cải thiện về độ lưu loát, sự tự tin và độ chính xác.

source: FluencyPal – AI English Speaking Practice for Fluency & Confidence
ar: FluencyPal – ممارسة التحدث باللغة الإنجليزية باستخدام الذكاء الصناعي لتحقيق الطلاقة والثقة
be: FluencyPal - Практыка англійскай мовы з ШІ для ведання і самаўпэўненасці
da: FluencyPal – AI Engelsk Taletræning til Flydende Sprog og Selvtillid
de: FluencyPal – KI Englisch Sprechpraxis für fließende Sprache und Selbstbewusstsein
es: FluencyPal – Práctica de Conversación en Inglés con IA para Fluidez y Confianza
fr: FluencyPal – Pratique de l'anglais avec IA pour la fluidité et la confiance
id: FluencyPal – Praktik Berbicara Bahasa Inggris AI untuk Kelancaran & Kepercayaan Diri
it: FluencyPal – Pratica di Parlare Inglese con AI per Fluidità e Fiducia
ja: FluencyPal – 流暢さと自信のためのAI英語スピーキング練習
ms: FluencyPal – Amalan Berbicara Bahasa Inggeris AI untuk Kefasihan & Keyakinan
no: FluencyPal – AI Engelsk Taletraining for Flyt og Selvtillit
pl: FluencyPal – AI do praktyki mówienia po angielsku dla płynności i pewności siebie
pt: FluencyPal – Prática de Fala em Inglês com IA para Fluência e Confiança
ru: FluencyPal – ИИ для практики разговорного английского для беглости и уверенности
sv: FluencyPal – AI-engelsk talövning för flyt och självförtroende
th: FluencyPal – การฝึกพูดภาษาอังกฤษด้วย AI เพื่อความคล่องแคล่วและความมั่นใจ
tr: FluencyPal – Akıcılık ve Güven için AI İngilizce Konuşma Uygulaması
uk: FluencyPal – Штучний інтелект для практики англійської мови для вільності та впевненості
vi: FluencyPal – AI Luyện Nói Tiếng Anh untuk Sự Lưu Loát & Tự Tin

source: FluencyPal – Your AI English Speaking Partner
ar: FluencyPal – شريكك الذكي في المحادثة باللغة الإنجليزية
be: FluencyPal – Ваш партнёр па ангельскай мове AI
da: FluencyPal – Din AI Engelsk Talende Partner
de: FluencyPal – Ihr KI Englisch sprechender Partner
es: FluencyPal – Tu Socio de Conversación en Inglés AI
fr: FluencyPal – Votre partenaire IA pour parler anglais
id: FluencyPal – Mitra Berbicara Bahasa Inggris AI Anda
it: FluencyPal – Il tuo partner di conversazione in inglese basato sull'IA
ja: FluencyPal – あなたのAI英会話パートナー
ms: FluencyPal – Rakan Berbicara Bahasa Inggeris AI Anda
no: FluencyPal – Din AI engelske samtalepartner
pl: FluencyPal – Twój AI partner do mówienia po angielsku
pt: FluencyPal – Seu Parceiro de Conversação em Inglês com IA
ru: FluencyPal – Ваш AI партнер для общения на английском
sv: FluencyPal – Din AI-engelska talpartner
th: FluencyPal – คู่สนทนาภาษาอังกฤษ AI ของคุณ
tr: FluencyPal – Yapay Zeka İngilizce Konuşma Ortağın
uk: FluencyPal – Ваш партнер з англійської мови на базі штучного інтелекту
vi: FluencyPal – Đối tác Nói tiếng Anh AI của bạn

source: Focus on shipping reliable services
ar: ركز على تقديم خدمات موثوقة
be: Скарыстайцеся дастаўкай надзейных паслуг
da: Fokuser på at levere pålidelige tjenester
de: Fokus auf die Bereitstellung zuverlässiger Dienstleistungen
es: Concéntrese en ofrecer servicios confiables
fr: Concentrez-vous sur la livraison de services fiables
id: Fokus pada pengiriman layanan yang andal
it: Concentrati sulla fornitura di servizi affidabili
ja: 信頼性の高いサービスの提供に注力する
ms: Fokus pada penghantaran perkhidmatan yang boleh dipercayai
no: Fokus på å levere pålitelige tjenester
pl: Skup się na dostarczaniu niezawodnych usług
pt: Concentre-se em fornecer serviços confiáveis
ru: Сосредоточьтесь на предоставлении надежных услуг
sv: Fokusera på att leverera tillförlitliga tjänster
th: มุ่งเน้นการส่งมอบบริการที่เชื่อถือได้
tr: Güvenilir hizmetlerin teslimatına odaklanın
uk: Зосередьтеся на наданні надійних послуг
vi: Tập trung vào việc cung cấp dịch vụ đáng tin cậy
