Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Korean Learning Plan
ar: خطة تعلم الكورية
be: План вучэбы карэйскай мовы
da: Koreansk Læringsplan
de: Koreanischer Lernplan
es: Plan de Aprendizaje Coreano
fr: Plan d'apprentissage coréen
id: Rencana Belajar Bahasa Korea
it: Piano di Apprendimento Coreano
ja: 韓国語学習プラン
ms: Rancangan Pembelajaran Korea
no: Koreansk Læringsplan
pl: Plan Nauki Koreńskiego
pt: Plano de Aprendizado de Coreano
ru: План обучения корейскому языку
sv: Koreansk Inlärningsplan
th: แผนการเรียนรู้ภาษาเกาหลี
tr: Korece Öğrenme Planı
uk: План вивчення корейської
vi: Kế Hoạch Học Tiếng Hàn

source: Lack of politeness — Use *please*, *thank you*, *excuse me* as needed.
ar: نقص في الأدب — استخدم *من فضلك*، *شكراً*، *عفواً* عند الحاجة.
be: Нехаплівасць — Выкарыстоўвайце *калі ласка*, *дзякуй*, *выбачце* калі гэта неабходна.
da: Mangel på høflighed — Brug *vær så venlig*, *tak*, *undskyld mig* efter behov.
de: Mangel an Höflichkeit — Verwenden Sie bei Bedarf *bitte*, *danke*, *Entschuldigung*.
es: Falta de cortesía — Use *por favor*, *gracias*, *disculpe* según sea necesario.
fr: Manque de politesse — Utilisez *s'il vous plaît*, *merci*, *excusez-moi* selon le besoin.
id: Kekurangan sopan santun — Gunakan *tolong*, *terima kasih*, *maaf* sebagaimana diperlukan.
it: Mancanza di cortesia — Usa *per favore*, *grazie*, *mi scuso* quando necessario.
ja: 礼儀の欠如 - 必要に応じて*お願いします*、*ありがとうございます*、*すみません*を使用してください。
ms: Kurang sopan — Gunakan *sila*, *terima kasih*, *maafkan saya* jika perlu.
no: Mangel på høflighet — Bruk *vær så snill*, *takk*, *unnskyld meg* etter behov.
pl: Brak uprzejmości — Używaj *proszę*, *dziękuję*, *przepraszam* w razie potrzeby.
pt: Falta de cortesia — Use *por favor*, *obrigado*, *com licença* conforme necessário.
ru: Недостаток вежливости — Используйте *пожалуйста*, *спасибо*, *извините* по мере необходимости.
sv: Brist på artighet — Använd *snälla*, *tack*, *ursäkta mig* vid behov.
th: ขาดการสุภาพ — ใช้ *กรุณา* , *ขอบคุณ* , *ขอโทษ* ตามที่ต้องการ.
tr: Nezaket eksikliği — Gerektiği gibi *lütfen*, *teşekkür ederim*, *affedersiniz* kullanın.
uk: Недостаток ввічливості - Використовуйте *будь ласка*, *дякую*, *вибачте* за потреби.
vi: Thiếu lịch sự — Sử dụng *xin vui lòng*, *cảm ơn*, *xin lỗi* khi cần thiết.

source: Landing Your First Dev Job Is Harder Than It Should Be
ar: النجاح في الحصول على أول وظيفة تطوير أصعب مما ينبغي
be: Атрымаць першую працу распрацоўшчыка цяжэй, чым яна павінна быць
da: At lande dit første udvikler-job er sværere end det burde være
de: Landing Your First Dev Job Is Harder Than It Should Be Der Erhalt Ihres ersten Entwicklerjobs ist schwieriger, als es sein sollte.
es: Aterrizar tu primer trabajo como desarrollador es más difícil de lo que debería ser
fr: Chercher et Obtenir un Premier Emploi en Développement est Plus Difficile qu'il ne Devrait l'Être
id: Mendapatkan Pekerjaan Dev Pertama Anda Lebih Sulit Daripada Seharusnya
it: Atterrare sul tuo primo lavoro da sviluppatore è più difficile di quanto dovrebbe essere
ja: 初めての開発職を獲得するのは思ったよりも難しい
no: Å Få Din Første Utviklerjobb Er Vanskeligere Enn Det Burde Være
pl: Znalezienie Pierwszej Pracy Jako Programista Jest Trudniejsze, Niż Powinno Być
pt: Conseguir Seu Primeiro Emprego de Desenvolvedor É Mais Difícil do Que Deveria Ser
ru: Посадка на вашу первую должность разработчика труднее, чем должна быть
sv: Att få ditt första utvecklarjobb är svårare än det borde vara
th: การได้งานนักพัฒนาแรกของคุณนั้นยากกว่าที่ควรจะเป็น
tr: İlk Geliştirici İşinizi Bulmak Gerektiğinden Daha Zor
uk: Отримати свою першу роботу розробника важче, ніж мало б бути
vi: Đạt Được Công Việc Lập Trình Đầu Tiên Khó Khăn Hơn So Với Điều Đáng Lẽ Ra Phải Có

source: Language
ar: لغة
be: Мова
da: Sprog
de: Sprache
es: Idioma
fr: Langue
id: Bahasa
it: Lingua
ja: 言語
ms: Bahasa
no: Språk
pl: Język
pt: Idioma
ru: Язык
sv: Språk
th: ภาษา
tr: Dil
uk: Мова
vi: Ngôn ngữ

source: Language Immersion
ar: غمر اللغة
be: Моўная імэрсія
da: Sprogimmersjon
de: Sprache Immersion
es: Inmersión Lingüística
fr: Immersion Linguistique
id: Immersi Bahasa
it: Immersione Linguistica
ja: 言語没入
ms: Penyerapan Bahasa
no: Språkinnlevelse
pl: Zanurzenie w języku
pt: Imersão Linguística
ru: Языковое погружение
sv: Språknivå
th: การจมอยู่ในภาษา
tr: Dil Daldırma
uk: Занурення в мову
vi: Nhập môn ngôn ngữ

source: language immersion app
ar: تطبيق الانغماس اللغوي
be: дадатак для пагружэння ў мову
da: sprogdypningsapp
de: Spracheimmersion-App
es: aplicación de inmersión lingüística
fr: application d'immersion linguistique
id: aplikasi pembelajaran bahasa
it: app di immersione linguistica
ja: 言語没入アプリ
ms: aplikasi penglibatan bahasa
no: språknedslagsapp
pl: aplikacja zanurzenia językowego
pt: aplicativo de imersão linguística
ru: приложение для языкового погружения
sv: språkimmersionapp
th: แอพการดื่มด่ำภาษา
tr: dil immersion uygulaması
uk: додаток для занурення в мову
vi: ứng dụng tiếp cận ngôn ngữ

source: Language Learning
ar: تعلم اللغة
be: Вучэнне моваў
da: Sproglæring
de: Sprache lernen
es: Aprendizaje de Idiomas
fr: Apprentissage des langues
id: Pembelajaran Bahasa
it: Apprendimento delle lingue
ja: 言語学習
ms: Pembelajaran Bahasa
no: Språklæring
pl: Uczenie się języków
pt: Aprendizado de Línguas
ru: Изучение языка
sv: Språkinlärning
th: การเรียนรู้ภาษา
tr: Dil Öğrenimi
uk: Вивчення мови
vi: Học ngôn ngữ

source: Language Learning Blog
ar: مدونة تعلم اللغة
be: Блог па вывучэнні моваў
da: Sprogindlæring Blog
de: Sprache Lernen Blog
es: Blog de Aprendizaje de Idiomas
fr: Blog d'apprentissage des langues
id: Blog Pembelajaran Bahasa
it: Blog sull'Apprendimento delle Lingue
ja: 言語学習ブログ
ms: Blog Pembelajaran Bahasa
no: Språk Læring Blogg
pl: Blog o Nauczaniu Języków
pt: Blog de Aprendizagem de Idiomas
ru: Блог о изучении языков
sv: Språkinlärningsblogg
th: บล็อกการเรียนรู้ภาษา
tr: Dil Öğrenme Blogu
uk: Блог з вивчення мов
vi: Blog Học Ngôn Ngữ

source: Language Learning Game
id: Permainan Pembelajaran Bahasa
it: Gioco di Apprendimento delle Lingue
ja: 言語学習ゲーム
no: Språklæringsspill
ru: Игра для изучения языка
uk: Гра для навчання мовам

source: Language Learning Resources
ar: موارد تعلم اللغة
be: Рэсурсы для вучэння мовы
da: Sprogindlæringsressourcer
de: Sprachlernressourcen
es: Recursos para Aprender Idiomas
fr: Ressources d'apprentissage des langues
id: Sumber Belajar Bahasa
it: Risorse per l'apprendimento delle lingue
ja: 言語学習リソース
ms: Sumber Pembelajaran Bahasa
no: Språklæringsressurser
pl: Zasoby do nauki języków
pt: Recursos para Aprendizado de Idiomas
ru: Ресурсы для изучения языков
sv: Språkinlärningsresurser
th: แหล่งข้อมูลการเรียนรู้ภาษา
tr: Dil Öğrenme Kaynakları
uk: Ресурси для вивчення мов
vi: Tài nguyên Học Ngôn Ngữ

source: Language Learning Tips
ar: نصائح لتعلم اللغة
be: Парады па вучэбе мовы
da: Sprogindlærings Tips
de: Sprache Lern Tipps
es: Consejos para Aprender Idiomas
fr: Conseils pour l'apprentissage des langues
id: Tips Belajar Bahasa
it: Suggerimenti per l'Apprendimento delle Lingue
ja: 言語学習のコツ
ms: Tips Pembelajaran Bahasa
no: Språklæringstips
pl: Porady dotyczące nauki języków
pt: Dicas para Aprender Idiomas
ru: Советы по изучению языков
sv: Språkinlärningstips
th: เคล็ดลับการเรียนภาษา
tr: Dil Öğrenme İpuçları
uk: Поради з вивчення мови
vi: Mẹo Học Ngôn Ngữ

source: Language to Learn
ar: اللغة المراد تعلمها
be: Мова для вучобы
da: Sprog at lære
de: Sprache zum Lernen
es: Idioma para aprender
fr: Langue à apprendre
id: Bahasa yang Ingin Dipelajari
it: Lingua da Imparare
ja: 学びたい言語
ms: Bahasa untuk Dipelajari
no: Språk å lære
pl: Język do nauki
pt: Idioma para Aprender
ru: Язык для изучения
sv: Språk att Lära
th: ภาษาที่จะเรียน
tr: Öğrenilecek Dil
uk: Мова для вивчення
vi: Ngôn ngữ để học

source: Languages
ar: اللغات
be: Мовы
da: Sprog
de: Sprachen
es: Idiomas
fr: Langues
id: Bahasa
it: Lingue
ja: 言語
ms: Bahasa
no: Språk
pl: Języki
pt: Idiomas
ru: Языки
sv: Språk
th: ภาษา
tr: Diller
uk: Мови
vi: Ngôn ngữ

source: Languages installed in your brain:
ar: اللغات المثبتة في عقلك:
be: Мовы, усталяваныя ў вашым мозгу:
da: Sprog installeret i din hjerne:
de: In Ihrem Gehirn installierte Sprachen:
es: Idiomas instalados en tu cerebro:
fr: Langues installées dans votre cerveau:
id: Bahasa yang terpasang di otak Anda:
it: Lingue installate nel tuo cervello:
ja: あなたの脳にインストールされた言語:
ms: Bahasa yang dipasang di dalam otak anda:
no: Språk installert i hjernen din:
pl: Języki zainstalowane w twoim mózgu:
pt: Idiomas instalados no seu cérebro:
ru: Языки, установленные в вашем мозгу:
sv: Språk installerade i din hjärna:
th: ภาษาที่ติดตั้งในสมองของคุณ:
tr: Beyninizde yüklü olan diller:
uk: Мови, встановлені у вашому мозку:
vi: Ngôn ngữ được cài đặt trong não của bạn:

source: Last Visit
de: Letzter Besuch
es: Última Visita
id: Kunjungan Terakhir
it: Ultima Visita
ja: 最終訪問
no: Siste besøk
pl: Ostatnia wizyta
pt: Última Visita
ru: Последний визит
sv: Senaste besök
th: การเข้าชมล่าสุด
tr: Son Ziyaret
uk: Останній візит
vi: Lần Ghé Thăm Cuối

source: Last visited: {lastVisited}
de: Zuletzt besucht: {lastVisited}
es: Última visita: {lastVisited}
id: Terakhir dikunjungi: {lastVisited}
it: Ultima visita: {lastVisited}
ja: 最終訪問日: {lastVisited}
no: Sist besøkt: {lastVisited}
pl: Ostatnio odwiedzono: {lastVisited}
pt: Última visita: {lastVisited}
ru: Последний визит: {lastVisited}
sv: Senast besökt: {lastVisited}
th: เยี่ยมชมล่าสุด: {lastVisited}
tr: Son ziyaret: {lastVisited}
uk: Останній візит: {lastVisited}
vi: Lần cuối ghé thăm: {lastVisited}

source: Launch your frontend career
ar: ابدأ حياتك المهنية في الواجهة الأمامية
be: Запусціце сваю кар'еру ў фронтэнд-распрацоўцы
da: Start din frontend karriere
de: Starte deine Frontend-Karriere
es: Lanza tu carrera en frontend
fr: Lancez votre carrière en frontend
id: Luncurkan karir frontend Anda
it: Lancia la tua carriera nel frontend
ja: フロントエンドキャリアをスタートしましょう
no: Start din frontend-karriere
pl: Rozpocznij swoją karierę w frontendzie
pt: Lance sua carreira frontend
ru: Начните свою карьеру во фронтенде
sv: Starta din frontend-karriär
th: เริ่มต้นอาชีพของคุณในสายงานพัฒนา Frontend
tr: Ön Uç Kariyerinize Başlayın
uk: Запустіть свою кар'єру фронтенд-розробника
vi: Bắt đầu sự nghiệp phát triển giao diện của bạn

source: Lazy Loading
ar: التحميل البطيء
be: Лянівое Загружэнне
da: Doven indlæsning
es: Carga Diferida
fr: Chargement Paresseux
id: Pemuatan Lambat
it: Caricamento pigro
ja: 遅延読み込み
ms: Memuat Malas
no: Latinnlasting
pl: Leniwe ładowanie
pt: Carregamento Lento
ru: Ленивая загрузка
th: การโหลดแบบขี้เกียจ
tr: Tembel Yükleme
uk: Ліниве завантаження
vi: Tải Lười Biếng

source: Leaderboard
de: Bestenliste
es: Tabla de clasificación
id: Papan Peringkat
it: Classifica
ja: リーダーボード
no: Toppliste
pl: Tablica wyników
pt: Placar
ru: Таблица лидеров
sv: Topplista
th: ลีดเดอร์บอร์ด
tr: Lider Tablosu
uk: Таблиця лідерів

source: Leaderboards
id: Papan Peringkat
it: Classifiche
ja: リーダーボード
no: Lederbord
pl: Tablice wyników
ru: Лидеры
sv: Ledartavlor
uk: Таблиці лідерів

source: Leadership and ownership questions feel **vague and subjective**
ar: أسئلة القيادة والملكية تشعر بأنها **غامضة وذاتية**
be: Пытанні пра лідэрства і валоданне адчуваюцца **непэўнымі і суб'ектыўнымі**
da: Lederskabs- og ejerskabsspørgsmål føles **vage og subjektive**
de: Fragen zu Führung und Eigenverantwortung wirken **vage und subjektiv**
es: Las preguntas sobre liderazgo y propiedad se sienten **vagas y subjetivas**
fr: Les questions de leadership et de responsabilité semblent **vagues et subjectives**
id: Pertanyaan tentang kepemimpinan dan kepemilikan terasa **kabur dan subyektif**
it: Le domande su leadership e possesso sembrano **vaghe e soggettive**
ja: リーダーシップとオーナーシップに関する質問は、**曖昧で主観的**に感じられます
no: Lederskaps- og eierskapsspørsmål føles **vage og subjektive**
pl: Pytania dotyczące przywództwa i odpowiedzialności wydają się **niejasne i subiektywne**
pt: Perguntas sobre liderança e apropriação parecem **vagas e subjetivas**
ru: Вопросы о лидерстве и владении кажутся **расплывчатыми и субъективными**
sv: Frågor om ledarskap och ägarskap känns **vaga och subjektiva**
th: คำถามเกี่ยวกับความเป็นผู้นำและความรับผิดชอบรู้สึกว่า **คลุมเครือและขึ้นอยู่กับมุมมองส่วนบุคคล**
tr: Liderlik ve sahiplik soruları **belirsiz ve öznel** hissediliyor.
uk: Питання щодо лідерства та власності здаються **невизначеними та суб'єктивними**
vi: Các câu hỏi về lãnh đạo và sở hữu cảm thấy **mơ hồ và chủ quan**

source: Leadership competency assessment with behavioral response feedback
ar: تقييم الكفاءة القيادية مع تغذية راجعة للاستجابة السلوكية
be: Ацэнка кампетэнцыі ў лідэрстве з зваротнай сувяззю паводзін
da: Lederskabskompetencevurdering med feedback på adfærdsmæssige reaktioner
de: Bewertung der Führungskompetenz mit Feedback zu Verhaltensreaktionen
es: Evaluación de competencia de liderazgo con retroalimentación de respuesta conductual
fr: Évaluation des compétences en leadership avec retour d'information sur la réponse comportementale
id: Penilaian kompetensi kepemimpinan dengan umpan balik tanggapan perilaku
it: Valutazione delle competenze di leadership con feedback sulle risposte comportamentali
ja: リーダーシップ能力評価および行動反応フィードバック
ms: Penilaian kecekapan kepimpinan dengan maklum balas respons tingkah laku
no: Kompetansevurdering av lederskap med tilbakemelding på atferdsrespons
pl: Ocena kompetencji przywódczych z informacją zwrotną na temat zachowań
pt: Avaliação de competências de liderança com feedback de resposta comportamental
ru: Оценка компетенций в области лидерства с обратной связью по поведенческим реакциям
sv: Bedömning av ledarskapskompetens med feedback på beteendesvar
th: การประเมินความสามารถในการเป็นผู้นำพร้อมด้วยความคิดเห็นตอบสนองทางพฤติกรรม
tr: Davranışsal yanıt geri bildirimi ile liderlik yeterliliği değerlendirmesi
uk: Оцінка компетентності лідерства з відгуками про поведінкову реакцію
vi: Đánh giá năng lực lãnh đạo với phản hồi về phản ứng hành vi

source: Learn
ar: تعلم
be: Вучыцца
da: Lær
de: Lernen
es: Aprender
fr: Apprendre
id: Belajar
it: Impara
ja: 学ぶ
ms: Belajar
no: Lær
pl: Ucz się
pt: Aprender
ru: Учиться
sv: Lära sig
th: เรียนรู้
tr: Öğren
uk: Вчіться
vi: Học

source: Learn anywhere, anytime
ar: تعلم في أي مكان، في أي وقت
be: Вучыцеся дзе-небудзь, калі-небудзь
da: Lær hvor som helst, når som helst
de: Lernen Sie überall, jederzeit
es: Aprende en cualquier lugar, en cualquier momento
fr: Apprenez n'importe où, n'importe quand
id: Belajar di mana saja, kapan saja
it: Impara ovunque, in qualsiasi momento
ja: いつでも、どこでも学ぶ
ms: Belajar di mana sahaja, pada bila-bila masa
no: Lær hvor som helst, når som helst
pl: Ucz się gdziekolwiek, kiedykolwiek
pt: Aprenda em qualquer lugar, a qualquer momento
ru: Учись где угодно, когда угодно
sv: Lär dig var som helst, när som helst
th: เรียนได้ทุกที่ ทุกเวลา
tr: Her yerde, her zaman öğrenin
uk: Вчіться будь-де, у будь-який час
vi: Học ở bất cứ đâu, bất kì lúc nào

source: Learn at full speed with full access
ar: تعلم بأقصى سرعة مع الوصول الكامل
be: Вывучайце на поўнай хуткасці з поўным доступам
da: Lær i fuld fart med fuld adgang
de: Lernen Sie in vollem Tempo mit vollem Zugang
es: Aprende a toda velocidad con acceso completo
fr: Apprenez à toute vitesse avec un accès complet
id: Belajar dengan kecepatan penuh dengan akses penuh
it: Impara a pieno ritmo con accesso completo
ja: 完全なアクセスで全速力で学びましょう
ms: Belajar dengan laju penuh dengan akses sepenuhnya
no: Lær i full fart med full tilgang
pl: Ucz się pełną parą z pełnym dostępem
pt: Aprenda em alta velocidade com acesso total
ru: Учиться на полную катушку с полным доступом
sv: Lär dig i full fart med full tillgång
th: เรียนรู้ด้วยความเร็วสูงสุดด้วยการเข้าถึงทั้งหมด
tr: Tam erişimle tam hızda öğrenin
uk: Вчіться на повну швидкість з повним доступом
vi: Học tập với tốc độ cao với quyền truy cập đầy đủ

source: Learn English
ar: تعلم الإنجليزية
be: Вывучайце англійскую
da: Lær engelsk
de: Lernen Sie Englisch
es: Aprender inglés
fr: Apprendre l'anglais
id: Belajar Bahasa Inggris
it: Impara l'inglese
ja: 英語を学ぶ
ms: Belajar Bahasa Inggeris
no: Lær engelsk
pl: Naucz się angielskiego
pt: Aprender inglês
ru: Изучайте английский
sv: Lär dig engelska
th: เรียนรู้ภาษาอังกฤษ
tr: İngilizce Öğrenin
uk: Вивчайте англійську
vi: Học tiếng Anh

source: Learn grammar used in academic writing and speaking.
ar: تعلم القواعد المستخدمة في الكتابة والتحدث الأكاديمي.
be: Вучыце граматыку, якая выкарыстоўваецца ў акадэмічным пісьме і размаўлянні.
da: Lær grammatik anvendt i akademisk skrivning og tale.
de: Lernen Sie die Grammatik, die in akademischem Schreiben und Sprechen verwendet wird.
es: Aprende la gramática utilizada en la escritura y el habla académicas.
fr: Apprenez la grammaire utilisée dans l'écriture et l'oral académiques.
id: Pelajari tata bahasa yang digunakan dalam penulisan dan berbicara akademik.
it: Impara la grammatica usata nella scrittura e nel parlato accademico.
ja: 学術的なライティングやスピーチで使用される文法を学びましょう。
ms: Belajar tatabahasa yang digunakan dalam penulisan dan percakapan akademik.
no: Lær grammatikk brukt i akademisk skriving og tale.
pl: Naucz się gramatyki używanej w pisaniu akademickim i mówieniu.
pt: Aprenda a gramática usada na escrita e fala acadêmica.
ru: Изучайте грамматику, используемую в академическом письме и речи.
sv: Lär dig grammatik som används i akademiskt skrivande och tal.
th: เรียนรู้ไวยากรณ์ที่ใช้ในการเขียนและการพูดทางวิชาการ
tr: Akademik yazı ve konuşmalarda kullanılan dilbilgisini öğrenin.
uk: Вивчайте граматику, яка використовується в академічному письмі та мовленні.
vi: Học ngữ pháp được sử dụng trong viết và nói học thuật.

source: Learn how to schedule a medical visit over the phone
ar: تعلم كيفية جدولة زيارة طبية عبر الهاتف
be: Даведайцеся, як запланаваць медыцынскі візіт па тэлефоне
da: Lær hvordan man planlægger en lægeaftale over telefonen
de: Lernen Sie, wie Sie einen Arzttermin telefonisch vereinbaren.
es: Aprende a programar una visita médica por teléfono
fr: Apprenez à prendre rendez-vous pour une visite médicale par téléphone
id: Pelajari cara menjadwalkan kunjungan medis melalui telepon
it: Impara come prenotare una visita medica al telefono
ja: 医療訪問を電話でスケジュールする方法を学ぶ
ms: Pelajari cara menjadwalkan lawatan perubatan melalui telefon
no: Lær hvordan du kan avtale en medisinsk time over telefon.
pl: Naucz się, jak umówić wizytę lekarską przez telefon
pt: Aprenda a agendar uma consulta médica por telefone
ru: Узнайте, как записаться на медицинский прием по телефону
sv: Lär dig hur du schemalägger ett läkarbesök över telefon
th: เรียนรู้วิธีการนัดหมายการเข้าพบแพทย์ทางโทรศัพท์
tr: Telefonla tıbbi randevu nasıl alınır öğrenin
uk: Дізнайтеся, як записатися на медичний прийом по телефону
vi: Học cách lên lịch hẹn khám bệnh qua điện thoại

source: Learn to communicate effectively, ask smart questions, and demonstrate your passion for frontend development.
ar: تعلم التواصل بشكل فعال، وطرح الأسئلة الذكية، وإظهار شغفك بتطوير الواجهة الأمامية.
be: Навучыцеся эфектыўна мець зносіны, задаваць разумныя пытанні і дэманстраваць сваю запал да распрацоўкі фронтэнду.
da: Lær at kommunikere effektivt, stille kloge spørgsmål og demonstrere din passion for frontend-udvikling.
de: Lernen Sie, effektiv zu kommunizieren, kluge Fragen zu stellen und Ihre Leidenschaft für Frontend-Entwicklung zu demonstrieren.
es: Aprende a comunicarte de manera efectiva, haz preguntas inteligentes y demuestra tu pasión por el desarrollo frontend.
fr: Apprenez à communiquer efficacement, posez des questions intelligentes et démontrez votre passion pour le développement frontend.
id: Belajar berkomunikasi dengan efektif, ajukan pertanyaan cerdas, dan tunjukkan minat Anda terhadap pengembangan frontend.
it: Impara a comunicare efficacemente, fai domande intelligenti e dimostra la tua passione per lo sviluppo frontend.
ja: 効果的にコミュニケーションをとり、賢い質問をし、フロントエンド開発への情熱を示しましょう。
no: Lær å kommunisere effektivt, stille smarte spørsmål, og demonstrere din lidenskap for frontend-utvikling.
pl: Naucz się skutecznie komunikować, zadawaj inteligentne pytania i demonstruj swoją pasję do programowania frontend.
pt: Aprenda a se comunicar efetivamente, faça perguntas inteligentes e demonstre sua paixão pelo desenvolvimento frontend.
ru: Научитесь эффективно общаться, задавать умные вопросы и демонстрировать свою страсть к разработке интерфейсов.
sv: Lär dig att kommunicera effektivt, ställa smarta frågor och visa din passion för frontendutveckling.
th: เรียนรู้การสื่อสารอย่างมีประสิทธิภาพ ตั้งคำถามอย่างชาญฉลาด และแสดงให้เห็นถึงความหลงใหลในการพัฒนา Frontend
tr: Etkili iletişim kurmayı öğrenin, akıllı sorular sorun ve frontend geliştirme konusundaki tutkunuzu gösterin.
uk: Навчіться ефективно спілкуватися, ставити розумні запитання та демонструвати свою пристрасть до фронтенд-розробки.
vi: Học cách giao tiếp hiệu quả, đặt những câu hỏi thông minh, và thể hiện đam mê của bạn với phát triển giao diện người dùng.

source: Learn to describe symptoms and ask for medical advice effectively
ar: تعلم كيفية وصف الأعراض وطلب النصيحة الطبية بفعالية
be: Вывучайце апісваць сімптомы і эфектыўна запытваць медыцынскую дапамогу
da: Lær at beskrive symptomer og anmode om medicinsk rådgivning effektivt
de: Lernen Sie, Symptome zu beschreiben und effektiv medizinischen Rat einzuholen
es: Aprende a describir síntomas y solicitar consejo médico de manera efectiva
fr: Apprenez à décrire les symptômes et à demander des conseils médicaux de manière efficace
id: Belajar mendeskripsikan gejala dan meminta saran medis dengan efektif
it: Impara a descrivere i sintomi e a chiedere consigli medici in modo efficace
ja: 症状を説明し、効果的に医療アドバイスを求める方法を学ぶ
ms: Belajar untuk menerangkan gejala dan memohon nasihat perubatan dengan berkesan
no: Lær å beskrive symptomer og be om medisinsk råd på en effektiv måte
pl: Naucz się skutecznie opisywać objawy i prosić o porady medyczne
pt: Aprenda a descrever sintomas e pedir conselhos médicos de forma eficaz
ru: Научитесь эффективно описывать симптомы и запрашивать медицинские советы
sv: Lär dig att beskriva symtom och be om medicinsk rådgivning på ett effektivt sätt
th: เรียนรู้ที่จะอธิบายอาการและขอคำแนะนำทางการแพทย์อย่างมีประสิทธิภาพ
tr: Semptomları tanımlamayı ve tıbbi tavsiye istemeyi etkili bir şekilde öğrenin
uk: Навчіться ефективно описувати симптоми та запитувати медичну пораду
vi: Học cách mô tả triệu chứng và hỏi về lời khuyên y tế một cách hiệu quả

source: Learning Blog
ar: مدونة التعلم
be: Блог аб навучанні
da: Læringsblog
de: Lernblog
es: Blog de Aprendizaje
fr: Blog d'apprentissage
id: Blog Pembelajaran
it: Blog di Apprendimento
ja: 学習ブログ
ms: Belajar Blog
no: Læringsblogg
pl: Blog o nauce
pt: Blog de Aprendizagem
ru: Блог обучения
sv: Lärande Blogg
th: บล็อกการเรียนรู้
tr: Öğrenme Blogu
uk: Блог про навчання
vi: Blog Học Tập

source: Learning Plan
ar: خطة التعلم
be: План навучання
da: Læringsplan
de: Lernplan
es: Plan de Aprendizaje
fr: Plan d'apprentissage
id: Rencana Pembelajaran
it: Piano di Apprendimento
ja: 学習計画
ms: Pelan Pembelajaran
no: Læringsplan
pl: Plan nauki
pt: Plano de Aprendizagem
ru: Учебный план
sv: Inlärningsplan
th: แผนการเรียนรู้
tr: Öğrenme Planı
uk: План навчання
vi: Kế hoạch học tập

source: Leave your message
ar: اترك رسالتك
be: Пакіньце сваё паведамленне
da: Efterlad din besked
de: Hinterlassen Sie Ihre Nachricht
es: Deja tu mensaje
fr: Laissez votre message
id: Tinggalkan pesan Anda
it: Lascia il tuo messaggio
ja: あなたのメッセージを残してください
ms: Tinggalkan pesanan anda
no: Legg igjen meldingen din
pl: Zostaw swoją wiadomość
pt: Deixe sua mensagem
ru: Оставьте свое сообщение
sv: Lämna ditt meddelande
th: ฝากข้อความของคุณ
tr: Mesajınızı bırakın
uk: Залиште своє повідомлення
vi: Để lại tin nhắn của bạn

source: Legal:
ar: القانوني:
be: Прававые пытанні:
da: Juridisk:
de: Rechtlich:
fr: Juridique:
id: Hukum:
it: Legale:
ja: 法的:
ms: Undang-undang:
no: Juridisk:
pl: Prawne:
ru: Юридическая информация:
sv: Rättsliga:
th: กฎหมาย:
tr: Hukuki:
uk: Юридичне:
vi: Pháp lý:
