Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Let's add some hours to your balance
ar: دعنا نضيف بعض الساعات إلى رصيدك
be: Давайце дададзім некалькі гадзін да вашага балансу
da: Lad os tilføje nogle timer til din saldo
de: Lassen Sie uns einige Stunden zu Ihrem Guthaben hinzufügen
es: Vamos a añadir algunas horas a tu saldo
fr: Ajoutons quelques heures à votre solde
id: Mari tambahkan beberapa jam ke saldo Anda
it: Aggiungiamo alcune ore al tuo saldo
ja: あなたの残高にいくつかの時間を追加しましょう
ms: Mari tambah beberapa jam ke dalam baki anda
no: La oss legge til noen timer på saldoen din
pl: Dodajmy trochę godzin do Twojego salda
pt: Vamos adicionar algumas horas ao seu saldo
ru: Давайте добавим некоторое количество часов на ваш баланс
sv: Låt oss lägga till några timmar till ditt saldo
th: เรามาเพิ่มบางชั่วโมงไปยังยอดคงเหลือของคุณ
tr: Hadi, bakiyenize biraz saat ekleyelim
vi: Hãy thêm một số giờ vào số dư của bạn

source: Once purchased, your hours remain available until you use them. There is no expiration.
ar: بمجرد الشراء، تظل ساعاتك متاحة حتى تستخدمها. لا يوجد تاريخ انتهاء.
be: Пасля куплі, вашы гадзіны застануцца даступнымі, пакуль вы іх не выкарыстаеце. Тэрмін дзеяння адсутнічае.
da: Når købt, forbliver dine timer tilgængelige, indtil du bruger dem. Der er ingen udløbsdato.
de: Einmal gekauft, bleiben Ihre Stunden verfügbar, bis Sie sie nutzen. Es gibt kein Verfallsdatum.
es: Una vez compradas, tus horas permanecen disponibles hasta que las uses. No hay caducidad.
fr: Une fois achetées, vos heures restent disponibles jusqu'à ce que vous les utilisiez. Il n'y a pas d'expiration.
id: Setelah dibeli, jam Anda tetap tersedia sampai Anda menggunakannya. Tidak ada masa kedaluwarsa.
it: Una volta acquistate, le tue ore rimangono disponibili fino a quando non le utilizzi. Non c'è scadenza.
ja: 一度購入すると、使用するまでの時間が利用可能になります。有効期限はありません。
ms: Setelah dibeli, jam anda akan tersedia sehingga anda menggunakannya. Tiada tarikh luput.
no: Når du har kjøpt, forblir timene dine tilgjengelige til du bruker dem. Det er ingen utløpsdato.
pl: Po zakupie, twoje godziny są dostępne dopóki ich nie wykorzystasz. Nie mają one daty ważności.
pt: Uma vez compradas, suas horas permanecem disponíveis até que você as use. Não há expiração.
ru: После покупки, ваши часы остаются доступными до тех пор, пока вы их не используете. Срок их действия не ограничен.
sv: När du väl köpt, förblir dina timmar tillgängliga tills du använder dem. Det finns ingen utgångsdatum.
th: หลังจากที่คุณซื้อแล้ว ชั่วโมงของคุณจะพร้อมใช้งานจนกว่าคุณจะใช้มัน ไม่มีวันหมดอายุ
tr: Bir kez satın aldığınızda, saatleriniz kullanana kadar kullanılabilir durumda kalır. Bir son kullanma tarihi yoktur.
vi: Một khi mua, số giờ của bạn sẽ vẫn có sẵn cho đến khi bạn sử dụng hết. Không có thời hạn sử dụng.

source: Payment history:
ar: سجل الدفعات:
be: Гісторыя плацяжоў:
da: Betalingshistorik:
de: Zahlungshistorie:
es: Historial de pagos:
fr: Historique des paiements:
id: Riwayat pembayaran:
it: Cronologia dei pagamenti:
ja: 支払い履歴:
ms: Sejarah pembayaran:
no: Betalingshistorikk:
pl: Historia płatności:
pt: Histórico de pagamento:
ru: История платежей:
sv: Betalningshistorik:
th: ประวัติการชำระเงิน:
tr: Ödeme geçmişi:
vi: Lịch sử thanh toán:

source: Pick your teacher
id: Pilih pengajar Anda
it: Scegli il tuo insegnante
ja: 先生を選択してください
pl: Wybierz swojego nauczyciela
ru: Выберите своего учителя
sv: Välj din lärare

source: Practice scheduling a doctor’s appointment over the phone by clearly stating your availability and reason for the visit. Perfect for improving clarity and confidence in professional medical settings. #### Why You Should Play *Doctor's Appointment* 1. Learn to request appointments on specific dates and times. 2. Develop clarity in explaining the purpose of your visit. 3. Practice common phrases for medical scheduling. 4. Build confidence in managing personal healthcare logistics. 5. Prepare for real-world situations where time and details are crucial. #### How the Scenario Works You’ll take the role of a patient calling a doctor’s office to schedule an appointment. The AI, as a receptionist, will ask for your name, preferred date, and reason for the visit. By responding naturally, you’ll build essential communication skills for any medical context.
ar: ممارسة جدولة موعد طبي عبر الهاتف من خلال توضيح توافرك وسبب الزيارة. مثالي لتحسين الوضوح والثقة في البيئات الطبية المهنية. #### لماذا يجب أن تلعب *موعد الطبيب* 1. تعلم كيفية طلب المواعيد في تواريخ وأوقات محددة. 2. تطوير الوضوح في شرح غرض زيارتك. 3. ممارسة العبارات الشائعة لجدولة المواعيد الطبية. 4. بناء الثقة في إدارة اللوجستيات الشخصية للرعاية الصحية. 5. الاستعداد للمواقف الواقعية حيث يكون الوقت والتفاصيل حاسمة. #### كيف يعمل السيناريو سوف تتخذ دور مريض يتصل بمكتب طبيب لتحديد موعد. ستقوم الذكاء الاصطناعي، كموظف استقبال، بسؤالك عن اسمك، التاريخ المفضل، وسبب الزيارة. من خلال الرد بشكل طبيعي، ستقوم ببناء مهارات الاتصال الأساسية لأي سياق طبي.
be: Практыкуйцеся ў прадумванні візіту да лекара па тэлефоне, чаткі выказваючы вашу даступнасць і прычыны візіту. Ідэальна падыходзіць для паляпшэння зразумеласці і упэўненасці ў прафесійных медыцынскіх умовах. #### Чаму варта гуляць у *Прызначэнне лекара* 1. Навучыцеся запытваць прызначэнні на канкрэтныя даты і гадзіны. 2. Развіце зразумеласць у тлумачэнні мэты вашага візіту. 3. Практыкуйцеся ў агульныя фразы для медыцынскага раскладу. 4. Пабудуйце ўпэўненасць у кіраванні асабістымі лекарскімі лагістыкамі. 5. Падгатуйцеся да рэальных сітуацый, дзе час і дэтали крытычна важныя. #### Як працуе пстсцэнарый Вы будзеце выконваць ролю пацыента, які дзвоніць у кабінет лекара, каб запланаваць прызначэнне. Штучны інтэлект, у ролі адміністратара, спытае у вас прозвішча, бажаную дату і прычыны візіту. Адказваючы на ўсе гэта ў натуральнай форме, вы будзеце распрацоўваць незаменныя камунікацыйныя навыкі для любога медычнага кантэксту.
de: Üben Sie die Terminvereinbarung für einen Arztbesuch am Telefon, indem Sie klar Ihre Verfügbarkeit und den Grund für den Besuch angeben. Perfekt, um Klarheit und Selbstvertrauen in professionellen medizinischen Situationen zu verbessern. #### Warum Sie *Arzttermin* spielen sollten 1. Lernen Sie, Termine an bestimmten Daten und Uhrzeiten anzufragen. 2. Entwickeln Sie Klarheit beim Erklären des Zwecks Ihres Besuchs. 3. Üben Sie gängige Phrasen für medizinische Terminvereinbarungen. 4. Bauen Sie Selbstvertrauen im Umgang mit persönlichen Gesundheitslogistik auf. 5. Bereiten Sie sich auf reale Situationen vor, in denen Zeit und Details entscheidend sind. #### Wie das Szenario funktioniert Sie übernehmen die Rolle eines Patienten, der die Arztpraxis anruft, um einen Termin zu vereinbaren. Die KI, als Rezeptionist, wird nach Ihrem Namen, bevorzugtem Datum und Grund für den Besuch fragen. Indem Sie natürlich antworten, entwickeln Sie wichtige Kommunikationsfähigkeiten für jeden medizinischen Kontext.
es: Practica la programación de una cita médica por teléfono al expresar claramente tu disponibilidad y el motivo de la visita. Perfecto para mejorar la claridad y la confianza en entornos médicos profesionales. #### Por qué deberías jugar *Cita Médica* 1. Aprende a solicitar citas en fechas y horas específicas. 2. Desarrolla claridad al explicar el propósito de tu visita. 3. Practica frases comunes para la programación médica. 4. Aumenta la confianza en la gestión de la logística de tu atención médica personal. 5. Prepárate para situaciones del mundo real donde el tiempo y los detalles son cruciales. #### Cómo funciona el escenario Asumirás el rol de un paciente que llama a la oficina de un médico para programar una cita. La IA, como recepcionista, pedirá tu nombre, fecha preferida y motivo de la visita. Al responder de manera natural, desarrollarás habilidades de comunicación esenciales para cualquier contexto médico.
fr: Pratiquez la prise de rendez-vous chez le médecin par téléphone en indiquant clairement vos disponibilités et la raison de votre visite. Idéal pour améliorer la clarté et la confiance dans des contextes médicaux professionnels. #### Pourquoi vous devriez jouer à *Rendez-vous chez le médecin* 1. Apprenez à demander des rendez-vous à des dates et heures spécifiques. 2. Développez la clarté dans l'explication de l'objet de votre visite. 3. Pratiquez des phrases courantes pour la prise de rendez-vous médicaux. 4. Renforcez votre confiance dans la gestion de la logistique de votre santé personnelle. 5. Préparez-vous à des situations réelles où le temps et les détails sont cruciaux. #### Comment le scénario fonctionne Vous jouerez le rôle d'un patient appelant le cabinet d'un médecin pour prendre un rendez-vous. L'IA, en tant que réceptionniste, vous demandera votre nom, la date souhaitée et la raison de la visite. En répondant naturellement, vous développerez des compétences de communication essentielles pour tout contexte médical.
id: Latihlah penjadwalan janji temu dokter melalui telepon dengan jelas menyatakan ketersediaan dan alasan kunjungan Anda. Sangat cocok untuk meningkatkan kejelasan dan kepercayaan diri dalam pengaturan medis profesional. #### Mengapa Anda Harus Bermain *Janji Temu Dokter* 1. Pelajari cara meminta janji temu pada tanggal dan waktu tertentu. 2. Kembangkan kejelasan dalam menjelaskan tujuan kunjungan Anda. 3. Latih frasa umum untuk penjadwalan medis. 4. Bangun kepercayaan diri dalam mengelola logistik perawatan kesehatan pribadi. 5. Siapkan diri untuk situasi dunia nyata di mana waktu dan detail sangat penting. #### Cara Skenario Bekerja Anda akan berperan sebagai pasien yang menghubungi kantor dokter untuk menjadwalkan janji temu. AI, sebagai resepsionis, akan meminta nama Anda, tanggal yang diinginkan, dan alasan kunjungan. Dengan merespons secara alami, Anda akan membangun keterampilan komunikasi yang penting untuk konteks medis apa pun.
it: Pratica la programmazione di un appuntamento dal medico telefonicamente, dichiarando chiaramente la tua disponibilità e il motivo della visita. Perfetto per migliorare la chiarezza e la fiducia in contesti medici professionali. #### Perché dovresti giocare a *Appuntamento dal Dottore* 1. Impara a richiedere appuntamenti in date e orari specifici. 2. Sviluppa chiarezza nel spiegare il motivo della tua visita. 3. Pratica frasi comuni per la programmazione medica. 4. Costruisci fiducia nella gestione della logistica sanitaria personale. 5. Preparati a situazioni del mondo reale in cui tempo e dettagli sono cruciali. #### Come funziona lo scenario Assumerai il ruolo di un paziente che chiama l'ambulatorio di un medico per fissare un appuntamento. L'IA, come segretaria, chiederà il tuo nome, la data preferita e il motivo della visita. Rispondendo in modo naturale, svilupperai competenze comunicative essenziali per qualsiasi contesto medico.
ja: Practice scheduling a doctor’s appointment over the phone by clearly stating your availability and reason for the visit. Perfect for improving clarity and confidence in professional medical settings. #### Why You Should Play *Doctor's Appointment* 1. 特定の日付と時間に予約をリクエストする方法を学べます。 2. 訪問の目的を説明する際の明確さを養います。 3. 医療スケジュールに関する一般的なフレーズを練習します。 4. 自分の医療物流を管理する自信を高めます。 5. 時間や詳細が重要な現実の状況に備えます。 #### How the Scenario Works あなたは医者のオフィスに電話をかけて予約を取る患者の役割を担います。AIは受付係として、あなたの名前、希望の日付、訪問の理由を尋ねます。自然に応答することで、あらゆる医療の文脈に必要なコミュニケーションスキルを磨くことができます。
ms: Amalkan penjadualan temu janji doktor melalui telefon dengan menyatakan ketersediaan anda dan sebab kunjungan dengan jelas. Sangat baik untuk meningkatkan kejelasan dan keyakinan dalam situasi perubatan profesional. #### Mengapa Anda Perlu Bermain *Temu Janji Doktor* 1. Belajar untuk meminta temu janji pada tarikh dan masa tertentu. 2. Mengembangkan kejelasan dalam menjelaskan tujuan kunjungan anda. 3. Amalkan frasa biasa untuk penjadualan perubatan. 4. Membangun keyakinan dalam mengurus logistik penjagaan kesihatan peribadi. 5. Bersiap sedia untuk situasi dunia nyata di mana masa dan butiran adalah penting. #### Cara Senario Ini Berfungsi Anda akan mengambil peranan sebagai pesakit yang menghubungi pejabat doktor untuk menjadualkan temu janji. AI, sebagai penyambut tetamu, akan menanyakan nama anda, tarikh yang diingini, dan sebab kunjungan. Dengan memberi jawapan secara semula jadi, anda akan membina kemahiran komunikasi asas untuk sebarang konteks perubatan.
pt: Pratique agendar uma consulta médica por telefone, declarando claramente sua disponibilidade e razão para a visita. Perfeito para melhorar a clareza e a confiança em ambientes médicos profissionais. #### Por que você deve jogar *Consulta Médica* 1. Aprenda a solicitar consultas em datas e horários específicos. 2. Desenvolva clareza ao explicar o propósito da sua visita. 3. Pratique frases comuns para agendamento médico. 4. Construa confiança na gestão da logística de cuidados pessoais de saúde. 5. Prepare-se para situações do mundo real onde tempo e detalhes são cruciais. #### Como funciona o cenário Você assumirá o papel de um paciente ligando para o consultório de um médico para agendar uma consulta. A IA, como recepcionista, pedirá seu nome, data preferida e razão da visita. Ao responder de forma natural, você desenvolverá habilidades de comunicação essenciais para qualquer contexto médico.
ru: Практикуйте назначение встречи к врачу по телефону, четко указывая свою доступность и причину визита. Отлично подходит для улучшения ясности и уверенности в профессиональных медицинских ситуациях. #### Почему стоит сыграть в *Запись на прием к врачу* 1. Узнайте, как записываться на прием в конкретные даты и времена. 2. Развивайте ясность в объяснении цели вашего визита. 3. Практикуйте распространенные фразы для медицинского расписания. 4. Укрепляйте уверенность в управлении личной медицинской логистикой. 5. Подготовьтесь к реальным ситуациям, где время и детали имеют решающее значение. #### Как работает сценарий Вы возьмете на себя роль пациента, звонящего в кабинет врача, чтобы записаться на прием. ИИ, выступающий в роли администратора, спросит ваше имя, предпочтительную дату и причину визита. Отвечая естественно, вы разовьете важные коммуникативные навыки для любой медицинской обстановки.
th: ฝึกฝนการนัดหมายพบแพทย์ทางโทรศัพท์โดยการระบุความพร้อมและเหตุผลสำหรับการเข้าพบอย่างชัดเจน เหมาะสำหรับการพัฒนาความชัดเจนและความมั่นใจในสภาพแวดล้อมการแพทย์ที่เป็นทางการ #### ทำไมคุณควรเล่น *นัดหมายพบแพทย์* 1. เรียนรู้วิธีการขอนัดหมายในวันที่และเวลาที่ระบุ 2. พัฒนาความชัดเจนในการอธิบายวัตถุประสงค์ของการเข้าพบ 3. ฝึกฝนวลีทั่วไปสำหรับการนัดหมายทางการแพทย์ 4. สร้างความมั่นใจในการจัดการด้านสุขภาพส่วนตัว 5. เตรียมพร้อมสำหรับสถานการณ์ในโลกจริงที่เวลาและรายละเอียดมีความสำคัญ #### วิธีการทำงานของสถานการณ์ คุณจะรับบทเป็นผู้ป่วยที่โทรหาสำนักงานแพทย์เพื่อทำการนัดหมาย AI ในฐานะพนักงานต้อนรับจะขอชื่อของคุณ วันที่ที่ต้องการ และเหตุผลสำหรับการเข้าพบ โดยการตอบกลับอย่างเป็นธรรมชาติ คุณจะพัฒนาทักษะการสื่อสารที่จำเป็นสำหรับบริบททางการแพทย์ทุกประเภท
tr: Pratik yaparak bir doktor randevusu almak için telefonla arama yapın. Uygun olduğunuz zamanları ve ziyaret nedeninizi net bir şekilde belirtin. Profesyonel tıbbi ortamlarda netlik ve güven geliştirmek için mükemmel. #### Neden *Doktor Randevusu* Oynamalısınız 1. Belirli tarihlerde ve saatlerde randevu talep etmeyi öğrenin. 2. Ziyaret amacınızı açıklamada netlik geliştirin. 3. Tıbbi randevu alma için yaygın ifadeleri pratiğini yapın. 4. Kişisel sağlık hizmeti lojistiğini yönetme konusunda güven inşa edin. 5. Zamanın ve ayrıntıların kritik olduğu gerçek dünya durumlarına hazırlanın. #### Senaryonun Çalışma Şekli Bir doktor muayenehanesini arayarak randevu almak için hasta rolünü üstleneceksiniz. AI, bir sekreter olarak, adınızı, tercih ettiğiniz tarihi ve ziyaret nedeninizi soracak. Doğal bir şekilde yanıt vererek, herhangi bir tıbbi bağlamda gerekli iletişim becerilerini geliştireceksiniz.
vi: Practice scheduling a doctor’s appointment over the phone by clearly stating your availability and reason for the visit. Perfect for improving clarity and confidence in professional medical settings. #### Tại sao bạn nên chơi *Cuộc hẹn với bác sĩ* 1. Học cách yêu cầu các cuộc hẹn vào những ngày và giờ cụ thể. 2. Phát triển sự rõ ràng trong việc giải thích mục đích của chuyến thăm của bạn. 3. Thực hành các cụm từ thông dụng cho việc lên lịch y tế. 4. Xây dựng sự tự tin trong việc quản lý logistics chăm sóc sức khỏe cá nhân. 5. Chuẩn bị cho các tình huống thực tế nơi thời gian và chi tiết là rất quan trọng. #### Cách mà kịch bản hoạt động Bạn sẽ đóng vai là một bệnh nhân gọi đến văn phòng bác sĩ để sắp xếp một cuộc hẹn. Trí tuệ nhân tạo, đóng vai trò là lễ tân, sẽ hỏi tên của bạn, ngày mong muốn và lý do cho chuyến thăm. Bằng cách trả lời một cách tự nhiên, bạn sẽ phát triển những kỹ năng giao tiếp thiết yếu cho bất kỳ bối cảnh y tế nào.

source: Price per one AI hour:
ar: السعر لكل ساعة AI:
be: Цана за адзін гадзіну AI:
da: Pris pr. en AI-time:
de: Preis pro eine AI Stunde:
es: Precio por una hora de IA:
fr: Prix par une heure d'IA :
id: Harga per satu jam AI:
it: Prezzo per un'ora di AI:
ja: 1時間あたりのAIの価格:
ms: Harga per satu jam AI:
no: Pris per en AI time:
pl: Cena za jedną godzinę AI:
pt: Preço por uma hora de IA:
ru: Цена за один AI час:
sv: Pris per en AI timme:
th: ราคาต่อหนึ่งชั่วโมง AI:
tr: Bir AI saati başına fiyat:
vi: Giá cho một giờ AI:

source: privacy policy
ar: سياسة الخصوصية
be: палітыка прыватнасці
da: privatlivspolitik
de: Datenschutzrichtlinie
es: política de privacidad
fr: politique de confidentialité
id: kebijakan privasi
it: politica sulla privacy
ja: プライバシーポリシー
ms: dasar privasi
no: personvernregler
pl: polityka prywatności
pt: política de privacidade
ru: политика конфиденциальности
sv: integritetspolicy
th: นโยบายความเป็นส่วนตัว
tr: gizlilik politikası
vi: chính sách bảo mật

source: React & Next.js
ar: ريآكت و Next.js
be: React і Next.js
de: Reagieren & Next.js
fr: Réagir & Next.js
ja: リアクト & Next.js
ms: Reaksi & Next.js
no: React og Next.js
pl: Reaguj i Next.js
ru: React и Next.js

source: Record 2-3 minutes story using <0>{learningLanguageName}</0> or <1>{nativeLanguageName}</1>. This will help me to create a personalized practice plan.
de: Nehmen Sie eine 2-3-minütige Geschichte auf, indem Sie entweder <0>{learningLanguageName}</0> oder <1>{nativeLanguageName}</1> verwenden. Dies wird mir helfen, einen personalisierten Übungsplan zu erstellen.
es: Graba una historia de 2-3 minutos usando <0>{learningLanguageName}</0> o <1>{nativeLanguageName}</1>. Esto me ayudará a crear un plan de práctica personalizado.
id: Rekam cerita 2-3 menit menggunakan <0>{learningLanguageName}</0> atau <1>{nativeLanguageName}</1>. Ini akan membantu saya membuat rencana latihan yang dipersonalisasi.
it: Registrare una storia di 2-3 minuti utilizzando <0>{learningLanguageName}</0> o <1>{nativeLanguageName}</1>. Questo mi aiuterà a creare un piano di pratica personalizzato.
ja: <0>{learningLanguageName}</0> または <1>{nativeLanguageName}</1> を使用して、2～3分の物語を録音してください。これにより、個々に合わせた練習プランを作成するのに役立ちます。
pl: Nagraj 2-3 minutową historię używając <0>{learningLanguageName}</0> or <1>{nativeLanguageName}</1>. To pomoże mi stworzyć spersonalizowany plan ćwiczeń.
pt: Grave uma história de 2-3 minutos usando <0>{learningLanguageName}</0> ou <1>{nativeLanguageName}</1>. Isso me ajudará a criar um plano de prática personalizado.
ru: Запишите 2-3 минуты истории, используя <0>{learningLanguageName}</0> или <1>{nativeLanguageName}</1>. Это поможет мне создать персонализированный план практики.
sv: Spela in en 2-3 minuters berättelse med hjälp av <0>{learningLanguageName}</0> eller <1>{nativeLanguageName}</1>. Det här kommer att hjälpa mig att skapa en personlig övningsplan.
th: บันทึกเรื่องราวความยาว 2-3 นาที โดยใช้ <0>{learningLanguageName}</0> หรือ <1>{nativeLanguageName}</1> สิ่งนี้จะช่วยฉันในการสร้างแผนการฝึกฝนที่เป็นส่วนตัวสำหรับคุณ
tr: <0>{learningLanguageName}</0> veya <1>{nativeLanguageName}</1> kullanarak 2-3 dakikalık bir hikaye kaydedin. Bu, kişiselleştirilmiş bir pratik planı oluşturmama yardımcı olacak.
vi: Ghi âm câu chuyện dài 2-3 phút bằng <0>{learningLanguageName}</0> hoặc <1>{nativeLanguageName}</1>. Điều này sẽ giúp tôi tạo ra một kế hoạch luyện tập cá nhân hóa.

source: Record 2-3 minutes story using <0>{learningLanguageName}</0>. This will help me to create a personalized practice plan.
de: Nehmen Sie eine 2-3 Minuten lange Geschichte auf, die <0>{learningLanguageName}</0> verwendet. Dies wird mir helfen, einen personalisierten Übungsplan zu erstellen.
es: Graba una historia de 2-3 minutos utilizando <0>{learningLanguageName}</0>. Esto me ayudará a crear un plan de práctica personalizado.
id: Rekam cerita 2-3 menit menggunakan <0>{learningLanguageName}</0>. Ini akan membantu saya membuat rencana latihan yang dipersonalisasi.
it: Registra una storia di 2-3 minuti utilizzando <0>{learningLanguageName}</0>. Questo mi aiuterà a creare un piano di pratica personalizzato.
ja: <0>{learningLanguageName}</0>を使って2～3分のストーリーを録画してください。これにより、個別の練習プランを作成するのに役立ちます。
pl: Nagraj 2-3 minutową historię używając <0>{learningLanguageName}</0>. To pomoże mi stworzyć spersonalizowany plan nauki.
pt: Grave uma história de 2 a 3 minutos usando <0>{learningLanguageName}</0>. Isso me ajudará a criar um plano de prática personalizado.
ru: Запишите 2-3-минутную историю, используя <0>{learningLanguageName}</0>. Это поможет мне создать персонализированный план практики.
sv: Spela in en berättelse på 2-3 minuter med hjälp av <0>{learningLanguageName}</0>. Detta kommer att hjälpa mig att skapa en personlig träningsplan.
th: บันทึกเรื่องเล่า 2-3 นาทีโดยใช้ <0>{learningLanguageName}</0> สิ่งนี้จะช่วยให้ฉันสร้างแผนการฝึกฝนตามความต้องการของคุณ
tr: <0>{learningLanguageName}</0> kullanarak 2-3 dakikalık bir hikaye kaydedin. Bu, kişiselleştirilmiş bir çalışma planı oluşturmama yardımcı olacaktır.
vi: Ghi lại câu chuyện dài 2-3 phút bằng <0>{learningLanguageName}</0>. Điều này sẽ giúp tôi tạo ra một kế hoạch luyện tập cá nhân hóa.

source: Record a message in Community Chat and get {points} points in the leaderboard
de: Nehmen Sie eine Nachricht im Community-Chat auf und erhalten Sie {points} Punkte in der Rangliste
es: Graba un mensaje en el Chat Comunitario y obtén {points} puntos en la tabla de clasificación
fr: Enregistrez un message dans le Chat Communautaire et obtenez {points} points dans le classement
id: Rekam pesan di Obrolan Komunitas dan dapatkan {points} poin di papan peringkat
it: Registra un messaggio nella Chat della community e ottieni {points} punti nella classifica leaderboard
ja: コミュニティチャットでメッセージを記録し、リーダーボードで{points}ポイントを獲得
no: Spill inn en melding i Samfunnschatten og få {points} poeng på poengtavlen
pl: Nagraj wiadomość na Czacie Społecznościowym i zdobądź {points} punktów w rankingu
pt: Grave uma mensagem no Chat da Comunidade e ganhe {points} pontos na classificação
ru: Запишите сообщение в чате сообщества и получите {points} очков в таблице лидеров
sv: Spela in ett meddelande i Community Chat och få {points} poäng på topplistan
th: บันทึกข้อความในชุมชนแชทและรับ {points} คะแนนในกระดานผู้นำ
tr: Topluluk Sohbetinde bir mesaj kaydedin ve liderlik tablosunda {points} puan kazanın
vi: Ghi lại một tin nhắn trong Phòng chat Cộng đồng và nhận {points} điểm trên bảng xếp hạng

source: Select a voice and look that feels right for you.
id: Pilih suara dan tampilan yang sesuai untuk Anda.
it: Seleziona una voce e un aspetto che ti sembrano giusti.
ja: 自分に合っていると感じる声と見た目を選んでください。
pl: Wybierz głos i wygląd, który Ci odpowiada.
ru: Выберите голос и внешний вид, которые вам подходят.
sv: Välj en röst och ett utseende som känns rätt för dig.

source: Start using full access
id: Mulai menggunakan akses penuh
it: Inizia a utilizzare l'accesso completo
ja: フルアクセスを使い始める
no: Begynn å bruke full tilgang
pl: Zacznij korzystać z pełnego dostępu
ru: Начать использовать полный доступ
sv: Börja använda full åtkomst
