Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Points earned: {pointsEarned}. Keep practicing to improve your score!
de: Punkte verdient: {pointsEarned}. Üben Sie weiter, um Ihre Punktzahl zu verbessern!
es: Puntos ganados: {pointsEarned}. ¡Sigue practicando para mejorar tu puntuación!
id: Poin yang diperoleh: {pointsEarned}. Terus berlatih untuk meningkatkan skor Anda!
it: Punti guadagnati: {pointsEarned}. Continua a esercitarti per migliorare il tuo punteggio!
ja: 得点: {pointsEarned}。スコアを向上させるために練習を続けましょう！
no: Poeng tjent: {pointsEarned}. Fortsett å øve for å forbedre poengsummen din!
pl: Punkty zdobyte: {pointsEarned}. Ćwicz dalej, aby poprawić swój wynik!
pt: Pontos ganhos: {pointsEarned}. Continue praticando para melhorar sua pontuação!
ru: Очки заработаны: {pointsEarned}. Продолжайте практиковаться, чтобы улучшить свой результат!
sv: Poäng intjänade: {pointsEarned}. Fortsätt öva för att förbättra din poäng!
th: คะแนนที่ได้รับ: {pointsEarned} เก็บฝึกฝนต่อไปเพื่อเพิ่มคะแนนของคุณ!
tr: Kazanılan puan: {pointsEarned}. Skorunu geliştirmek için pratik yapmaya devam et!
uk: Зароблені бали: {pointsEarned}. Продовжуйте тренуватися, щоб покращити свій результат!

source: Polish Learning Plan
ar: خطة تعلم البولندية
be: План вучэння па-польску
da: Polsk Læringsplan
de: Polnischer Lernplan
es: Plan de Aprendizaje de Polaco
fr: Plan d'Apprentissage du Polonais
id: Rencana Belajar Bahasa Polandia
it: Piano di Apprendimento Polacco
ja: ポーランド語学習プラン
ms: Rancangan Pembelajaran Bahasa Poland
no: Læringsplan på Polsk
pl: Plan Nauki Języka Polskiego
pt: Plano de Aprendizagem em Polonês
ru: План Изучения Польского
sv: Polsk inlärningsplan
th: แผนการเรียนรู้ภาษาโปแลนด์
tr: Polonyaca Öğrenme Planı
uk: План навчання польської
vi: Kế hoạch học tiếng Ba Lan

source: Portuguese Learning Plan
ar: خطة تعلم البرتغالية
be: План вучэбы партугальскай мовы
da: Portugisisk Læringsplan
de: Portugiesischer Lernplan
es: Plan de Aprendizaje de Portugués
fr: Plan d'Apprentissage du Portugais
id: Rencana Belajar Bahasa Portugis
it: Piano di Apprendimento del Portoghese
ja: ポルトガル語学習プラン
ms: Pelajaran Belajar Portugis
no: Portugisisk Læringsplan
pl: Plan Nauki Portugalskiego
pt: Plano de Aprendizagem de Português
ru: План обучения португальскому
sv: Portugisiskt Läroplan
th: แผนการเรียนภาษาโปรตุเกส
tr: Portekizce Öğrenme Planı
uk: План вивчення португальської
vi: Kế Hoạch Học Tiếng Bồ Đào Nha

source: Position
ar: الموقع
be: Пазіцыя
es: Posición
id: Posisi
it: Posizione
ja: 位置
ms: Kedudukan
no: Posisjon
pl: Pozycja
pt: Posição
ru: Позиция
th: ตำแหน่ง
tr: Konum
uk: Посада
vi: Vị trí

source: Post a short thought and ask: “Does this sound natural?”
uk: Розмістіть коротку думку та запитайте: "Чи звучить це природно?"

source: Posting helps you grow in the FluencyPal leaderboard — and helps others learn too.
uk: Розміщення допомагає вам підвищити позиції у таблиці лідерів FluencyPal — і допомагає іншим навчатися також.

source: Practical coding Q&A and debugging practice
ar: أسئلة وأجوبة عملية لتشفير البرمجة وممارسة تصحيح الأخطاء
be: Практычныя пытанні і адказы па кадаванні і практыка адладкі
da: Praktiske kodningsspørgsmål og fejlretningstræning
de: Praktische Fragen & Antworten zum Codieren und Debugging-Praxis
es: Práctica de preguntas y respuestas sobre codificación práctica y depuración
fr: Pratique de questions-réponses et de débogage en codage pratique
id: Praktik tanya jawab dan debugging untuk pemrograman
it: Pratica di domande e risposte sul codice e debug
ja: 実用的なコーディングのQ&Aとデバッグの練習
no: Praktisk koding Q&A og feilsøkingstrening
pl: Praktyczne pytania i odpowiedzi dotyczące kodowania oraz ćwiczenie debugowania
pt: Prática de perguntas e respostas sobre codificação prática e depuração
ru: Практическая секция вопросов и ответов по кодированию и отладке
sv: Praktisk Q&A för kodning och felsökningsövningar
th: การถามตอบเกี่ยวกับการเขียนโค้ดแบบปฏิบัติจริงและการฝึกแก้ไขข้อบกพร่องในโค้ด
tr: Pratik kodlama Soru-Cevap ve hata ayıklama uygulaması
uk: Практичні питання та відповіді з кодування та практика налагодження
vi: Hỏi đáp và thực hành gỡ lỗi mã hóa thực tiễn

source: Practical tips you can apply immediately
ar: نصائح عملية يمكنك تطبيقها على الفور
be: Практычныя парады, якія вы можаце прымяніць неадкладна
da: Praktiske tips, du kan anvende med det samme
de: Praktische Tipps, die Sie sofort anwenden können
es: Consejos prácticos que puedes aplicar de inmediato
fr: Conseils pratiques que vous pouvez appliquer immédiatement
id: Tips praktis yang dapat Anda terapkan segera
it: Suggerimenti pratici che puoi applicare immediatamente
ja: すぐに適用できる実践的なヒント
no: Praktiske tips du kan bruke med en gang
pl: Praktyczne wskazówki, które możesz zastosować od razu
pt: Dicas práticas que você pode aplicar imediatamente
ru: Практические советы, которые вы можете применить немедленно
sv: Praktiska tips du kan tillämpa omedelbart
th: เคล็ดลับที่สามารถนำไปใช้ได้ทันที
tr: Hemen uygulayabileceğiniz pratik ipuçları
uk: Практичні поради, які ви можете застосувати негайно
vi: Các mẹo thực tế bạn có thể áp dụng ngay lập tức

source: Practice
ar: ممارسة
be: Практыка
da: Praxis
de: Üben
es: Práctica
fr: Pratique
id: Praktik
it: Pratica
ja: 練習
ms: Amalan
no: Øv
pl: Praktyka
pt: Praticar
ru: Практика
sv: Öva
th: ฝึกฝน
tr: Pratik
uk: Практика
vi: Thực hành

source: PRACTICE AND HARD WORK
ar: التمرين والعمل الشاق
be: ПРАКТЫКА І ЦЯЖКАЯ ПРАЦА
da: ØVELSE OG HÅRDT ARBEJDE
de: ÜBUNG UND HARTER ARBEIT
es: PRÁCTICA Y TRABAJO DURO
fr: PRATIQUE ET TRAVAIL ACHARNÉ
id: LATIHAN DAN KERJA KERAS
it: PRATICA E LAVORO DURO
ja: 練習と努力
ms: LATIHAN DAN KERJA KERAS
no: ØVELSE OG HARDT ARBEID
pl: ĆWICZENIE I CIĘŻKA PRACA
pt: PRÁTICA E TRABALHO DURO
ru: ПРАКТИКА И УСЕРДНАЯ РАБОТА
sv: ÖVNING OCH HÅRT ARBETE
th: การฝึกฝนและการทำงานหนัก
tr: PRAKTİK VE SIKI ÇALIŞMA
uk: ПРАКТИКА І ВАЖКА РОБОТА
vi: THỰC HÀNH VÀ LÀM VIỆC CHĂM CHỈ

source: Practice API and system design scenarios.
ar: ممارسة سيناريوهات تصميم الأنظمة وواجهة برمجة التطبيقات.
be: Практыкуйце сцэнарыі API і праектавання сістэм.
da: Øv API- og systemdesignscenarier.
de: Üben Sie API- und Systemdesign-Szenarien.
es: Practica escenarios de API y diseño de sistemas.
fr: Pratiquez les scénarios d'API et de conception de système.
id: Berlatih skenario API dan desain sistem.
it: Esercitazione su scenari di API e progettazione del sistema.
ja: APIおよびシステムデザインのシナリオを実践する。
ms: Berlatih senario API dan reka bentuk sistem.
no: Øv på API og systemdesign-scenarier.
pl: Ćwicz scenariusze projektowania API i systemu.
pt: Pratique cenários de design de API e sistema.
ru: Практикуйте сценарии API и системного проектирования.
sv: Öva på API- och systemdesignscenarier.
th: ฝึกฝนการออกแบบ API และระบบ.
tr: API ve sistem tasarım senaryolarını çalışın.
uk: Практикуйте сценарії API та системного дизайну.
vi: Luyện tập các kịch bản thiết kế hệ thống và API.

source: Practice asking about schedules, fares, and ticket options
ar: مارس طرح الأسئلة حول الجداول الزمنية، والأسعار، وخيارات التذاكر
be: Практыкуйцеся пытацца пра расклады, цэны і варыянты білетаў
da: Øv dig i at spørge om tidsplaner, priser og billetmuligheder
de: Üben Sie, Fragen zu Fahrplänen, Preisen und Ticketoptionen zu stellen
es: Practica preguntar sobre horarios, tarifas y opciones de boletos
fr: Pratiquez la demande d'informations sur les horaires, les tarifs et les options de billets
id: Latihan bertanya tentang jadwal, tarif, dan pilihan tiket
it: Esercitati a chiedere informazioni su orari, tariffe e opzioni di biglietti
ja: スケジュール、運賃、チケットオプションについて尋ねる練習をしましょう
ms: Amalkan bertanya tentang jadual, tambang, dan pilihan tiket
no: Øv på å spørre om timeplaner, priser og billettalternativer
pl: Praktykuj pytanie o rozkłady, ceny i opcje biletów
pt: Pratique perguntar sobre horários, tarifas e opções de bilhetes
ru: Практикуйте вопросы о расписаниях, ценах и вариантах билетов
sv: Öva på att fråga om scheman, priser och biljettalternativ
th: ฝึกถามเกี่ยวกับตารางเวลา, ค่าตั๋ว, และตัวเลือกตั๋ว
tr: Programlar, tarifeler ve bilet seçenekleri hakkında soru sorma pratiği yapın
uk: Практика запитів про розклади, тарифи та варіанти квитків
vi: Thực hành hỏi về lịch trình, giá vé và lựa chọn vé

source: Practice asking for product recommendations and making purchases
ar: مارس طلب توصيات للمنتجات وإجراء المشتريات
be: Практыкуйцеся у запытах рэкамендацый прадуктаў і рабяце пакупкі
da: Øv at bede om produktanbefalinger og foretage køb
de: Üben Sie, um Produktempfehlungen zu bitten und Einkäufe zu tätigen
es: Practica pedir recomendaciones de productos y hacer compras
fr: Pratiquez à demander des recommandations de produits et à effectuer des achats
id: Latihan meminta rekomendasi produk dan melakukan pembelian
it: Pratica a chiedere consigli sui prodotti e a fare acquisti
ja: 製品の推奨を尋ねたり、購入を行ったりする練習をしましょう。
ms: Amalkan meminta saranan produk dan membuat pembelian
no: Praktisere å be om produktanbefalinger og gjøre kjøp
pl: Ćwicz pytanie o rekomendacje produktów i dokonywanie zakupów
pt: Pratique pedir recomendações de produtos e fazer compras
ru: Практикуйте просьбы о рекомендациях продуктов и совершении покупок
sv: Öva på att be om produktrekommendationer och göra köp
th: ฝึกขอคำแนะนำเกี่ยวกับผลิตภัณฑ์และการซื้อสินค้า
tr: Ürün önerileri istemek ve satın alma işlemleri yapma pratiği
uk: Практика запиту рекомендацій щодо продуктів та здійснення покупок
vi: Thực hành hỏi về gợi ý sản phẩm và thực hiện mua sắm

source: Practice booking a room, requesting amenities, and checking in
ar: مارس حجز غرفة، طلب المرافق، وتسجيل الدخول
be: Практыкуйцеся ў браніраванні пакоя, запыце ў годнасцях, і ў рэгістрацыі
da: Øv booking af et værelse, anmodning om faciliteter og check-in
de: Üben Sie das Buchen eines Zimmers, das Anfordern von Annehmlichkeiten und das Einchecken
es: Practique reservar una habitación, solicitar amenidades y hacer el check-in
fr: Pratiquez la réservation d'une chambre, la demande d'équipements et l'enregistrement
id: Latihan memesan kamar, meminta fasilitas, dan mendaftar masuk
it: Esercitati a prenotare una stanza, richiedere servizi e effettuare il check-in
ja: 部屋の予約、アメニティのリクエスト、そしてチェックインの練習をする
ms: Amalkan menempah bilik, meminta kemudahan, dan mendaftar masuk
no: Øv på å bestille et rom, be om fasiliteter, og sjekke inn
pl: Ćwicz rezerwację pokoju, zamawianie udogodnień i meldowanie się
pt: Pratique a reserva de um quarto, solicitação de comodidades e check-in
ru: Практика бронирования номера, запроса удобств и регистрации в отеле
sv: Öva på att boka ett rum, begära bekvämligheter och checka in
th: ฝึกการจองห้อง การขอสิ่งอำนวยความสะดวก และการเช็คอิน
tr: Oda rezervasyonu yapma, olanak talep etme ve giriş yapma pratiği yapın
uk: Практикуйте бронювання кімнати, запитування зручностей та реєстрацію.
vi: Thực hành đặt phòng, yêu cầu tiện nghi và làm thủ tục nhận phòng

source: Practice conversational English with FluencyPal, your 24/7 AI English tutor and speaking coach. Improve fluency, pronunciation, and confidence through real-life role-play scenarios with instant feedback.
ar: مارس المحادثة باللغة الإنجليزية مع FluencyPal، مدرسك الذكي لتعليم اللغة الإنجليزية ومدربك على التحدث المتاح على مدار الساعة وطوال أيام الأسبوع. حسّن الطلاقة، والنطق، والثقة من خلال سيناريوهات لعب الأدوار الواقعية مع ردود فعل فورية.
be: Практікуйце размовную англійскую з FluencyPal, вашым AI-рэпетытаром англійскай мовы, які працуе 24/7. Паляпшыце плаўнасць вымаўлення, вуснае вымаўленне і уверанасць у сябе праз рэальныя сцэнары ролевых гульні з мітчасовай зваротнай сувязю.
da: Øv dig i samtaleengelsk med FluencyPal, din 24/7 AI engelsklærer og talecoach. Forbedr flydende, udtale og selvtillid gennem realistiske rollespilsscenarier med øjeblikkelig feedback.
de: Üben Sie konversationales Englisch mit FluencyPal, Ihrem 24/7 KI-Englisch-Tutor und Sprach-Coach. Verbessern Sie Ihre Sprachgewandtheit, Aussprache und Ihr Selbstvertrauen durch realistische Rollenspielszenarien mit sofortigem Feedback.
es: Practica inglés conversacional con FluencyPal, tu tutor de inglés AI disponible 24/7 y entrenador de habla. Mejora la fluidez, la pronunciación y la confianza a través de escenarios de juego de roles de la vida real con retroalimentación instantánea.
fr: Pratiquez l'anglais conversationnel avec FluencyPal, votre tuteur et coach en expression orale AI disponible 24/7. Améliorez votre fluidité, votre prononciation et votre confiance grâce à des scénarios de jeu de rôle réalistes avec des retours instantanés.
id: Latih Bahasa Inggris percakapan Anda dengan FluencyPal, tutor Bahasa Inggris AI Anda yang tersedia 24/7 dan pelatih berbicara. Tingkatkan kelancaran, pengucapan, dan percaya diri melalui skenario bermain peran dunia nyata dengan umpan balik instan.
it: Pratica l'inglese conversazionale con FluencyPal, il tuo tutor di inglese AI disponibile 24 ore su 24, 7 giorni su 7, e coach di conversazione. Migliora la fluidità, la pronuncia e la fiducia attraverso scenari di gioco di ruolo della vita reale con feedback immediato.
ja: フルエンシーパルで会話英語を練習しましょう。あなたの24時間年中無休のAI英語チューターおよびスピーキングコーチです。リアルなロールプレイシナリオを通じて、流暢さ、発音、自信を即時フィードバックで向上させましょう。
ms: Amalkan bahasa Inggeris perbualan dengan FluencyPal, tutor dan jurulatih bercakap AI bahasa Inggeris anda 24/7. Tingkatkan kefasihan, sebutan, dan keyakinan melalui senario main peranan kehidupan sebenar dengan maklumbalas segera.
no: Øv på samtaleengelsk med FluencyPal, din 24/7 AI-engelsklærer og talecoach. Forbedre flyt, uttale og selvtillit gjennom virkelige rollespillscenarier med umiddelbar tilbakemelding.
pl: Ćwicz konwersacyjną angielszczyznę z FluencyPal, twoim całodobowym nauczycielem angielskiego AI i trenerem mówienia. Popraw płynność, wymowę i pewność siebie dzięki scenariuszom z życia wziętym, z natychmiastową informacją zwrotną.
pt: Pratique inglês conversacional com o FluencyPal, seu tutor de inglês AI disponível 24/7 e treinador de fala. Melhore a fluência, a pronúncia e a confiança por meio de cenários de simulação da vida real com feedback instantâneo.
ru: Практикуйте разговорный английский с FluencyPal, вашим AI репетитором по английскому языку и тренером по разговорной практике, доступным 24/7. Улучшайте беглость, произношение и уверенность через реальные ролевые сценарии с мгновенной обратной связью.
sv: Öva konverserande engelska med FluencyPal, din AI-engelska handledare och talcoach dygnet runt. Förbättra flyt, uttal och självförtroende genom verkliga rollspelscenarier med omedelbar feedback.
th: ฝึกฝนภาษาอังกฤษในการสนทนากับ FluencyPal ผู้สอนภาษาอังกฤษ AI ที่ให้บริการตลอด 24 ชั่วโมงและโค้ชการพูด ปรับปรุงความคล่องแคล่ว การออกเสียง และความมั่นใจผ่านสถานการณ์การจำลองในชีวิตจริงพร้อมข้อเสนอแนะแบบทันที
tr: FluencyPal ile konuşma İngilizcesi pratiği yapın, 7/24 AI İngilizce öğretmeniniz ve konuşma koçunuz. Gerçek yaşam rol oynama senaryoları ile akıcılığı, telaffuzu ve güveni anlık geri bildirim ile geliştirin.
uk: Практикуйте розмовну англійську з FluencyPal, вашим 24/7 AI викладачем англійської мови та тренером з розмовної практики. Покращуйте свою плавність, вимову та впевненість через реальні сценарії ролей з миттєвим зворотним зв'язком.
vi: Thực hành tiếng Anh hội thoại với FluencyPal, gia sư tiếng Anh AI 24/7 và huấn luyện viên nói chuyện của bạn. Cải thiện sự trôi chảy, phát âm và sự tự tin thông qua các tình huống đóng vai thực tế với phản hồi ngay lập tức.

source: Practice English Conversation with AI | FluencyPal
ar: ممارسة المحادثة باللغة الإنجليزية مع الذكاء الاصطناعي | فلوينسي بال
be: Практыкуйце англійскую размову з AI | FluencyPal
da: Øv engelsk samtale med AI | FluencyPal
de: Üben Sie Englisch Konversation mit KI | FluencyPal
es: Practica Conversación en Inglés con IA | FluencyPal
fr: Pratiquez la conversation anglaise avec l'IA | FluencyPal
id: Latihan Percakapan Bahasa Inggris dengan AI | FluencyPal
it: Pratica la conversazione in inglese con l'IA | FluencyPal
ja: AIと英会話の練習 | フルエンシーパル
ms: Berlatih Perbualan Bahasa Inggeris dengan AI | FluencyPal
no: Praktiser engelsk samtale med AI | FluencyPal
pl: Praktykuj konwersacje po angielsku z AI | FluencyPal
pt: Pratique Conversação em Inglês com IA | FluencyPal
ru: Практикуйте разговорный английский с ИИ | FluencyPal
sv: Öva engelska konversation med AI | FluencyPal
th: ฝึกสนทนาภาษาอังกฤษกับ AI | FluencyPal
tr: AI ile İngilizce Konuşma Pratiği | FluencyPal
uk: Практикуйте англійську розмову з AI | FluencyPal
vi: Thực hành hội thoại tiếng Anh với AI | FluencyPal

source: Practice English Online
ar: ممارسة اللغة الإنجليزية على الإنترنت
be: Практыкуйце англійскую мову ў інтэрнэце
da: Øv engelsk online
de: Üben Sie Englisch online
es: Practicar inglés en línea
fr: Pratiquez l'anglais en ligne
id: Praktikkan Bahasa Inggris Secara Online
it: Pratica l'inglese online
ja: オンラインで英語を練習する
ms: Amalkan Bahasa Inggeris Dalam Talian
no: Praktiser engelsk på nettet
pl: Ćwicz angielski online
pt: Pratique Inglês Online
ru: Практикуйте английский онлайн
sv: Praktisera engelska online
th: ฝึกภาษาอังกฤษออนไลน์
tr: Online İngilizce Pratiği
uk: Практикуйте англійську онлайн
vi: Thực hành tiếng Anh trực tuyến

source: Practice explaining product issues and requesting refunds or exchanges
ar: مارس شرح مشكلات المنتجات وطلب استرداد الأموال أو التبادلات
be: Практыкуйцеся ў тым, каб тлумачыць праблемы з таварам і запытваць аб вяртанні грошай або абмене
da: Øv dig i at forklare produktproblemer og anmode om refusioner eller ombytninger
de: Üben Sie, Produktprobleme zu erklären und Rückerstattungen oder Umtausch zu beantragen
es: Practica explicar problemas de productos y solicitar reembolsos o cambios
fr: Pratiquez l'explication des problèmes de produit et la demande de remboursements ou d'échanges
id: Latihan menjelaskan masalah produk dan meminta pengembalian dana atau pertukaran
it: Pratica la spiegazione dei problemi del prodotto e la richiesta di rimborsi o scambi
ja: 製品の問題を説明し、返金または交換をリクエストする練習をする
ms: Amalkan menerangkan isu produk dan meminta pemulangan atau pertukaran
no: Praktisér å forklare produktegenskaper og be om refusjoner eller bytter
pl: Ćwiczenie wyjaśniania problemów z produktem oraz wnioskowania o zwroty lub wymiany
pt: Pratique explicar problemas com produtos e solicitar reembolsos ou trocas
ru: Практика объяснения проблем с продуктами и просьбы о возврате или обмене
sv: Öva på att förklara produktproblem och begära återbetalningar eller byten
th: ฝึกการอธิบายปัญหาของผลิตภัณฑ์และการขอคืนเงินหรือการเปลี่ยนสินค้า
tr: Ürün sorunlarını açıklama ve geri ödeme veya değişim talep etme pratiği yapın
uk: Практикуйте пояснення проблем з продуктом та запити на повернення або обмін
vi: Thực hành giải thích các vấn đề về sản phẩm và yêu cầu hoàn tiền hoặc đổi hàng

source: Practice in real interview conditions — no tutors needed.
ar: تدرب في ظروف مقابلة حقيقية — لا حاجة لمعلمين.
be: Практыкуйцеся ў рэальных умовах інтэрв'ю — без патрэбы ў настаўніках.
da: Øv dig under virkelige interviewforhold — ingen undervisere nødvendige.
de: Üben Sie unter realen Interviewbedingungen – keine Tutoren erforderlich.
es: Practica en condiciones reales de entrevista — sin necesidad de tutores.
fr: Pratiquez dans des conditions réelles d'entretien — pas besoin de tuteurs.
id: Berlatih dalam kondisi wawancara yang sebenarnya — tidak memerlukan tutor.
it: Pratica in condizioni reali di intervista — nessun tutor necessario.
ja: 実際のインタビュー環境で練習 — チューターは不要です。
ms: Berlatih dalam keadaan temu duga sebenar — tiada tutor diperlukan.
no: Øv deg i ekte intervjubetingelser — ingen veiledere nødvendig.
pl: Ćwicz w rzeczywistych warunkach rozmowy kwalifikacyjnej — bez potrzeby korzystania z korepetytorów.
pt: Pratique em condições reais de entrevista — sem necessidade de tutores.
ru: Практикуйтесь в условиях реального собеседования — репетиторы не нужны.
sv: Öva under verkliga intervjuförhållanden — inga handledare behövs.
th: ฝึกฝนในเงื่อนไขการสัมภาษณ์จริง — ไม่ต้องใช้ติวเตอร์
tr: Gerçek mülakat koşullarında pratik yapın — eğitmen gerekmez.
uk: Практикуйтеся в реальних умовах співбесіди — без наставників.
vi: Thực hành trong điều kiện phỏng vấn thực tế — không cần gia sư.

source: Practice Interview Answers Before It Matters
ar: تمرن على إجابات المقابلة قبل أن تهمك
be: Практыкуйце адказы на сумоўе да таго, як гэта стане важным
da: Øv dig på interviewsvar, før det gælder
de: Üben Sie Interviewantworten, bevor es darauf ankommt
es: Practica las Respuestas de Entrevista Antes de que Importen
fr: Pratiquez les Réponses aux Interviews Avant que Cela ne Compte
id: Latih Jawaban Wawancara Sebelum Hal Itu Penting
it: Esercitati nelle Risposte per il Colloquio Prima che Importi
ja: それが重要になる前に、インタビューの回答を練習する
no: Øv på intervjusvar før det gjelder
pl: Ćwicz Odpowiedzi na Rozmowę Kwalifikacyjną Zanim To Się Liczy
pt: Pratique as Respostas de Entrevista Antes que Elas Importem
ru: Практикуйте ответы на собеседовании, пока это не стало важным
sv: Öva på svaren inför intervjun innan det gäller
th: ฝึกตอบคำถามสัมภาษณ์ก่อนที่จะสำคัญ
tr: Önemli Olmadan Önce Mülakat Cevaplarını Pratik Yapın
uk: Практикуйте відповіді на інтерв'ю, перш ніж це стане важливим.
vi: Luyện tập trả lời phỏng vấn trước khi điều này quan trọng

source: Practice Interviews on FluencyPal: Your Path to Confidence
ar: ممارسة المقابلات على FluencyPal: طريقك نحو الثقة
be: Практыка інтэрв'ю на FluencyPal: Ваш шлях да ўпэўненасці
da: Øv interviews på FluencyPal: Din vej til selvsikkerhed
de: Übungsgespräche auf FluencyPal: Ihr Weg zur Selbstsicherheit
es: Entrevistas de práctica en FluencyPal: Tu camino hacia la confianza
fr: Entraînements d'Entretiens sur FluencyPal : Votre Chemin vers la Confiance
id: Latihan Wawancara di FluencyPal: Jalanmu Menuju Kepercayaan Diri
it: Interviste di Pratica su FluencyPal: Il Tuo Percorso verso la Sicurezza
ja: FluencyPalでの練習面接：自信への道筋
ms: Latihan Temuramah di FluencyPal: Jalan Anda ke Keyakinan
no: Øv på intervjuer på FluencyPal: Din vei til selvsikkerhet
pl: Treningi wywiadów na FluencyPal: Twoja ścieżka do pewności siebie
pt: Entrevistas de Prática no FluencyPal: Seu Caminho para a Confiança
ru: Практика интервью на FluencyPal: Ваш путь к уверенности
sv: Öva intervjuer på FluencyPal: Din väg till självförtroende
th: ฝึกสัมภาษณ์บน FluencyPal: ทางสู่ความมั่นใจ
tr: FluencyPal'da Pratik Mülakatlar: Kendine Güven Yolunuz
uk: Практичні інтерв'ю на FluencyPal: Ваш шлях до впевненості
vi: Luyện tập Phỏng vấn trên FluencyPal: Con đường đến sự tự tin

source: Practice Job Interview
ar: ممارسة مقابلة العمل
be: Практыка праходжэння працоўнага інтэрв'ю
da: Øv Jobinterview
de: Üben Sie Vorstellungsgespräche
es: Practicar Entrevista de Trabajo
fr: Pratiquer l'entretien d'embauche
id: Praktik Wawancara Kerja
it: Pratica Colloquio di Lavoro
ja: 練習の職務面接
ms: Amalkan Temuduga Pekerjaan
no: Praktisere jobbintervju
pl: Ćwiczenie rozmowy kwalifikacyjnej
pt: Praticar Entrevista de Emprego
ru: Практика собеседования на работу
sv: Öva Jobbintervju
th: ฝึกสัมภาษณ์งาน
tr: Pratik İş Mülakatı
uk: Практика співбесіди
vi: Thực hành phỏng vấn xin việc
