Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Tech stack covered
ar: تكنولوجيا المُكوِّنة التي تم تغطيتها
be: Тэхналагічны стэк ахоплены
da: Teknologisk stak dækket
de: Technologiestapel abgedeckt
es: Conjunto de tecnologías cubierto
fr: Pile technologique couverte
id: Tumpukan teknologi yang dibahas
it: Tecnologie coperte
ja: カバーされている技術スタック
ms: Tumpuan timbunan teknologi
no: Teknologier dekket
pl: Stos technologiczny omówiony
pt: Pilha de tecnologia coberta
ru: Используемый стек технологий
sv: Teknikstack täckt
th: ครอบคลุมเทคโนโลยีที่ใช้
tr: Kapsanan teknoloji yığını
uk: Технологічний стек охоплено
vi: Ngăn xếp công nghệ được đề cập

source: Tech Support
id: Dukungan Teknis
it: Supporto Tecnico
ja: テクニカルサポート
no: Teknisk støtte
pl: Wsparcie Techniczne
ru: Техническая поддержка
sv: Teknisk Support
uk: Технічна підтримка

source: Technical analysis on system design and architecture answers
ar: تحليل تقني حول تصميم النظام وإجابات الهندسة المعمارية
be: Тэхнічны аналіз сістэмнага праектавання і канструкцыі адказы
da: Teknisk analyse af systemdesign og arkitektur svar
de: Technische Analyse zu Systemdesign und Architekturantworten
es: Análisis técnico sobre diseño de sistemas y respuestas de arquitectura
fr: Analyse technique sur les réponses de conception et d'architecture des systèmes
id: Analisis teknis tentang jawaban desain sistem dan arsitektur
it: Analisi tecnica sulle risposte di progettazione e architettura del sistema
ja: システム設計とアーキテクチャの技術分析の回答
ms: Analisis teknikal mengenai reka bentuk sistem dan jawapan seni bina
no: Teknisk analyse av systemdesign og arkitektur svar
pl: Analiza techniczna dotycząca projektowania i architektury systemów odpowiedzi
pt: Análise técnica sobre design e arquitetura de sistemas respostas
ru: Технический анализ по проектированию и архитектуре системы ответы
sv: Teknisk analys av systemdesign och arkitektur svar
th: การวิเคราะห์ทางเทคนิคเกี่ยวกับการออกแบบและสถาปัตยกรรมระบบตอบคำถาม
tr: Sistem tasarımı ve mimarisi üzerinde teknik analiz cevapları
uk: Технічний аналіз системного дизайну та архітектури відповідей
vi: Phân tích kỹ thuật về thiết kế hệ thống và câu trả lời kiến trúc

source: Technical Question
ar: سؤال تقني
be: Тэхнічнае Пытанне
da: Teknisk Spørgsmål
de: Technische Frage
es: Pregunta Técnica
fr: Question technique
id: Pertanyaan Teknis
it: Domanda Tecnica
ja: 技術的な質問
ms: Soalan Teknikal
no: Teknisk spørsmål
pl: Pytanie techniczne
pt: Questão Técnica
ru: Технический вопрос
sv: Teknisk fråga
th: คำถามทางเทคนิค
tr: Teknik Soru
uk: Технічне питання
vi: Câu Hỏi Kỹ Thuật

source: Technical Support
ar: الدعم الفني
be: Тэхнічная падтрымка
da: Teknisk Support
de: Technischer Support
es: Soporte Técnico
fr: Assistance Technique
id: Dukungan Teknis
it: Assistenza Tecnica
ja: テクニカルサポート
ms: Sokongan Teknikal
no: Teknisk støtte
pl: Wsparcie techniczne
pt: Suporte Técnico
ru: Техническая поддержка
sv: Teknisk Support
th: การสนับสนุนทางเทคนิค
tr: Teknik Destek
uk: Технічна підтримка
vi: Hỗ trợ kỹ thuật

source: Tell about a time you were stuck on a bug. How did you find the cause and fix it?
ar: أخبرنا عن وقت واجهت فيه خللاً برمجيًا. كيف وجدت السبب وقمت بإصلاحه؟
be: Раскажыце пра час, калі вы сутыкнуліся з памылкай. Як вы знайшлі прычыну і выправілі яе?
da: Fortæl om en tid, hvor du sad fast på en fejl. Hvordan fandt du årsagen, og hvordan løste du den?
de: Erzählen Sie von einer Zeit, in der Sie an einem Fehler hängen geblieben sind. Wie haben Sie die Ursache gefunden und behoben?
es: Cuenta sobre una vez que te quedaste atascado con un error. ¿Cómo encontraste la causa y la solucionaste?
fr: Parlez d'un moment où vous étiez bloqué sur un bug. Comment avez-vous trouvé la cause et l'avez-vous corrigé ?
id: Beritahu tentang suatu waktu ketika Anda terjebak dalam sebuah bug. Bagaimana Anda menemukan penyebabnya dan memperbaikinya?
it: Racconta di una volta in cui sei stato bloccato su un bug. Come hai trovato la causa e l'hai risolto?
ja: バグに悩まされた経験について教えてください。原因をどのように突き止め、修正しましたか？
no: Fortell om en gang du satt fast med en feil. Hvordan fant du årsaken og fikset den?
pl: Opowiedz o czasie, kiedy utknąłeś na problemie z błędem. Jak znalazłeś przyczynę i ją naprawiłeś?
pt: Conte sobre uma vez em que você ficou preso em um bug. Como você descobriu a causa e a corrigiu?
ru: Расскажите о времени, когда вы застряли на ошибке. Как вы нашли причину и исправили её?
sv: Berätta om en gång du fastnade på en bugg. Hur hittade du orsaken och fixade den?
th: เล่าถึงครั้งหนึ่งที่คุณเจอปัญหาโค้ดบั๊ก คุณหาสาเหตุและแก้ไขมันอย่างไร?
tr: Bir hata üzerinde takıldığınız bir zamanı anlatın. Sebebini nasıl buldunuz ve düzelttiniz?
uk: Розкажіть про випадок, коли ви зіткнулися з багом. Як ви знайшли його причину та виправили?
vi: Hãy kể về một lần bạn bị mắc kẹt với một lỗi. Bạn đã tìm ra nguyên nhân và khắc phục nó như thế nào?

source: Tell me about your goals
de: Erzählen Sie mir von Ihren Zielen
es: Cuéntame sobre tus objetivos
id: Ceritakan tentang tujuan Anda
it: Parlami dei tuoi obiettivi
ja: あなたの目標について教えてください
no: Fortell meg om dine mål
pl: Powiedz mi o swoich celach
pt: Conte-me sobre seus objetivos
ru: Расскажи мне о своих целях
sv: Berätta om dina mål
th: บอกฉันเกี่ยวกับเป้าหมายของคุณ
tr: Hedefleriniz hakkında bana bilgi verin
uk: Розкажи мені про свої цілі
vi: Hãy cho tôi biết về mục tiêu của bạn

source: Tell us about your background, experience, and what makes you a great Senior Frontend Developer.
ar: أخبرنا عن خلفيتك وخبراتك وما الذي يجعلك مطور واجهات أمامية رائع في المستوى المتقدم.
be: Раскажыце пра свой фон, вопыт і што робіць вас выдатным старшым фронтэнд-распрацоўшчыкам.
da: Fortæl os om din baggrund, erfaring og hvad der gør dig til en fremragende Senior Frontend Udvikler.
de: Erzählen Sie uns von Ihrem Hintergrund, Ihrer Erfahrung und was Sie zu einem großartigen Senior Frontend Entwickler macht.
es: Cuéntanos sobre tu formación, experiencia y qué te hace ser un gran Desarrollador Frontend Senior.
fr: Parlez-nous de votre parcours, de votre expérience et de ce qui fait de vous un excellent Développeur Frontend Sénior.
id: Ceritakan kepada kami tentang latar belakang Anda, pengalaman Anda, dan apa yang membuat Anda menjadi Senior Frontend Developer yang hebat.
it: Parlaci del tuo background, della tua esperienza e di cosa ti rende un eccellente Sviluppatore Frontend Senior.
ja: あなたのバックグラウンド、経験、そしてあなたを優れたシニアフロントエンド開発者たらしめる要素について教えてください。
ms: Beritahu kami tentang latar belakang, pengalaman, dan apa yang membuat anda seorang Pembangun Hadapan Senior yang hebat.
no: Fortell oss om din bakgrunn, erfaring, og hva som gjør deg til en fantastisk Senior Frontend-utvikler.
pl: Powiedz nam o swoim doświadczeniu, kwalifikacjach i co czyni Cię świetnym Seniorem Developera Frontendu.
pt: Conte-nos sobre seu histórico, experiência e o que faz de você um ótimo Desenvolvedor Frontend Sênior.
ru: Расскажите о своем опыте, навыках и почему вы являетесь отличным Старшим Frontend-разработчиком.
sv: Berätta om din bakgrund, erfarenhet och vad som gör dig till en fantastisk Senior Frontend-utvecklare.
th: บอกเราเกี่ยวกับพื้นเพ ประสบการณ์ และสิ่งที่ทำให้คุณเป็นนักพัฒนาเว็บด้านหน้าอาวุโสที่ยอดเยี่ยม
tr: Bize geçmişiniz, deneyimleriniz ve sizi harika bir Kıdemli Ön Uç Geliştirici yapan şeyler hakkında bilgi verin.
uk: Розкажіть нам про свій досвід, навички та що робить вас відмінним старшим фронтенд-розробником.
vi: Cho chúng tôi biết về nền tảng, kinh nghiệm của bạn, và điều gì khiến bạn trở thành một Nhà Phát Triển Frontend Cao Cấp tuyệt vời.

source: Tell us about your background, what you've learned so far, and what you want to improve as a Junior Frontend Developer.
ar: أخبرنا عن خلفيتك، وما تعلمته حتى الآن، وما الذي تريد تحسينه كمطور واجهات أمامية مبتدئ.
be: Раскажыце пра свой прафесійны вопыт, што вы вывучылі да гэтага моманту, і што вы хочаце палепшыць як пачатковы Frontend-распрацоўшчык.
da: Fortæl os om din baggrund, hvad du har lært indtil videre, og hvad du ønsker at forbedre som Junior Frontend Developer.
de: Erzählen Sie uns von Ihrem Hintergrund, was Sie bisher gelernt haben und was Sie als Junior Frontend-Entwickler verbessern möchten.
es: Cuéntanos sobre tu experiencia, lo que has aprendido hasta ahora y lo que quieres mejorar como Desarrollador Frontend Junior.
fr: Parlez-nous de votre parcours, de ce que vous avez appris jusqu'à présent et de ce que vous souhaitez améliorer en tant que développeur frontend junior.
id: Ceritakan kepada kami tentang latar belakang Anda, apa yang telah Anda pelajari sejauh ini, dan apa yang ingin Anda tingkatkan sebagai Junior Frontend Developer.
it: Dicci del tuo background, cosa hai imparato finora e cosa vuoi migliorare come Junior Frontend Developer.
ja: これまでの経歴、これまでに学んだこと、そしてジュニアフロントエンド開発者として改善したいことについて教えてください。
no: Fortell oss om din bakgrunn, hva du har lært så langt, og hva du ønsker å forbedre som en Junior Frontend-utvikler.
pl: Powiedz nam o swoim doświadczeniu, czego się do tej pory nauczyłeś i co chcesz poprawić jako Junior Frontend Developer.
pt: Conte-nos sobre seu histórico, o que você aprendeu até agora e o que deseja melhorar como Desenvolvedor Frontend Júnior.
ru: Расскажите нам о своем опыте, о том, чему вы уже научились, и что вы хотели бы улучшить как младший фронтенд-разработчик.
sv: Berätta om din bakgrund, vad du har lärt dig hittills och vad du vill förbättra som Junior Frontend-utvecklare.
th: บอกเราเกี่ยวกับพื้นฐานของคุณ สิ่งที่คุณได้เรียนรู้มาแล้ว และสิ่งที่คุณต้องการพัฒนาในฐานะนักพัฒนา Frontend ระดับจูเนียร์
tr: Bize geçmişinizden, şu ana kadar neler öğrendiğinizden ve Junior Frontend Geliştirici olarak geliştirmek istediğiniz alanlardan bahsedin.
uk: Розкажіть нам про свій досвід, чого ви навчилися досі та що хотіли б покращити як Джуніор Фронтенд Розробник.
vi: Hãy cho chúng tôi biết về nền tảng của bạn, những gì bạn đã học được cho đến nay, và những gì bạn muốn cải thiện với tư cách là một Nhà phát triển Frontend Junior.

source: Terms and Conditions
ar: الشروط والأحكام
be: Умовы і ўмовы
da: Vilkår og Betingelser
de: Nutzungsbedingungen
es: Términos y Condiciones
fr: Conditions Générales
id: Syarat dan Ketentuan
it: Termini e Condizioni
ja: 利用規約
ms: Terma dan Syarat
no: Vilkår og betingelser
pl: Warunki i Zasady
pt: Termos e Condições
ru: Условия и положения
sv: Villkor och bestämmelser
th: ข้อกำหนดและเงื่อนไข
tr: Şartlar ve Koşullar
uk: Умови та Положення
vi: Điều Khoản và Điều Kiện

source: Terms of Service
ar: شروط الخدمة
be: Умовы абслугоўвання
da: Servicevilkår
de: Nutzungsbedingungen
es: Términos de servicio
fr: Conditions d'utilisation
id: Ketentuan Layanan
it: Termini di Servizio
ja: 利用規約
ms: Terma Perkhidmatan
no: Tjenestevilkår
pl: Warunki świadczenia usług
pt: Termos de Serviço
ru: Условия использования
sv: Användarvillkor
th: ข้อกำหนดในการให้บริการ
tr: Hizmet Şartları
uk: Умови обслуговування
vi: Điều khoản Dịch vụ

source: Terms of Use
ar: شروط الاستخدام
be: Умовы карыстання
da: Brugsbetingelser
de: Nutzungsbedingungen
es: Términos de Uso
fr: Conditions d'utilisation
id: Ketentuan Penggunaan
it: Termini di Utilizzo
ja: 利用規約
ms: Terma Penggunaan
no: Vilkår for bruk
pl: Warunki korzystania z usługi
pt: Termos de Uso
ru: Условия использования
sv: Villkor för användning
th: ข้อกำหนดการใช้งาน
tr: Kullanım Şartları
uk: Умови використання
vi: Điều khoản sử dụng

source: Test your interview skills with FluencyPal's AI-powered interview quiz. Practice answering common questions, receive instant feedback, and boost your confidence for real interviews.
ar: اختبر مهاراتك في المقابلات مع اختبار المقابلة الذي يدعمه الذكاء الاصطناعي من FluencyPal. تدرب على الإجابة على الأسئلة الشائعة، واحصل على تعليقات فورية، وزد من ثقتك للمقابلات الحقيقية.
be: Пратэстуйце свае навыкі сумоўя з дапамогай AI-квіза для сумоўяў ад FluencyPal. Практыкуйце адказы на распаўсюджаныя пытанні, атрымлівайце імгненную зваротную сувязь і павышайце ўпэўненасць для рэальных сумоўяў.
da: Test dine interviewfærdigheder med FluencyPals AI-drevne interviewquiz. Øv dig i at besvare almindelige spørgsmål, modtag øjeblikkelig feedback, og boost din selvtillid til rigtige interviews.
de: Testen Sie Ihre Interviewfähigkeiten mit dem KI-gestützten Interview-Quiz von FluencyPal. Üben Sie das Beantworten häufiger Fragen, erhalten Sie sofortiges Feedback und steigern Sie Ihr Vertrauen für echte Interviews.
es: Pon a prueba tus habilidades de entrevista con el cuestionario de entrevistas impulsado por IA de FluencyPal. Practica respondiendo preguntas comunes, recibe retroalimentación instantánea y aumenta tu confianza para entrevistas reales.
fr: Testez vos compétences en entretien avec le quiz d'entretien alimenté par l'IA de FluencyPal. Entraînez-vous à répondre aux questions courantes, recevez un retour instantané et renforcez votre confiance pour les entretiens réels.
id: Uji keterampilan wawancara Anda dengan kuis wawancara bertenaga AI dari FluencyPal. Latih menjawab pertanyaan umum, dapatkan umpan balik instan, dan tingkatkan kepercayaan diri Anda untuk wawancara sesungguhnya.
it: Metti alla prova le tue abilità di colloquio con il quiz interattivo alimentato dall'IA di FluencyPal. Esercitati a rispondere a domande comuni, ricevi feedback immediato e aumenta la tua fiducia per i colloqui reali.
ja: 面接スキルをFluencyPalのAI搭載の面接クイズでテストしましょう。一般的な質問に答える練習をし、即時フィードバックを受け取り、実際の面接への自信を高めましょう。
ms: Uji kemahiran temuduga anda dengan kuiz temuduga berkuasa AI daripada FluencyPal. Amalkan menjawab soalan-soalan biasa, terima maklum balas segera, dan tingkatkan keyakinan anda untuk temuduga sebenar.
no: Test ferdighetene dine i intervjuer med FluencyPals AI-drevne intervjuquiz. Øv deg på å svare på vanlige spørsmål, motta umiddelbar tilbakemelding, og øk selvtilliten din for ekte intervjuer.
pl: Przetestuj swoje umiejętności w rozmowach kwalifikacyjnych z quizem FluencyPal wspomaganym przez AI. Ćwicz odpowiadanie na typowe pytania, otrzymuj natychmiastową informację zwrotną i zwiększ swoją pewność siebie przed prawdziwymi rozmowami kwalifikacyjnymi.
pt: Teste suas habilidades de entrevista com o quiz de entrevista alimentado por IA do FluencyPal. Pratique a resposta a perguntas comuns, receba feedback instantâneo e aumente sua confiança para entrevistas reais.
ru: Проверьте свои навыки прохождения интервью с помощью теста на интервью от FluencyPal, основанного на ИИ. Попрактикуйтесь в ответах на распространенные вопросы, получайте мгновенную обратную связь и повышайте уверенность в реальных собеседованиях.
sv: Testa dina intervjufärdigheter med FluencyPals AI-drivna intervjukviss. Öva på att svara på vanliga frågor, få omedelbar feedback och öka ditt självförtroende inför riktiga intervjuer.
th: ทดสอบทักษะการสัมภาษณ์ของคุณกับ FluencyPal แบบทดสอบการสัมภาษณ์ที่ขับเคลื่อนด้วย AI ฝึกตอบคำถามที่พบบ่อย รับความคิดเห็นทันที และเพิ่มความมั่นใจของคุณสำหรับการสัมภาษณ์จริง
tr: FluencyPal'in yapay zekâ destekli mülakat testi ile mülakat becerilerinizi test edin. Yaygın soruları yanıtlamayı pratiğe dökün, anında geri bildirim alın ve gerçek mülakatlar için güveninizi artırın.
uk: Перевірте свої навички інтерв'ювання з інтерв'ю-вікториною від FluencyPal на базі штучного інтелекту. Практикуйтеся у відповідях на поширені запитання, отримуйте миттєвий зворотний зв'язок і підвищуйте свою впевненість для реальних співбесід.
vi: Kiểm tra kỹ năng phỏng vấn của bạn với bài kiểm tra phỏng vấn được hỗ trợ bởi AI của FluencyPal. Luyện tập trả lời các câu hỏi thường gặp, nhận phản hồi tức thì và gia tăng sự tự tin của bạn cho các cuộc phỏng vấn thực tế.

source: Testing & Quality
ar: الاختبار والجودة
be: Тэставанне і якасць
da: Testning & Kvalitet
de: Testen & Qualität
es: Pruebas y Calidad
fr: Test & Qualité
id: Pengujian & Kualitas
it: Test e qualità
ja: テストと品質
ms: Pengujian & Kualiti
no: Testing & Kvalitet
pl: Testowanie i Jakość
pt: Teste e Qualidade
ru: Тестирование и качество
sv: Testning & Kvalitet
th: การทดสอบ & คุณภาพ
tr: Test Etme & Kalite
uk: Тестування та Якість
vi: Kiểm tra & Chất lượng

source: Thai Learning Plan
ar: خطة تعلم اللغة الإنجليزية
be: План вучэння тайскай
da: Thai Læringsplan
de: Thailändischer Lernplan
es: Plan de Aprendizaje de Tailandés
fr: Plan d'Apprentissage du Thaï
id: Rencana Belajar Bahasa Thailand
it: Piano di Apprendimento Thai
ja: タイ語学習計画
ms: Rancangan Pembelajaran Thai
no: Thai Læringsplan
pl: Plan Nauki Tajskiego
pt: Plano de Aprendizado de Tailandês
ru: План Изучения Тайского
sv: Thailändsk Inlärningsplan
th: แผนการเรียนรู้ภาษาไทย
tr: Tay Dili Öğrenme Planı
uk: План навчання Thai
vi: Kế Hoạch Học Tiếng Thái

source: Thank you for completing the Junior Frontend Developer interview prep. You can now open your dashboard and keep practicing. Good luck!
ar: شكرًا لك على إتمام التحضير لمقابلة مطور الواجهة الأمامية المبتدئ. يمكنك الآن فتح لوحة التحكم الخاصة بك واستمرار الممارسة. حظًا موفقًا!
be: Дзякуй за завяршэнне падрыхтоўкі да спаткання на пасаду Junior Frontend Developer. Зараз вы можаце адкрыць сваю панэль кіравання і працягваць практыкавацца. Поспехаў!
da: Tak for at gennemføre Junior Frontend Developer interviewforberedelsen. Du kan nu åbne dit dashboard og fortsætte med at øve. Held og lykke!
de: Danke, dass Sie die Vorbereitung auf das Vorstellungsgespräch für Junior Frontend Developer abgeschlossen haben. Sie können nun Ihr Dashboard öffnen und weiter üben. Viel Glück!
es: Gracias por completar la preparación para la entrevista de Desarrollador Frontend Junior. Ahora puedes abrir tu panel de control y seguir practicando. ¡Buena suerte!
fr: Merci d'avoir terminé la préparation à l'entretien pour le poste de Développeur Frontend Junior. Vous pouvez maintenant ouvrir votre tableau de bord et continuer à vous entraîner. Bonne chance !
id: Terima kasih telah menyelesaikan persiapan wawancara Junior Frontend Developer. Anda sekarang dapat membuka dasbor Anda dan terus berlatih. Semoga sukses!
it: Grazie per aver completato la preparazione all'intervista per Junior Frontend Developer. Ora puoi aprire il tuo cruscotto e continuare a esercitarti. Buona fortuna!
ja: ジュニアフロントエンド開発者向けのインタビュー準備を完了していただき、ありがとうございます。ダッシュボードを開いて練習を続けられます。頑張ってください！
no: Takk for at du fullførte forberedelsen til intervjuet for Junior Frontend Utvikler. Du kan nå åpne dashbordet ditt og fortsette å øve. Lykke til!
pl: Dziękujemy za ukończenie przygotowań do rozmowy kwalifikacyjnej na Junior Frontend Developera. Teraz możesz otworzyć swój panel i kontynuować ćwiczenia. Powodzenia!
pt: Obrigado por completar a preparação para a entrevista de Desenvolvedor Frontend Júnior. Agora você pode abrir seu painel e continuar praticando. Boa sorte!
ru: Спасибо за завершение подготовки к интервью на позицию младшего Frontend разработчика. Теперь вы можете открыть свою панель управления и продолжать практиковаться. Удачи!
sv: Tack för att du har slutfört förberedelserna för intervjun som Junior Frontend-utvecklare. Du kan nu öppna din instrumentpanel och fortsätta öva. Lycka till!
th: ขอบคุณที่ทำการเตรียมตัวสอบสัมภาษณ์สำหรับตำแหน่งนักพัฒนาฟรอนต์เอนด์ระดับจูเนียร์เสร็จเรียบร้อยแล้ว ตอนนี้คุณสามารถเปิดแดชบอร์ดของคุณและฝึกฝนต่อได้ ขอให้โชคดี!
tr: Junior Frontend Developer mülakat hazırlığını tamamladığınız için teşekkür ederiz. Şimdi panonuzu açabilir ve pratik yapmaya devam edebilirsiniz. İyi şanslar!
uk: Дякуємо за завершення підготовки до інтерв'ю на посаду Junior Frontend Developer. Тепер ви можете відкрити свою панель інструментів та продовжувати практикуватись. Успіхів!
vi: Cảm ơn bạn đã hoàn thành chuẩn bị phỏng vấn Junior Frontend Developer. Bây giờ bạn có thể mở bảng điều khiển của mình và tiếp tục luyện tập. Chúc bạn may mắn!

source: Thank you for completing the Senior Frontend Developer interview prep. You can now access your dashboard to start practicing. Good luck!
ar: شكراً لك على إكمال التحضير لمقابلة مطور الواجهة الأمامية المتقدم. يمكنك الآن الوصول إلى لوحة التحكم الخاصة بك لبدء الممارسة. حظاً موفقاً!
be: Дзякуй за завяршэнне падрыхтоўкі да інтэрв'ю на пасаду Старэйшага Фронтэнд-распрацоўшчыка. Цяпер вы можаце перайсці на вашу панэль кіравання, каб пачаць практыкавацца. Поспехаў!
da: Tak for at have gennemført forberedelsen til interviewet som Senior Frontend Developer. Du kan nu få adgang til dit dashboard for at begynde at øve. Held og lykke!
de: Vielen Dank, dass Sie die Vorbereitungen auf das Vorstellungsgespräch als Senior Frontend Entwickler abgeschlossen haben. Sie können nun auf Ihr Dashboard zugreifen, um mit dem Üben zu beginnen. Viel Glück!
es: Gracias por completar la preparación para la entrevista de Desarrollador Frontend Senior. Ahora puedes acceder a tu panel para comenzar a practicar. ¡Buena suerte!
fr: Merci d'avoir terminé la préparation à l'entretien de Senior Frontend Developer. Vous pouvez maintenant accéder à votre tableau de bord pour commencer à vous entraîner. Bonne chance !
id: Terima kasih telah menyelesaikan persiapan wawancara Senior Frontend Developer. Anda sekarang dapat mengakses dasbor Anda untuk mulai berlatih. Semoga berhasil!
it: Grazie per aver completato la preparazione all'intervista per Senior Frontend Developer. Ora puoi accedere al tuo dashboard per iniziare a esercitarti. Buona fortuna!
ja: シニアフロントエンドデベロッパーの面接準備を完了していただき、ありがとうございます。ダッシュボードにアクセスして練習を始められます。頑張ってください！
no: Takk for at du fullførte intervju-oppkjøringen for Senior Frontend-utvikler. Du kan nå få tilgang til dashbordet ditt for å begynne å øve. Lykke til!
pl: Dziękujemy za ukończenie przygotowania do rozmowy kwalifikacyjnej na stanowisko Starszego Programisty Frontend. Teraz możesz uzyskać dostęp do swojego panelu, aby rozpocząć ćwiczenia. Powodzenia!
pt: Obrigado por completar a preparação para a entrevista de Desenvolvedor Frontend Sênior. Você agora pode acessar o seu painel para começar a praticar. Boa sorte!
ru: Спасибо за завершение подготовки к интервью на должность старшего фронтенд-разработчика. Теперь вы можете получить доступ к своей панели управления, чтобы начать практиковаться. Удачи!
sv: Tack för att du har slutfört förberedelserna för intervju som Senior Frontend-utvecklare. Du kan nu komma åt din dashboard för att börja öva. Lycka till!
th: ขอบคุณที่ทำการเตรียมสัมภาษณ์ตำแหน่ง Senior Frontend Developer เสร็จเรียบร้อยแล้ว คุณสามารถเข้าถึงแดชบอร์ดของคุณเพื่อเริ่มฝึกฝน ขอให้โชคดี!
tr: Senior Frontend Developer mülakat hazırlığını tamamladığınız için teşekkür ederiz. Artık pratiğe başlamak için kontrol panelinize erişebilirsiniz. İyi şanslar!
uk: Дякуємо за завершення підготовки до співбесіди на позицію Старшого Frontend Розробника. Тепер ви можете отримати доступ до своєї панелі управління, щоб почати практикувати. Удачі!
vi: Cảm ơn bạn đã hoàn thành phần chuẩn bị phỏng vấn cho Vị trí Lập Trình Viên Frontend Cấp Cao. Bạn có thể truy cập vào bảng điều khiển của mình để bắt đầu thực hành. Chúc bạn may mắn!

source: Thank you for your feedback!
ar: شكراً على ملاحظاتك!
be: Дзякуй за ваш водгук!
da: Tak for din feedback!
de: Vielen Dank für Ihr Feedback!
es: ¡Gracias por tus comentarios!
fr: Merci pour vos commentaires !
id: Terima kasih atas masukan Anda!
it: Grazie per il tuo feedback!
ja: あなたのフィードバックをありがとうございます！
ms: Terima kasih atas maklum balas anda!
no: Takk for tilbakemeldingen din!
pl: Dziękujemy za Twoją opinię!
pt: Obrigado pelo seu feedback!
ru: Спасибо за ваш отзыв!
sv: Tack för din feedback!
th: ขอบคุณสำหรับคำติชมของคุณ!
tr: Geri bildiriminiz için teşekkür ederiz!
uk: Дякуємо за ваш відгук!
vi: Cảm ơn bạn đã phản hồi!

source: Thank you for your purchase.
uk: Дякуємо за вашу покупку.

source: That's the strong weekly plan.
uk: Це сильний тижневий план.
