Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: I am not a talented software developer. I'm not the fastest one — and definitely not the best. But when the company where I work struggles with something important and urgent, they ask for my help and pay me a lot. No clue why. The company makes chatbots for entertainment. You know those ads like *“Let’s talk with Albert Einstein”* or *“Let’s chat with Marilyn Monroe.”* Which I find quite stupid — but it works. Well, it had been working, to be precise. The company got stuck. No ideas for new features, no interesting characters. Whoever wanted to try it already had. Revenue slowly declined. The team’s writer, who was hired to craft such personas, couldn’t keep up, and quality was slipping. Our task was to improve it — with no real idea how. That’s all you need to know about my employer’s management and processes, or lack of processes, vision, plan, responsibilities. But okay. ![img.png](/blog/dog/monroe.webp) The writer's idea was to create a famous person who had tried another life — so the user could talk, for example, with Donald Trump, who in the middle of his life decided to switch careers and become a painter. Maybe our writer got inspired by Donald’s recently announced drawing, allegedly sent to Epstein. But anyway. The writer gave me a one-page draft about Donald's life after his career pivot. Which was not enough to create a good AI persona. I needed at least 20 pages of text to fill our QDrant vector store, so the AI RAG system could freely pick well-embedded documents for a proper fine-tuning process. *Sorry for the engineering terms.* After one day of waiting, I decided to use AI to generate what our writer might have written. It was an act of procrastination. I just wanted to fill the waiting time. Surprisingly, the results were almost identical to what the writer gave me. That, to be honest, astonished me. It might have been a coincidence, so I wanted to re-check it with real data — with my personal data. Later, I realized that was the wrong decision. The company was in a rush. *“We needed this persona done yesterday,”* said the founder. I was skeptical that this persona would rejuvenate the company. I asked for two extra days to finish my work. Most of the time I planned to allocate to my experiments. After collecting all my personal data — including Telegram chats, voice call transcripts, Google Photos, Google Drive documents, everything somehow related to me — I stared at the progress bar with a kind smile. My dog barked in the background, demanding attention. I ignored him, eyes fixed on the screen. The kind smile disappeared when I got the extrapolation result. > “You, Alex, will be fired tomorrow,” the screen read. That had to be wrong. I repeat, I’m not a talented developer and not the best one — but when the company struggles with something, they ask for my help. I did a lot for them. I’m important to them. It was ridiculous. Ridiculous or not, that day I finished my task and sent the results immediately after. The rest of the day I spent in my apartment in a beautiful neighborhood somewhere in Warsaw — with a slightly greenish face. *"This is ridiculous,"* I kept hearing in my head. *“Listen, Alex, I like you…”* — that’s how my manager started the conversation the next day. He listed what I had done for them, what the company was doing, that they had to reduce spending, that they really appreciated my work — and many other bullshit epithets. *“So we've decided to pause your working relationship for a while and focus on company survival.”* — that’s how he finished. That was not funny at all. It took me three days to accept it. At least I had good savings — and that creepy piece of software. After three days of staring at the ceiling, I came back to the software. What else could I do? I was unemployed, emotionally bruised, and curious. I opened the extrapolation interface and typed: > “What if we didn’t get a dog one year ago?” Result: In 99.9% of variations — we still got a dog. Just later. Sometimes it’s a whippet. Sometimes it’s a mutt. In one rare case, we got a cat. The cat ran away in six months. Next test: > “What if I won the lottery?” Great news — I did. Once or twice in different timelines. And then I lost it all on real estate in Italy or shady crypto startups. No happiness was detected. And then I grew bolder. I asked the real question — the one I had always wanted to know the answer to: > “What if I won the programming olympiads 15 years ago?” Result: life shift. Massive. That version of me entered a top university in another country. He made friends — actual friends, with opinions and a taste in architecture. He co-founded a machine learning startup before I even learned how to hold eye contact in interviews. And weirdest of all — he seemed… happy? I scrolled through his life logs. He drank smoothies in Palo Alto. He surfed. He pitched to venture capitalists and got rejected. Then he pitched again. Eventually, he failed gracefully. ![img.png](/blog/dog/polo.webp) He dated people I couldn't even imagine existing. He read poetry. He even had a therapist. But the strangest part? Near the end of his timeline, he left a private note in the system: > “Sometimes I wonder what my life would’ve been like if I stayed in Poland. Maybe in a small apartment in Warsaw. Maybe walking a dog. I think I’d like that too.” That’s when I closed the laptop. I didn’t touch the software for a week. I went on long walks. Listened to music without skipping every 30 seconds. All the timelines, all the versions of me, all the simulations — they echoed in my head like reruns of a show I’d already watched. I realized that the drastic changes made me unrecognizable. They weren’t me — just projections. Branches growing in every direction, but from a root I barely remembered planting. I opened the app one last time. Final prompt: > “What if I don’t ask anymore?” The system froze. Then replied: > “No projections available.” Good. I shut the laptop down and archived the logs. The dog stared at me. He usually does that when it’s time for a walk — at 3 p.m. And for the first time in weeks, I didn’t want to be anywhere else. ![img.png](/blog/dog/dog-park2.webp)
ar: أنا لست مطور برمجيات موهوب. لست الأسرع - وبالتأكيد لست الأفضل. ولكن عندما تواجه الشركة التي أعمل بها مشكلة مهمة وطارئة، يطلبون مساعدتي ويدفعون لي الكثير. لا أعرف السبب. الشركة تصنع روبوتات دردشة للترفيه. تعلمون تلك الإعلانات مثل "لنتحدث مع ألبرت أينشتاين" أو "لندردش مع مارلين مونرو." وهو ما أراه غبيًا تمامًا - ولكن هذا كان يعمل. حسنًا، لقد كان يعمل، لأكون دقيقًا. لقد توقفت الشركة. لا توجد أفكار لميزات جديدة، ولا شخصيات مثيرة. من أراد تجربتها قد فعل بالفعل. تراجعت الإيرادات ببطء. كاتب الفريق، الذي تم تعيينه لإنشاء مثل هذه الشخصيات، لم يتمكن من مواكبة ذلك، وبدأت الجودة في الانخفاض. كانت مهمتنا تحسينها - دون فكرة حقيقية حول كيفية ذلك. هذا كل ما تحتاج معرفته عن إدارة عملي وعملية الشركة، أو عدم وجود عملية، رؤية، خطة، مسؤوليات. ولكن حسناً. ![img.png](/blog/dog/monroe.webp) كانت فكرة الكاتب هي إنشاء شخص مشهور جرب حياة أخرى - حتى يتمكن المستخدم من التحدث، على سبيل المثال، مع دونالد ترامب الذي قرر في منتصف حياته تغيير مهنته ليصبح رسامًا. ربما ألهمه الإعلان الأخير عن رسمة دونالد المرسلة، حسب الادعاء، إلى إبستين. ولكن على أي حال. أعطى الكاتب لي مسودة من صفحة واحدة حول حياة دونالد بعد تحوله الوظيفي. وهو لم يكن كافياً لإنشاء شخصية AI جيدة. كنت بحاجة إلى 20 صفحة على الأقل من النص لملء متجر متجهات QDrant، حتى يمكن لنظام AI RAG اختيار المستندات المتضمنة جيدًا للقيام بعملية التحسين الدقيقة. *آسف للمصطلحات الهندسية.* بعد يوم من الانتظار، قررت استخدام الذكاء الاصطناعي لتوليد ما قد كتبه كاتبنا. كان ذلك عملاً من التسويف. أردت فقط ملء وقت الانتظار. بشكل مفاجئ، كانت النتائج متطابقة تقريبًا مع ما قدمه لي الكاتب. وهذا أدهشني بصراحة. قد يكون ذلك صدفة، لذلك أردت إعادة التحقق منها بالبيانات الحقيقية - مع بياناتي الشخصية. في وقت لاحق، أدركت أن ذلك كان القرار الخطأ. كانت الشركة في عجلة من أمرها. *"كنا بحاجة إلى هذه الشخصية منذ الأمس،"* قال المؤسس. كنت متشككًا في أن هذه الشخصية قد تنشط الشركة من جديد. طلبت يومين إضافيين لإنهاء عملي. خصصت معظم الوقت للتجارب. بعد جمع كل بياناتي الشخصية - بما في ذلك محادثات تيليجرام، نسخ المكالمات الصوتية، صور جوجل، مستندات جوجل درايف، كل شيء بطريقة ما يرتبط بي - شاهدت شريط التقدم بابتسامة لطيفة. نبح كلبي في الخلفية يطلب الاهتمام. تجاهلته، وعيني مثبتة على الشاشة. اختفت الابتسامة اللطيفة عند حصولي على نتيجة التوقع. > "أنت، أليكس، سيتم فصلك غدًا"، إنبأت الشاشة. كان ذلك خطأً بالتأكيد. أكرر، لست مطورًا موهوبًا ولست الأفضل - ولكن عندما تواجه الشركة مشكلة ما، يطلبون مساعدتي. لقد قدمت لهم الكثير. أنا مهم لهم. كان ذلك سخيفًا. سواء كان سخيفًا أم لا، في ذلك اليوم أنهيت مهمتي وأرسلت النتائج فورًا بعد ذلك. قضيت بقية اليوم في شقتي في حي جميل في مكان ما في وارسو - بوجه مائل إلى الأخضر قليلاً. *"هذا سخيف"،* كنت أسمع في رأسي. *“استمع، أليكس، أنا أحبك…”* — هكذا بدأ مديري المحادثة في اليوم التالي. ذكر ما فعلته لهم، وما تفعله الشركة، أنهم يحتاجون إلى تقليل النفقات، أنهم يقدرون عملي حقًا - والعديد من الصفات الأخرى الغبية. *"لذا قررنا إيقاف علاقتنا العمل لفترة والتركيز على بقاء الشركة."* — هكذا أنهى حديثه. كان ذلك غير مضحك على الإطلاق. استغرقني الأمر ثلاثة أيام لقبوله. على الأقل كان لدي مدخرات جيدة - وتلك البرمجية المرعبة. بعد ثلاثة أيام من التحديق في السقف، عدت إلى البرمجية. ماذا يمكن أن أفعل؟ كنت بدون عمل، مجروح عاطفيًا، وفضولي. فتحت واجهة التوقع وكتبت: > “ماذا لو لم نحصل على كلب منذ عام؟” النتيجة: في 99.9% من التغيرات - ما زلنا حصلنا على كلب. فقط في وقت لاحق. في بعض الأحيان يكون كلب من نوع الوبيت. في بعض الأحيان يكون مزيجًا. في حالة نادرة، حصلنا على قطة. هربت القطة بعد ستة أشهر. الاختبار التالي: > “ماذا لو فزت باليانصيب؟” أخبار رائعة - فعلت ذلك. مرة أو مرتين في جداول زمنية مختلفة. وبعدها خسرت كل شيء في العقارات في إيطاليا أو في شركات ناشئة مشبوهة في العملات المشفرة. لم يُكشف أي سعادة. ثم أصبحت أكثر جرأة. طرحت السؤال الحقيقي - الذي أردت دائمًا معرفة إجابته: > “ماذا لو فزت بأولمبياد البرمجة قبل 15 عامًا؟” النتيجة: تغيير ضخم في الحياة. ذلك الإصدار مني دخل جامعة مرموقة في بلد آخر. صنع الأصدقاء - الأصدقاء الحقيقيون، مع آراء وتذوق في العمارة. شارك في تأسيس شركة ناشئة في التعلم الآلي قبل حتى أن أتعلم كيفية الحفاظ على التواصل البصري في المقابلات. والأغرب من كل ذلك - أنه بدا... سعيدًا؟ تصفحت سجلات حياته. شرب العصائر في بالو ألتو. ركب الأمواج. قدم عروضاً لرؤوس الأموال المخاطرة وتم رفضه. ثم قدم العروض مرة أخرى. في النهاية، فشل بلباقة. ![img.png](/blog/dog/polo.webp) كان يواعد أشخاصًا لم أتمكن حتى من تخيل وجودهم. قرأ الشعر. كان لديه حتى معالج نفسي. لكن الجزء الأغرب؟ قرب نهاية الجداول الزمنية، ترك مذكرة خاصة في النظام: > “أحيانًا، أتساءل كيف ستكون حياتي لو بقيت في بولندا. ربما في شقة صغيرة في وارسو. ربما أتنزه مع كلب. أعتقد أنني أحب ذلك أيضًا.” هنا أغلقت الكمبيوتر المحمول. لم أستخدم البرمجية لمدة أسبوع. خرجت في نزهات طويلة. استمعت إلى الموسيقى دون أن أتخطى كل 30 ثانية. كل الجداول الزمنية، كل النسخ مني، كل المحاكاة - كانوا يترددون في رأسي مثل إعادة عرض لبرنامج قد شاهدته من قبل. أدركت أن التغيرات الكبيرة جعلتني غير قابل للتعرف. لم يكونوا سوى توقعات. فروع تنمو في كل اتجاه، ولكن من جذر بالكاد أتذكر زراعته. فتحت التطبيق لآخر مرة. الإيعاز النهائي: > “ماذا لو لم أعد أطرح الأسئلة؟” تجمد النظام. ثم رد: > “لا توقعات متاحة.” حسنًا. أغلقت الكمبيوتر المحمول وفهرست السجلات. نظر إلي الكلب. عادة ما يفعل ذلك عندما يحين وقت المشي - في الساعة 3 مساءً. ولأول مرة منذ أسابيع، لم أرغب في أن أكون في أي مكان آخر. ![img.png](/blog/dog/dog-park2.webp)
be: Я не таленавіты распрацоўшчык праграмнага забеспячэння. Я не самы хуткі — і, безумоўна, не самы лепшы. Але калі кампанія, дзе я працую, сутыкаецца з нечым важным і тэрміновым, яны звяртаюцца па маю дапамогу і шчодра плацяць мне. Ніякай ідэі, чаму. Гэтая кампанія стварае чат-боты для забаў. Вы ведаеце тую рэкламу кшталту *“Давай пагаворым з Альбертам Айнштэйнам”* ці *“Давай пагаворым з Мэрылін Монро.”* Што я знаходжу даволі глупым — але гэта працуе. Ну, каб быць дакладным, гэта працавала. Кампанія затрымалася. Няма ідэй для новых функцый, няма цікавых персанажаў. Тыя, хто хацеў паспрабаваць, ужо паспрабавалі. Даход павольна зменшаўся. Пісьменнік у камандзе, наняты для стваральніцтва такіх персан, не паспеў за працай, і якасць спаўзала. Наша задача была ў тым, каб палепшыць гэта — без усякіх рэальных ідэй, як. Гэта ўсё, што трэба ведаць пра кіраўніцтва маёй кампаніі і яе працэсы, альбо іх адсутнасць, бачанне, план, адказнасці. Але добра. ![img.png](/blog/dog/monroe.webp) Ідэя пісьменніка была ў стварэнні знакамітасці, якая паспрабавала іншае жыццё — так што карыстальнік мог гаварыць, напрыклад, з Дональдам Трампам, які ў сярэдзіне свайго жыцця вырашыў змяніць кар'еру і стаць мастаком. Магчыма, наш пісьменнік быў натхнёны нядаўна абвешчаным малюнкам Дональда, які, быццам, быў адпраўлены Эпштэйну. Але ў любым выпадку. Пісьменнік даў мне аднабаковік-праект пра жыццё Дональда пасля яго змены кар'еры. Але гэтага было недастаткова для стварэння добрай AI-персоны. Мне трэба было як мінімум 20 старонак тэксту, каб запоўніць наш QDrant вектарнае сховішча, так што сістэма AI RAG магла свабодна выбіраць дакументы з добра ўпісаным зместам для правільнага тонкага налады. *Прабачце за інжынерныя тэрміны.* Пасля аднаго дня чакання я вырашыў выкарыстаць AI, каб згенераваць тое, што наш пісьменнік мог бы напісаць. Гэта быў акт пракрастынацыі. Я проста хацеў скаротыць чакаючы час. Найбольш нечаканага, вынікі былі амаль такія ж, як тое, што пісьменнік даў мне. Калі быць сумленным, гэта здзівіла мяне. Гэта магло быць супадзеннем, і я хацеў пераправерыць гэта з рэальнымі данымі — з маімі асабістымі дадзенымі. Пазней я зразумеў, што гэта было няправільнае рашэнне. Кампанія кідалася. *“Нам патрэбна была гэтая персона яшчэ ўчора,”* — сказаў заснавальнік. Я скептычна паставіўся да таго, што гэта персона абновіць кампанію. Я запатрабаваў два дадатковыя дні, каб завяршыць маю працу. Большасць часу я планаваў выдзеліць на свае эксперыменты. Пасля збору ўсіх маіх асабістых дадзеных — уключаючы чаты ў Telegram, расшыфроўкі галасавых званкоў, дакументы ў Google Photos, Google Drive — усё, што неяк звязана са мной, я назіраў за паласой прагрэсу з добрай усмешкай. Мой сабака гаркаў на заднім фоне, патрабуючы ўвагі. Я яго ігнараваў, з вачыма фіксаванымі на экране. Добрая ўсмешка знікла, калі я атрымаў вынік экстрапаляцыі. > "Ты, Алекс, будзеш звольнены заўтра," — паказаў экран. Гэта мусіла быць памылкай. Я паўтараю, я не якасны распрацоўшчык і не лепшы — але калі кампанія сутыкаецца з праблемай, яны звяртаюцца па маю дапамогу. Я зрабіў шмат для іх. Я важны для іх. Гэта было смешна. Смешна ці не, у той дзень я завяршыў маю задачу і адправіў вынікі неадкладна пасля. Астатак дня я правёў у маім кватэры ў прыгожым раёне недзе ў Варшаве — з трошкі зялёным тварам. *"Гэта смешна,"* я працягваў чуць у маёй галаве. *“Слухай, Алекс, я табе спадабаюся…”* — так пачаў размову мой менеджар на наступны дзень. Ён пералічыў, што я зрабіў для іх, што кампанія робіць, што яны павінны скарачаць выдаткі, што яны сапраўды ацэньваюць маю працу — і шмат іншых непрыемных кампліментаў. *“Таму мы вырашылі прыпыніць вашыя працоўныя адносіны на некаторы час і засяродзіцца на выжыванні кампаніі.”* — так ён скончыў. Гэта было зусім не смешна. Мне спатрэбілася тры дні, каб прыняць гэта. Па меншай меры, у мяне былі добрыя ашчаджайкі — і гэта жудасная праграма. Пасля трох дзён назірання за столлю я вярнуўся да праграды. Што я яшчэ мог рабіць? Я быў беспрацоўным, эмацыйна патрушчаным і цікаваўся. Я адкрыў інтэрфейс экстрапаляцыі і ўвёў: > "Што калі мы не завялі сабаку год таму?" Вынік: У 99.9% варыянтаў — мы ўсё роўна завялі сабаку. Толькі пазней. Часам гэта гуса. Часам гэта бязродавая. У адным рэдкім выпадку мы атрымалі кошку. Кошка ўцякла праз шэсць месяцаў. Наступны тэст: > "Што калі я выйграю ў латарэю?" Выдатныя навіны — я выйграў. Адзін ці два разы ў розных часавых лініях. І потым я ўсё згубіў на нерухомасці ў Італіі ці трапных крэптастартапах. Шчасця не было выяўлена. І потым я стаў смялейшым. Я задаў сапраўды важнае пытанне — тое, якое я заўсёды хацеў ведаць адказ: > "Што калі я выйграю праграмную алімпіяду 15 гадоў таму?" Вынік: змена жыцця. Максімальная. Та версія мяне паступіла ў топ-універсітэт у іншай краіне. Ён завёў сяброў — рэальных сяброў, з меркаваннем і густам у архітэктуры. Ён стаў сузаснавальнікам стартапа машыннага навучання яшчэ да таго, як я навучыўся падтрымліваць зрокавы кантакт на сумоўях. І што найбольш дзіўнае — ён, здаецца, быў шчаслівы? Я гартаў яго жыццёвыя запісы. Ён піў смуці ў Пало Алто. Ён катаўся на серфінгу. Ён прадставіў планы венчурным капіталістам і атрымаў адмову. Потым ён спрабаваў зноў. Урэшце, ён цярпліва праваліўся. ![img.png](/blog/dog/polo.webp) Ён сустракаў людзей, пра якіх я і не мог уявіць, што яны існуюць. Ён чытаў паэзію. Ён нават меў тэрапеўта. Але самая дзіўная частка? Бліжэй да канца яго часавай лініі ён пакінуў прыватную нататку ў сістэме: > "Часам я думаю, якім было б маё жыццё, калі б я застаўся ў Польшчы. Магчыма, у маленькай кватэры ў Варшаве. Магчыма, выгульваючы сабаку. Думаю, мне гэта таксама спадабалася б.” У той момант я закрыў ноўтбук. Я не чапаў праграму цэлы тыдзень. Я хадзіў на доўгія прагулкі. Слухаў музыку без прапускання кожныя 30 секунд. Усе часовыя лініі, усе версіі мяне, усе мадэляцыі — яны адлюстроўваліся ў маёй галаве, як паўторы шоу, якое я ўжо глядзеў. Я зразумеў, што радыкальныя змены зрабілі мяне неўзнаваемым. Яны не былі мной — толькі праекцыямі. Веткі, якія растуць у кожны бок, але з кораня, які я ледзь помню, што пасадзіў. Я адкрыў дадатак адзін апошні раз. Заключны запыт: > "Што калі я не спытаю больш?" Сістэма замярзла. Потым адказала: > "Праекцыі не даступныя." Добра. Я выключыў ноўтбук і архіваваў запісы. Сабака глядзела на мяне. Ён звычайна робіць гэта, калі пара на прагулку — у 3 гадзіны дня. І ў першы раз за тыдні я не хацеў быць дзе-небудзь яшчэ. ![img.png](/blog/dog/dog-park2.webp)
da: Jeg er ikke en talentfuld softwareudvikler. Jeg er ikke den hurtigste — og bestemt ikke den bedste. Men når firmaet, hvor jeg arbejder, kæmper med noget vigtigt og presserende, beder de om min hjælp og betaler mig meget. Jeg aner ikke hvorfor. Firmaet laver chatbots til underholdning. Du kender de annoncer som *"Lad os tale med Albert Einstein"* eller *"Lad os chatte med Marilyn Monroe."* Hvilket jeg finder temmelig tåbeligt — men det virker. Det havde i hvert fald fungeret, for at være præcis. Firmaet gik i stå. Ingen idéer til nye funktioner, ingen interessante karakterer. Dem, der ønskede at prøve det, havde allerede gjort det. Indtægterne faldt langsomt. Teamets forfatter, som blev ansat til at skabe sådanne personligheder, kunne ikke følge med, og kvaliteten var dalende. Vores opgave var at forbedre det — uden nogen egentlig idé om hvordan. Det er alt, du behøver at vide om min arbejdsgivers ledelse og processer, eller mangel på processer, vision, plan, ansvar. Men okay. ![img.png](/blog/dog/monroe.webp) Forfatterens idé var at skabe en berømt person, der havde prøvet et andet liv — så brugeren kunne tale med f.eks. Donald Trump, som midt i sit liv besluttede at skifte karriere og blive maler. Måske blev vores forfatter inspireret af Donalds nyligt annoncerede tegning, angiveligt sendt til Epstein. Men uanset. Forfatteren gav mig et udkast på én side om Donalds liv efter hans karriereskift. Hvilket ikke var nok til at skabe en god AI-persona. Jeg havde brug for mindst 20 sider tekst til at fylde vores QDrant-vektorlager, så AI RAG-systemet frit kunne vælge vel-indlejrede dokumenter til en korrekt finjusteringsproces. *Undskyld for de tekniske termer.* Efter en hel dags venten besluttede jeg at bruge AI til at generere, hvad vores forfatter måske ville have skrevet. Det var en handling af overspringshandling. Jeg ville bare fylde ventetiden. Overraskende var resultaterne næsten identiske med, hvad forfatteren gav mig. Det, for at være ærlig, forbavsede mig. Det kunne have været en tilfældighed, så jeg ønskede at re-tjekke det med rigtige data — med mine personlige data. Senere indså jeg, at det var den forkerte beslutning. Firmaet havde travlt. *“Vi skulle have haft denne persona færdig i går,”* sagde grundlæggeren. Jeg var skeptisk over, at denne persona ville genoplive firmaet. Jeg bad om to ekstra dage til at færdiggøre mit arbejde. Det meste af tiden planlagde jeg at allokere til mine eksperimenter. Efter at have samlet alle mine personlige data — inklusive Telegram-chatbeskeder, transkriptioner af telefonsamtaler, Google Fotos, Google Drev-dokumenter, alt på en eller anden måde relateret til mig — stirrede jeg på fremdriftsbjælken med et venligt smil. Min hund gøede i baggrunden og krævede opmærksomhed. Jeg ignorerede ham, blikket var fastholdt på skærmen. Det venlige smil forsvandt, da jeg fik ekstrapoleringsresultatet. > “Du, Alex, bliver fyret i morgen,” stod der på skærmen. Det måtte være forkert. Jeg gentager, jeg er ikke en talentfuld udvikler og ikke den bedste — men når firmaet kæmper med noget, beder de om min hjælp. Jeg har gjort meget for dem. Jeg er vigtig for dem. Det var latterligt. Latterligt eller ej, den dag færdiggjorde jeg min opgave og sendte resultaterne straks bagefter. Resten af dagen tilbragte jeg i min lejlighed i et smukt kvarter et sted i Warszawa — med et lidt grønligt ansigt. *"Dette er latterligt,"* blev ved med at lyde i mit hoved. *“Lyt, Alex, jeg kan godt lide dig…”* — sådan startede min manager samtalen den næste dag. Han oplistede, hvad jeg havde gjort for dem, hvad firmaet foretog sig, at de måtte reducere udgifterne, at de virkelig satte pris på mit arbejde — og mange andre banale adjektiver. *“Så vi har besluttet at sætte dit arbejdsforhold på pause i et stykke tid og fokusere på firmaets overlevelse.”* — sådan afsluttede han. Det var slet ikke sjovt. Det tog mig tre dage at acceptere det. I det mindste havde jeg gode besparelser — og det uhyggelige stykke software. Efter tre dage med at stirre i loftet vendte jeg tilbage til softwaren. Hvad andet kunne jeg gøre? Jeg var arbejdsløs, følelsesmæssigt forslået og nysgerrig. Jeg åbnede ekstrapoleringsgrænsefladen og tastede: > “Hvad hvis vi ikke fik en hund for et år siden?” Resultat: I 99,9 % af variationerne — fik vi stadig en hund. Bare senere. Nogle gange er det en whippet. Nogle gange er det en gadekryds. I et sjældent tilfælde fik vi en kat. Katten løb væk efter seks måneder. Næste test: > “Hvad hvis jeg vandt i lotto?” Gode nyheder — det gjorde jeg. En eller to gange i forskellige tidslinjer. Og så tabte jeg det hele på ejendomme i Italien eller lyssky kryptoinvesteringer. Ingen lykke blev detekteret. Og så blev jeg modigere. Jeg stillede det rigtige spørgsmål — det, som jeg altid havde ønsket at kende svaret på: > “Hvad hvis jeg vandt programmeringsolympiaderne for 15 år siden?” Resultat: livsskift. Massiv. Den version af mig kom ind på et topuniversitet i et andet land. Han fik venner — rigtige venner med meninger og en smag for arkitektur. Han var med til at grundlægge en machine learning-startup, før jeg overhovedet havde lært at holde øjenkontakt under interviews. Og det mærkeligste af alt — han virkede… glad? Jeg scrollede gennem hans livslogfiler. Han drak smoothies i Palo Alto. Han surfede. Han præsenterede for venturekapitalister og blev afvist. Så præsenterede han igen. Til sidst fejlede han på en elegant måde. ![img.png](/blog/dog/polo.webp) Han datede personer, jeg ikke engang kunne forestille mig eksisterede. Han læste poesi. Han havde endda en terapeut. Men den mærkeligste del? Mod slutningen af hans tidslinje efterlod han en privat note i systemet: > “Nogle gange spekulerer jeg på, hvordan mit liv ville have været, hvis jeg var blevet i Polen. Måske i en lille lejlighed i Warszawa. Måske gik med en hund. Jeg tror, jeg ville kunne lide det også.” Det var, da jeg lukkede for computeren. Jeg rørte ikke softwaren i en uge. Jeg gik lange ture. Ly ttede til musik uden at skippe hver 30 sekund. Alle tidslinjerne, alle versionerne af mig, alle simuleringerne — de ekkoede i mit hoved som gentagelser af en udsendelse, jeg allerede havde set. Jeg indså, at de drastiske ændringer gjorde mig ukendelig. De var ikke mig — bare projektioner. Grene, der voksede i alle retninger, men fra en rod, jeg knapt huskede at have plantet. Jeg åbnede app'en en sidste gang. Sidste prompt: > “Hvad hvis jeg ikke spørger mere?” Systemet frøs. Svarede så: > “Ingen projektioner tilgængelige.” Godt. Jeg lukkede computeren ned og arkiverede loggene. Hunden stirrede på mig. Han gør det normalt, når det er tid til en gåtur — kl. 15. Og for første gang i flere uger ønskede jeg ikke at være noget som helst andet sted. ![img.png](/blog/dog/dog-park2.webp)
de: Ich bin kein talentierter Softwareentwickler. Ich bin nicht der Schnellste - und definitiv nicht der Beste. Aber wenn das Unternehmen, bei dem ich arbeite, mit etwas Wichtigem und Dringendem zu kämpfen hat, bitten sie um meine Hilfe und bezahlen mich gut. Keine Ahnung warum. Das Unternehmen erstellt Chatbots zur Unterhaltung. Sie kennen diese Anzeigen wie *„Lassen Sie uns mit Albert Einstein sprechen“* oder *„Lassen Sie uns mit Marilyn Monroe chatten.“* Diese finde ich ziemlich dumm — aber es funktioniert. Nun ja, es hat funktioniert, um genau zu sein. Das Unternehmen steckte fest. Keine Ideen für neue Funktionen, keine interessanten Charaktere. Wer es ausprobieren wollte, hatte es bereits getan. Die Einnahmen gingen langsam zurück. Der Autor des Teams, der eingestellt wurde, um solche Personas zu entwerfen, konnte nicht mithalten, und die Qualität ließ nach. Unsere Aufgabe war es, es zu verbessern — ohne wirkliche Idee, wie. Das ist alles, was Sie über das Management und die Prozesse meines Arbeitgebers wissen müssen, oder den Mangel an Prozessen, Vision, Plan, Verantwortlichkeiten. Aber okay. ![img.png](/blog/dog/monroe.webp) Die Idee des Autors war es, eine berühmte Person zu schaffen, die ein anderes Leben ausprobiert hat — so könnte der Benutzer zum Beispiel mit Donald Trump sprechen, der mitten in seinem Leben beschlossen hat, die Karriere zu wechseln und Maler zu werden. Vielleicht wurde unser Autor durch Donalds kürzlich angekündigte Zeichnung inspiriert, angeblich an Epstein geschickt. Aber egal. Der Autor gab mir einen einseitigen Entwurf über Donalds Leben nach seiner Karriereänderung. Das reichte nicht aus, um eine gute KI-Persona zu erstellen. Ich brauchte mindestens 20 Seiten Text, um unseren QDrant-Vektorspeicher zu füllen, damit das KI-RAG-System frei gut eingebettete Dokumente für einen ordentlichen Feinabstimmungsprozess auswählen konnte. *Entschuldigung für die technischen Begriffe.* Nach einem Tag des Wartens beschloss ich, KI zu verwenden, um das zu generieren, was unser Autor möglicherweise geschrieben hätte. Es war ein Akt der Prokrastination. Ich wollte nur die Wartezeit überbrücken. Überraschenderweise waren die Ergebnisse fast identisch mit denen, die der Autor mir gegeben hatte. Das hat mich ehrlich gesagt erstaunt. Es könnte ein Zufall gewesen sein, also wollte ich es mit echten Daten erneut überprüfen — mit meinen persönlichen Daten. Später erkannte ich, dass dies die falsche Entscheidung war. Das Unternehmen war in Eile. *„Wir brauchten diese Persona bereits gestern,“* sagte der Gründer. Ich war skeptisch, dass diese Persona das Unternehmen verjüngen würde. Ich bat um zwei zusätzliche Tage, um meine Arbeit zu beenden. Die meiste Zeit wollte ich meinen Experimenten widmen. Nachdem ich alle meine persönlichen Daten gesammelt hatte — einschließlich Telegram-Chats, Transkripte von Telefonanrufen, Google-Fotos, Google-Drive-Dokumente, alles, was irgendwie mit mir zu tun hatte — starrte ich mit einem freundlichen Lächeln auf die Fortschrittsleiste. Mein Hund bellte im Hintergrund und verlangte Aufmerksamkeit. Ich ignorierte ihn, die Augen auf den Bildschirm fixiert. Das freundliche Lächeln verschwand, als ich das Extrapolationsergebnis erhielt. > „Du, Alex, wirst morgen gefeuert,“ stand auf dem Bildschirm. Das musste falsch sein. Ich wiederhole, ich bin kein talentierter Entwickler und nicht der Beste - aber wenn das Unternehmen mit etwas ringt, bitten sie um meine Hilfe. Ich habe viel für sie getan. Ich bin ihnen wichtig. Es war lächerlich. Lächerlich oder nicht, an diesem Tag beendete ich meine Aufgabe und sendete die Ergebnisse sofort danach. Den Rest des Tages verbrachte ich in meiner Wohnung in einem schönen Stadtteil irgendwo in Warschau — mit einem leicht grünlichen Gesicht. *"Das ist lächerlich,"* hörte ich immer wieder in meinem Kopf. *„Hör zu, Alex, ich mag dich…”* — so begann mein Manager das Gespräch am nächsten Tag. Er zählte auf, was ich für sie getan hatte, was das Unternehmen tat, dass sie die Ausgaben reduzieren mussten, dass sie meine Arbeit wirklich schätzten — und viele andere beschönigende Epitheta. *„Also haben wir beschlossen, deine Arbeitsbeziehung eine Weile zu pausieren und uns auf das Überleben des Unternehmens zu konzentrieren.”* — so beendete er. Das war überhaupt nicht lustig. Es dauerte drei Tage, bis ich es akzeptierte. Wenigstens hatte ich gute Ersparnisse — und dieses unheimliche Stück Software. Nach drei Tagen, in denen ich an die Decke starrte, kehrte ich zu der Software zurück. Was sonst könnte ich tun? Ich war arbeitslos, emotional angeschlagen und neugierig. Ich öffnete die Extrapolationsschnittstelle und tippte: > „Was, wenn wir uns vor einem Jahr keinen Hund zugelegt hätten?” Ergebnis: In 99,9 % der Variationen — bekamen wir trotzdem einen Hund. Nur später. Manchmal ist es ein Whippet. Manchmal ist es ein Mischling. In einem seltenen Fall bekamen wir eine Katze. Die Katze lief nach sechs Monaten weg. Nächster Test: > „Was, wenn ich die Lotterie gewonnen hätte?” Gute Nachrichten — das habe ich. Ein- oder zweimal in verschiedenen Zeitachsen. Und dann verlor ich alles an italienische Immobilien oder dubiose Krypto-Startups. Kein Glück wurde festgestellt. Und dann wurde ich kühner. Ich stellte die wirkliche Frage — die, auf die ich immer die Antwort wissen wollte: > „Was, wenn ich vor 15 Jahren die Programmierolympiade gewonnen hätte?” Ergebnis: massive Lebensveränderung. Diese Version von mir trat an einer Spitzenuniversität in einem anderen Land ein. Er schloss Freundschaften — echte Freunde, mit Meinungen und einem Geschmack für Architektur. Er gründete ein Maschinelles Lern-Startup, bevor ich überhaupt gelernt hatte, Augenkontakt in Vorstellungsgesprächen zu halten. Und das Seltsamste von allem — er schien… glücklich zu sein? Ich scrollte durch seine Lebensprotokolle. Er trank Smoothies in Palo Alto. Er surfte. Er präsentierte vor Risikokapitalgebern und wurde abgelehnt. Dann präsentierte er erneut. Schließlich scheiterte er elegant. ![img.png](/blog/dog/polo.webp) Er ging mit Leuten aus, die ich mir nicht einmal vorzustellen traute. Er las Gedichte. Er hatte sogar einen Therapeuten. Aber das Seltsamste? Am Ende seiner Zeitachse hinterließ er eine private Notiz im System: > „Manchmal frage ich mich, wie mein Leben gewesen wäre, wenn ich in Polen geblieben wäre. Vielleicht in einer kleinen Wohnung in Warschau. Vielleicht mit einem Hund spazieren gehen. Ich glaube, das hätte ich auch gemocht.” Das war der Moment, als ich den Laptop schloss. Ich berührte die Software eine Woche lang nicht. Ich ging auf lange Spaziergänge. Hörte Musik, ohne alle 30 Sekunden zu skippen. All die Zeitlinien, all die Versionen von mir, all die Simulationen — sie hallten in meinem Kopf wider wie Wiederholungen einer Show, die ich bereits gesehen hatte. Mir wurde klar, dass die drastischen Veränderungen mich unkenntlich machten. Sie waren nicht ich — nur Projektionen. Äste, die in jede Richtung wuchsen, aber von einer Wurzel, die ich kaum noch erinnerte, gepflanzt zu haben. Ich öffnete die App ein letztes Mal. Letzte Eingabeaufforderung: > „Was, wenn ich nicht mehr frage?” Das System fror ein. Dann antwortete es: > „Keine Projektionen verfügbar.” Gut. Ich schaltete den Laptop aus und archivierte die Protokolle. Der Hund starrte mich an. Das tut er normalerweise, wenn es Zeit für einen Spaziergang ist — um 15 Uhr. Und zum ersten Mal seit Wochen wollte ich nirgendwo anders sein. ![img.png](/blog/dog/dog-park2.webp)
es: No soy un desarrollador de software talentoso. No soy el más rápido, y definitivamente no el mejor. Pero cuando la empresa en la que trabajo tiene problemas con algo importante y urgente, piden mi ayuda y me pagan mucho. Sin idea de por qué. La empresa crea chatbots para entretenimiento. Ya sabes, esos anuncios como *"Hablemos con Albert Einstein"* o *"Chateemos con Marilyn Monroe."* Lo que encuentro bastante estúpido, pero funciona. Bueno, estaba funcionando, para ser preciso. La empresa se atascó. Sin ideas para nuevas funciones, sin personajes interesantes. Quien quería probarlo ya lo había hecho. Los ingresos disminuyeron lentamente. El escritor del equipo, que fue contratado para crear tales personajes, no podía seguir el ritmo, y la calidad estaba bajando. Nuestra tarea era mejorarlo, sin una idea real de cómo. Eso es todo lo que necesitas saber sobre la gestión de mi empleador y los procesos, o la falta de procesos, visión, plan, responsabilidades. Pero está bien. ![img.png](/blog/dog/monroe.webp) La idea del escritor era crear una persona famosa que hubiera intentado otra vida, para que el usuario pudiera hablar, por ejemplo, con Donald Trump, quien en medio de su vida decidió cambiar de carrera y convertirse en pintor. Quizás nuestro escritor se inspiró en el dibujo recientemente anunciado de Donald, supuestamente enviado a Epstein. Pero, de todos modos. El escritor me dio un borrador de una página sobre la vida de Donald después de su cambio de carrera. Lo cual no era suficiente para crear una buena persona de IA. Necesitaba al menos 20 páginas de texto para llenar nuestra tienda de vectores QDrant, para que el sistema AI RAG pudiera elegir libremente documentos bien incrustados para un proceso de ajuste fino adecuado. *Lo siento por los términos de ingeniería.* Después de un día de espera, decidí usar IA para generar lo que nuestro escritor podría haber escrito. Fue un acto de procrastinación. Solo quería llenar el tiempo de espera. Sorprendentemente, los resultados fueron casi idénticos a lo que el escritor me dio. Eso, para ser honesto, me asombró. Podría haber sido una coincidencia, así que quería verificarlo de nuevo con datos reales, con mis datos personales. Más tarde, me di cuenta de que fue una decisión incorrecta. La empresa estaba apurada. *"Necesitábamos este personaje hecho ayer,"* dijo el fundador. Yo era escéptico de que este personaje rejuvenecería a la empresa. Pedí dos días adicionales para terminar mi trabajo. La mayor parte del tiempo planeaba destinarlo a mis experimentos. Después de recopilar todos mis datos personales, incluidos los chats de Telegram, las transcripciones de llamadas de voz, las fotos de Google, los documentos de Google Drive, todo de alguna manera relacionado conmigo, miré la barra de progreso con una amable sonrisa. Mi perro ladraba en el fondo, exigiendo atención. Lo ignoré, con los ojos fijos en la pantalla. La amable sonrisa desapareció cuando obtuve el resultado de la extrapolación. > "Tú, Alex, serás despedido mañana," decía la pantalla. Eso tenía que estar mal. Repito, no soy un desarrollador talentoso y no el mejor, pero cuando la empresa tiene problemas con algo, piden mi ayuda. Hice mucho por ellos. Soy importante para ellos. Era ridículo. Ridículo o no, ese día terminé mi tarea y envié los resultados inmediatamente después. El resto del día lo pasé en mi apartamento en un hermoso vecindario en algún lugar de Varsovia, con un rostro ligeramente verdoso. *"Esto es ridículo,"* seguía oyendo en mi cabeza. *"Escucha, Alex, me caes bien..."* así es como mi gerente comenzó la conversación al día siguiente. Enumeró lo que había hecho por ellos, lo que la empresa estaba haciendo, que tenían que reducir gastos, que realmente apreciaban mi trabajo, y muchas otras tonterías. *"Así que hemos decidido pausar tu relación laboral por un tiempo y enfocarnos en la supervivencia de la empresa."* — así terminó. Eso no fue nada gracioso. Me tomó tres días aceptarlo. Al menos tenía buenos ahorros, y esa pieza espeluznante de software. Después de tres días de mirar al techo, volví al software. ¿Qué más podría hacer? Estaba desempleado, emocionalmente herido y curioso. Abrí la interfaz de extrapolación y escribí: > "¿Qué pasaría si no hubiéramos conseguido un perro hace un año?" Resultado: En el 99.9% de las variaciones, todavía conseguimos un perro. Solo más tarde. A veces es un galgo. A veces es un mestizo. En un caso raro, conseguimos un gato. El gato se escapó en seis meses. Próxima prueba: > "¿Qué pasaría si ganara la lotería?" Buenas noticias: lo hice. Una o dos veces en diferentes líneas de tiempo. Y luego lo perdí todo en bienes raíces en Italia o en startups de criptomonedas dudosas. No se detectó felicidad. Y luego me volví más audaz. Hice la verdadera pregunta: la que siempre había querido saber la respuesta: > "¿Qué pasaría si ganara las olimpiadas de programación hace 15 años?" Resultado: cambio de vida. Enorme. Esa versión de mí ingresó a una universidad de élite en otro país. Hizo amigos, amigos reales, con opiniones y gusto por la arquitectura. Fundó una startup de aprendizaje automático antes de que yo siquiera aprendiera a mantener contacto visual en las entrevistas. Y lo más extraño de todo, parecía... ¿feliz? Revisé sus registros de vida. Bebía batidos en Palo Alto. Surfeaba. Hacía presentaciones a inversores de capital riesgo y era rechazado. Luego volvió a intentarlo. Finalmente, falló con gracia. ![img.png](/blog/dog/polo.webp) Salía con personas que ni siquiera podía imaginar que existieran. Leía poesía. Incluso tenía un terapeuta. Pero lo más extraño, cerca del final de su línea de tiempo, dejó una nota privada en el sistema: > "A veces me pregunto cómo hubiera sido mi vida si me hubiera quedado en Polonia. Tal vez en un pequeño apartamento en Varsovia. Tal vez paseando un perro. Creo que también me gustaría eso." Ahí es cuando cerré la computadora portátil. No toqué el software durante una semana. Salí a caminar largas distancias. Escuché música sin cambiar cada 30 segundos. Todas las líneas de tiempo, todas las versiones de mí, todas las simulaciones, resonaban en mi cabeza como repeticiones de un programa que ya había visto. Me di cuenta de que los cambios drásticos me volvían irreconocible. No eran yo, solo proyecciones. Ramas creciendo en cada dirección, pero desde una raíz que apenas recordaba haber plantado. Abrí la aplicación por última vez. Solicitud final: > "¿Qué pasaría si ya no pregunto?" El sistema se congeló. Luego respondió: > "No hay proyecciones disponibles." Bien. Apagué la computadora portátil y archivé los registros. El perro me miró. Suele hacerlo cuando es hora de pasear, a las 3 p.m. Y por primera vez en semanas, no quería estar en ningún otro lugar. ![img.png](/blog/dog/dog-park2.webp)
fr: Je ne suis pas un développeur de logiciels talentueux. Je ne suis pas le plus rapide - et certainement pas le meilleur. Mais quand l'entreprise où je travaille a des difficultés avec quelque chose d'important et d'urgent, elle me demande mon aide et me paie beaucoup. Aucune idée pourquoi. L'entreprise fabrique des chatbots pour le divertissement. Vous voyez ces publicités comme *"Discutons avec Albert Einstein"* ou *"Chattons avec Marilyn Monroe."* Que je trouve assez stupide — mais ça fonctionne. Enfin, ça fonctionnait, pour être précis. L'entreprise était bloquée. Pas d'idées pour de nouvelles fonctionnalités, pas de personnages intéressants. Quiconque voulait l'essayer l'avait déjà fait. Les revenus déclinaient lentement. Le scénariste de l'équipe, qui avait été embauché pour créer de telles personnalités, ne pouvait pas suivre, et la qualité diminuait. Notre tâche était de l'améliorer — sans réelle idée de comment. C'est tout ce que vous devez savoir sur la gestion et les processus de mon employeur, ou l'absence de processus, de vision, de plan, de responsabilités. Mais d'accord. ![img.png](/blog/dog/monroe.webp) L'idée du scénariste était de créer une personne célèbre qui aurait essayé une autre vie — de sorte que l'utilisateur puisse parler, par exemple, avec Donald Trump, qui au milieu de sa vie a décidé de changer de carrière et de devenir peintre. Peut-être que notre scénariste a été inspiré par le dessin récemment annoncé de Donald, prétendument envoyé à Epstein. Mais quoi qu'il en soit. Le scénariste m'a donné un brouillon d'une page sur la vie de Donald après son changement de carrière. Ce qui n'était pas suffisant pour créer une bonne personnalité d'IA. J'avais besoin d'au moins 20 pages de texte pour remplir notre magasin vectoriel QDrant, afin que le système RAG d'IA puisse librement choisir des documents bien intégrés pour un processus de réglage fin approprié. *Désolé pour les termes d'ingénierie.* Après une journée d'attente, j'ai décidé d'utiliser l'IA pour générer ce que notre scénariste aurait pu écrire. C'était un acte de procrastination. Je voulais juste remplir le temps d'attente. Étonnamment, les résultats étaient presque identiques à ce que le scénariste m'avait donné. Cela, pour être honnête, m'a étonné. Cela aurait pu être une coïncidence, alors j'ai voulu le vérifier à nouveau avec des données réelles — avec mes données personnelles. Plus tard, je me suis rendu compte que c'était la mauvaise décision. L'entreprise était pressée. *"Nous avions besoin de cette personnalité hier,"* a dit le fondateur. J'étais sceptique quant à l'idée que cette personnalité pourrait rajeunir l'entreprise. J'ai demandé deux jours supplémentaires pour terminer mon travail. La plupart du temps, je prévoyais de le consacrer à mes expériences. Après avoir collecté toutes mes données personnelles — y compris les discussions Telegram, les transcriptions d'appels vocaux, les photos Google, les documents Google Drive, tout ce qui est en quelque sorte lié à moi — j'ai fixé la barre de progression avec un gentil sourire. Mon chien aboyait en arrière-plan, exigeant de l'attention. Je l'ai ignoré, les yeux fixés sur l'écran. Le gentil sourire a disparu lorsque j'ai obtenu le résultat d'extrapolation. > "Toi, Alex, tu seras viré demain," disait l'écran. Cela devait être faux. Je répète, je ne suis pas un développeur talentueux et pas le meilleur — mais quand l'entreprise a des difficultés avec quelque chose, elle demande mon aide. J'ai fait beaucoup pour eux. Je suis important pour eux. C'était ridicule. Ridicule ou non, ce jour-là, j'ai terminé ma tâche et envoyé les résultats immédiatement après. Le reste de la journée, je l'ai passé dans mon appartement dans un beau quartier quelque part à Varsovie — avec un visage légèrement verdâtre. *"C'est ridicule,"* n'arrêtait de résonner dans ma tête. *“Écoute, Alex, je t'aime bien…”* — c'est comme ça que mon manager a commencé la conversation le lendemain. Il a énuméré ce que j'avais fait pour eux, ce que l'entreprise faisait, qu'ils devaient réduire les dépenses, qu'ils appréciaient vraiment mon travail — et tant d'autres épithètes absurdes. *“Donc nous avons décidé de mettre en pause notre relation de travail pour un certain temps et de nous concentrer sur la survie de l'entreprise.”* — c'est comme ça qu'il a fini. Ce n'était pas du tout drôle. Ça m'a pris trois jours pour l'accepter. Au moins j'avais de bonnes économies — et ce logiciel effrayant. Après trois jours à fixer le plafond, je suis revenu au logiciel. Que pouvais-je faire d'autre ? J'étais sans emploi, émotionnellement meurtri, et curieux. J'ai ouvert l'interface d'extrapolation et tapé : > "Et si nous n'avons pas pris de chien il y a un an ?" Résultat : Dans 99,9 % des variations — nous avons quand même pris un chien. Juste plus tard. Parfois, c'est un whippet. Parfois, c'est un bâtard. Dans un cas rare, nous avons eu un chat. Le chat s'est enfui en six mois. Prochain test : > "Et si je gagne à la loterie ?" Bonne nouvelle — je l'ai fait. Une ou deux fois dans différentes chronologies. Et puis j'ai tout perdu dans l'immobilier en Italie ou des startups crypto douteuses. Aucun bonheur détecté. Et ensuite j'ai pris plus d'assurance. J'ai posé la vraie question — celle dont j'ai toujours voulu connaître la réponse : > "Et si j'avais gagné les olympiades de programmation il y a 15 ans ?" Résultat : changement de vie. Massif. Cette version de moi est entrée dans une université de haut niveau dans un autre pays. Il s'est fait des amis — de vrais amis, avec des opinions et un goût pour l'architecture. Il a cofondé une startup de machine learning avant que je n'apprenne moi-même à soutenir le contact visuel lors d'entretiens. Et le plus étrange de tout — il avait l'air… heureux ? J'ai défilé dans ses journaux de vie. Il buvait des smoothies à Palo Alto. Il surfait. Il présentait à des capital-risqueurs et était rejeté. Puis il présentait à nouveau. Finalement, il échouait avec élégance. ![img.png](/blog/dog/polo.webp) Il sortait avec des personnes que je ne pouvais même pas imaginer exister. Il lisait de la poésie. Il avait même un thérapeute. Mais la partie la plus étrange ? Près de la fin de sa chronologie, il a laissé une note privée dans le système : > "Parfois je me demande à quoi ma vie ressemblerait si j'étais resté en Pologne. Peut-être dans un petit appartement à Varsovie. Peut-être en promenant un chien. Je pense que j'aimerais aussi ça." C'est là que j'ai fermé l'ordinateur portable. Je n'ai pas touché au logiciel pendant une semaine. Je suis allé faire de longues promenades. J'ai écouté de la musique sans zapper toutes les 30 secondes. Toutes les chronologies, toutes les versions de moi, toutes les simulations — elles résonnaient dans ma tête comme les rediffusions d'une émission que j'avais déjà vue. J'ai réalisé que les changements drastiques me rendaient méconnaissable. Ce n'était pas moi — juste des projections. Des branches qui poussent dans toutes les directions, mais à partir d'une racine que je me souvenais à peine avoir plantée. J'ai ouvert l'application une dernière fois. Dernière invite : > “Et si je ne demande plus ?” Le système s'est figé. Puis a répondu : > “Aucune projection disponible.” Bien. J'ai éteint l'ordinateur portable et archivé les journaux. Le chien me fixait. Il fait généralement cela lorsqu'il est temps de se promener — à 15 heures. Et pour la première fois depuis des semaines, je ne voulais être nulle part ailleurs. ![img.png](/blog/dog/dog-park2.webp)
id: Saya bukan pengembang perangkat lunak yang berbakat. Saya bukan yang tercepat — dan tentu saja bukan yang terbaik. Tetapi ketika perusahaan tempat saya bekerja mengalami kesulitan dengan sesuatu yang penting dan mendesak, mereka meminta bantuan saya dan membayar saya banyak. Tidak tahu kenapa. Perusahaan ini membuat chatbot untuk hiburan. Anda tahu iklan seperti *“Ayo bicara dengan Albert Einstein”* atau *“Ayo ngobrol dengan Marilyn Monroe.”* Yang menurut saya cukup konyol — tetapi berhasil. Ya, lebih tepatnya dulu berhasil. Perusahaan mengalami kebuntuan. Tidak ada ide untuk fitur baru, tidak ada karakter menarik. Siapa pun yang ingin mencobanya sudah melakukannya. Pendapatan perlahan menurun. Penulis tim, yang dipekerjakan untuk membuat persona semacam itu, tidak dapat mengejar, dan kualitasnya menurun. Tugas kami adalah memperbaikinya — tanpa ide nyata bagaimana caranya. Itu saja yang perlu Anda ketahui tentang manajemen dan proses (atau kekurangan proses, visi, rencana, tanggung jawab) dari perusahaan saya. Tapi baiklah. ![img.png](/blog/dog/monroe.webp) Ide penulisnya adalah menciptakan orang terkenal yang mencoba kehidupan lain — jadi pengguna bisa berbicara, misalnya, dengan Donald Trump, yang di tengah hidupnya memutuskan beralih karier dan menjadi pelukis. Mungkin penulis kami terinspirasi oleh pengumuman menggambar Donald yang baru-baru ini, yang diduga dikirim ke Epstein. Tapi bagaimanapun juga. Penulis memberikan draf satu halaman kepada saya tentang kehidupan Donald setelah perubahan kariernya. Yang belum cukup untuk menciptakan persona AI yang baik. Saya memerlukan setidaknya 20 halaman teks untuk mengisi QDrant vector store kami, sehingga sistem AI RAG dapat dengan bebas memilih dokumen yang tertanam dengan baik untuk proses penyetelan ulang yang tepat. *Maaf untuk istilah teknisnya.* Setelah menunggu satu hari, saya memutuskan untuk menggunakan AI untuk menghasilkan apa yang mungkin telah ditulis oleh penulis kami. Itu adalah tindakan menunda-nunda pekerjaan. Saya hanya ingin mengisi waktu menunggu. Yang mengejutkan, hasilnya hampir identik dengan yang diberikan penulis kepada saya. Itu, sejujurnya, membuat saya terkejut. Mungkin itu kebetulan, jadi saya ingin memeriksanya kembali dengan data nyata — dengan data pribadi saya. Belakangan, saya menyadari bahwa itu adalah keputusan yang salah. Perusahaan sedang terburu-buru. *“Kami butuh persona ini selesai kemarin,”* kata pendiri. Saya ragu bahwa persona ini akan menyegarkan perusahaan. Saya meminta dua hari ekstra untuk menyelesaikan pekerjaan saya. Sebagian besar waktu saya rencanakan untuk dialokasikan ke eksperimen saya. Setelah mengumpulkan semua data pribadi saya — termasuk percakapan Telegram, transkrip panggilan suara, foto Google, dokumen Google Drive, semua yang entah bagaimana terkait dengan saya — saya menatap bilah kemajuan dengan senyum ramah. Anjing saya menggonggong di latar belakang, menuntut perhatian. Saya mengabaikannya, mata menatap layar. Senyum ramah menghilang ketika saya mendapatkan hasil ekstrapolasi. > "Kamu, Alex, akan dipecat besok," tertulis di layar. Itu pasti salah. Saya ulangi, saya bukan pengembang yang berbakat dan bukan yang terbaik — tetapi ketika perusahaan mengalami kesulitan dengan sesuatu, mereka meminta bantuan saya. Saya telah melakukan banyak hal untuk mereka. Saya penting bagi mereka. Itu sangat tidak masuk akal. Tidak masuk akal atau tidak, hari itu saya menyelesaikan tugas saya dan mengirimkan hasilnya segera setelahnya. Sisa hari itu saya habiskan di apartemen saya di lingkungan yang indah di suatu tempat di Warsawa — dengan wajah yang sedikit kehijauan. *“Ini tidak masuk akal,"* terus berulang di kepala saya. *“Dengar, Alex, aku suka kamu…”* — begitulah manajer saya memulai percakapan keesokan harinya. Dia mencantumkan apa yang telah saya lakukan untuk mereka, apa yang dilakukan perusahaan, bahwa mereka harus mengurangi pengeluaran, bahwa mereka benar-benar menghargai pekerjaan saya — dan banyak epitet omong kosong lainnya. *“Jadi kami telah memutuskan untuk menghentikan hubungan kerja Anda untuk sementara waktu dan fokus pada kelangsungan perusahaan.”* — begitulah cara dia menyelesaikan. Itu tidak lucu sama sekali. Saya butuh tiga hari untuk menerimanya. Setidaknya saya punya tabungan yang bagus — dan perangkat lunak yang menyeramkan itu. Setelah tiga hari menatap langit-langit, saya kembali ke perangkat lunak itu. Apalagi yang bisa saya lakukan? Saya menganggur, terluka secara emosional, dan penasaran. Saya membuka antarmuka ekstrapolasi dan mengetik: > "Bagaimana jika kita tidak memelihara anjing satu tahun yang lalu?" Hasil: Dalam 99,9% variasi — kita tetap mendapatkan anjing. Hanya terlambat. Kadang-kadang itu adalah whippet. Kadang-kadang itu adalah anjing campuran. Dalam satu kasus langka, kita mendapatkan kucing. Kucing itu kabur dalam enam bulan. Tes berikutnya: > "Bagaimana jika saya memenangkan lotere?" Berita baik — saya menang. Satu atau dua kali di berbagai garis waktu. Dan kemudian saya kehilangan semuanya pada properti di Italia atau startup kripto yang samar. Tidak ada kebahagiaan yang terdeteksi. Dan kemudian saya semakin berani. Saya mengajukan pertanyaan sebenarnya — yang selalu ingin saya ketahui jawabannya: > "Bagaimana jika saya memenangkan olimpiade pemrograman 15 tahun yang lalu?" Hasil: perubahan hidup. Masif. Versi diri saya itu masuk ke universitas top di negara lain. Dia berteman — teman sejati, dengan pendapat dan selera dalam arsitektur. Dia ikut mendirikan startup pembelajaran mesin sebelum saya bahkan belajar cara menjaga kontak mata dalam wawancara. Dan yang paling aneh — dia tampak… bahagia? Saya menggulir log kehidupannya. Dia meminum smoothie di Palo Alto. Dia berselancar. Dia mempresentasikan ide kepada pemodal ventura dan ditolak. Kemudian dia mencoba lagi. Akhirnya, dia gagal dengan anggun. ![img.png](/blog/dog/polo.webp) Dia berkencan dengan orang yang bahkan tidak bisa saya bayangkan ada. Dia membaca puisi. Dia bahkan memiliki terapis. Tetapi bagian yang paling aneh? Menjelang akhir garis waktunya, dia meninggalkan catatan pribadi dalam sistem: > "Terkadang saya bertanya-tanya bagaimana hidup saya akan berjalan kalau tetap tinggal di Polandia. Mungkin tinggal di apartemen kecil di Warsawa. Mungkin berjalan-jalan dengan anjing. Saya pikir saya akan menyukainya juga." Saat itulah saya menutup laptop. Saya tidak menyentuh perangkat lunak selama seminggu. Saya berjalan-jalan jauh. Mendengarkan musik tanpa melewatkan setiap 30 detik. Semua garis waktu, semua versi diriku, semua simulasi — mereka bergema di kepala seperti tayangan ulang acara yang sudah pernah saya tonton. Saya menyadari bahwa perubahan drastis membuat saya tak bisa dikenali. Mereka bukan saya — hanya proyeksi. Cabang tumbuh ke segala arah, tetapi dari akar yang hampir tidak saya ingat menanamnya. Saya membuka aplikasi untuk terakhir kalinya. Prompt akhir: > "Bagaimana jika saya tidak bertanya lagi?" Sistem membeku. Kemudian menjawab: > "Tidak ada proyeksi yang tersedia." Bagus. Saya mematikan laptop dan mengarsipkan log. Anjing itu menatap saya. Dia biasa melakukannya saat sudah waktunya berjalan-jalan — jam 3 sore. Dan untuk pertama kalinya dalam beberapa minggu, saya tidak ingin berada di tempat lain. ![img.png](/blog/dog/dog-park2.webp)
it: Non sono uno sviluppatore software talentuoso. Non sono il più veloce — e sicuramente non il migliore. Ma quando l'azienda per cui lavoro ha problemi con qualcosa di importante ed urgente, chiedono il mio aiuto e mi pagano molto. Non so perché. La società produce chatbot per l'intrattenimento. Conosci quegli annunci come *"Parliamo con Albert Einstein"* o *"Chattiamo con Marilyn Monroe."* Che trovo piuttosto stupidi — ma funziona. Beh, funzionava, per essere precisi. L'azienda è rimasta bloccata. Nessuna idea per nuove funzionalità, nessun personaggio interessante. Chi voleva provarlo l'aveva già fatto. I ricavi lentamente sono diminuiti. Lo scrittore del team, assunto per creare tali personaggi, non riusciva a tenere il passo, e la qualità stava calando. Il nostro compito era di migliorarlo — senza avere realmente idea di come. Questo è tutto ciò che devi sapere sulla gestione e sui processi del mio datore di lavoro, o sulla mancanza di processi, visione, piano, responsabilità. Ma va bene. ![img.png](/blog/dog/monroe.webp) L'idea dello scrittore era di creare un personaggio famoso che avesse provato un'altra vita — così l'utente poteva parlare, per esempio, con Donald Trump, che nel mezzo della sua vita aveva deciso di cambiare carriera e diventare un pittore. Forse il nostro scrittore è stato ispirato dal recente disegno annunciato da Donald, presumibilmente inviato a Epstein. Ma comunque. Lo scrittore mi ha dato una bozza di una pagina sulla vita di Donald dopo il suo cambio di carriera. La quale non era sufficiente per creare un buon personaggio AI. Avevo bisogno di almeno 20 pagine di testo per riempire il nostro archivio vettoriale QDrant, così il sistema RAG dell'AI potesse scegliere liberamente documenti ben incorporati per un corretto processo di perfezionamento. *Scusate per i termini ingegneristici.* Dopo un giorno di attesa, ho deciso di usare l'IA per generare ciò che il nostro scrittore avrebbe potuto scrivere. È stato un atto di procrastinazione. Volevo solo riempire il tempo di attesa. Sorprendentemente, i risultati erano quasi identici a quelli forniti dallo scrittore. Questo, per essere onesto, mi ha stupito. Potrebbe essere stata una coincidenza, quindi ho voluto verificarlo con dati reali — con i miei dati personali. Più tardi ho capito che era la decisione sbagliata. L'azienda era di fretta. *“Avevamo bisogno di questo personaggio fatto ieri,”* ha detto il fondatore. Ero scettico sul fatto che questo personaggio avrebbe ringiovanito l'azienda. Ho chiesto due giorni in più per finire il mio lavoro. La maggior parte del tempo l'avevo pianificata per dedicarmi ai miei esperimenti. Dopo aver raccolto tutti i miei dati personali — comprese le chat di Telegram, trascrizioni di chiamate vocali, foto di Google, documenti di Google Drive, tutto in qualche modo relativo a me — ho fissato la barra di avanzamento con un sorriso gentile. Il mio cane abbaiava in sottofondo, richiedendo attenzione. L'ho ignorato, occhi fissi sullo schermo. Il gentile sorriso è scomparso quando ho ottenuto il risultato dell'estrapolazione. > “Tu, Alex, sarai licenziato domani,” ha letto lo schermo. Doveva essere sbagliato. Ripeto, non sono uno sviluppatore talentuoso e non il migliore — ma quando l'azienda ha problemi con qualcosa, chiedono il mio aiuto. Ho fatto molto per loro. Sono importante per loro. Era ridicolo. Ridicolo o no, quel giorno ho finito il mio compito e ho inviato i risultati immediatamente dopo. Il resto della giornata l'ho trascorsa nel mio appartamento in un bel quartiere da qualche parte a Varsavia — con un volto leggermente verdastro. *"Questo è ridicolo,"* continuavo a sentire nella mia testa. *“Ascolta, Alex, mi piaci…”* — è così che il mio manager ha iniziato la conversazione il giorno dopo. Ha elencato ciò che avevo fatto per loro, quello che l'azienda stava facendo, che dovevano ridurre le spese, che apprezzavano davvero il mio lavoro — e molte altre stronzate. *“Quindi abbiamo deciso di mettere in pausa il tuo rapporto di lavoro per un po' e concentrarci sulla sopravvivenza dell'azienda.”* — è così che ha finito. Non era affatto divertente. Mi ci sono voluti tre giorni per accettarlo. Almeno avevo buoni risparmi — e quel pezzo inquietante di software. Dopo tre giorni passati a fissare il soffitto, sono tornato al software. Cos'altro potevo fare? Ero disoccupato, emotivamente ferito, e curioso. Ho aperto l'interfaccia di estrapolazione e digitato: > “E se non avessimo preso un cane un anno fa?” Risultato: nel 99,9% delle varianti — abbiamo comunque preso un cane. Solo più tardi. A volte è un levriero. A volte è un meticcio. In un raro caso, abbiamo preso un gatto. Il gatto è scappato in sei mesi. Prossimo test: > “E se avessi vinto la lotteria?” Ottime notizie — l'ho fatto. Una o due volte in linee temporali diverse. E poi ho perso tutto nel settore immobiliare in Italia o in startup crypto ombrose. Nessuna felicità è stata rilevata. E poi sono diventato più audace. Ho fatto la vera domanda — quella di cui avevo sempre voluto sapere la risposta: > “E se avessi vinto le olimpiadi di programmazione 15 anni fa?” Risultato: cambiamento di vita. Massiccio. Quella versione di me entrò in una università prestigiosa in un altro paese. Fece amici — amici veri, con opinioni e un gusto per l'architettura. Co-fondò una startup di apprendimento automatico prima ancora che imparassi come mantenere il contatto visivo nei colloqui. E la cosa più strana di tutte — sembrava... felice? Scorri le sue registrazioni di vita. Beveva frullati a Palo Alto. Faceva surf. Proponeva a capitalisti di ventura e veniva rifiutato. Poi proponeva di nuovo. Alla fine, fallì con grazia. ![img.png](/blog/dog/polo.webp) Frequentava persone che non riuscivo nemmeno a immaginare esistessero. Leggeva poesia. Aveva persino un terapeuta. Ma la parte più strana? Vicino alla fine della sua linea temporale, lasciò una nota privata nel sistema: > “A volte mi chiedo come sarebbe stata la mia vita se fossi rimasto in Polonia. Forse in un piccolo appartamento a Varsavia. Forse a passeggio con un cane. Penso che mi piacerebbe anche quello.” E' stato allora che ho chiuso il laptop. Non ho toccato il software per una settimana. Ho fatto lunghe passeggiate. Ho ascoltato musica senza saltare ogni 30 secondi. Tutte le linee temporali, tutte le versioni di me, tutte le simulazioni — riecheggiavano nella mia testa come repliche di uno spettacolo che avevo già visto. Ho realizzato che i cambiamenti drastici mi rendevano irriconoscibile. Non erano me — solo proiezioni. Rami che crescevano in ogni direzione, ma da una radice che ricordavo a malapena di aver piantato. Ho aperto l'app un'ultima volta. Ultima richiesta: > “E se non chiedessi più nulla?” Il sistema si è bloccato. Poi ha risposto: > “Nessuna proiezione disponibile.” Bene. Ho spento il laptop e archiviato i registri. Il cane mi ha fissato. Di solito lo fa quando è ora di fare una passeggiata — alle 15:00. E per la prima volta da settimane, non volevo essere da nessun'altra parte. ![img.png](/blog/dog/dog-park2.webp)
ja: 私にはソフトウェア開発の才能がありません。私は一番速いわけでも、一番優れているわけでもありません。しかし、私の勤めている会社が重要で緊急な問題に直面したとき、彼らは私に助けを求め、多額の報酬を支払います。なぜなのかはわかりません。 その会社はエンターテインメント向けのチャットボットを開発しています。*「アルバート・アインシュタインと話そう」*とか*「マリリン・モンローとチャットしよう」*というような広告をご存じでしょう。それはとても愚かだと思いますが、効果があります。少なくとも以前はそうでした。会社は詰まってしまいました。新機能のアイデアがなく、興味深いキャラクターもありません。興味を持った人はすでに試してしまいました。売り上げは徐々に減少。そのような人格を創り出すために雇われたライターもそれに追いつけず、品質も低下していました。 私たちの任務は、それを改善することでした。しかし、どうしたらいいかわからずにいました。これが私の雇用者の管理やプロセス、あるいはプロセスの欠如、ビジョン、計画、責任などについて知っておくべきすべてのことです。でもまあいいでしょう。 ライターのアイデアは、別の人生を歩んだ有名人を創り出すことでした。ユーザーがたとえば、人生の途中でキャリアを変えて画家になったドナルド・トランプと話すことができるようにするというものでした。おそらく、ライターはドナルドが最近発表した絵に着想を得たのでしょう。しかしそれはさておき。ライターはドナルドの転職後の人生についての1ページの草案を私に渡してきました。 それでは良いAI人格を作るのには不十分でした。QDrantベクトルストアを埋めるのに少なくとも20ページのテキストが必要だったので、AI RAGシステムが適切なファインチューニングプロセスのためにしっかりと埋め込まれた文書を自由に選べるようにする必要がありました。*工学用語についての謝罪です。* 1日待った後、私はライターが書くかもしれないものを生成するためAIを使用することにしました。それは先延ばしの行為でした。ただ待ち時間を埋めたかっただけでした。驚いたことに、結果はライターが私にくれたものとほぼ同じでした。正直に言うと、それに驚かされました。 それは偶然かもしれないと思い、実際のデータで再確認したくなりました — 私の個人的なデータで。後で、それが間違った決定だったことに気付きました。 会社は急いでいました。*「この人格は昨日までに必要だったのに」*と言う創業者。私はこの人格が会社を立て直すとは懐疑的でした。作業を完了するのに2日追加で欲しいと頼み、ほとんどその時間を実験に割り当てるつもりでした。 私の全ての個人的なデータを収集した後 — Telegramのチャット、音声通話のトランスクリプト、Google Photos、Google Driveのドキュメント、私に関連するすべて — 穏やかな微笑みで進捗バーを見つめました。背後では犬が吠えて注意を引こうとしていましたが無視し、画面に目を集中させていました。 その親切な微笑みは外挿結果が出たときに消えました。 > 「あなたは明日、解雇されます」と画面には表示されていました。 それは間違いであるはずです。私は天才的な開発者ではなく、最高の開発者でもありませんが、会社が困っているときには私に助けを求めてきます。私は彼らのために多くのことをしました。私は彼らにとって重要です。それは馬鹿げています。 馬鹿げているかどうかは置いておいて、その日は私のタスクを完了し、結果をすぐに送りました。残りの時間は、ワルシャワのどこかの美しい街区にあるアパートで顔をわずかに黄緑色にして過ごしました。 *「これは馬鹿げています」*と頭の中で聞こえ続けました。 *「聞いてくれ、アレックス、君のことは気に入っているんだけど…」* — 次の日に私のマネージャーはそう会話を始めました。 彼は私が彼らのために何をしたか、会社が何をしているのか、支出を削減する必要があること、私の仕事を本当に評価していること — それに他の多くのくだらない形容詞を列挙しました。 *「だから、君の勤務関係をしばらく中断し、会社の生存に集中することにしたのだ。」* — そう彼は締めくくりました。 それは全く面白くありませんでした。受け入れるのに3日を要しました。少なくとも貯金は十分にありましたし — そしてあの不気味なソフトウェアも。 天井を見つめ続けた3日後、私は再びソフトウェアに向かいました。他に何ができるでしょうか？私は失業していて、感情的に傷ついていて、そして好奇心がありました。 予想外の結果インターフェースを開き、こう入力しました： > 「1年前に犬を飼わなかったらどうなる？」 結果：99.9%のバリエーションで — 私たちは結局犬を飼います。ただし、もっと後のことです。 時にはウィペット。時には雑種。稀なケースでは、猫を飼っていました。その猫は6ヶ月で姿を消しました。 次のテスト： > 「宝くじに当たったらどうなる？」 うれしいニュース — ある時間軸では当たりました。そして、イタリアの不動産や怪しい仮想通貨スタートアップですべてを失いました。幸福は検出されませんでした。 そして私は大胆になりました。 本当に知りたかった質問をしました： > 「15年前にプログラミングオリンピックで優勝していたらどうなる？」 結果：人生の転換。劇的な。 その私のバージョンは別の国の名門大学に入学しました。彼は友達 — 本物の友達を作りました。意見と建築に対する趣味を備えた友人です。彼は機械学習のスタートアップを共同設立しました。私は面接で目を合わせる方法すら学ぶ前に。 そして不思議なことに — 彼は幸せそうでした？ 彼の人生記録をスクロールしました。彼はパロアルトでスムージーを飲みました。サーフィンをしました。ベンチャーキャピタリストに売り込みをしては拒絶され、再び売り込みました。最終的に彼は上手に失敗しました。 彼は想像もできないような人たちとデートしました。詩を読みました。セラピストもいました。 しかし一番奇妙なことは？彼の時間軸の終わりに近いところ、彼はシステムにプライベートノートを残しました： > 「時々思うんだ、もしポーランドにとどまっていたらどうなっていただろう？ワルシャワの小さなアパートで。犬を散歩させるかもしれない。でもそれも悪くないと思う。」 そのとき私はラップトップを閉じました。 一週間、ソフトウェアに触れませんでした。長い散歩に出かけ、30秒ごとにスキップせずに音楽を聴きました。 全ての時間軸、全ての私のバージョン、全てのシミュレーション — それらは既に見たことがある番組のリピートのように頭の中で反響していました。 私は気づきました。大幅な変更によって私は識別できなくなっていた。それらは私ではなく、ただの投影でした。あらゆる方向に伸びる枝ですが、私が種を撒いた記憶はほとんど覚えていないのです。 最後にもう一度アプリを開きました。 最終プロンプト： > 「もう何も問わなければ？」 システムは固まり、それから答えました： > 「利用可能な予想はありません。」 良かった。 私はラップトップをシャットダウンし、ログをアーカイブしました。 犬が私を見つめていました。彼はたいてい3時になるとそれをします — 散歩の時間だからです。 そして数週間ぶりに、私は他のどこにも居たくありませんでした。
ms: Saya bukanlah seorang pembangun perisian berbakat. Saya bukan yang paling pantas — dan pastinya bukan yang terbaik. Tetapi apabila syarikat tempat saya bekerja menghadapi masalah dengan sesuatu yang penting dan mendesak, mereka meminta bantuan saya dan membayar saya banyak. Tidak tahu kenapa. Syarikat ini membuat chatbot untuk hiburan. Anda tahu iklan seperti *"Mari berbual dengan Albert Einstein"* atau *"Mari berbual dengan Marilyn Monroe."* Yang saya rasa agak bodoh — tetapi ia berkesan. Ya, ia pernah berkesan, untuk lebih tepat. Syarikat itu terperangkap. Tiada idea untuk ciri baharu, tiada watak menarik. Sesiapa yang ingin mencubanya sudah pun mencuba. Pendapatan semakin merosot. Penulis pasukan, yang diambil untuk mencipta persona sebegitu, tidak dapat mengekalkan kualiti, dan kualiti semakin merosot. Tugas kami adalah untuk memperbaikinya — tanpa idea yang nyata bagaimana. Itulah sahaja yang anda perlu tahu tentang pengurusan dan proses majikan saya, atau kekurangan proses, visi, pelan, tanggungjawab. Tetapi baiklah. ![img.png](/blog/dog/monroe.webp) Idea penulis adalah untuk mencipta seorang tokoh terkenal yang telah mencuba kehidupan lain — jadi pengguna boleh berbual, sebagai contoh, dengan Donald Trump, yang di pertengahan kehidupannya memutuskan untuk menukar kerjaya dan menjadi pelukis. Mungkin penulis kami mendapat inspirasi dari Donald yang baru-baru ini mengumumkan lukisan, kononnya dihantar kepada Epstein. Tetapi bagaimanapun. Penulis memberikan saya draf satu muka surat tentang kehidupan Donald selepas perubahan kerjayanya. Yang mana tidak cukup untuk mencipta persona AI yang baik. Saya memerlukan sekurang-kurangnya 20 muka surat teks untuk mengisi stor vektor QDrant kami, jadi sistem AI RAG boleh dengan bebas memilih dokumen yang terbenam dengan baik untuk proses penalaan yang sesuai. *Maaf untuk istilah kejuruteraan.* Selepas satu hari menunggu, saya memutuskan untuk menggunakan AI untuk menghasilkan apa yang mungkin ditulis oleh penulis kami. Ia adalah satu tindakan prokrastinasi. Saya cuma mahu mengisi masa menunggu. Mengejutkan, hasilnya hampir sama dengan apa yang penulis berikan kepada saya. Jujur, itu mengejutkan saya. Ia mungkin kebetulan, jadi saya ingin memeriksanya semula dengan data sebenar — dengan data peribadi saya. Kemudian, saya menyedari bahawa itu adalah keputusan yang salah. Syarikat berada dalam keadaan terdesak. *"Kita perlukan persona ini siap semalam,"* kata pengasas. Saya ragu bahawa persona ini akan menyegarkan syarikat. Saya meminta dua hari tambahan untuk menyiapkan kerja saya. Kebanyakan masa saya rancang untuk dialokasikan kepada eksperimen saya. Selepas mengumpulkan semua data peribadi saya — termasuk sembang Telegram, transkrip panggilan suara, Google Photos, dokumen Google Drive, segala-galanya yang agak berkaitan dengan saya — saya merenung bar progres dengan senyuman yang lembut. Anjing saya menyalak di latar belakang, menuntut perhatian. Saya mengabaikannya, mata terkunci pada skrin. Senayuman lembut itu hilang apabila saya mendapat hasil ekstrapolasi. > “Anda, Alex, akan dipecat esok,” baca skrin. Itu pasti salah. Saya ulang, saya bukan pembangun berbakat dan bukan yang terbaik — tetapi bila syarikat menghadapi masalah dengan sesuatu, mereka minta bantuan saya. Saya banyak berbuat untuk mereka. Saya penting kepada mereka. Ia adalah mengarut. Mengarut atau tidak, hari itu saya menyelesaikan tugas saya dan menghantar keputusan sejurus selepasnya. Sepanjang hari saya habiskan di apartmen saya di kawasan kejiranan yang indah di Warsaw — dengan muka yang sedikit hijau. *"Ini mengarut,"* saya terus mendengar dalam kepala saya. *“Dengar, Alex, saya suka awak…”* — itulah cara pengurus saya memulakan perbualan pada keesokan harinya. Dia menyenaraikan apa yang telah saya lakukan untuk mereka, apa yang syarikat lakukan, mereka perlu mengurangkan perbelanjaan, mereka benar-benar menghargai kerja saya — dan banyak epithet yang tidak menyenangkan. *“Jadi kami memutuskan untuk menghentikan hubungan kerja anda buat sementara waktu dan fokus pada kelangsungan hidup syarikat.”* — itulah cara dia mengakhiri. Itu tidak lucu langsung. Saya memerlukan tiga hari untuk menerimanya. Sekurang-kurangnya saya mempunyai simpanan yang baik — dan perisian yang menyeramkan itu. Setelah tiga hari menatap siling, saya kembali kepada perisian. Apa lagi yang boleh saya lakukan? Saya menganggur, secara emosional terluka, dan ingin tahu. Saya membuka antara muka ekstrapolasi dan menaip: > “Bagaimana jika kita tidak mendapatkan anjing setahun yang lalu?” Hasilnya: Dalam 99.9% variasi — kita tetap mendapatkan anjing. Cuma lebih lambat. Kadang-kadang ia adalah whippet. Kadang-kadang ia adalah anjing kacukan. Dalam satu kes yang jarang berlaku, kita mendapatkan kucing. Kucing itu lari selepas enam bulan. Ujian seterusnya: > “Bagaimana jika saya menang loteri?” Berita baik — saya menang. Sekali atau dua kali dalam garis masa yang berbeza. Dan kemudian saya kehilangannya semua pada hartanah di Itali atau startup crypto yang mencurigakan. Tiada kebahagiaan dikesan. Kemudian saya menjadi lebih berani. Saya bertanyakan soalan sebenar — yang selalu saya ingin tahu jawabannya: > “Bagaimana jika saya memenangi olimpiad pengaturcaraan 15 tahun lalu?” Hasilnya: perubahan hidup. Besar. Versi saya itu memasuki universiti terkemuka di negara lain. Dia membuat kawan — kawan sebenar dengan pendapat dan minat dalam seni bina. Dia menubuhkan startup pembelajaran mesin sebelum saya pun belajar bagaimana untuk menahan kontak mata dalam temuduga. Dan yang paling pelik sekali — dia kelihatan... gembira? Saya menyemak log kehidupannya. Dia minum smoothie di Palo Alto. Dia berselancar. Dia membuat pitch kepada kapitalis teroka dan ditolak. Kemudian dia pitch lagi. Akhirnya, dia gagal dengan anggun. ![img.png](/blog/dog/polo.webp) Dia berkenalan dengan orang yang saya tidak dapat bayangkan wujud. Dia membaca puisi. Dia malah mempunyai seorang terapis. Tetapi bahagian yang paling pelik? Dekat akhir garis masanya, dia meninggalkan catatan peribadi dalam sistem: > “Kadang-kadang saya tertanya-tanya bagaimana hidup saya akan jika saya tetap di Poland. Mungkin di apartmen kecil di Warsaw. Mungkin berjalan-jalan dengan anjing. Saya rasa saya juga akan suka itu.” Ketika itulah saya menutup laptop. Saya tidak menyentuh perisian selama seminggu. Saya pergi berjalan-jalan jauh. Mendengar muzik tanpa melangkau setiap 30 saat. Semua garis masa, semua versi diri saya, semua simulasi — mereka bergema dalam kepala saya seperti ulangan rancangan yang telah saya tonton. Saya menyedari bahawa perubahan drastik membuat saya tidak dikenali. Mereka bukan saya — hanya unjuran. Cabang-cabang yang tumbuh dalam setiap arah, tetapi dari akar yang saya hampir tidak ingat menanamnya. Saya membuka aplikasi satu kali terakhir. Dorongan terakhir: > “Bagaimana jika saya tidak bertanya lagi?” Sistem terhenti. Kemudian menjawab: > “Tiada unjuran tersedia.” Bagus. Saya menutup laptop dan mengarkibkan log. Anjing itu merenung saya. Dia biasanya melakukan itu apabila tiba masanya untuk berjalan-jalan — pada 3 petang. Dan untuk pertama kali dalam minggu ini, saya tidak mahu berada di tempat lain. ![img.png](/blog/dog/dog-park2.webp)
no: Jeg er ikke en talentfull programvareutvikler. Jeg er ikke den raskeste — og absolutt ikke den beste. Men når selskapet der jeg jobber sliter med noe viktig og presserende, ber de om min hjelp og betaler meg mye. Aner ikke hvorfor. Selskapet lager chatboter for underholdning. Du vet, de annonsene som *"La oss snakke med Albert Einstein"* eller *"La oss chatte med Marilyn Monroe."* Noe jeg synes er ganske dumt — men det fungerer. Vel, det hadde fungert, for å være nøyaktig. Selskapet satt fast. Ingen ideer for nye funksjoner, ingen interessante karakterer. De som ville prøve det, hadde allerede gjort det. Inntektene sank sakte. Teamets skribent, som ble ansatt for å lage slike personligheter, klarte ikke å følge med, og kvaliteten gled ut. Oppgaven vår var å forbedre det — uten noen egentlig idé om hvordan. Det er alt du trenger å vite om ledelsen og prosessene, eller mangelen på prosesser, visjon, plan, ansvarsområder til arbeidsgiveren min. Men ok. ![img.png](/blog/dog/monroe.webp) Skribentens idé var å lage en berømt person som hadde forsøkt et annet liv — slik at brukeren for eksempel kunne snakke med Donald Trump, som midt i livet bestemte seg for å bytte karriere og bli maler. Kanskje skribenten vår ble inspirert av Donalds nylig annonserte tegning, angivelig sendt til Epstein. Men uansett. Skribenten ga meg et én-sides utkast om Donalds liv etter hans karriereskifte. Som ikke var nok til å lage en god AI-personlighet. Jeg trengte minst 20 sider med tekst for å fylle vår QDrant vektorlager, slik at AI RAG-systemet fritt kunne velge godt innebygde dokumenter for en skikkelig finjusteringsprosess. *Beklager de teknologiske termene.* Etter en dags venting bestemte jeg meg for å bruke AI for å generere hva vår skribent muligens kunne ha skrevet. Det var en handling av prokrastinering. Jeg ville bare fylle ventetiden. Overraskende nok var resultatene nesten identiske med det skribenten ga meg. Det, for å være ærlig, forbløffet meg. Det kunne ha vært en tilfeldighet, så jeg ønsket å sjekke det igjen med ekte data — med mine personlige data. Senere innså jeg at det var en feil beslutning. Selskapet hadde det travelt. *"Vi trengte denne personligheten ferdig i går,"* sa grunnleggeren. Jeg var skeptisk til at denne personligheten ville forynge selskapet. Jeg ba om to ekstra dager for å fullføre arbeidet mitt. Mesteparten av tiden planla jeg å bruke på eksperimentene mine. Etter å ha samlet inn alle mine personlige data — inkludert Telegram-samtaler, transkripsjoner av taleanrop, Google Foto, Google Disk-dokumenter, alt som på noen måte var relatert til meg — stirret jeg på fremdriftslinjen med et vennlig smil. Hunden min bjeffet i bakgrunnen, krevde oppmerksomhet. Jeg ignorerte ham, med blikket fast på skjermen. Det vennlige smilet forsvant da jeg fikk ekstrapolasjonsresultatet. > "Du, Alex, vil bli sparket i morgen," sto det på skjermen. Det måtte være galt. Jeg gjentar, jeg er ikke en talentfull utvikler og ikke den beste — men når selskapet sliter med noe, ber de om min hjelp. Jeg gjorde mye for dem. Jeg er viktig for dem. Det var latterlig. Latterlig eller ikke, den dagen fullførte jeg oppgaven min og sendte resultatene umiddelbart etter. Resten av dagen tilbrakte jeg i leiligheten min i et vakkert nabolag et sted i Warszawa — med et noe grønnaktig ansikt. *"Dette er latterlig,"* fortsatte jeg å høre i hodet mitt. *"Hør, Alex, jeg liker deg..."* — slik startet sjefen min samtalen dagen etter. Han listet opp hva jeg hadde gjort for dem, hva selskapet gjorde, at de måtte redusere utgifter, at de virkelig satte pris på mitt arbeid — og mange andre hullepikker. *"Så vi har bestemt oss for å pause arbeidsforholdet ditt en stund og fokusere på selskapets overlevelse."* — slik avsluttet han. Det var ikke morsomt i det hele tatt. Det tok meg tre dager å akseptere det. I det minste hadde jeg gode sparepenger — og den skumle programvaren. Etter tre dager med å stirre i taket, kom jeg tilbake til programvaren. Hva annet kunne jeg gjøre? Jeg var arbeidsledig, følelsesmessig skadet og nysgjerrig. Jeg åpnet ekstrapolasjonsgrensesnittet og skrev: > "Hva om vi ikke hadde fått en hund for ett år siden?" Resultat: I 99,9 % av variantene — vi fikk fortsatt en hund. Bare senere. Noen ganger er det en whippet. Noen ganger er det en blandingshund. I ett sjeldent tilfelle fikk vi en katt. Katten stakk av etter seks måneder. Neste test: > "Hva om jeg vant i lotto?" Gode nyheter — det gjorde jeg. En gang eller to ganger i forskjellige tidslinjer. Og så mistet jeg alt på eiendom i Italia eller suspekte kryptostartups. Ingen lykke ble oppdaget. Og så ble jeg modigere. Jeg stilte det virkelige spørsmålet — det jeg alltid har ønsket å vite svaret på: > "Hva om jeg vant programmeringsolympiaden for 15 år siden?" Resultat: livsskifte. Massivt. Den versjonen av meg kom inn på et topplag universitet i et annet land. Han fikk venner — ekte venner, med meninger og en smak for arkitektur. Han medgrunnla en maskinlæringsstartup før jeg i det hele tatt lærte hvordan jeg skulle holde blikket under intervjuer. Og det merkeligste av alt — han virket... lykkelig? Jeg bladde gjennom livsloggene hans. Han drakk smoothies i Palo Alto. Han surfet. Han pitchet til investorer og fikk avslag. Så pitchet han igjen. Til slutt mislyktes han storslått. ![img.png](/blog/dog/polo.webp) Han datet folk jeg ikke engang kunne forestille meg eksisterte. Han leste poesi. Han hadde til og med en terapeut. Men det rareste? Nær slutten av tidslinjen hans la han igjen en privat notat i systemet: > "Noen ganger lurer jeg på hvordan livet mitt ville vært hvis jeg ble værende i Polen. Kanskje i en liten leilighet i Warszawa. Kanskje gå tur med en hund. Jeg tror jeg ville likt det også." Det var da jeg lukket laptoppen. Jeg rørte ikke programvaren på en uke. Jeg gikk på lange turer. Hørte på musikk uten å hoppe videre hvert 30. sekund. Alle tidslinjene, alle versjonene av meg, alle simuleringene — de ekko i hodet mitt som gjentagelser av et show jeg allerede hadde sett. Jeg innså at de drastiske endringene gjorde meg ugjenkjennelig. De var ikke meg — bare projeksjoner. Greiner som vokser i alle retninger, men fra en rot jeg knapt husker å ha plantet. Jeg åpnet appen en siste gang. Siste prompt: > "Hva om jeg ikke spør mer?" Systemet frøs. Så svarte det: > "Ingen projeksjoner tilgjengelige." Bra. Jeg slo av laptopen og arkiverte loggene. Hunden stirret på meg. Han pleier å gjøre det når det er tid for en tur — klokka 15:00. Og for første gang på flere uker ønsket jeg ikke å være noe annet sted. ![img.png](/blog/dog/dog-park2.webp)
pl: Nie jestem utalentowanym programistą. Nie jestem najszybszy — i z pewnością nie najlepszy. Ale kiedy firma, w której pracuję, boryka się z czymś ważnym i pilnym, proszą mnie o pomoc i dużo mi płacą. Nie mam pojęcia dlaczego. Firma tworzy chatboty dla rozrywki. Znasz te reklamy typu *„Porozmawiajmy z Albertem Einsteinem”* czy *„Porozmawiajmy z Marilyn Monroe.”* Uważam, że to dość głupie — ale to działa. No cóż, działało, mówiąc precyzyjnie. Firma utknęła. Brak pomysłów na nowe funkcje, brak interesujących postaci. Kto chciał spróbować, już to zrobił. Dochody powoli malały. Scenarzysta zespołu, który został zatrudniony do tworzenia takich postaci, nie nadążał, a jakość spadała. Naszym zadaniem było to poprawić — bez prawdziwego pomysłu jak. To wszystko, co trzeba wiedzieć o zarządzaniu moim pracodawcą, jego procesach lub ich braku, wizji, planie, odpowiedzialnościach. Ale w porządku. ![img.png](/blog/dog/monroe.webp) Pomysłem scenarzysty było stworzenie znanej osoby, która spróbowała innego życia — aby użytkownik mógł porozmawiać na przykład z Donaldem Trumpem, który w połowie życia postanowił zmienić karierę i zostać malarzem. Może nasz scenarzysta zainspirował się niedawno ogłoszonym rysunkiem Donalda, rzekomo wysłanym do Epsteina. Ale tak czy inaczej. Scenarzysta dał mi jednolitą stronę szkicu o życiu Donalda po jego zwrocie kariery. Co nie wystarczało, aby stworzyć dobrą personę AI. Potrzebowałem co najmniej 20 stron tekstu, aby wypełnić nasz magazyn QDrant, dzięki czemu system AI RAG mógł swobodnie wybierać dobrze osadzone dokumenty do odpowiedniego procesu dostrajania. *Przepraszam za inżynierskie terminy.* Po jednodniowym oczekiwaniu postanowiłem użyć AI do wygenerowania tego, co nasz scenarzysta mógłby napisać. To było działanie opóźniające. Po prostu chciałem wypełnić czas oczekiwania. Ku memu zaskoczeniu, wyniki były niemal identyczne z tym, co dał mi scenarzysta. To, szczerze mówiąc, mnie zadziwiło. Mogło to być przypadkiem, więc chciałem sprawdzić to ponownie z rzeczywistymi danymi — z moimi danymi osobistymi. Później zdałem sobie sprawę, że to była zła decyzja. Firma była w pośpiechu. *„Potrzebowaliśmy tej persony już wczoraj,”* powiedział założyciel. Byłem sceptyczny, że ta persona odnowi firmę. Poprosiłem o dodatkowe dwa dni na dokończenie mojej pracy. Większość czasu planowałem przeznaczyć na moje eksperymenty. Po zebraniu wszystkich moich danych osobowych — w tym czatów z Telegrama, transkrypcji połączeń głosowych, zdjęć z Google, dokumentów z Google Drive, wszystkiego jakoś związanego ze mną — patrzyłem na pasek postępu z łagodnym uśmiechem. Mój pies szczekał w tle, domagając się uwagi. Zignorowałem go, nie spuszczając oczu z ekranu. Łagodny uśmiech zniknął, gdy otrzymałem wyniki ekstrapolacji. > „Ty, Alex, zostaniesz zwolniony jutro,” przeczytałem na ekranie. To musiało być błędne. Powtarzam, nie jestem utalentowanym programistą i nie najlepszym — ale kiedy firma ma problem, proszą mnie o pomoc. Zrobiłem dla nich wiele. Jestem dla nich ważny. To było absurdalne. Absurdalne czy nie, tego dnia ukończyłem moje zadanie i wysłałem wyniki natychmiast po. Resztę dnia spędziłem w moim mieszkaniu w pięknej dzielnicy gdzieś w Warszawie — z lekko zielonawą twarzą. *"To jest absurdem,"* powtarzałem sobie w głowie. *„Słuchaj, Alex, lubię cię…”* — tak zaczęła się rozmowa z moim menedżerem następnego dnia. Wymienił, co zrobiłem dla nich, co robi firma, że muszą zmniejszyć wydatki, że naprawdę doceniają moją pracę — i wiele innych bzdurnych epitetów. *„Więc zdecydowaliśmy się na chwilową przerwę w twojej współpracy i skupienie się na przetrwaniu firmy.”* — tak to skończył. To nie było wcale zabawne. Zajęło mi trzy dni, aby to zaakceptować. Przynajmniej miałem dobre oszczędności — i to przerażające oprogramowanie. Po trzech dniach wpatrywania się w sufit wróciłem do oprogramowania. Co innego mogłem zrobić? Byłem bezrobotny, emocjonalnie zraniony i ciekawy. Otworzyłem interfejs ekstrapolacji i wpisałem: > “Co, jeśli rok temu nie wzięlibyśmy psa?” Wynik: W 99.9% wariantów — wciąż mieliśmy psa. Tylko później. Czasem to chart. Czasem mieszaniec. W jednym rzadkim przypadku mieliśmy kota. Kot uciekł po sześciu miesiącach. Następny test: > “Co, jeśli wygrałem na loterii?” Dobre wieści — wygrałem. Raz lub dwa razy w różnych liniach czasowych. A potem straciłem wszystko na nieruchomościach we Włoszech lub podejrzanych startupach kryptowalutowych. Nie wykryto szczęścia. A potem stałem się odważniejszy. Zadałem prawdziwe pytanie — to, na które zawsze chciałem znać odpowiedź: > “Co, jeśli wygrałem olimpiady programistyczne 15 lat temu?” Wynik: zmiana życia. Ogromna. Ta wersja mnie poszła na najlepszą uczelnię za granicą. Zawarła przyjaźnie — prawdziwe, z opiniami i gustem architektonicznym. Współzałożyła startup zajmujący się uczeniem maszynowym, zanim nawet nauczyłem się utrzymywać kontakt wzrokowy podczas rozmów kwalifikacyjnych. I co najdziwniejsze — wydawał się… szczęśliwy? Przewijałem jego logi życia. Pił koktajle w Palo Alto. Surfer. Przemawiał do inwestorów venture capital i był odrzucany. Potem przemawiał ponownie. Ostatecznie, poniósł porażkę z klasą. ![img.png](/blog/dog/polo.webp) Spotykał się z ludźmi, których nawet nie mogłem sobie wyobrazić istnienia. Czytał poezję. Nawet miał terapeutę. Ale najdziwniejsza część? Pod koniec swojej osi czasu, zostawił prywatną notatkę w systemie: > “Czasami zastanawiam się, jak wyglądałoby moje życie, gdybym został w Polsce. Może w małym mieszkaniu w Warszawie. Może spacerowałby z psem. Myślę, że to też by mi się podobało.” Wtedy zamknąłem laptopa. Nie dotykałem oprogramowania przez tydzień. Chodziłem na długie spacery. Słuchałem muzyki bez przeskakiwania co 30 sekund. Wszystkie linie czasowe, wszystkie wersje mnie, wszystkie symulacje — rozbrzmiewały w mojej głowie jak powtórki serialu, który już obejrzałem. Zdałem sobie sprawę, że drastyczne zmiany uczyniły mnie nierozpoznawalnym. To nie byłem ja — tylko projekcje. Gałęzie rosnące w każdym kierunku, ale z korzenia, którego ledwo pamiętałem, że zasadziłem. Otworzyłem aplikację po raz ostatni. Ostateczny znak zachęty: > “Co, jeśli nie będę więcej pytać?” System się zawiesił. Potem odpowiedział: > “Brak dostępnych projekcji.” Dobrze. Wyłączyłem laptopa i zarchiwizowałem logi. Pies wpatrywał się we mnie. Zazwyczaj robi to, gdy nadejdzie pora spaceru — o 15. I po raz pierwszy od tygodni nie chciałem być nigdzie indziej. ![img.png](/blog/dog/dog-park2.webp)
pt: Eu não sou um desenvolvedor de software talentoso. Não sou o mais rápido — e definitivamente não o melhor. Mas quando a empresa onde trabalho tem dificuldades com algo importante e urgente, eles pedem minha ajuda e me pagam bem. Não sei por quê. A empresa cria chatbots para entretenimento. Você conhece aqueles anúncios como “Vamos conversar com Albert Einstein” ou “Vamos bater papo com Marilyn Monroe.” Que eu acho bem estúpido — mas funciona. Bem, estava funcionando, para ser preciso. A empresa ficou presa. Sem ideias para novas funções, sem personagens interessantes. Qualquer um que quisesse tentar já o havia feito. A receita começou a declinar lentamente. O redator da equipe, que foi contratado para criar essas personas, não conseguia acompanhar, e a qualidade estava caindo. Nossa tarefa era melhorar isso — sem realmente saber como. Isso é tudo que você precisa saber sobre a administração do meu empregador e processos, ou a falta de processos, visão, plano, responsabilidades. Mas tudo bem. ![img.png](/blog/dog/monroe.webp) A ideia do escritor era criar uma pessoa famosa que tivesse tentado outra vida — assim, o usuário poderia conversar, por exemplo, com Donald Trump, que no meio da vida decidiu mudar de carreira e se tornar pintor. Talvez nosso escritor tenha se inspirado pelo desenho recentemente anunciado de Donald, supostamente enviado para Epstein. Mas enfim. O escritor me deu um rascunho de uma página sobre a vida de Donald após mudar de carreira. O que não era suficiente para criar uma boa persona de IA. Eu precisava de pelo menos 20 páginas de texto para preencher nosso repositório vetorial QDrant, para que o sistema IA RAG pudesse escolher livremente documentos bem incorporados para um processo de ajuste fino adequado. *Desculpe pelos termos de engenharia.* Após um dia de espera, decidi usar IA para gerar o que nosso escritor poderia ter escrito. Foi um ato de procrastinação. Eu só queria preencher o tempo de espera. Surpreendentemente, os resultados foram quase idênticos ao que o escritor me deu. Isso, para ser honesto, me deixou surpreso. Pode ter sido coincidência, então eu queria reavaliar isso com dados reais — com meus dados pessoais. Depois, percebi que foi a decisão errada. A empresa estava com pressa. *“Precisávamos dessa persona pronta ontem,”* disse o fundador. Eu era cético quanto a essa persona revitalizar a empresa. Pedi dois dias extras para terminar meu trabalho. A maior parte do tempo eu planejava alocar para meus experimentos. Depois de coletar todos os meus dados pessoais — incluindo conversas do Telegram, transcrições de chamadas de voz, Google Fotos, documentos no Google Drive, tudo de alguma forma relacionado a mim — fiquei olhando para a barra de progresso com um sorriso gentil. Meu cachorro latia ao fundo, exigindo atenção. Eu o ignorei, com os olhos fixos na tela. O sorriso desapareceu quando obtive o resultado da extrapolação. > “Você, Alex, será demitido amanhã,” a tela mostrou. Isso tinha que estar errado. Repito, não sou um desenvolvedor talentoso e não sou o melhor — mas quando a empresa tem dificuldades com algo, eles pedem minha ajuda. Fiz muito por eles. Sou importante para eles. Era ridículo. Ridículo ou não, naquele dia terminei minha tarefa e enviei os resultados imediatamente. O resto do dia passei no meu apartamento em um belo bairro em algum lugar de Varsóvia — com um rosto levemente esverdeado. *"Isso é ridículo,"* continuava ouvindo na minha cabeça. *“Escute, Alex, eu gosto de você…”* — foi assim que meu gerente começou a conversa no dia seguinte. Ele listou o que eu havia feito por eles, o que a empresa estava fazendo, que tinham que reduzir gastos, que realmente apreciavam meu trabalho — e muitos outros epítetos inúteis. *“Então decidimos pausar sua relação de trabalho por um tempo e focar na sobrevivência da empresa.”* — foi assim que ele terminou. Isso não teve graça nenhuma. Levei três dias para aceitar. Pelo menos eu tinha boas economias — e aquele software estranho. Depois de três dias olhando para o teto, voltei ao software. O que mais eu poderia fazer? Estava desempregado, emocionalmente abalado e curioso. Abri a interface de extrapolação e digitei: > “E se não tivéssemos adotado um cachorro um ano atrás?” Resultado: Em 99,9% das variações — ainda adotamos um cachorro. Apenas mais tarde. Às vezes é um whippet. Às vezes é um vira-lata. Em um caso raro, adotamos um gato. O gato fugiu em seis meses. Próximo teste: > “E se eu ganhasse na loteria?” Ótima notícia — ganhei. Uma ou duas vezes em diferentes linhas do tempo. E depois perdi tudo em imóveis na Itália ou startups de criptomoedas duvidosas. Nenhuma felicidade foi detectada. E então me tornei mais ousado. Perguntei a verdadeira questão — aquela que sempre quis saber a resposta: > “E se eu tivesse vencido as olimpíadas de programação há 15 anos?” Resultado: mudança de vida. Maciça. Essa versão de mim entrou em uma universidade de prestígio em outro país. Fez amigos — amigos de verdade, com opiniões e gosto por arquitetura. Co-fundou uma startup de aprendizado de máquina antes mesmo de eu aprender a manter contato visual em entrevistas. E o mais estranho de tudo — ele parecia... feliz? Passei pelas informações da sua vida. Ele bebia smoothies em Palo Alto. Surfava. Fazia apresentações a capitalistas de risco e era rejeitado. Depois apresentava de novo. Eventualmente, falhava com elegância. ![img.png](/blog/dog/polo.webp) Saía com pessoas que eu nem conseguia imaginar que existiam. Lia poesia. Inclusive tinha um terapeuta. Mas a parte mais estranha? Perto do final da sua linha do tempo, ele deixou um recado privado no sistema: > “Às vezes me pergunto como seria minha vida se eu tivesse ficado na Polônia. Talvez em um pequeno apartamento em Varsóvia. Talvez levando um cachorro para passear. Acho que também gostaria disso.” Foi aí que fechei o laptop. Não toquei no software por uma semana. Fiz longas caminhadas. Ouvi música sem pular a cada 30 segundos. Todas as linhas do tempo, todas as versões de mim, todas as simulações — ecoavam em minha cabeça como reprises de um show que já assisti. Percebi que as mudanças drásticas me tornaram irreconhecível. Elas não eram eu — apenas projeções. Ramos crescendo em todas as direções, mas de uma raiz que mal me lembrava de ter plantado. Abri o aplicativo uma última vez. Prompt final: > “E se eu não perguntar mais?” O sistema congelou. Em seguida, respondeu: > “Nenhuma projeção disponível.” Bom. Desliguei o laptop e arquivei os registros. O cachorro me encarou. Ele costuma fazer isso quando é hora de um passeio — às 15h. E pela primeira vez em semanas, eu não queria estar em nenhum outro lugar. ![img.png](/blog/dog/dog-park2.webp)
ru: Я не талантливый разработчик программного обеспечения. Я не самый быстрый — и уж точно не лучший. Но когда в компании, где я работаю, возникают проблемы с чем-то важным и срочным, именно ко мне обращаются за помощью и платят много. Понятия не имею, почему. Компания делает чат-ботов для развлечений. Знаете такие объявления: *«Давайте поговорим с Альбертом Эйнштейном»* или *«Поболтаем с Мэрилин Монро».* Мне это кажется довольно глупым — но работает. Точнее, работало. Компания зашла в тупик. Нет идей для новых функций, нет интересных персонажей. Все, кто хотел попробовать, уже попробовали. Доходы медленно падали. Писатель, которого наняли создавать персонажей, не справлялся, и качество работ ухудшалось. Наша задача была всё это улучшить — без малейшего понимания как. Этого достаточно, чтобы вы поняли, как устроено руководство компании: отсутствие процессов, видения, плана, ответственности. Но ладно. ![img.png](/blog/dog/monroe.webp) Идея писателя заключалась в создании известной личности, которая попробовала бы другую жизнь. Например, пользователь мог бы пообщаться с Дональдом Трампом, который в середине жизни решил сменить карьеру и стать художником. Возможно, писатель вдохновился недавно опубликованным рисунком Дональда, якобы отправленным Эпштейну. Так или иначе, он дал мне одностраничный черновик о жизни Дональда после смены карьеры. Этого было недостаточно, чтобы создать убедительного AI-персонажа. Мне нужно было как минимум 20 страниц текста, чтобы заполнить наше векторное хранилище QDrant, чтобы AI RAG-система могла выбирать качественно векторизованные документы для корректного дообучения. *Извините за инженерные термины.* После дня ожидания я решил использовать AI, чтобы сгенерировать текст в стиле, который мог бы написать наш писатель. Это было чистой прокрастинацией. Я просто хотел занять время. Удивительно, но результат оказался почти идентичен тому, что дал мне писатель. Честно говоря, это меня поразило. Может, совпадение. Я решил перепроверить на реальных данных — на своих личных. Позже понял, что это было неправильное решение. Компания торопила. *«Этот персонаж был нужен нам ещё вчера»,* — сказал основатель. Я сомневался, что этот персонаж спасёт компанию, и попросил ещё два дня, чтобы закончить работу. Большую часть времени я собирался посвятить экспериментам. Собрав все свои личные данные — включая чаты в Telegram, расшифровки звонков, Google Photos, документы Google Drive, всё, что так или иначе касалось меня, — я смотрел на полосу прогресса с лёгкой улыбкой. На фоне скулил мой пёс, требуя внимания. Я проигнорировал его, сосредоточившись на экране. Улыбка исчезла, когда я получил результат экстраполяции. > «Ты, Алекс, будешь уволен завтра», — высветилось на экране. Этого не могло быть. Повторюсь: я не талантливый разработчик и не лучший, но когда у компании проблемы — помощь просят у меня. Я сделал для них многое. Я важен для них. Это было нелепо. Нелепо или нет, в тот день я закончил задачу и сразу отправил результат. Остаток дня я провёл в своей квартире в красивом районе Варшавы — с немного позеленевшим лицом. *«Это нелепо»,* — повторял я про себя. *«Послушай, Алекс, ты мне нравишься…»* — так начал разговор на следующий день мой менеджер. Он перечислял, что я сделал для них, что происходит с компанией, что они должны сокращать расходы, что они ценят мою работу — и много другой ерунды. *«Поэтому мы решили приостановить наше сотрудничество на время и сосредоточиться на выживании компании.»* — так он закончил. Это вовсе не было смешно. Мне понадобилось три дня, чтобы смириться. По крайней мере, у меня были хорошие сбережения — и это жуткое программное обеспечение. Три дня я просто смотрел в потолок. Потом вернулся к программе. Что мне ещё оставалось? Я был безработным, эмоционально разбитым и любопытным. Я открыл интерфейс экстраполяции и напечатал: > «Что, если бы мы не завели собаку год назад?» Результат: в 99,9% вариантов мы всё равно завели собаку. Просто позже. Иногда это уиппет. Иногда дворняга. В одном редком случае — кот. Кот сбежал через полгода. Следующий тест: > «Что, если бы я выиграл в лотерею?» Отличные новости — я выиграл. Один, два, даже три раза в разных временных линиях. А потом всё потерял на недвижимости в Италии или в сомнительных криптостартапах. Счастья не обнаружено. Ни смены карьеры. В одной версии я купил яхту и врезался в норвежский утёс. И тогда я решился. Я задал настоящий вопрос — тот, что всегда хотел задать: > «Что, если бы я выиграл олимпиаду по программированию 15 лет назад?» Результат: жизнь изменилась. Радикально. Та версия меня поступила в топовый университет за границей. У него появились друзья — настоящие, со вкусами и мнением об архитектуре. Он основал стартап в области машинного обучения ещё до того, как я научился держать зрительный контакт на собеседованиях. И самое странное — он выглядел… счастливым? Я пролистывал его жизнь. Он пил смузи в Пало-Альто. Он занимался серфингом. Он предлагал идеи венчурным инвесторам и получал отказы. Потом предлагал снова. В итоге потерпел неудачу — но достойно. ![img.png](/blog/dog/polo.webp) Он встречался с людьми, о которых я и мечтать не мог. Читал стихи. У него даже был психотерапевт. Но самая странная часть? Под конец своей линии он оставил личную заметку в системе: > «Иногда думаю, какой была бы моя жизнь, если бы я остался в Польше. Может быть, в маленькой квартире в Варшаве. Может быть, гуляя с собакой. Думаю, мне бы это тоже понравилось.» Вот тогда я закрыл ноутбук. Неделю я к программе не прикасался. Гулял подолгу. Слушал музыку, не переключая трек каждые 30 секунд. Все временные линии, все версии меня, все симуляции — отзывались эхом в голове, словно повторы уже виденного шоу. Я понял: резкие перемены делали меня неузнаваемым. Это был не я — всего лишь проекции. Ветви, растущие во все стороны, но из корня, который я едва помнил, что сам когда-то посадил. Я открыл приложение в последний раз. Последний запрос: > «Что, если я больше не буду спрашивать?» Система застыла. Потом ответила: > «Проекций нет.» Хорошо. Я закрыл ноутбук и заархивировал логи. Собака смотрела на меня. Она всегда делает это, когда подходит время прогулки — в 3 часа дня. И впервые за долгое время я понял, что нахожусь на своём месте. ![img.png](/blog/dog/dog-park2.webp)
sv: Jag är ingen talangfull mjukvaruutvecklare. Jag är inte den snabbaste – och definitivt inte den bästa. Men när företaget där jag arbetar har problem med något viktigt och brådskande, ber de om min hjälp och betalar mig mycket. Ingen aning varför. Företaget tillverkar chatbotar för underhållning. Du känner till de där annonserna som *”Låt oss prata med Albert Einstein”* eller *”Låt oss chatta med Marilyn Monroe.”* Vilket jag tycker är ganska dumt – men det fungerar. Nåväl, det hade fungerat, för att vara exakt. Företaget fastnade. Inga idéer för nya funktioner, inga intressanta karaktärer. Vem än sommå ville prova det hade redan gjort det. Intäkterna minskade långsamt. Teamets författare, som anställdes för att skapa sådana personer, kunde inte hålla jämna steg, och kvaliteten sjönk. Vår uppgift var att förbättra det – utan någon egentlig idé hur. Det är allt du behöver veta om min arbetsgivares ledning och processer, eller bristen på processer, vision, plan, ansvar. Men okej. ![img.png](/blog/dog/monroe.webp) Författarens idé var att skapa en känd person som hade försökt ett annat liv – så användaren kunde prata, till exempel, med Donald Trump, som mitt i livet bestämde sig för att byta karriär och bli konstnär. Kanske inspirerades vår författare av Donalds nyligen annonserade teckning, påstått skickad till Epstein. Men hur som helst. Författaren gav mig en endssides utkast om Donalds liv efter hans karriärskifte. Vilket inte var tillräckligt för att skapa en bra AI-persona. Jag behövde åtminstone 20 sidor text för att fylla vår QDrant-vektorbutik, så att AI RAG-systemet fritt kunde välja välinbäddade dokument för en ordentlig finjusteringsprocess. *Ursäkta för ingenjörsterminologin.* Efter en dags väntan bestämde jag mig för att använda AI för att generera det som vår författare kanske hade skrivit. Det var en slags prokrastinering. Jag ville bara fylla väntetiden. Förvånansvärt nog var resultaten nästan identiska med vad författaren gav mig. Det, för att vara ärlig, förvånade mig. Det kan ha varit en slump, så jag ville kolla om med riktiga data – med mina egna personuppgifter. Senare insåg jag att det var fel beslut. Företaget hade bråttom. *”Vi behövde den här personan klar igår,”* sa grundaren. Jag var skeptisk till att denna persona skulle föryngra företaget. Jag bad om två extra dagar för att slutföra mitt arbete. Mest av tiden planerade jag att avsätta för mina experiment. Efter att ha samlat in alla mina personuppgifter – inklusive Telegramchattar, röstmeddelande-utskrifter, Google Fotos, Google Drive-dokument, allt på något sätt relaterat till mig – stirrade jag på förloppsindikatorn med ett milt leende. Min hund skällde i bakgrunden och krävde uppmärksamhet. Jag ignorerade honom, med ögonen fästa på skärmen. Det milda leendet försvann när jag fick extrapoleringsresultatet. > “Du, Alex, kommer bli avskedad imorgon,” stod det på skärmen. Det måste vara fel. Jag upprepar, jag är ingen talangfull utvecklare och inte den bästa – men när företaget har problem med något, ber de om min hjälp. Jag har gjort mycket för dem. Jag är viktig för dem. Det var löjligt. Löjligt eller inte, den dagen avslutade jag min uppgift och skickade resultaten omedelbart därefter. Resten av dagen tillbringade jag i min lägenhet i ett vackert område någonstans i Warszawa – med ett något grönaktigt ansikte. *"Det här är löjligt,"* hörde jag i mitt huvud. *“Lyssna, Alex, jag gillar dig…”* – det var så min chef började samtalet nästa dag. Han listade vad jag hade gjort för dem, vad företaget gjorde, att de var tvungna att minska kostnaderna, att de verkligen uppskattade mitt arbete – och många andra skitsnack epitet. *“Så vi har beslutat att pausa ditt arbetsförhållande ett tag och fokusera på företagets överlevnad.”* – det var så han avslutade. Det var inte alls roligt. Det tog mig tre dagar att acceptera det. Åtminstone hade jag ett bra sparande – och den kusliga mjukvaran. Efter tre dagars stirrande i taket återvände jag till mjukvaran. Vad skulle jag annars göra? Jag var arbetslös, emotionellt tilltufsad, och nyfiken. Jag öppnade extrapoleringsgränssnittet och skrev: > “Vad händer om vi inte skaffade hund för ett år sedan?” Resultat: I 99,9% av varianterna – vi skaffade ändå en hund. Bara senare. Ibland är det en whippet. Ibland är det en blandras. I ett sällsynt fall skaffade vi en katt. Katten rymde efter sex månader. Nästa test: > “Vad händer om jag vinner lotteriet?” Goda nyheter – jag gjorde det. En eller två gånger i olika tidslinjer. Och sen förlorade jag allt på fastigheter i Italien eller skumma kryptostartups. Ingen lycka påvisades. Och sen blev jag djärvare. Jag ställde den verkliga frågan – den jag alltid hade velat veta svaret på: > “Vad händer om jag vann programmeringsolympiaderna för 15 år sedan?” Resultat: livsförändring. Enorm. Den versionen av mig började på ett toppuniversitet i ett annat land. Han skaffade vänner – riktiga vänner, med åsikter och smak för arkitektur. Han var med och grundade en maskininlärnings-startup innan jag ens lärde mig att hålla ögonkontakt under intervjuer. Och det märkligaste av allt – han verkade… lycklig? Jag skrollade genom hans livsloggar. Han drack smoothies i Palo Alto. Han surfade. Han pitchade till riskkapitalister och blev nekad. Sen pitchade han igen. Till sist misslyckades han elegant. ![img.png](/blog/dog/polo.webp) Han dejtade människor jag inte ens kunde föreställa mig fanns. Han läste poesi. Han hade till och med en terapeut. Men det underligaste? I slutet av hans tidslinje lämnade han ett privat meddelande i systemet: > “Ibland undrar jag hur mitt liv skulle ha sett ut om jag stannat i Polen. Kanske i en liten lägenhet i Warszawa. Kanske promenader med en hund. Jag tror jag skulle ha tyckt om det också.” Det var då jag stängde laptopen. Jag rörde inte mjukvaran på en vecka. Jag gick på långa promenader. Lyssnade på musik utan att hoppa över var 30:e sekund. Alla tidslinjer, alla versioner av mig, alla simuleringar – de ekade i mitt huvud som repriser av en serie jag redan sett. Jag insåg att de drastiska förändringarna gjorde mig oigenkännlig. De var inte jag – bara projektioner. Grenar som växte i alla riktningar, men från en rot jag knappt mindes att jag planterat. Jag öppnade appen en sista gång. Slutlig uppmaning: > “Vad händer om jag inte frågar mer?” Systemet frös. Svarade sedan: > “Inga projektioner tillgängliga.” Bra. Jag stängde ner laptopen och arkiverade loggarna. Hunden stirrade på mig. Det brukar han göra när det är dags för en promenad – kl. 15. Och för första gången på veckor ville jag inte vara någon annanstans. ![img.png](/blog/dog/dog-park2.webp)
th: ฉันไม่ใช่นักพัฒนาซอฟต์แวร์ที่มีพรสวรรค์ ฉันไม่ใช่คนที่เร็วที่สุด — และแน่นอนไม่ใช่คนที่ดีที่สุด แต่เมื่อบริษัทที่ฉันทำงานอยู่มีปัญหาสำคัญและเร่งด่วน พวกเขาก็ขอความช่วยเหลือจากฉันและจ่ายเงินฉันมากมาย ไม่รู้ว่าทำไม บริษัทสร้างแชทบอทเพื่อความบันเทิง คุณรู้ไหม โฆษณาแบบ “มาคุยกับอัลเบิร์ต ไอน์สไตน์กันเถอะ” หรือ “มาคุยกับมาริลิน มอนโร” ซึ่งฉันคิดว่ามันค่อนข้างโง่ — แต่ก็ได้ผล ตามจริง มันเคยได้ผล บริษัทติดขัด ไม่มีไอเดียสำหรับคุณสมบัติใหม่ๆ ไม่มีตัวละครที่น่าสนใจ ใครก็ตามที่อยากลองใช้อยู่แล้ว รายได้ค่อยๆ หดตัว นักเขียนของทีม ที่ถูกจ้างมาเพื่อสร้างบุคลิกแบบนี้ ไม่สามารถทำได้ทันและคุณภาพก็ลดลง งานของเราคือการปรับปรุงมัน — โดยไม่มีไอเดียจริงๆ ว่าจะทำยังไง นั่นคือทั้งหมดที่คุณต้องรู้เกี่ยวกับการบริหารและกระบวนการของนายจ้างของฉัน หรือขาดกระบวนการ วิสัยทัศน์ แผน งานที่รับผิดชอบ แต่โอเค ![img.png](/blog/dog/monroe.webp) ไอเดียนักเขียนคือนำเสนอบุคคลที่มีชื่อเสียงที่ได้ลองใช้ชีวิตใหม่ — ดังนั้นผู้ใช้อาจได้พูดคุยกับโดนัลด์ ทรัมป์ ที่ในช่วงกลางชีวิตของเขาตัดสินใจเปลี่ยนอาชีพและกลายเป็นจิตรกร บางทีนักเขียนของเราอาจได้รับแรงบันดาลใจจากการวาดภาพที่โดนัลด์ประกาศเมื่อเร็วๆ นี้ ซึ่งคาดว่าถูกส่งให้เอปสตีน แต่ก็ไม่เป็นไร นักเขียนให้ร่างหนึ่งหน้าเกี่ยวกับชีวิตของโดนัลด์หลังจากการเปลี่ยนอาชีพของเขา ซึ่งไม่เพียงพอที่จะสร้างบุคลิก AI ที่ดี ฉันต้องการอย่างน้อย 20 หน้าของข้อความเพื่อเติมใน QDrant vector store ของเรา ดังนั้นระบบ AI RAG สามารถเลือกเอกสารที่ถูกฝังไว้อย่างเหมาะสมสำหรับกระบวนการฝึกปรับละเอียด *ขอโทษสำหรับคำทางวิศวกรรม* หลังจากรอหนึ่งวัน ฉันตัดสินใจใช้ AI สร้างสิ่งที่นักเขียนของเราอาจเขียนขึ้น มันเป็นการผลัดวันประกันพรุ่ง ฉันเพียงแค่ต้องการเติมเต็มเวลาที่รอ แปลกใจที่ผลลัพธ์เกือบจะเหมือนกับที่นักเขียนให้มา ซึ่งจะเป็นความบังเอิญก็ได้ จึงอยากตรวจซ้ำด้วยข้อมูลจริง — ข้อมูลส่วนตัวของฉันเอง ภายหลัง ฉันรู้ว่านั่นคือการตัดสินใจที่ผิด บริษัทเร่งด่วน *“เราต้องการบุคลิกนี้เสร็จตั้งแต่เมื่อวาน”* ผู้ก่อตั้งกล่าว ฉันไม่มั่นใจว่าบุคลิกนี้จะปรับปรุงบริษัทได้ ฉันขอเวลาสองวันเพิ่มเติมเพื่อทำงานให้เสร็จ ส่วนใหญ่ฉันวางแผนที่จะให้เวลากับการทดลองของฉัน หลังจากเก็บข้อมูลส่วนตัวทั้งหมด — รวมถึงแชทใน Telegram การถอดข้อความเสียง ประกาศใน Google Drive เอกสาร ทุกอย่างที่เกี่ยวข้องกับฉัน — ฉันจ้องมองแถบความคืบหน้าด้วยรอยยิ้มอ่อนโยน สุนัขของฉันเห่าในพื้นหลัง เรียกร้องความสนใจ ฉันเพิกเฉยต่อน้อง จ้องมองหน้าจออย่างตั้งใจ รอยยิ้มอ่อนโยนหายไปเมื่อฉันได้รับผลจากการคาดการณ์ > “พรุ่งนี้คุณจะถูกไล่ออก, อเล็กซ์” หน้าจอแสดง นั่นต้องผิด ฉันย้ำอีกครั้ง ฉันเป็นนักพัฒนาที่ไม่มีพรสวรรค์และไม่ใช่คนที่ดีที่สุด — แต่เมื่อบริษัทมีปัญหา พวกเขามักขอความช่วยเหลือจากฉัน ฉันทำมากมายเพื่อพวกเขา ฉันสำคัญสำหรับพวกเขา มันน่าขัน ถึงจะน่าขันยังไง วันนั้นฉันทำงานของฉันเสร็จและส่งผลลัพธ์ทันที วันตลอดที่เหลือฉันใช้ชีวิตในอพาร์ตเมนต์แห่งหนึ่งในย่านที่สวยงามในวอร์ซอว์ — ด้วยหน้าที่ดูเหลื่อมเป็นเขียว *"นี่มันน่าขัน,"* ฉันได้ยินในหัว *“ฟังสิ อเล็กซ์, ฉันชอบคุณ…”* — นั่นคือการเริ่มต้นการสนทนาของผู้จัดการของฉันในวันถัดไป เขาบอกเล่าว่าฉันทำสิ่งใดให้พวกเขาบ้าง ว่าบริษัทกำลังทำอะไร ว่าพวกเขาต้องลดค่าใช้จ่าย ว่าพวกเขาคิดสูงเกี่ยวกับงานของฉัน — และอื่น ๆ อีกที่พูด *“ดังนั้นเราตัดสินใจหยุดความสัมพันธ์การทำงานของคุณสักระยะ และมุ่งเน้นที่การอยู่รอดของบริษัท.”* — นั่นคือการจบคำพูด นั่นไม่ตลกเลย ใช้เวลาสามวันเพื่อยอมรับมัน ที่อย่างน้อยฉันมีเงินฝากดีๆ — และซอฟต์แวร์ที่น่ากลัวนั่น หลังจากสามวันที่จ้องเพดาน ฉันกลับมาหาซอฟต์แวร์ อะไรที่ฉันจะทำได้อีกล่ะ? ฉันว่างงานบาดเจ็บใจ และอยากรู้ ฉันเปิดอินเทอร์เฟซการคาดการณ์และพิมพ์: > “ถ้าเราไม่ได้เลี้ยงสุนัขเมื่อปีที่แล้ว?” ผลลัพธ์: ใน 99.9% ของความแปรปรวน — เรายังเลี้ยงสุนัขอยู่ดี แค่ช้าลงหน่อย บางครั้งก็เป็นหมาพันธุ์วิพเพ็ท บางครั้งก็เป็นพันธุ์ผสม ในหนึ่งกรณีที่หายาก เราเลี้ยงแมว แมวหนีไปในหกเดือน การทดลองต่อไป: > “ถ้าฉันถูกลอตเตอรี่?” ข่าวดี — ฉันเคยถูก ครั้งหรือสองครั้งในช่วงเวลาที่ต่างกัน และจากนั้นฉันก็สูญเสียทั้งหมดในอสังหาริมทรัพย์ในอิตาลีหรือคริปโตที่คลุมเครือ ไม่มีความสุขเลยแบบไหน และจากนั้นฉันกล้าหาญยิ่งขึ้น ฉันถามคำถามจริง — คำถามที่ฉันอยากรู้คำตอบมาตลอด: > “ถ้าฉันชนะโอลิมปิกการเขียนโปรแกรมเมื่อ 15 ปีที่แล้ว?” ผลลัพธ์: การเปลี่ยนแปลงชีวิต มหาศาล เวอร์ชันของฉันที่เข้าเรียนในมหาวิทยาลัยท็อปในอีกประเทศ เขามีเพื่อน — เพื่อนจริง, ที่มีความคิดเห็นและรสนิยมในการสถาปัตยกรรม เขาร่วมก่อตั้งสตาร์ทอัพเกี่ยวกับการเรียนรู้ของเครื่องก่อนที่ฉันจะเรียนรู้วิธีการมองตาในตาสัมภาษณ์ และที่แปลกที่สุด — เขาดูเหมือน… มีความสุข? ฉันเลื่อนผ่านบันทึกชีวิตของเขา เขาดื่มสมูทตี้ในพาโลอัลโต เขาฝึกท่องน้ำ เขาเสนอขายให้กับนักลงทุนนักเสี่ยง ที่ถูกรับข้อเสนอ จากนั้นเขาก็ล้มเหลวอย่างชิล ![img.png](/blog/dog/polo.webp) เขานัดจะพาคนที่ฉันคิดไม่ออกว่าจะมีอยู่จริง เขาอ่านบทกวี เขายังมีนักจิตวิทยา แต่สิ่งที่แปลกที่สุด? ใกล้สิ้นสุดเส้นเวลาของเขา มีโน้ตส่วนตัวอยู่ในระบบ: > “บางครั้งฉันสงสัยว่าชีวิตของฉันจะเป็นยังไงถ้าฉันยังอยู่ในโปแลนด์ บางทีในอพาร์ตเมนต์เล็กๆ ในวอร์ซอว์ บางทีเดินสุนัข ฉันคิดว่าฉันจะชอบแบบนั้นด้วย” นั่นคือตอนได้ปิดแล็ปท็อป ฉันไม่ได้แตะต้องซอฟต์แวร์เป็นเวลาหนึ่งสัปดาห์ ฉันเดินเล่นยาว ๆ ฟังเพลงโดยไม่ข้ามทุกๆ 30 วินาที ทุกเส้นเวลา ทุกเวอร์ชันของฉัน ทุกการจำลอง — พวกเขาก้องในหัวของฉันเหมือนลางบอกเรื่องซ้ำที่ฉันเคยดูแล้ว ฉันตระหนักว่าการเปลี่ยนแปลงที่กะทันหันทำให้ฉันไม่สามารถจดจำได้ ว่าพวกเขาไม่ใช่ฉัน — แค่เป็นการคาดการณ์ กิ่งไม้ที่ยืดออกไปทุกทิศทาง แต่จากรากที่ฉันแทบจำไม่ได้ว่าปลูกเมื่อไร ฉันเปิดแอปหนึ่งครั้งสุดท้าย คำท้าท้ายสุดท้าย: > “ถ้าฉันไม่ถามอีกล่ะ?” ระบบค้าง จากนั้นตอบกลับ: > “ไม่มีการคาดการณ์.” ดี ฉันปิดแล็ปท็อปและบันทึกเอกสารลงในที่เก็บถาวร สุนัขจ้องมาที่ฉัน เขามักจะทำแบบนั้นเมื่อถึงเวลาที่ต้องไปเดินเล่น — ตอน 3 โมงเย็น และเป็นครั้งแรกในหลายสัปดาห์ ฉันไม่อยากไปอยู่ที่ไหนอีกแล้ว ![img.png](/blog/dog/dog-park2.webp)
tr: Ben yetenekli bir yazılım geliştiricisi değilim. En hızlı olan da değilim — ve kesinlikle en iyi olan da değilim. Ama çalıştığım şirket bir konuda önemli ve acil bir sıkıntı yaşadığında, benden yardım istiyorlar ve bana çok para ödüyorlar. Nedenini hiç bilmiyorum. Şirket eğlence için chatbotlar üretiyor. Hani şu *“Albert Einstein ile konuşalım”* ya da *“Marilyn Monroe ile sohbet edelim”* gibi reklamlar var ya. Bunları oldukça saçma buluyorum — ama işe yarıyor. Yani, kesin olmak gerekirse, işe yarıyordu. Şirket sıkışmıştı. Yeni özellikler için fikir yoktu, ilginç karakterler yoktu. Denemek isteyen herkes zaten denemişti. Gelir yavaşça düşüyordu. Bu tür kişilikler oluşturmak için işe alınmış olan takımın yazarı yetişemiyordu ve kalite düşüyordu. Görevimiz bunu geliştirmekti — nasıl yapılacağı hakkında gerçek bir fikrimiz olmadan. Çalıştığım şirketin yönetimi ve süreçleri, yahut süreçlerin, vizyonun, planın ve sorumlulukların eksikliği hakkında bilmeniz gereken her şey bu. Ama tamam. ![img.png](/blog/dog/monroe.webp) Yazarın fikri, başka bir hayat deneyen ünlü bir kişi yaratmaktı — böylece kullanıcı, örneğin Donald Trump ile sohbet edebilirdi, hayatının ortasında kariyer değiştirip ressam olmaya karar veren biriyle. Belki de yazarımız, Donald'ın Epstein'e gönderildiği iddia edilen son açıklanan çiziminden ilham almıştı. Ne olursa olsun. Yazar, bana Donald'ın kariyer değişiminden sonraki hayatı hakkında bir sayfalık bir taslak verdi. Bu, iyi bir AI kişiliği oluşturmak için yeterli değildi. QDrant vektör depomuzu doldurmak ve AI RAG sisteminin uygun bir ince ayar süreci için iyi yerleştirilmiş belgeleri özgürce seçebilmesi adına en az 20 sayfa metne ihtiyacım vardı. *Mühendislik terimleri için üzgünüm.* Bir gün bekledikten sonra, yazarımızın yazmış olabileceğini AI ile oluşturmaya karar verdim. Bu bir oyalama eylemiydi. Sadece bekleme süresini doldurmak istedim. Şaşırtıcı bir şekilde, sonuçlar yazarın bana verdiğiyle neredeyse aynıydı. Bu, dürüst olmak gerekirse, beni şaşırttı. Bu bir tesadüf olabilirdi, bu yüzden gerçek verilerle — kendi kişisel verilerimle — tekrar kontrol etmek istedim. Daha sonra bunun yanlış bir karar olduğunu fark ettim. Şirket acele içindeydi. *“Bu kişiliğe dün ihtiyacımız vardı,”* dedi kurucu. Bu kişiliğin şirketi canlandıracağına şüpheyle bakıyordum. İşimi bitirmek için iki ekstra gün istedim. Zamanımın çoğunu deneylerime ayırmayı planladım. Tüm kişisel verilerimi — Telegram sohbetleri, sesli görüşme transkriptleri, Google Fotoğrafları, Google Drive belgelerini, bana bir şekilde ilgili her şeyi — topladıktan sonra, ilerleme çubuğuna nazik bir gülümsemeyle baktım. Köpeğim arkada havlıyordu, ilgi bekliyordu. Onu görmezden geldim, gözlerim ekrana sabitlenmişti. Nazik gülümsemem, çıkarım sonucunu alınca kayboldu. > “Alex, yarın kovulacaksın,” diye yazıyordu ekranda. Bu yanlış olmalıydı. Tekrar ediyorum, ben yetenekli bir geliştirici değilim ve en iyi olan değilim — ama şirket bir sorunla karşılaştığında, benden yardım istiyorlar. Onlar için çok şey yaptım. Onlar için önemliyim. Bu gülünçtü. Gülünç ya da değil, o gün görevimi bitirdim ve sonuçları hemen gönderdim. Günün geri kalanını Varşova'da bir yerlerde güzel bir mahalledeki dairemde geçirdim — hafifçe yeşilimsi bir yüzle. *"Bu saçmalık,"* diye duydum sürekli kafamda. *“Dinle Alex, seni seviyorum…”* — ertesi gün müdürümün konuşmaya böyle başlamıştı. Benim onlar için neler yaptığımı, şirketin ne yaptığını, harcamaları azaltmak zorunda olduklarını, çalışmamı gerçekten takdir ettiklerini — ve daha birçok saçma övgü sıfatlarını listeledi. *“Bu yüzden iş ilişkini bir süre durdurmaya ve şirketin hayatta kalmasına odaklanmaya karar verdik.”* — böyle bitirdi. Bu hiç de komik değildi. Kabullenmem üç günümü aldı. En azından iyi tasarruflarım vardı — ve o ürkütücü yazılım parçası. Üç gün boyunca tavana baktıktan sonra, yazılıma geri döndüm. Başka ne yapabilirdim ki? İşsizdim, duygusal olarak yıpranmıştım ve meraklıydım. Ekstrapolasyon arayüzünü açtım ve yazdım: > “Bir yıl önce köpek almazsak ne olurdu?” Sonuç: Varyasyonlarının %99.9'unda — yine de bir köpek alıyoruz. Sadece biraz daha geç. Bazen bir whippet oluyor. Bazen bir melez. Nadir durumlarda bir kedi alıyoruz. O kedi altı ay içinde kaçıyor. Sonraki test: > “Piyangoyu kazansam ne olurdu?” Harika haber — kazandım. Farklı zaman dilimlerinde bir kez ya da iki kez. Ve sonra İtalya'da gayrimenkule ya da gölgeli kripto girişimlerine harcayarak hepsini kaybettim. Mutluluk tespit edilmedi. Ve sonra daha cesur oldum. Gerçek soruyu sordum — her zaman cevabını bilmek istediğim soruyu: > “15 yıl önce programlama olimpiyatlarını kazansaydım ne olurdu?” Sonuç: hayat değişikliği. Büyük çapta. O versiyonum başka bir ülkede bir top üniversiteye girdi. Arkadaşlar edindi — görüşleri ve mimari zevki olan gerçek arkadaşlar. Bir makine öğrenimi girişimini birlikte kurdu ben daha mülakatlarda göz teması kurmayı nasıl öğrenemeden önce. Ve en tuhafı — mutlu görünüyordu? Hayat loglarını inceledim. Palo Alto'da smoothie içti. Sörf yaptı. Risk sermayedarlarına sunum yaptı ve reddedildi. Sonra tekrar sundu. Sonunda zarif şekilde başarısız oldu. ![img.png](/blog/dog/polo.webp) Hayal bile edemeyeceğim insanlarla çıktı. Şiir okudu. Terapisti bile vardı. Ama en garibi? Zaman çizelgesinin sonlarına doğru, sisteme özel bir not bıraktı: > “Bazen hayatımın Polonya'da kalsaydım nasıl olurdu diye merak ediyorum. Belki Varşova'da küçük bir dairede. Belki bir köpek gezdirerek. Bunu da seveceğimi düşünüyorum.” İşte o zaman bilgisayarı kapattım. Yazılıma bir hafta dokunmadım. Uzun yürüyüşlere çıktım. Her 30 saniyede bir atlamadan müzik dinledim. Tüm zaman çizelgeleri, tüm ben versiyonları, tüm simülasyonlar — kafamda zaten izlediğim bir şovun tekrarları gibi yankı yaptı. Farkettim ki, köklü değişiklikler beni tanınmaz hale getirdi. Onlar ben değillerdi — sadece projeksiyonlardı. Her yöne uzanan dallar, ama neredeyse hatırlamadığım bir kökten büyüyen. Son bir kez uygulamayı açtım. Son talep: > “Artık sormazsam ne olurdu?” Sistem dondu. Sonra cevap verdi: > “Projeksyon yok.” Güzel. Laptopu kapattım ve logları arşivledim. Köpek bana baktı. Bunu genelde 3:00'te yürüyüş zamanı geldiğinde yapar. Ve haftalar sonra ilk kez başka hiçbir yerde olmak istemedim. ![img.png](/blog/dog/dog-park2.webp)
uk: Я не талановитий розробник програмного забезпечення. Я не найшвидший — і, безумовно, не найкращий. Але коли компанія, в якій я працюю, стикається з чимось важливим та терміновим, вони звертаються за моєю допомогою і платять мені багато. Не маю уявлення чому. Компанія робить чат-ботів для розваг. Знаєте ці оголошення типу *“Поговорімо з Альбертом Ейнштейном”* або *“Давайте поспілкуємося з Мерілін Монро.”* Що я вважаю доволі дурненьким — але це працює. Ну, якщо бути точнішим, раніше це працювало. Компанія застрягла. Нема ідей для нових функцій, жодних цікавих персонажів. Хто хотів спробувати це, вже зробив це. Доходи повільно знижувалися. Письменник команди, якого найняли для створення таких персон, не встигав, і якість падала. Нашим завданням було це покращити — без реального уявлення як. Це все, що вам потрібно знати про управління та процеси моїх роботодавців, або їхню відсутність, бачення, план, відповідальність. Але гаразд. ![img.png](/blog/dog/monroe.webp) Ідея письменника полягала в створенні знаменитої особи, яка спробувала інше життя — так що користувач міг би поспілкуватися, наприклад, з Дональдом Трампом, який у середині свого життя вирішив змінити кар'єру і стати художником. Можливо, наш письменник надихнувся нещодавно оголошеним малюнком Дональда, можливо, надісланим Епштейну. Але так чи інакше. Письменник дав мені чернетку на одну сторінку про життя Дональда після зміни кар'єри. Чого було недостатньо, щоб створити хороший ІІ персонаж. Мені потрібно щонайменше 20 сторінок тексту, щоб заповнити наш QDrant векторний сховище, щоб система RAG могла вільно вибирати добре вбудовані документи для належного процесу тонкого налаштування. *Вибачте за інженерні терміни.* Після одного дня очікування я вирішив використовувати ІІ для генерації того, що міг написати наш письменник. Це був акт прокрастинації. Я просто хотів заповнити час очікування. Дивно, але результати були майже ідентичні тому, що дав мені письменник. Це, якщо бути чесним, мене здивувало. Це могло бути збігом, тому я хотів перевірити це на реальних даних — на моїх особистих даних. Пізніше я зрозумів, що це було неправильне рішення. Компанія поспішала. *“Нам потрібно було закінчити цю персону ще вчора,”* сказав засновник. Я був скептично налаштований, що ця персона оживить компанію. Я попросив два додаткові дні, щоб завершити мою роботу. Більшість часу я планував присвятити своїм експериментам. Зібравши всі свої особисті дані — включаючи чати в Telegram, транскрипції голосових дзвінків, фотографії Google, документи Google Drive, все, що якось пов'язане зі мною — я дивився на індикатор прогресу з доброзичливою посмішкою. Мій пес гавкав на задньому плані, потребуючи уваги. Я ігнорував його, зосереджено дивлячись на екран. Доброзичлива посмішка зникла, коли я дізнався результат екстраполяції. > “Тебе, Олексію, завтра звільнять,” — прочитав я на екрані. Це мало бути неправильно. Я повторюю, я не талановитий розробник, і не найкращий — але коли компанія стикається з чимось, вони звертаються за моєю допомогою. Я зробив багато для них. Я важливий для них. Це було безглуздо. Безглуздо чи ні, того дня я закінчив своє завдання і відправив результати негайно після. Решту дня я провів у своїй квартирі в прекрасному районі десь у Варшаві — з трохи зеленим обличчям. *"Це безглуздо,"* я продовжував чути в голові. *“Слухай, Олексію, ти мені подобаєшся…”* — саме так почав розмову мій менеджер наступного дня. Він перерахував, що я для них зробив, що робить компанія, що вони мають скоротити витрати, що вони дуже цінують мою роботу — і ще безліч бла-бла-бла епігетів. *“Тож ми вирішили призупинити твій трудовий відносини на деякий час і зосередитися на виживанні компанії.”* — ось так він закінчив. Це було зовсім не смішно. Мені знадобилося три дні, щоб прийняти це. Доброго у мене були добре накопичення — і це моторошне програмне забезпечення. Після трьох днів, проведених, дивлячись у стелю, я повернувся до програмного забезпечення. Що ще я міг зробити? Я був безробітним, емоційно зраненим і цікавим. Я відкрив інтерфейс екстраполяції і набрав: > “Що якщо ми не завели б собаку рік тому?” Результат: у 99.9% варіацій — ми все ж завели собаку. Просто пізніше. Інколи це хорт. Інколи це дворняжка. В одному рідкісному випадку ми мали кота. Кіт втік через шість місяців. Наступний тест: > “Що якщо я виграю в лотерею?” Добра новина — я дійсно це зробив. Одного або двічі в різних лініях часу. А потім я все втратив на нерухомості в Італії або на сумнівних крипто стартапах. Жодного щастя не виявлено. І потім я став хоробрішим. Я запитав реальне питання — те, на яке я завжди хотів знати відповідь: > “Що якщо я виграв би програми олімпіади 15 років тому?” Результат: зміна життя. Масивна. Ця версія мене вступила до топового університету в іншій країні. Він завів друзів — справжніх друзів, з точками зору та смаком до архітектури. Він заснував стартап машинного навчання, перш ніж я навіть навчився тримати контакт очима на співбесідах. І найдивніше з усього — він здавався… щасливим? Я прокрутив його життєві журнали. Він пив смузі у Пало-Альто. Він займався серфінгом. Він презентував венчурним капіталістам і його відкидали. Потім він презентував знову. Зрештою, він невдало, але з честю, провалився. ![img.png](/blog/dog/polo.webp) Він зустрічався з людьми, чиев існування я навіть не міг уявити. Він читав поезію. У нього навіть був терапевт. Але найхимерніше? Наприкінці його часової лінії він залишив приватну записку в системі: > “Іноді я думаю, яким би могло бути моє життя, якщо б я залишився в Польщі. Можливо в маленькій квартирі у Варшаві. Можливо, гуляючи з собакою. Думаю, це мені також би сподобалося.” Тоді я закрив ноутбук. Я не торкався програмного забезпечення тиждень. Я виходив на довгі прогулянки. Слухав музику, не пропускаючи кожні 30 секунд. Усі ці часові лінії, усі версії мене, всі симуляції — вони звучали в моїй голові, як повтори шоу, яке я вже переглянув. Я зрозумів, що кардинальні зміни зробили мене невпізнанним. Вони не були мною — всього лише проекціями. Гілки, що ростуть у всіх напрямках, але від коріння, яке я ледве пам’ятав, що сам посадив. Я відкрив програму залишній раз. Фінальний запит: > “Що якщо я більше не запитуватиму?” Система зависла. Потім відповіла: > “Жодних проекцій немає.” Добре. Я вимкнув ноутбук і заархівував журнали. Пес дивився на мене. Він зазвичай так робить, коли настав час на прогулянку — о 15:00. І вперше за кілька тижнів я не хотів бути ніде деінде. ![img.png](/blog/dog/dog-park2.webp)
vi: Tôi không phải là một lập trình viên tài năng. Tôi không phải là người nhanh nhất — và chắc chắn cũng không phải là tốt nhất. Nhưng khi công ty tôi làm việc gặp khó khăn với điều gì đó quan trọng và khẩn cấp, họ nhờ tôi giúp đỡ và trả cho tôi rất nhiều. Không biết tại sao. Công ty làm chatbot cho mục đích giải trí. Bạn biết đấy, những quảng cáo như "Hãy nói chuyện với Albert Einstein" hoặc "Hãy trò chuyện với Marilyn Monroe." Mà tôi thấy khá ngớ ngẩn — nhưng lại hiệu quả. À, nó đã từng hiệu quả, chính xác là vậy. Công ty đang bị kẹt. Không có ý tưởng cho tính năng mới, không còn nhân vật thú vị. Ai đã muốn thử thì đã thử rồi. Doanh thu dần giảm. Nhà văn của đội, người được thuê để tạo ra những nhân vật như vậy, không theo kịp, và chất lượng đang giảm sút. Nhiệm vụ của chúng tôi là cải thiện nó — mà không có ý tưởng thực sự nào. Đó là tất cả những gì bạn cần biết về quản lý và quy trình của nhà tuyển dụng của tôi, hoặc sự thiếu quản lý, tầm nhìn, kế hoạch, trách nhiệm. Nhưng được rồi. ![img.png](/blog/dog/monroe.webp) Ý tưởng của nhà văn là tạo ra một nhân vật nổi tiếng đã trải qua một cuộc sống khác — để người dùng có thể nói chuyện, ví dụ, với Donald Trump, người mà giữa cuộc đời đã quyết định chuyển nghề và trở thành họa sĩ. Có thể nhà văn của chúng tôi đã lấy cảm hứng từ bức tranh mà Donald gần đây thông báo, được cho là đã gửi cho Epstein. Nhưng dù sao đi nữa. Nhà văn đã đưa tôi một bản thảo một trang về cuộc sống của Donald sau khi chuyển đổi nghề nghiệp. Điều đó không đủ để tạo ra một nhân vật AI tốt. Tôi cần ít nhất 20 trang văn bản để lấp đầy kho lưu trữ vector QDrant của mình, để hệ thống RAG AI có thể chọn lựa các tài liệu đã được nhúng tốt cho quy trình tinh chỉnh đúng cách. *Xin lỗi vì các thuật ngữ kỹ thuật.* Sau một ngày chờ đợi, tôi quyết định sử dụng AI để tạo ra những gì nhà văn của chúng tôi có thể đã viết. Đó là một hành động trì hoãn. Tôi chỉ muốn lấp đầy thời gian chờ. Đáng ngạc nhiên là, kết quả gần như giống hệt với những gì nhà văn đã đưa cho tôi. Điều đó, thành thật mà nói, làm tôi kinh ngạc. Có thể đó là một sự trùng hợp, nên tôi muốn kiểm tra lại với dữ liệu thực tế — với dữ liệu cá nhân của mình. Sau đó, tôi nhận ra đó là quyết định sai lầm. Công ty đang trong tình trạng gấp rút. *"Chúng tôi cần nhân vật này hoàn thành từ hôm qua,"* người sáng lập nói. Tôi hoài nghi rằng nhân vật này sẽ làm mới công ty. Tôi đã yêu cầu thêm hai ngày để hoàn thành công việc của mình. Phần lớn thời gian tôi dự định dành cho các thí nghiệm của mình. Sau khi thu thập tất cả dữ liệu cá nhân của mình — bao gồm các cuộc trò chuyện trên Telegram, bản ghi cuộc gọi thoại, ảnh Google Photos, tài liệu trên Google Drive, tất cả những thứ có liên quan đến tôi — tôi nhìn chằm chằm vào thanh tiến trình với một nụ cười nhẹ. Chú chó của tôi sủa ở nền phía sau, đòi được chú ý. Tôi lờ đi, mắt dán vào màn hình. Nụ cười nhẹ biến mất khi tôi nhận được kết quả suy luận. > "Bạn, Alex, sẽ bị sa thải vào ngày mai," dòng chữ hiện lên trên màn hình. Điều đó phải sai. Tôi nhắc lại, tôi không phải là một nhà phát triển tài năng và không phải là người giỏi nhất — nhưng khi công ty gặp khó khăn với điều gì đó, họ nhờ tôi giúp. Tôi đã làm rất nhiều cho họ. Tôi quan trọng với họ. Thật vô lý. Vô lý hay không, ngày đó tôi đã hoàn thành nhiệm vụ của mình và gửi kết quả ngay sau đó. Phần còn lại trong ngày tôi dành ở căn hộ của mình trong một khu phố tuyệt đẹp nào đó ở Warsaw — với khuôn mặt hơi xanh xao. *"Thật vô lý,"* tôi cứ nghe thấy trong đầu. *"Nghe này, Alex, tôi thích bạn..."* — đó là cách mà quản lý của tôi bắt đầu cuộc trò chuyện ngày hôm sau. Ông ấy liệt kê những gì tôi đã làm cho họ, những gì công ty đang làm, rằng họ phải cắt giảm chi tiêu, rằng họ thực sự đánh giá cao công việc của tôi — և nhiều lời tâng bốc không thật khác. *"Vì vậy, chúng tôi đã quyết định tạm dừng quan hệ làm việc của bạn một thời gian và tập trung vào sự tồn tại của công ty."* — đó là cách ông ấy kết thúc. Điều đó hoàn toàn không hài hước. Tôi mất ba ngày để chấp nhận điều đó. Ít nhất tôi có khoản tiết kiệm tốt — và mảnh phần mềm đáng sợ đó. Sau ba ngày nhìn lên trần nhà, tôi quay lại phần mềm. Tôi có thể làm gì khác? Tôi thất nghiệp, bị tổn thương tinh thần, và tò mò. Tôi mở giao diện suy luận và gõ: > "Điều gì sẽ xảy ra nếu chúng ta không nuôi một chú chó cách đây một năm?" Kết quả: Trong 99.9% biến thể — chúng ta vẫn nuôi một chú chó. Chỉ là sau này. Thỉnh thoảng nó là một con chó săn. Thỉnh thoảng nó là một con chó con lai. Trong một trường hợp hiếm hoi, chúng ta có một con mèo. Con mèo đã chạy đi sau sáu tháng. Bài kiểm tra tiếp theo: > "Điều gì sẽ xảy ra nếu tôi trúng xổ số?" Tin tuyệt vời — tôi đã làm. Một hoặc hai lần trong các dòng thời gian khác nhau. Và sau đó tôi mất tất cả vào bất động sản ở Ý hoặc các dự án khởi nghiệp tiền điện tử đáng ngờ. Không phát hiện thấy hạnh phúc nào. Và rồi tôi trở nên táo bạo hơn. Tôi đã hỏi câu hỏi thực sự — câu hỏi mà tôi luôn muốn biết câu trả lời: > "Điều gì sẽ xảy ra nếu tôi vô địch olympiads lập trình 15 năm trước?" Kết quả: Thay đổi cuộc sống. Rất lớn. Phiên bản đó của tôi vào học một trường đại học hàng đầu ở một đất nước khác. Anh ấy có những người bạn — những người bạn thực sự, với những ý kiến và sở thích về kiến trúc. Anh ấy đồng sáng lập một công ty khởi nghiệp về học máy trước khi tôi thậm chí học cách giao tiếp bằng mắt trong các cuộc phỏng vấn. Và kỳ lạ nhất — anh ấy dường như… hạnh phúc? Tôi cuộn qua nhật ký cuộc sống của anh ấy. Anh ấy uống sinh tố ở Palo Alto. Anh ấy đi lướt sóng. Anh ta thuyết trình với nhà đầu tư mạo hiểm và bị từ chối. Rồi anh ta lại thuyết trình. Cuối cùng, anh ta thất bại một cách trang nhã. ![img.png](/blog/dog/polo.webp) Anh ấy hẹn hò với những người mà tôi thậm chí không thể tưởng tượng là tồn tại. Anh ấy đọc thơ. Anh ấy thậm chí có một nhà trị liệu. Nhưng phần kỳ lạ nhất? Gần cuối dòng thời gian của anh ấy, anh ấy để lại một ghi chú riêng tư trong hệ thống: > "Đôi khi tôi tự hỏi cuộc sống của tôi sẽ như thế nào nếu tôi ở lại Ba Lan. Có thể trong một căn hộ nhỏ ở Warsaw. Có thể đang đi bộ với chú chó. Tôi nghĩ tôi cũng sẽ thích điều đó." Đó là khi tôi đóng laptop lại. Tôi không động vào phần mềm trong một tuần. Tôi đi bộ dài. Nghe nhạc mà không bỏ qua mỗi 30 giây. Tất cả các dòng thời gian, tất cả các phiên bản của tôi, tất cả các mô phỏng — chúng vang lên trong đầu tôi như những lần chiếu lại của một chương trình tôi đã từng xem rồi. Tôi nhận ra rằng các thay đổi to lớn khiến tôi không thể nhận ra. Chúng không phải là tôi — chỉ là những sự hình dung. Những nhánh mọc ra theo mọi hướng, nhưng từ một gốc mà tôi hiếm khi nhớ đã trồng. Tôi mở ứng dụng một lần cuối. Lời nhắc cuối cùng: > "Điều gì nếu tôi không hỏi nữa?" Hệ thống bị treo. Sau đó phản hồi: > "Không có dự báo nào khả dụng." Tốt. Tôi tắt máy tính xách tay và lưu trữ nhật ký. Con chó nhìn tôi chằm chằm. Nó thường làm vậy khi đến giờ đi dạo — vào lúc 3 giờ chiều. Và lần đầu tiên sau nhiều tuần, tôi không muốn ở bất cứ nơi nào khác. ![img.png](/blog/dog/dog-park2.webp)
