Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Mental Health Talk
ar: الحديث عن الصحة العقلية
be: Гутарак пра псіхічнае здароўе
da: Mental Health Talk Mental Sundhed Snak
de: Gespräch über die psychische Gesundheit
es: Charla sobre Salud Mental
fr: Discussion sur la Santé Mentale
id: Pembicaraan Kesehatan Mental
it: Conversazione sulla Salute Mentale
ja: メンタルヘルス・トーク
ms: Percakapan tentang Kesihatan Mental
no: Mental Helse Prat
pl: Rozmowa o zdrowiu psychicznym
pt: Conversa sobre Saúde Mental
ru: Разговор о психическом здоровье
sv: Mental Health Talk Mentalt Hälsosamtal
th: การสนทนาเรื่องสุขภาพจิต
tr: Ruh Sağlığı Sohbeti
uk: Розмова про психічне здоров'я
vi: Cuộc trò chuyện về Sức khỏe Tâm thần

source: Mental Health Vocabulary
ar: مفردات الصحة العقلية
be: Слоўнік па псіхічнаму здароўі
da: Mental Sundhed Vokabular
de: Wortschatz für psychische Gesundheit
es: Vocabulario de Salud Mental
fr: Vocabulaire de la Santé Mentale
id: Kosakata Kesehatan Mental
it: Vocabolario sulla Salute Mentale
ja: メンタルヘルスの語彙
ms: Kosa Kata Kesihatan Mental
no: Mental Helse Vokabular
pl: Słownictwo z zakresu zdrowia psychicznego
pt: Vocabulário de Saúde Mental
ru: Словарь психического здоровья
sv: Mental Hälsa Ordförråd
th: คำศัพท์เกี่ยวกับสุขภาพจิต
tr: Ruh Sağlığı Sözlüğü
uk: Словник з питань психічного здоров'я
vi: Từ vựng về Sức khỏe Tâm thần

source: Mention key projects or achievements
ar: اذكر المشاريع أو الإنجازات الرئيسية
be: Згадайце ключавыя праекты або дасягненні
da: Nævn nøgleprojekter eller præstationer
de: Erwähnen Sie wichtige Projekte oder Errungenschaften
es: Mencione proyectos clave o logros destacados
fr: Mentionnez les projets clés ou les réalisations
id: Sebutkan proyek atau pencapaian penting
it: Menziona progetti o risultati chiave
ja: 重要なプロジェクトまたは業績を挙げてください
ms: Sebutkan projek utama atau pencapaian
no: Nevn nøkkelprosjekter eller prestasjoner
pl: Wymień kluczowe projekty lub osiągnięcia
pt: Mencione projetos ou realizações importantes
ru: Укажите ключевые проекты или достижения
sv: Nämn nyckelprojekt eller prestationer
th: ระบุโครงการสำคัญหรือความสำเร็จ
tr: Önemli projeleri veya başarıları belirtin
uk: Вкажіть ключові проекти або досягнення
vi: Đề cập đến các dự án chính hoặc thành tựu

source: Mention re-render behavior briefly
ar: اذكر سلوك إعادة العرض بإيجاز
be: Упамяніце паводзіны па перамалёўцы коратка
da: Nævn opdateringsadfærd kortfattet
de: Erwähnen Sie das Neurender-Verhalten kurz.
es: Mencionar el comportamiento de re-renderizado brevemente
fr: Mentionnez brièvement le comportement de re-rendering
id: Sebutkan perilaku render ulang secara singkat
it: Meniona brevemente il comportamento di ri-renderizzazione
ja: 再レンダリングの動作を簡単に述べる
no: Nevn oppdateringsatferden kortfattet
pl: Wspomnij krótko o zachowaniu ponownego renderowania
pt: Mencione brevemente o comportamento de re-renderização
ru: Упомяните о поведении повторного рендеринга вкратце
sv: Nämn omrenderingsbeteende kortfattat
th: กล่าวถึงพฤติกรรมการเรนเดอร์ใหม่อย่างย่อ
tr: Yeniden render etme davranışını kısaca belirtin
uk: Згадайте про поведінку повторного рендерингу коротко
vi: Đề cập ngắn gọn về hành vi vẽ lại.

source: Mention scalability and maintainability
ar: اذكر قابلية التوسع وقابلية الصيانة
be: Згадайце маштабаванасць і падтрымку
da: Nævn skalerbarhed og vedligeholdelsesevne
de: Erwähnen Sie Skalierbarkeit und Wartbarkeit
es: Mencionar escalabilidad y mantenibilidad
fr: Mentionnez l'évolutivité et la maintenabilité
id: Sebutkan skalabilitas dan kemudahan pemeliharaan
it: Menzionare scalabilità e manutenibilità
ja: スケーラビリティとメンテナビリティについて言及してください
ms: Sebutkan kebolehskalaan dan kebolehselenggaraan
no: Nevn skalerbarhet og vedlikeholdbarhet
pl: Wspomnij o skalowalności i łatwości utrzymania
pt: Mencione escalabilidade e manutenibilidade
ru: Упомяните масштабируемость и поддерживаемость
sv: Nämn skalbarhet och underhållbarhet
th: กล่าวถึงความสามารถในการขยายและการดูแลรักษา
tr: Ölçeklenebilirlik ve sürdürülebilirlikten bahsedin
uk: Згадати масштабованість та підтримуваність
vi: Đề cập đến khả năng mở rộng và khả năng bảo trì

source: Mention tools you used (console, DevTools, logs)
ar: اذكر الأدوات التي استخدمتها (وحدة التحكم، أدوات التطوير، السجلات)
be: Узгадайце інструменты, якія вы выкарыстоўвалі (кансоль, DevTools, лагі)
da: Nævn værktøjer, du brugte (konsol, DevTools, logs)
de: Nennen Sie die verwendeten Tools (Konsole, DevTools, Logs)
es: Menciona las herramientas que utilizaste (consola, DevTools, registros)
fr: Mentionner les outils que vous avez utilisés (console, DevTools, journaux)
id: Sebutkan alat-alat yang Anda gunakan (konsol, DevTools, log)
it: Meniona gli strumenti utilizzati (console, DevTools, log)
ja: 使用したツールを述べてください（コンソール、DevTools、ログ）
no: Nevn verktøyene du brukte (konsoll, DevTools, logger)
pl: Wspomnij narzędzia, których użyłeś (konsola, DevTools, logi)
pt: Mencione ferramentas que você usou (console, DevTools, logs)
ru: Укажите инструменты, которые вы использовали (консоль, DevTools, логи)
sv: Ange verktyg du använde (konsol, DevTools, loggar)
th: ระบุเครื่องมือที่คุณใช้ (คอนโซล, DevTools, บันทึก)
tr: Kullandığınız araçları belirtin (konsol, DevTools, günlükler)
uk: Згадайте інструменти, які ви використовували (консоль, DevTools, логи)
vi: Đề cập các công cụ bạn đã sử dụng (bảng điều khiển, Công cụ dành cho nhà phát triển, nhật ký)

source: Mention your tech stack (React/JS/HTML/CSS)
ar: اذكر تقنيتك المستخدمة (React/JS/HTML/CSS)
be: Згадайце ваш тэхналагічны стэк (React/JS/HTML/CSS)
da: Nævn din teknologiske stak (React/JS/HTML/CSS)
de: Erwähnen Sie Ihren Tech-Stack (React/JS/HTML/CSS)
es: Menciona tu pila tecnológica (React/JS/HTML/CSS)
fr: Mentionnez votre pile technologique (React/JS/HTML/CSS)
id: Sebutkan tumpukan teknologi Anda (React/JS/HTML/CSS)
it: Menziona il tuo stack tecnologico (React/JS/HTML/CSS)
ja: あなたの技術スタックを記載してください (React/JS/HTML/CSS)
no: Nevn din teknologistabel (React/JS/HTML/CSS)
pl: Wspomnij o swoim stosie technologicznym (React/JS/HTML/CSS)
pt: Mencione sua stack de tecnologia (React/JS/HTML/CSS)
ru: Укажите ваш технологический стек (React/JS/HTML/CSS)
sv: Ange din tekniska stack (React/JS/HTML/CSS)
th: ระบุเทคโนโลยีที่คุณใช้ (React/JS/HTML/CSS)
tr: Teknoloji yığınınızı belirtin (React/JS/HTML/CSS)
uk: Зазначте ваш технологічний стек (React/JS/HTML/CSS)
vi: Đề cập đến công nghệ bạn sử dụng (React/JS/HTML/CSS)

source: Micro-frontends
ar: واجهات مصغرة
be: Мікра-фронтэнды
da: Mikro-frontends
de: Mikro-Frontends
fr: Micro-frontend
id: Mikro-antarmuka depan
it: Micro-frontend
ja: マイクロフロントエンド
ms: Mikro-frontend
no: Mikro-frontends
pl: Mikro-frontendy
ru: Micro-frontendы
sv: Mikro-frontender
th: ไมโครฟรอนต์เอนด์
tr: Mikro-ön uçlar
uk: Мікро-фронтенди

source: Microphone Access
ar: إمكانية الوصول إلى الميكروفون
be: Доступ да мікрафона
da: Microfontilgang
de: Mikrofonzugriff
es: Acceso al micrófono
fr: Accès au microphone
id: Akses Mikrofon
it: Accesso al Microfono
ja: マイクアクセス
ms: Akses Mikrofon
no: Mikrofon Tilgang
pl: Dostęp do mikrofonu
pt: Acesso ao Microfone
ru: Доступ к микрофону
sv: Mikrofonåtkomst
th: การเข้าถึงไมโครโฟน
tr: Mikrofon Erişimi
uk: Доступ до мікрофона
vi: Quyền truy cập Microphone

source: Microphone access denied. Please enable it in your browser settings.
es: El acceso al micrófono ha sido denegado. Por favor, actívelo en la configuración de su navegador.
id: Akses mikrofon ditolak. Silakan aktifkan di pengaturan browser Anda.
it: Accesso al microfono negato. Si prega di abilitarlo nelle impostazioni del browser.
ja: マイクへのアクセスが拒否されました。ブラウザの設定で有効にしてください。
no: Mikrofontilgang avvist. Vennligst aktiver det i nettleserens innstillinger.
pl: Dostęp do mikrofonu został odrzucony. Proszę włączyć go w ustawieniach przeglądarki.
pt: Acesso ao microfone negado. Por favor, ative-o nas configurações do seu navegador.
ru: Доступ к микрофону запрещен. Пожалуйста, включите его в настройках вашего браузера.
sv: Mikrofonåtkomst nekad. Vänligen aktivera det i dina webbläsarinställningar.
uk: Доступ до мікрофона відхилено. Будь ласка, увімкніть його в налаштуваннях вашого браузера.

source: Microphone Setup
es: Configuración del Micrófono
id: Pengaturan Mikrofon
it: Configurazione del Microfono
ja: マイクのセットアップ
no: Mikrofonoppsett
pl: Konfiguracja mikrofonu
pt: Configuração do Microfone
ru: Настройка микрофона
sv: Mikrofoninställningar
uk: Налаштування мікрофона

source: Minutes
ar: دقائق
be: Хвіліны
da: Minutter
de: Minuten
es: Minutos
id: Menit
it: Minuti
ja: 分
ms: Minit
no: Minutter
pl: Minuty
pt: Minutos
ru: Минуты
sv: Minuter
th: นาที
tr: Dakikalar
uk: Хвилини
vi: Phút

source: Mission complete
ar: تم إكمال المهمة
be: Місія выканана
da: Mission fuldført
de: Mission abgeschlossen
es: Misión completa
fr: Mission accomplie
id: Misi selesai
it: Missione completata
ja: ミッション完了
ms: Misi selesai
no: Oppdrag fullført
pl: Misja zakończona
pt: Missão concluída
ru: Миссия выполнена
sv: Uppdrag slutfört
th: ภารกิจเสร็จสิ้น
tr: Görev tamamlandı
uk: Місію виконано
vi: Nhiệm vụ hoàn thành

source: Mock
ar: مسخرة
be: Макет
de: Spott
es: Simulacro
fr: Simulation
id: Tiruan
ja: モック
ms: Tiruan
no: Hån
pl: Makieta
pt: Simulação
ru: Макет
sv: Härmning
th: ม็อก
tr: Alay
uk: Макет
vi: Chế nhạo

source: Mock Frontend Interviews with AI to Get Offers
ar: Mock Frontend Interviews with AI to Get Offers مقابلات واجهة المستخدم الوهمية مع الذكاء الاصطناعي للحصول على عروض
be: Макетныя інтэрв'ю па фронтэнду з ІІ каб атрымаць прапановы
da: Mock Frontend-interviews med AI til at få tilbud
de: Schein-Fronend-Interviews mit KI, um Angebote zu erhalten
es: Mock Frontend Entrevistas con IA para Obtener Ofertas
fr: Entrevues Front-end Simulées avec l'IA pour Obtenir des Offres
id: Mock Wawancara Frontend dengan AI untuk Mendapatkan Tawaran
it: Simula i colloqui frontend con l'IA per ottenere offerte
ja: AIで模擬フロントエンド面接をしてオファーを勝ち取ろう
no: Mock Frontend Intervjuer med AI for å Få Tilbud
pl: Symulacyjne Rozmowy Kwalifikacyjne z AI, aby Otrzymać Oferty
pt: Entrevistas simuladas de Frontend com IA para conseguir ofertas
ru: Макет фронтальных интервью с ИИ, чтобы получить предложения
sv: Mockintervjuer på frontend med AI för att få erbjudanden
th: สัมภาษณ์งานด้านส่วนหน้าเสมือนจริงกับ AI เพื่อรับข้อเสนอ
tr: AI ile Taklit Ön Uç Görüşmeleri Yaparak Teklifler Alın
uk: Макетні інтерв'ю фронтенд-розробників з ШІ для отримання пропозицій
vi: Mô phỏng Phỏng vấn Frontend với AI để Nhận Lời mời làm việc

source: Mock Frontend Interviews with AI to Get Senior-Level Offers
ar: التدرب على مقابلات الواجهة الأمامية الوهمية مع الذكاء الاصطناعي للحصول على عروض على مستوى كبار المهندسين
be: Макетныя інтэрв'ю для франтэнд-распрацоўшчыкаў з AI для атрыманя прапаноў на старэйшы ўзровень
da: Mock Frontend Interviews with AI to Get Senior-Level Offers -> Simulerede frontend-interviews med AI for at få tilbud på seniorniveau
de: Front-End-Interviews mit KI simulieren, um Angebote auf Senior-Ebene zu erhalten
es: Simulaciones de Entrevistas de Frontend con IA para Obtener Ofertas de Nivel Senior
fr: Simulations d'entretiens Frontend avec l'IA pour obtenir des offres de niveau senior
id: Mock Wawancara Frontend dengan AI untuk Mendapatkan Tawaran Tingkat Senior
it: Colloqui Frontend Simulati con l'IA per Ottenere Offerte di Livello Senior
ja: AIを活用した模擬フロントエンドインタビューでシニアレベルのオファーを獲得する
ms: Temu Duga Frontend Tiruan dengan AI untuk Mendapatkan Tawaran Peringkat Kanan
no: Mock Frontend-intervjuer med AI for å få tilbud på seniornivå
pl: Mock Interviews for Frontend Developer Positions with AI to Secure Senior-Level Offers
pt: Realize Entrevistas de Frontend Simuladas com IA para Obter Ofertas de Nível Sênior
ru: Моделируйте интервью по фронтенду с ИИ, чтобы получить предложения на уровне старшего специалиста
sv: Mock-intervjuer för frontend med AI för att få erbjudanden på seniornivå
th: สัมภาษณ์หน้าฟรอนต์เอนด์จำลองกับ AI เพื่อให้ได้ข้อเสนอในระดับอาวุโส
tr: AI ile Kıdemli Düzey Teklifleri Almak için Mock Frontend Mülakatları
uk: Імітаційні співбесіди з фронтенду з AI для отримання вакансій на рівні старшого спеціаліста
vi: Phỏng Vấn Frontend Giả Lập với AI để Nhận Được Các Đề Nghị Cấp Cao Cấp

source: Mock Frontend Interviews with AI to Land Your First Dev Job
ar: نماذج لمقابلات الواجهة الأمامية مع الذكاء الاصطناعي للحصول على أول وظيفة تطوير لك
be: Мадэльныя інтэрв'ю з ІІ для атрымання першай працы распрацоўніка
da: Mock Frontend Interviews med AI for at lande dit første udviklerjob
de: Mock-Frontend-Interviews mit KI, um Ihren ersten Entwicklerjob zu landen
es: Simulacros de Entrevistas de Frontend con IA para Conseguir Tu Primer Trabajo como Desarrollador
fr: Simulez des entretiens Frontend avec l'IA pour obtenir votre premier emploi de développeur
id: Mock Wawancara Frontend dengan AI untuk Mendapatkan Pekerjaan Dev Pertama Anda
it: Simula Colloqui Frontend con l'Intelligenza Artificiale per Ottenere il Tuo Primo Lavoro da Sviluppatore
ja: AIを使った模擬フロントエンド面接で、初めての開発職を勝ち取ろう
no: Mock Frontend-intervjuer med AI for å lande din første utviklerjobb
pl: Symuluj rozmowy kwalifikacyjne na frontend z AI, aby znaleźć swoją pierwszą pracę jako deweloper
pt: Mock Frontend Interviews with AI to Land Your First Dev Job Entrevistas Simuladas de Frontend com IA para Conseguir seu Primeiro Emprego como Desenvolvedor
ru: Моделируйте фронтенд-интервью с AI, чтобы получить свою первую работу разработчика
sv: Mocka frontend-intervjuer med AI för att landa ditt första utvecklarjobb
th: สัมภาษณ์จำลองแนวหน้า กับ AI เพื่อเข้าสู่ตำแหน่งนักพัฒนางานแรกของคุณ
tr: Mock Frontend Mülakatları ile İlk Developer İşinizi AI ile Yapın
uk: Макетні співбесіди з AI для отримання вашої першої роботи розробника
vi: Phỏng Vấn Giả Lập Với AI Để Giành Được Công Việc Dev Đầu Tiên Của Bạn

source: Mock interview practice
ar: ممارسة المقابلة التجريبية
be: Практыка макетнага інтэрв'ю
da: Simuleret interview træning
de: Übung für Vorstellungsgespräche
es: Práctica de simulacro de entrevista
fr: Pratique d'entretien simulé
id: Praktek wawancara simulasi
it: Pratica di colloquio simulato
ja: モックインタビュー練習
ms: Latihan temu duga simulasi
no: Praksis med falskt intervju
pl: Praktyka symulowanych rozmów kwalifikacyjnych
pt: Prática de entrevista simulada
ru: Практика мнимого собеседования
sv: Övning på provintervju
th: ฝึกสัมภาษณ์จำลอง
tr: Sahte mülakat pratiği
uk: Практика модельного інтерв'ю
vi: Luyện tập phỏng vấn giả

source: Mock Interview Questions
ar: أسئلة المقابلة الوهمية
be: Пытанні для імітацыі інтэрв'ю
da: Mock interview spørgsmål
de: Mock-Interview-Fragen
es: Preguntas de Entrevista Simulada
fr: Questions d'entretien simulé
id: Pertanyaan Wawancara Tiruan
it: Domande per un Colloquio Simulato
ja: 模擬面接の質問
ms: Soalan Temuduga Palsu
no: Mock Intervju Spørsmål
pl: Symulowane pytania do rozmowy kwalifikacyjnej
pt: Perguntas de Entrevista Simulada
ru: Вопросы для пробного интервью
sv: Intervjufrågor för övning
th: คำถามสัมภาษณ์จำลอง
tr: Mülakat Soruları
uk: Питання для макетного інтерв'ю
vi: Câu hỏi phỏng vấn mô phỏng

source: Mock Interviews
ar: المقابلات الوهمية
be: Інтэрв’ю па мадэлі
de: Scheininterviews
es: Entrevistas Simuladas
fr: Entrevues simulées
id: Wawancara Tiruan
it: Colloqui Simulati
ja: 模擬インタビュー
ms: Temubual Olok-olok
no: Late Intervjuer
pl: Symulowane Rozmowy Kwalifikacyjne
pt: Entrevistas Simuladas
ru: Мок-интервью
sv: Mockintervjuer
th: การสัมภาษณ์ตัวอย่าง
tr: Sahte Görüşmeler
uk: Макетні співбесіди
vi: Phỏng Vấn Thử Nghiệm

source: modern literature
ar: الأدب الحديث
be: сучасная літаратура
da: moderne litteratur
de: moderne Literatur
es: literatura moderna
fr: littérature moderne
id: sastra modern
it: letteratura moderna
ja: 現代文学
ms: kesusasteraan moden
no: moderne litteratur
pl: współczesna literatura
pt: literatura moderna
ru: современная литература
sv: modern litteratur
th: วรรณกรรมสมัยใหม่
tr: modern edebiyat
uk: сучасна література
vi: văn học hiện đại

source: month
ar: شهر
be: месяц
da: måned
de: Monat
es: mes
fr: mois
id: bulan
it: mese
ja: 月
ms: bulan
no: måned
pl: miesiąc
pt: mês
ru: месяц
sv: månad
th: เดือน
tr: ay
uk: місяць
vi: tháng

source: Month
de: Monat
es: Mes
id: Bulan
it: Mese
ja: 月
no: Måned
pl: Miesiąc
pt: Mês
ru: Месяц
sv: Månad
th: เดือน
tr: Ay
uk: Місяць
vi: Tháng

source: Monthly Plan
ar: خطة شهرية
be: Штомесячны план
da: Månedlig Plan
de: Monatsplan
es: Plan Mensual
fr: plaintext Plan Mensuel
id: Rencana Bulanan
it: Piano Mensile
ja: 月額プラン
ms: Pelan Bulanan
no: Månedlig plan
pl: Plan Miesięczny
pt: Plano Mensal
ru: Ежемесячный план
sv: Månadsplan
th: แผนรายเดือน
tr: Aylık Plan
uk: Щомісячний план
vi: Gói Hàng Tháng

source: More
ar: أكثر
be: Болей
da: Mere
es: Más
fr: Plus
id: Lebih
it: Più
ja: もっと
ms: Lebih
no: Mer
pl: Więcej
pt: Mais
ru: Больше
sv: Mer
th: เพิ่มเติม
tr: Daha Fazla
uk: Більше
vi: Thêm nữa

source: More options
ar: المزيد من الخيارات
be: Больш варыянтаў
da: Flere muligheder
de: Mehr Optionen
es: Más opciones
fr: Plus d'options
id: Lebih banyak pilihan
it: Altre opzioni
ja: さらにオプション
ms: Lebih banyak pilihan
no: Flere alternativer
pl: Więcej opcji
pt: Mais opções
ru: Больше вариантов
sv: Fler alternativ
th: ตัวเลือกเพิ่มเติม
tr: Daha fazla seçenek
uk: Більше опцій
vi: Nhiều tùy chọn

source: More unique lessons
ar: دروس أكثر تميزاً
be: Больш унікальных урокаў
da: Flere unikke lektioner
de: Mehr einzigartige Lektionen
es: Más lecciones únicas
fr: Plus de leçons uniques
id: Pelajaran yang lebih unik
it: Lezioni più uniche
ja: よりユニークなレッスン
ms: Pelajaran yang lebih unik
no: Flere unike leksjoner
pl: Więcej unikalnych lekcji
pt: Mais lições únicas
ru: Больше уникальных уроков
sv: Fler unika lektioner
th: บทเรียนที่ไม่ซ้ำซาก
tr: Daha benzersiz dersler
uk: Більше унікальних уроків
vi: Thêm nhiều bài học độc đáo

source: Most interviews include the classic “strengths and weaknesses” question. It’s especially important to handle this well in English.
ar: تتضمن معظم المقابلات السؤال الكلاسيكي "النقاط القوية والضعف". من الخصوصي المهم التعامل مع هذا بشكل جيد باللغة الإنجليزية.
be: Большасць інтэрв'ю ўключае класічныя пытанні пра "сілы і слабості". Асабліва важна гэта добра апрацоўваць на англійскай мове.
da: De fleste interviews inkluderer det klassiske "styrker og svagheder" spørgsmål. Det er især vigtigt at håndtere dette godt på engelsk.
de: Die meisten Interviews beinhalten die klassische Frage nach "Stärken und Schwächen". Es ist besonders wichtig, diese auf Englisch gut zu meistern.
es: La mayoría de las entrevistas incluyen la clásica pregunta de "fortalezas y debilidades". Es especialmente importante manejar esto bien en inglés.
fr: La plupart des entretiens incluent la question classique "forces et faiblesses". Il est particulièrement important de bien gérer cela en anglais.
id: Sebagian besar wawancara mencakup pertanyaan klasik "kekuatan dan kelemahan". Sangat penting untuk menangani ini dengan baik dalam bahasa Inggris.
it: La maggior parte dei colloqui include la classica domanda "punti di forza e debolezze". È particolarmente importante gestire bene questo in inglese.
ja: ほとんどの面接には、古典的な「強みと弱み」についての質問が含まれています。これを英語で適切に対処することは特に重要です。
ms: Kebanyakan temu duga merangkumi soalan klasik "kekuatan dan kelemahan". Ia sangat penting untuk menangani ini dengan baik dalam Bahasa Inggeris.
no: De fleste intervjuer inkluderer det klassiske "styrker og svakheter" spørsmålet. Det er spesielt viktig å håndtere dette godt på engelsk.
pl: Większość rozmów kwalifikacyjnych zawiera klasyczne pytanie o "mocne i słabe strony". Szczególnie ważne jest, aby dobrze sobie z tym poradzić w języku angielskim.
pt: A maioria das entrevistas inclui a clássica pergunta "pontos fortes e fracos". É especialmente importante lidar bem com isso em inglês.
ru: Большинство собеседований включают классический вопрос о "сильных и слабых сторонах". Особенно важно хорошо справиться с этим на английском языке.
sv: De flesta intervjuer inkluderar den klassiska "styrkor och svagheter" frågan. Det är särskilt viktigt att hantera detta väl på engelska.
th: สัมภาษณ์ส่วนใหญ่จะรวมถึงคำถามคลาสสิกเกี่ยวกับ "จุดแข็งและจุดอ่อน" การจัดการเรื่องนี้ได้ดีในภาษาอังกฤษเป็นเรื่องที่สำคัญเป็นพิเศษ
tr: Çoğu mülakat, klasik "güçlü yönler ve zayıf yönler" sorusunu içerir. Bunu İngilizce'de iyi bir şekilde ele almak özellikle önemlidir.
uk: Більшість співбесід включають класичне питання про "сильні та слабкі сторони". Особливо важливо гарно справлятися з цим на англійській мові.
vi: Hầu hết các cuộc phỏng vấn đều bao gồm câu hỏi cổ điển về "điểm mạnh và điểm yếu". Việc xử lý tốt vấn đề này trong tiếng Anh đặc biệt quan trọng.

source: Movies, books, or music
ar: أفلام، كتب، أو موسيقى
be: Фільмы, кнігі або музыка
da: Film, bøger eller musik
de: Filme, Bücher oder Musik
es: Películas, libros o música
fr: Films, livres ou musique
id: Film, buku, atau musik
it: Film, libri o musica
ja: 映画、本、または音楽
ms: Filem, buku, atau muzik
no: Filmer, bøker, eller musikk
pl: Filmy, książki lub muzyka
pt: Filmes, livros ou música
ru: Фильмы, книги или музыка
sv: Filmer, böcker eller musik
th: ภาพยนตร์ หนังสือ หรือเพลง
tr: Filmler, kitaplar veya müzik
uk: Фільми, книги чи музика
vi: Phim, sách, hoặc âm nhạc

source: Native Language
ar: اللغة الأم
be: Родная мова
da: Modersmål
de: Muttersprache
es: Idioma nativo
fr: Langue maternelle
id: Bahasa Asli
it: Lingua Madre
ja: 母国語
ms: Bahasa Ibu
no: Morsmål
pl: Język ojczysty
pt: Língua Materna
ru: Родной язык
sv: Modersmål
th: ภาษาแม่
tr: Anadil
uk: Рідна мова
vi: Ngôn ngữ mẹ đẻ

source: Native language
ar: اللغة الأصلية
be: Родная мова
da: Modersmål
de: Muttersprache
es: Idioma nativo
fr: Langue maternelle
id: Bahasa asli
it: Lingua madre
ja: ネイティブ言語
ms: Bahasa ibunda
no: Innfødt språk
pl: Język ojczysty
pt: Língua nativa
ru: Родной язык
sv: Modersmål
th: ภาษาแม่
tr: Ana dil
uk: Рідна мова
vi: Ngôn ngữ mẹ đẻ

source: natural and not robotic
ar: طبيعي وليس روبوتي
be: прыродны і не робатычны
da: naturlig og ikke robotagtig
de: natürlich und nicht roboterhaft
es: natural y no robótico
fr: naturel et non robotique
id: alamiah dan bukan robotik
it: naturale e non robotico
ja: 自然でロボット的でない
ms: alamiah dan bukan robotik
no: naturlig og ikke robotaktig
pl: naturalne i nie robotyczne
pt: natural e não robótico
ru: естественный и не роботизированный
sv: naturlig och inte robotisk
th: ธรรมชาติและไม่เหมือนหุ่นยนต์
tr: doğal ve robotik olmayan
uk: природній і не роботизований
vi: tự nhiên và không cứng nhắc

source: Need help?
ar: تحتاج إلى مساعدة؟
be: Патрэбна дапамога?
da: Har du brug for hjælp?
de: Brauchen Sie Hilfe?
es: ¿Necesitas ayuda?
fr: Besoin d'aide ?
id: Butuh bantuan?
it: Hai bisogno di aiuto?
ja: 助けが必要ですか？
ms: Perlukan bantuan?
no: Trenger du hjelp?
pl: Potrzebujesz pomocy?
pt: Precisa de ajuda?
ru: Нужна помощь?
sv: Behöver du hjälp?
th: ต้องการความช่วยเหลือ?
tr: Yardıma mı ihtiyacınız var?
uk: Потрібна допомога?
vi: Cần giúp đỡ?

source: Need Help?
ar: هل تحتاج مساعدة؟
be: Патрэбна дапамога?
da: Behøver du hjælp?
de: Brauchen Sie Hilfe?
es: ¿Necesitas ayuda?
fr: Besoin d'aide ?
id: Butuh Bantuan?
it: Hai bisogno di aiuto?
ja: 助けが必要ですか？
ms: Perlu Bantuan?
no: Trenger du hjelp?
pl: Potrzebujesz pomocy?
pt: Precisando de ajuda?
ru: Нужна помощь?
sv: Behöver du hjälp?
th: ต้องการความช่วยเหลือไหม?
tr: Yardım mı lazım?
uk: Потрібна допомога?
vi: Cần giúp đỡ?
