Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Type your answer here...
ar: اكتب إجابتك هنا...
be: Ўвядзіце свой адказ тут...
da: Skriv dit svar her...
de: Geben Sie hier Ihre Antwort ein...
es: Escribe tu respuesta aquí...
fr: Tapez votre réponse ici...
id: Ketikan jawaban Anda di sini...
it: Digita la tua risposta qui...
ja: ここにあなたの答えを入力してください...
no: Skriv svaret ditt her...
pl: Wpisz tutaj swoją odpowiedź...
pt: Digite sua resposta aqui...
ru: Введите свой ответ здесь...
sv: Skriv ditt svar här...
th: พิมพ์คำตอบของคุณที่นี่...
tr: Cevabınızı buraya yazın...
uk: Введіть свою відповідь тут...
vi: Nhập câu trả lời của bạn vào đây...

source: Ukrainian Learning Plan
ar: خطة التعلم الأوكرانية
be: План вучэння ўкраінскай мовы
da: Ukrainsk Læringsplan
de: Ukrainischer Lernplan
es: Plan de Aprendizaje Ucraniano
fr: Plan d'Apprentissage Ukrainien
id: Rencana Belajar Ukraina
it: Piano di Apprendimento Ucraino
ja: ウクライナ語学習プラン
ms: Rancangan Pembelajaran Ukraine
no: Ukrainsk Læringsplan
pl: Plan Nauki Ukraińskiego
pt: Plano de Aprendizagem Ucraniano
ru: Учебный план по изучению украинского языка
sv: Ukrainsk inlärningsplan
th: แผนการเรียนรู้ภาษายูเครน
tr: Ukrayna Öğrenme Planı
uk: План навчання української
vi: Kế hoạch học tiếng Ukraina

source: Unit Tests
ar: اختبارات الوحدة
be: Тэсты Юнітаў
da: Enhedstests
de: Einheitstests
es: Pruebas Unitarias
fr: Tests unitaires
id: Uji Unit
it: Test di Unità
ja: ユニットテスト
ms: Ujian Unit
no: Enhetstester
pl: Testy jednostkowe
pt: Testes de Unidade
ru: Юнит-тесты
sv: Enhetstester
th: การทดสอบหน่วย
tr: Birime Testleri
uk: Модульні тести
vi: Bài Kiểm Tra Đơn Vị

source: Unknown category
ar: فئة غير معروفة
be: Невядомая катэгорыя
da: Ukendt kategori
de: Unbekannte Kategorie
es: Categoría desconocida
fr: Catégorie inconnue
id: Kategori tidak diketahui
it: Categoria sconosciuta
ja: 未知のカテゴリ
ms: Kategori tidak diketahui
no: Ukjent kategori
pl: Nieznana kategoria
pt: Categoria desconhecida
ru: Неизвестная категория
sv: Okänd kategori
th: หมวดหมู่ที่ไม่รู้จัก
tr: Bilinmeyen kategori
uk: Невідома категорія
vi: Danh mục không xác định

source: Unknown error
ar: خطأ غير معروف
be: Невядомая памылка
da: Ukendt fejl
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
id: Kesalahan tidak diketahui
it: Errore sconosciuto
ja: 不明なエラー
ms: Ralat tidak diketahui
no: Ukjent feil
pl: Nieznany błąd
pt: Erro desconhecido
ru: Неизвестная ошибка
sv: Okänt fel
th: ข้อผิดพลาดที่ไม่รู้จัก
tr: Bilinmeyen hata
uk: Невідома помилка
vi: Lỗi không xác định

source: Unknown error during sign-in
ar: plaintext خطأ غير معروف أثناء تسجيل الدخول
be: Невядомая памылка падчас уваходу ў сістэму
da: Ukendt fejl under indlogning
de: Unbekannter Fehler bei der Anmeldung
es: Error desconocido durante el inicio de sesión
fr: Erreur inconnue lors de la connexion
id: Kesalahan tidak dikenal saat masuk
it: Errore sconosciuto durante l'accesso
ja: サインイン中に不明なエラーが発生しました
ms: Ralat tidak diketahui semasa log masuk
no: Ukjent feil under pålogging
pl: Nieznany błąd podczas logowania się
pt: Erro desconhecido durante o login
ru: Неизвестная ошибка при входе в систему
sv: Okänd fel vid inloggning
th: ข้อผิดพลาดที่ไม่ทราบสาเหตุระหว่างการลงชื่อเข้าใช้
tr: Oturum açma sırasında bilinmeyen hata
uk: Невідома помилка під час входу
vi: Lỗi không xác định khi đăng nhập

source: Unlimited answer reviews
ar: مراجعات إجابات غير محدودة
be: Неабмежаваныя перавіркі адказаў
da: Ubegrænsede svaranmeldelser
de: Unbegrenzte Antwortbewertungen
es: Revisiones ilimitadas de respuestas
fr: Révisions de réponses illimitées
id: Ulasan jawaban tanpa batas
it: Recensioni delle risposte illimitate
ja: 無制限の回答レビュー
ms: Ulasan jawapan tanpa had
no: Ubegrensede svarvurderinger
pl: Nieograniczone przeglądy odpowiedzi
pt: Revisões de respostas ilimitadas
ru: Неограниченные проверки ответов
sv: Obegränsade svarsgranskningar
th: การตรวจสอบคำตอบไม่จำกัด
tr: Sınırsız yanıt incelemesi
uk: Необмежена кількість рецензій на відповіді
vi: Đánh giá câu trả lời không giới hạn

source: Unlimited messages
id: Pesan tanpa batas
it: Messaggi illimitati
ja: 無制限のメッセージ
no: Ubegrensede meldinger
ru: Неограниченные сообщения
uk: Необмежена кількість повідомлень

source: Unlock full interview preparation
ar: افتح التحضير الكامل للمقابلة
be: Разблакіраваць поўную падрыхтоўку да інтэрв'ю
da: Lås op for fuld interviewforberedelse
de: Schalten Sie die vollständige Interview-Vorbereitung frei
es: Desbloquea la preparación completa para entrevistas
fr: Débloquer la préparation complète de l'entretien
id: Buka persiapan wawancara lengkap
it: Sblocca la preparazione completa per l'intervista
ja: フルインタビュー準備をアンロック
ms: Buka persediaan temu duga sepenuhnya
no: Lås opp full intervjuforberedelse
pl: Odblokuj pełne przygotowanie do wywiadu
pt: Desbloquear preparação completa para entrevista
ru: Разблокируйте полную подготовку к собеседованию
sv: Lås upp fullständig intervjuförberedelse
th: ปลดล็อกการเตรียมสัมภาษณ์อย่างเต็มรูปแบบ
tr: Tam görüşme hazırlığının kilidini aç
uk: Розблокуйте повну підготовку до співбесіди
vi: Mở khóa chuẩn bị phỏng vấn đầy đủ

source: Unlock human-like voice conversations and a curriculum tailored specifically to your goals.
id: Buka percakapan suara seperti manusia dan kurikulum yang disesuaikan secara khusus dengan tujuan Anda.
it: Sblocca conversazioni con voce simile a quella umana e un curriculum su misura specificamente per i tuoi obiettivi.
ja: 人間のような音声での会話と、あなたの目標に特化したカリキュラムを解放しましょう。
no: Lås opp menneskelignende stemmesamtaler og en læreplan skreddersydd spesielt for dine mål.
pl: Odblokuj rozmowy z ludzkim głosem i program nauczania dostosowany specjalnie do Twoich celów.
ru: Разблокируйте разговоры с голосом, подобным человеческому, и учебный план, специально адаптированный к вашим целям.
sv: Lås upp samtal med mänsklig röst och en läroplan skräddarsydd specifikt efter dina mål.
uk: Розблокуйте бесіди зі звучанням, подібним до людського, та навчальний план, створений спеціально для ваших цілей.

source: Unpublish
ar: إلغاء النشر
be: Аднавіць у чарнавік
da: Upublikér
de: Unveröffentlichen
es: Desteñir
fr: Dépublier
id: Tidak Dipublikasikan
it: Rimuovi dalla pubblicazione
ja: 非公開にする
ms: Tidak diterbitkan
no: Avpubliser
pl: Cofnij publikację
pt: Despublicar
ru: Отменить публикацию
sv: Avpublicera
th: ไม่เผยแพร่
tr: Yayından Kaldır
uk: Відмінити публікацію
vi: Hủy xuất bản

source: Upload image
uk: Завантажити зображення

source: Upload language skills directly to your brain
ar: تحميل مهارات اللغة مباشرة إلى عقلك
be: Загрузіце веданні мовы напрыцямую ў свой мозг
da: Upload sprogfærdigheder direkte til din hjerne
de: Laden Sie Sprachkenntnisse direkt in Ihr Gehirn hoch
es: Carga habilidades lingüísticas directamente en tu cerebro
fr: Téléchargez directement les compétences linguistiques dans votre cerveau
id: Unggah keterampilan bahasa langsung ke otak Anda
it: Carica direttamente nel tuo cervello le competenze linguistiche
ja: あなたの脳に直接言語スキルをアップロードします
ms: Muat naik kemahiran bahasa terus ke otak anda
no: Last opp språkferdigheter direkte til hjernen din
pl: Prześlij umiejętności językowe bezpośrednio do swojego mózgu
pt: Faça upload de habilidades linguísticas diretamente para o seu cérebro
ru: Загрузите знания языка прямо в ваш мозг
sv: Ladda upp språkkunskaper direkt till din hjärna
th: อัปโหลดทักษะการใช้ภาษาลงไปยังสมองของคุณโดยตรง
tr: Dil becerilerini doğrudan beynine yükle
uk: Завантажуйте мовні навички прямо в ваш мозок
vi: Tải kỹ năng ngôn ngữ trực tiếp lên não của bạn

source: Uploading...
uk: Завантаження...

source: Use queues, batching, throttling, and proper synchronization primitives.
ar: استخدم قوائم الانتظار، الدُفعات، الخنق، والمزامنة المناسبة للمزامنات.
be: Выкарыстоўвайце чэргі, пакетную апрацоўку, абмежаванне хуткасці і правільныя сінхранізацыйныя прымітывы.
da: Brug køer, batching, throttle og passende synkroniseringsprimitiver.
de: Verwenden Sie Warteschlangen, Stapelverarbeitung, Drosselung und geeignete Synchronisationsprimitiven.
es: Usa colas, procesamiento por lotes, limitación y primitivas de sincronización adecuadas.
fr: Utilisez des files d'attente, le traitement par lots, le throttling, et des primitives de synchronisation appropriées.
id: Gunakan antrean, pemrosesan dalam batch, throttling, dan primitif sinkronisasi yang tepat.
it: Usa le code, il batch processing, il throttling e le primitive di sincronizzazione adeguate.
ja: キュー、バッチ処理、スロットリング、適切な同期プリミティブを使用します。
ms: Gunakan antrian, pembungkusan, pengehad laju, dan primitif penyelarasan yang betul.
no: Bruk køer, batching, throttling, og riktige synkroniseringsprimitiver.
pl: Używaj kolejek, grupowania zadań, ograniczania przepustowości oraz odpowiednich prymitywów synchronizacji.
pt: Use filas, processamento em lote, limitação de taxa e primitivas de sincronização adequadas.
ru: Используйте очереди, пакетирование, ограничение скорости и правильные примитивы синхронизации.
sv: Använd köer, batchning, throttling, och korrekta synkroniseringsprimitiver.
th: ใช้คิว การจัดกลุ่ม การควบคุมความถี่ และโครงสร้างการทำงานพร้อมกันที่เหมาะสม
tr: Kuyruklar, toplu işleme, hız kontrolü ve uygun senkronizasyon ilkellerini kullanın.
uk: Використовуй черги, батчинг, інструменти обмеження швидкості та відповідні примітиви синхронізації.
vi: Sử dụng hàng đợi, gộp nhóm, giới hạn tần suất, và các nguyên thủy đồng bộ hóa thích hợp.

source: Use the STAR method (Situation, Task, Action, Result)
ar: استخدم طريقة STAR (الموقف، المهمة، العمل، النتيجة)
be: Выкарыстоўвайце метад STAR (Сітуацыя, Заданне, Дзеянне, Вынік)
da: Brug STAR-metoden (Situation, Opgave, Handling, Resultat)
de: Verwenden Sie die STAR-Methode (Situation, Aufgabe, Aktion, Ergebnis)
es: Usa el método STAR (Situación, Tarea, Acción, Resultado)
fr: Utilisez la méthode STAR (Situation, Tâche, Action, Résultat)
id: Gunakan metode STAR (Situasi, Tugas, Aksi, Hasil)
it: Usa il metodo STAR (Situazione, Compito, Azione, Risultato)
ja: STAR メソッドを使う (状況, 課題, 行動, 結果)
ms: Gunakan kaedah STAR (Situasi, Tugas, Tindakan, Hasil)
no: Bruk STAR-metoden (Situasjon, Oppgave, Handling, Resultat)
pl: Użyj metody STAR (Sytuacja, Zadanie, Działanie, Rezultat)
pt: Use o método STAR (Situação, Tarefa, Ação, Resultado)
ru: Используйте метод STAR (Ситуация, Задача, Действие, Результат)
sv: Använd STAR-metoden (Situation, Uppgift, Handling, Resultat)
th: ใช้วิธี STAR (สถานการณ์, งาน, การกระทำ, ผลลัพธ์)
tr: STAR yöntemini kullanın (Durum, Görev, Eylem, Sonuç)
uk: Використовуйте метод STAR (Ситуація, Завдання, Дія, Результат)
vi: Áp dụng phương pháp STAR (Tình huống, Nhiệm vụ, Hành động, Kết quả)

source: Use these templates to craft your own story. Don’t forget to mention an achievement:
ar: استخدم هذه القوالب لصياغة قصتك الخاصة. لا تنسى أن تذكر إنجازًا:
be: Выкарыстоўвайце гэтыя шаблоны для стварэння сваёй гісторыі. Не забывайце згадаць пра свае дасягненне:
da: Brug disse skabeloner til at skabe din egen historie. Glem ikke at nævne en præstation:
de: Verwenden Sie diese Vorlagen, um Ihre eigene Geschichte zu erstellen. Vergessen Sie nicht, eine Leistung zu erwähnen:
es: Utiliza estas plantillas para crear tu propia historia. No olvides mencionar un logro:
fr: Utilisez ces modèles pour créer votre propre histoire. N'oubliez pas de mentionner une réalisation :
id: Gunakan templat ini untuk membuat cerita Anda sendiri. Jangan lupa untuk menyebutkan sebuah pencapaian:
it: Utilizza questi modelli per creare la tua storia. Non dimenticare di menzionare un risultato:
ja: これらのテンプレートを使って自分だけのストーリーを作りましょう。実績を述べるのを忘れないでください：
ms: Gunakan templat ini untuk merangka kisah anda sendiri. Jangan lupa untuk menyebutkan pencapaian:
no: Bruk disse malene for å lage din egen historie. Ikke glem å nevne en prestasjon:
pl: Użyj tych szablonów, aby stworzyć swoją własną historię. Nie zapomnij wspomnieć o osiągnięciu:
pt: Use esses modelos para criar sua própria história. Não se esqueça de mencionar uma conquista:
ru: Используйте эти шаблоны для создания своей собственной истории. Не забудьте упомянуть достижение:
sv: Använd dessa mallar för att skapa din egen berättelse. Glöm inte att nämna en prestation:
th: ใช้เทมเพลตเหล่านี้เพื่อสร้างเรื่องราวของคุณเอง อย่าลืมพูดถึงความสำเร็จ:
tr: Bu şablonları kendi hikayenizi oluşturmak için kullanın. Bir başarıyı belirtmeyi unutmayın:
uk: Використовуйте ці шаблони, щоб створити власну історію. Не забудьте згадати про досягнення:
vi: Sử dụng những mẫu này để tạo câu chuyện của riêng bạn. Đừng quên đề cập đến một thành tựu:

source: Use your learning language ({lang})
ar: استخدم لغة التعلم الخاصة بك ({lang})
be: Выкарыстоўвайце вашу мову навучання ({lang})
da: Brug dit indlæringssprog ({lang})
de: Verwenden Sie Ihre Lernsprache ({lang})
es: Usa tu lenguaje de aprendizaje ({lang})
fr: Utilisez votre langue d'apprentissage ({lang})
id: Gunakan bahasa belajar Anda ({lang})
it: Usa la tua lingua di apprendimento ({lang})
ja: 学習中の言語 ({lang}) を使う
no: Bruk læringsspråket ditt ({lang})
pl: Użyj swojego języka nauki ({lang})
pt: Use seu idioma de aprendizado ({lang})
ru: Используйте ваш язык обучения ({lang})
sv: Använd ditt lärande språk ({lang})
th: ใช้ภาษาที่คุณกำลังเรียน ({lang})
tr: Öğrenme dilinizi kullanın ({lang})
uk: Використовуйте свою мову навчання ({lang})
vi: Sử dụng ngôn ngữ mà bạn đang học ({lang})

source: Useful Phrases for Self-Introduction
ar: عبارات مفيدة للتعريف عن النفس
be: Карысныя фразы для самапрэзентацыі
da: Nyttige sætninger til selv-introduktion
de: Nützliche Phrasen für die Selbstvorstellung
es: Frases Útiles para la Autopresentación
fr: Phrases Utiles pour se Présenter
id: Frasa Berguna untuk Perkenalan Diri
it: Frasi Utili per l'Autopresentazione
ja: 自己紹介に役立つフレーズ
ms: Frasa Berguna untuk Perkenalan Diri
no: Nyttige Uttrykk for Selvintroduksjon
pl: Przydatne Zwroty do Samoprezentacji
pt: Frases Úteis para Autoapresentação
ru: Полезные фразы для самопредставления
sv: Användbara fraser för självintroduktion
th: วลีที่มีประโยชน์สำหรับการแนะนำตัวเอง
tr: Kendini Tanıtma İçin Faydalı İfadeler
uk: Корисні фрази для самопрезентації
vi: Cụm từ hữu ích cho việc tự giới thiệu

source: Username is already taken
ar: اسم المستخدم محجوز بالفعل
be: Імя карыстальніка ўжо занята
da: Brugernavn er allerede taget
de: Benutzername ist bereits vergeben
es: El nombre de usuario ya está en uso
fr: Le nom d'utilisateur est déjà pris
id: Nama pengguna sudah digunakan
it: Nome utente già utilizzato
ja: ユーザー名は既に使用されています
ms: Nama pengguna sudah diambil
no: Brukernavnet er allerede tatt
pl: Nazwa użytkownika jest już zajęta
pt: Nome de usuário já está em uso
ru: Имя пользователя уже занято
sv: Användarnamnet är redan taget
th: ชื่อผู้ใช้นี้ถูกใช้ไปแล้ว
tr: Kullanıcı adı zaten alınmış
uk: Ім'я користувача вже зайняте
vi: Tên người dùng đã được sử dụng

source: Username must be at least 3 characters long.
ar: يجب أن يكون اسم المستخدم 3 أحرف على الأقل.
be: Імя карыстальніка павінна быць не менш за 3 сімвалы.
da: Brugernavn skal være mindst 3 tegn langt.
de: Der Benutzername muss mindestens 3 Zeichen lang sein.
es: El nombre de usuario debe tener al menos 3 caracteres de longitud.
fr: Le nom d'utilisateur doit comporter au moins 3 caractères.
id: Nama pengguna harus setidaknya 3 karakter.
it: Il nome utente deve essere lungo almeno 3 caratteri.
ja: ユーザー名は最低3文字必要です。
ms: Nama pengguna mesti sekurang-kurangnya 3 aksara.
no: Brukernavnet må være minst 3 tegn langt.
pl: Nazwa użytkownika musi mieć co najmniej 3 znaki.
pt: O nome de usuário deve ter pelo menos 3 caracteres.
ru: Имя пользователя должно содержать не менее 3 символов.
sv: Användarnamnet måste vara minst 3 tecken långt.
th: ชื่อผู้ใช้ต้องมีอักขระอย่างน้อย 3 ตัว
tr: Kullanıcı adı en az 3 karakter uzunluğunda olmalıdır.
uk: Ім'я користувача повинно містити принаймні 3 символи.
vi: Tên người dùng phải dài ít nhất 3 ký tự.

source: Username:
ar: اسم المستخدم:
be: Імя карыстальніка:
da: Brugernavn:
de: Benutzername:
es: Nombre de usuario:
fr: Nom d'utilisateur :
id: Nama Pengguna:
it: Nome utente:
ja: ユーザー名:
no: Brukernavn:
pl: Nazwa użytkownika:
pt: Nome de Usuário:
ru: Имя пользователя:
sv: Användarnamn:
th: ชื่อผู้ใช้:
tr: Kullanıcı Adı:
uk: Ім'я користувача:
vi: Tên người dùng:

source: Users who viewed this post
de: Benutzer, die diesen Beitrag angesehen haben
es: Usuarios que vieron esta publicación
id: Pengguna yang melihat postingan ini
it: Utenti che hanno visualizzato questo post
ja: この投稿を閲覧したユーザー
no: Brukere som så dette innlegget
pl: Użytkownicy, którzy obejrzeli ten post
pt: Usuários que visualizaram esta postagem
ru: Пользователи, которые просмотрели этот пост
sv: Användare som visade denna post
th: ผู้ใช้ที่ดูโพสต์นี้
tr: Bu gönderiyi görüntüleyen kullanıcılar
uk: Користувачі, які переглянули цей пост
vi: Người dùng đã xem bài viết này

source: Using real-time microphone is a premium feature. Please upgrade your balance to access this feature or use recorded audio.
uk: Використання мікрофона в реальному часі є преміум-функцією. Будь ласка, поповніть свій баланс, щоб отримати доступ до цієї функції, або скористайтеся записаним аудіо.

source: UX & Accessibility
ar: تجربة المستخدم وإمكانية الوصول
be: UX & Даступнасць
da: UX & Tilgængelighed
de: UX & Barrierefreiheit
es: UX y Accesibilidad
fr: UX et Accessibilité
id: UX & Aksesibilitas
it: UX & Accessibilità
ja: UX およびアクセシビリティ
ms: UX & Kebolehaksesan
no: UX og tilgjengelighet
pl: UX i dostępność
pt: UX & Acessibilidade
ru: UX и доступность
sv: UX & Tillgänglighet
tr: UX & Erişilebilirlik
uk: UX і Доступність
vi: UX & Khả năng tiếp cận

source: Vacancy description
ar: وصف فرصة العمل
be: Апісанне вакансіі
da: Ledighedsbeskrivelse
de: Stellenbeschreibung
es: Descripción de la vacante
fr: Description de l'offre d'emploi
id: Deskripsi lowongan
it: Descrizione della posizione aperta
ms: Deskripsi kekosongan
no: Ledighetsbeskrivelse
pl: Opis stanowiska
pt: Descrição da vaga
ru: Описание вакансии
sv: Ledig tjänstbeskrivning
th: คำบรรยายตำแหน่งงาน
tr: İş ilanı açıklaması
uk: Опис вакансії
vi: Mô tả vị trí tuyển dụng

source: var is function scoped and let and const are block scoped.
ar: var هو مُحدد لنطاق الدالة و let و const هما مُحدد لنطاق الكتلة.
be: var з'яўляецца функцыянальным аб'ёмам, а let і const маюць блочны аб'ём.
da: var er funktion scoped, og let og const er blok scoped.
de: var ist funktionsweit und let und const sind blockweit.
es: var es de ámbito de función y let y const son de ámbito de bloque.
fr: var est défini au niveau de la fonction, tandis que let et const sont définis au niveau du bloc.
id: var bersifat skoping fungsi dan let serta const bersifat skoping blok.
it: var è a livello di funzione, mentre let e const sono a livello di blocco.
ja: var は関数スコープであり、let と const はブロックスコープです。
no: var er funksjons-skopert og let og const er blokk-skopert.
pl: var jest zmienną zakresu funkcji, a let i const są zmiennymi zakresu bloku.
pt: var é com escopo de função e let e const são com escopo de bloco.
ru: var является функциональной областью видимости, а let и const - блочной областью видимости.
sv: var är funktionsscoped och let och const är blockscoped.
th: var เป็นการกำหนดขอบเขตของตัวแปรในฟังก์ชัน ส่วน let และ const เป็นการกำหนดขอบเขตของตัวแปรภายในบล็อก.
tr: var işlev (function) kapsamlıdır ve let ile const blok kapsamlıdır.
uk: var є функціонально обмеженим, а let і const — блочно обмеженими.
vi: `var` có phạm vi theo function, còn `let` và `const` có phạm vi theo block.

source: Verification failed
ar: فشل التحقق
be: Праверка не ўдалася
da: Verifikation mislykkedes
de: Verifizierung fehlgeschlagen
es: La verificación falló
fr: La vérification a échoué
id: Verifikasi gagal
it: Verifica fallita
ja: 検証に失敗しました
ms: Pengesahan gagal
no: Bekreftelse mislyktes
pl: Weryfikacja nie powiodła się
pt: Falha na verificação
ru: Проверка не удалась
sv: Verifiering misslyckades
th: การยืนยันล้มเหลว
tr: Doğrulama başarısız oldu
uk: Невдала перевірка
vi: Xác minh không thành công

source: Verifying...
ar: plaintext جارٍ التحقق...
be: Праверка...
da: Bekræfter...
de: Überprüfung...
es: Verificando...
fr: Vérification en cours...
id: Memverifikasi...
it: Verifica in corso...
ja: 検証中...
ms: Sedang Mengesahkan...
no: Verifiserer...
pl: Weryfikacja...
pt: Verificando...
ru: Проверка...
sv: Verifierar...
th: กำลังตรวจสอบ...
tr: Doğrulanıyor...
uk: Перевірка...
vi: plaintext Đang xác minh...

source: Vietnamese Learning Plan
ar: خطة التعلم الفيتنامية
be: План вучэння в'етнамскай мовы
da: Vietnamesisk Læreplan
de: Vietnamesischer Lernplan
es: Plan de Aprendizaje de Vietnamita
fr: Plan d'apprentissage du Vietnamien
id: Rencana Belajar Bahasa Vietnam
it: Piano di Apprendimento Vietnamita
ja: ベトナム語学習プラン
ms: Pelan Pembelajaran Bahasa Vietnam
no: Vietnamesisk Læreplan
pl: Plan Nauki Wietnamskiego
pt: Plano de Aprendizagem de Vietnamita
ru: План Изучения Вьетнамского
sv: Vietnamesisk inlärningsplan
th: แผนการเรียนรู้ภาษาเวียดนาม
tr: Vietnamca Öğrenme Planı
uk: План вивчення в'єтнамської
vi: Kế Hoạch Học Tiếng Việt

source: View all
ar: عرض الكل
be: Праглядзець усе
da: Se alle
de: Alle anzeigen
es: Ver todo
fr: Voir tout
id: Lihat semuanya
it: Visualizza tutto
ja: すべて表示
ms: Lihat semua
no: Vis alle
pl: Zobacz wszystko
pt: Ver todos
ru: Посмотреть все
sv: Visa alla
th: ดูทั้งหมด
tr: Tümünü Görüntüle
uk: Переглянути все
vi: Xem tất cả

source: View all posts
ar: عرض جميع المنشورات
be: Праглядзець усе запісы
da: Se alle indlæg
es: Ver todas las publicaciones
fr: Voir tous les posts
id: Lihat semua pos
it: Visualizza tutti i post
ja: すべての投稿を見る
ms: Lihat semua pos
no: Se alle innlegg
pl: Zobacz wszystkie posty
pt: Ver todas as postagens
ru: Посмотреть все записи
sv: Visa alla inlägg
th: ดูโพสต์ทั้งหมด
tr: Tüm gönderileri görüntüle
uk: Переглянути всі публікації
vi: Xem tất cả bài viết

source: View Scoreboard
id: Lihat Papan Skor
it: Visualizza Tabellone Segnapunti
ja: スコアボードを表示
no: Vis Poengtavle
ru: Посмотреть турнирную таблицу
uk: Переглянути турнірну таблицю

source: View your payment history
ar: عرض سجل الدفعات الخاص بك
be: Праглядзець гісторыю вашых плацяжоў
da: Se din betalingshistorik
de: Sehen Sie Ihre Zahlungshistorie an
es: Ver tu historial de pagos
fr: plaintext Voir votre historique de paiements
id: Lihat riwayat pembayaran Anda
it: Visualizza la cronologia dei pagamenti
ja: お支払い履歴を表示
ms: Lihat sejarah pembayaran anda
no: Vis din betalingshistorikk
pl: Wyświetl historię płatności
pt: Visualizar seu histórico de pagamentos
ru: Просмотреть историю платежей
sv: Visa din betalningshistorik
th: ดูประวัติการชำระเงินของคุณ
tr: Ödeme geçmişinizi görüntüleyin
uk: Переглянути вашу історію платежів
vi: Xem lịch sử thanh toán của bạn

source: View your payment history. Refunds
de: Sehen Sie sich Ihre Zahlungshistorie an. Rückerstattungen
es: Ver su historial de pagos. Reembolsos
id: Lihat riwayat pembayaran Anda. Pengembalian dana
it: Visualizza la cronologia dei tuoi pagamenti. Rimborsi
ja: お支払い履歴を表示します。返金
no: Vis din betalingshistorikk. Refusjoner
pl: Zobacz historię swoich płatności. Zwroty
pt: Visualize seu histórico de pagamentos. Reembolsos
ru: Просмотреть свою историю платежей. Возвраты
sv: Visa din betalningshistorik. Återbetalningar
th: ดูประวัติการชำระเงินของคุณ การคืนเงิน
tr: Ödeme geçmişinizi görüntüleyin. İadeler
uk: Перегляньте вашу історію платежів. Повернення коштів
vi: Xem lịch sử thanh toán của bạn. Hoàn tiền
