Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Smile, shake hands (if culturally appropriate), and speak in a friendly tone. If the interviewer asks, “Did you have any trouble finding us?” you might say:
ar: ابتسم، وصافح الأشخاص (إذا كان ذلك مناسبًا ثقافيًا)، وتحدث بنبرة ودية. إذا سألك المقابل، "هل واجهت أي صعوبة في العثور علينا؟" قد تقول:
be: Пасмяхніцеся, пацісніце руку (калі гэта дарэчна ў культурным аспекту), і гаварыце дружным тонам. Калі інтэрв'юэр спытае: "Ці было у вас якія-небудзь праблемы з тым, каб знайсці нас?", вы можаце сказаць:
da: Smil, giv hånd (hvis det er kulturelt passende), og tal i en venlig tone. Hvis intervieweren spørger: ”Havde du problemer med at finde os?” kan du sige:
de: Lächeln, Hände schütteln (wenn kulturell angemessen) und in einem freundlichen Ton sprechen. Wenn der Interviewer fragt: "Hatten Sie irgendwelche Probleme, uns zu finden?" könnten Sie sagen:
es: Sonríe, da la mano (si es culturalmente apropiado) y habla con un tono amigable. Si el entrevistador pregunta: "¿Tuvo algún problema para encontrarnos?", podrías decir:
fr: Souriez, serrez la main (si c'est culturellement approprié), et parlez sur un ton amical. Si l'interrogateur demande, "Avez-vous eu des difficultés à nous trouver?" vous pourriez dire :
id: Senyum, berjabat tangan (jika sesuai budaya), dan bicara dengan nada yang ramah. Jika pewawancara bertanya, "Apakah Anda memiliki masalah dalam menemukan kami?" Anda mungkin bisa menjawab:
it: Sorridi, stringi la mano (se culturalmente appropriato), e parla con un tono amichevole. Se l'intervistatore chiede: "Hai avuto qualche problema a trovarci?" potresti rispondere:
ja: 微笑んで、（文化的に適切な場合には）握手をし、友好的な口調で話しましょう。面接官が「ここを見つけるのに何か問題ありましたか？」と聞いてきたら、次のように答えることもできます：
ms: Senyum, berjabat tangan (jika sesuai budaya), dan berbicara dengan nada yang ramah. Jika pewawancara bertanya, "Adakah anda menghadapi masalah untuk mencari kami?" anda mungkin akan menjawab:
no: Smil, håndtrykk (hvis kulturelt passende), og snakk i en vennlig tone. Hvis intervjueren spør, "Hadde du noen problemer med å finne oss?" kan du kanskje svare:
pl: Uśmiechaj się, podaj rękę (jeśli to jest kulturalnie odpowiednie) i mów przyjaznym tonem. Jeśli osoba przeprowadzająca rozmowę zapyta: "Czy miałeś jakiekolwiek problemy z odnalezieniem nas?" możesz odpowiedzieć:
pt: Sorria, aperte as mãos (se culturalmente apropriado), e fale num tom amigável. Se o entrevistador perguntar, "Teve algum problema para nos encontrar?" você pode dizer:
ru: Улыбнитесь, пожмите руку (если это соответствует культуре), и говорите дружелюбным тоном. Если интервьюер спросит: "Вы не затруднились нас найти?" вы можете сказать:
sv: Le, skaka hand (om det är kulturellt passande), och tala i en vänlig ton. Om intervjuaren frågar, "Hade du några problem med att hitta oss?" kan du säga:
th: ยิ้ม, จับมือ (ถ้าเหมาะสมทางวัฒนธรรม), และพูดด้วยโทนที่เป็นมิตร ถ้าผู้สัมภาษณ์ถามว่า "คุณมีปัญหาในการค้นหาเราหรือไม่?" คุณอาจจะตอบว่า:
tr: Gülümseyin, el sıkışın (kültürel olarak uygunsa) ve dostça bir tonla konuşun. Eğer mülakatçı, “Bize ulaşmakta herhangi bir zorluk yaşadınız mı?” diye sorarsa, şöyle diyebilirsiniz:
uk: Усміхніться, потисніть руку (якщо це культурно прийнятно) і говоріть дружнім тоном. Якщо інтерв'юер запитає: "Чи виникли у Вас будь-які проблеми з тим, щоб знайти нас?" ви можете відповісти:
vi: Cười, bắt tay (nếu văn hóa cho phép), và nói chuyện với giọng điệu thân thiện. Nếu người phỏng vấn hỏi, "Bạn có gặp khó khăn gì khi tìm chúng tôi không?" bạn có thể phản hồi như sau:

source: So I can translate words for you
ar: لذلك يمكنني ترجمة الكلمات لك
be: Такім чынам, я магу перавесці для вас словы
da: Så jeg kan oversætte ord for dig
de: So kann ich Wörter für dich übersetzen
es: Así que puedo traducir palabras para ti
fr: Donc, je peux traduire des mots pour vous
id: Jadi saya dapat menerjemahkan kata-kata untukmu
it: Quindi posso tradurre le parole per te
ja: そのため、私はあなたのために単語を翻訳できます。
ms: Jadi saya boleh menterjemahkan kata-kata untuk anda
no: Så jeg kan oversette ord for deg
pl: Więc mogę tłumaczyć słowa dla Ciebie
pt: Então posso traduzir palavras para você
ru: Так что я могу переводить слова для вас
sv: Så jag kan översätta ord åt dig
th: ดังนั้นฉันสามารถแปลคำศัพท์ให้คุณได้
tr: Bu yüzden sizin için kelimeleri çevirebilirim
uk: Тож я можу перекладати слова для вас
vi: Vì vậy, tôi có thể dịch từ cho bạn

source: So we need your agreement with that and our policies
de: Also benötigen wir Ihre Zustimmung dazu und zu unseren Richtlinien.
es: Así que necesitamos su acuerdo con eso y nuestras políticas
id: Jadi kami memerlukan persetujuan Anda dengan hal itu dan kebijakan kami
it: Quindi abbiamo bisogno del tuo accordo con questo e con le nostre politiche
ja: この件と私たちのポリシーに同意していただく必要があります。
no: plaintext Så vi trenger din enighet med det og våre retningslinjer
pl: Więc potrzebujemy Twojej zgody na to i na nasze zasady
pt: Então, precisamos do seu acordo com isso e nossas políticas
ru: Итак, нам необходимо ваше согласие с этим и нашими политиками
sv: Så vi behöver ditt godkännande med det och våra policyer
th: ดังนั้นเราจึงต้องการความยินยอมจากคุณในเรื่องนั้นและนโยบายของเรา
tr: Dolayısıyla bununla ve politikalarımızla ilgili onayınızı almamız gerekiyor
uk: Тому нам потрібна ваша згода з цим та нашими політиками

source: So you can keep your progress
ar: حتى تتمكن من الحفاظ على تقدمك
be: Каб вы маглі працягваць свой прагрэс
da: Så du kan holde styr på dine fremskridt
de: Damit Sie Ihren Fortschritt beibehalten können
es: Para que puedas mantener tu progreso
fr: Ainsi, vous pouvez conserver vos progrès
id: Agar Anda dapat mempertahankan kemajuan Anda
it: Così puoi mantenere i tuoi progressi
ja: 進捗状況を維持するために
ms: Supaya anda dapat menyimpan kemajuan anda
no: Slik at du kan beholde fremgangen din
pl: Abyś mógł śledzić swój postęp
pt: Assim você pode manter seu progresso
ru: Чтобы вы могли отслеживать свой прогресс
sv: Så att du kan behålla dina framsteg
th: ดังนั้นคุณจึงสามารถรักษาความก้าวหน้าของคุณได้
tr: Böylece ilerlemenizi sürdürebilirsiniz.
uk: Отже, ви можете зберігати свій прогрес
vi: Vì vậy, bạn có thể giữ tiến độ của mình

source: So you can save your progress
ar: حتى تتمكن من حفظ تقدمك
be: Каб вы маглі захаваць ваш прагрэс
da: Så du kan gemme dine fremskridt
de: Damit Sie Ihren Fortschritt speichern können
es: Así puedes guardar tu progreso
fr: Ainsi, vous pouvez enregistrer vos progrès
id: Jadi Anda dapat menyimpan kemajuan Anda
it: Così puoi salvare i tuoi progressi
ja: 進捗を保存できます
ms: Jadi anda boleh menyimpan kemajuan anda
no: Slik at du kan lagre fremgangen din
pl: Więc możesz zapisać swoje postępy
pt: Para que você possa salvar seu progresso
ru: Таким образом, вы можете сохранить свой прогресс
sv: Så att du kan spara dina framsteg
th: เพื่อให้คุณสามารถบันทึกความก้าวหน้าได้
tr: Böylece ilerlemenizi kaydedebilirsiniz
uk: Щоб ви могли зберігати свій прогрес
vi: Để bạn có thể lưu tiến trình của mình

source: Social
ar: اجتماعي
be: Сацыяльнае
de: Sozial
id: Sosial
it: Sociale
ja: ソーシャル
ms: Sosial
no: Sosial
pl: Społeczny
ru: Социальный
th: สังคม
tr: Sosyal
uk: Соціальний
vi: Xã hội

source: Solid knowledge of ASP.NET Core and EF Core. Some gaps in resiliency patterns and observability.
ar: معرفة قوية بـ ASP.NET Core و EF Core. بعض الفجوات في أنماط المرونة والرصد.
be: Моцныя веды ASP.NET Core і EF Core. Некаторыя прабелы ў шаблонах устойлівасці і назіральнасці.
da: Solid forståelse af ASP.NET Core og EF Core. Nogle mangler inden for resiliensmønstre og observerbarhed.
de: Solide Kenntnisse in ASP.NET Core und EF Core. Einige Lücken in Resilienzmustern und Beobachtbarkeit.
es: Sólidos conocimientos de ASP.NET Core y EF Core. Algunas lagunas en patrones de resiliencia y observabilidad.
fr: Solide connaissance d'ASP.NET Core et d'EF Core. Quelques lacunes dans les modèles de résilience et d'observabilité.
id: Pengetahuan solid tentang ASP.NET Core dan EF Core. Beberapa kekurangan dalam pola ketahanan dan pengamatan.
it: Solida conoscenza di ASP.NET Core e EF Core. Alcuni gap nei pattern di resilienza e osservabilità.
ja: ASP.NET CoreとEF Coreに関する確かな知識があります。回復力のパターンと可観測性にはいくつかのギャップがあります。
ms: Pengetahuan kukuh tentang ASP.NET Core dan EF Core. Beberapa kekurangan dalam corak ketahanan dan pemerhatian.
no: Solid kunnskap om ASP.NET Core og EF Core. Noen mangler i resiliensmønstre og observerbarhet.
pl: Solidna wiedza o ASP.NET Core i EF Core. Pewne braki w zakresie wzorców odporności i obserwowalności.
pt: Conhecimento sólido em ASP.NET Core e EF Core. Algumas lacunas nos padrões de resiliência e observabilidade.
ru: Хорошее знание ASP.NET Core и EF Core. Некоторые пробелы в паттернах устойчивости и наблюдаемости.
sv: Solid kunskap om ASP.NET Core och EF Core. Vissa luckor i motståndskraftsmönster och observationbarhet.
th: มีความรู้ที่แน่นใน ASP.NET Core และ EF Core แต่มีบางจุดที่ขาดด้านรูปแบบการทนทาน (resiliency patterns) และการสังเกตการณ์ (observability)
tr: ASP.NET Core ve EF Core konusunda sağlam bilgi. Dayanıklılık desenleri ve gözlemlenebilirlik konularında bazı eksiklikler.
uk: Міцні знання ASP.NET Core та EF Core. Деякі прогалини у патернах стійкості та спостережуваності.
vi: Kiến thức vững chắc về ASP.NET Core và EF Core. Một số thiếu sót về mẫu sự bền bỉ và khả năng quan sát.

source: Something went wrong while generating more lessons. Please try again later.
ar: حدث خطأ ما أثناء إنشاء المزيد من الدروس. يرجى المحاولة مرة أخرى في وقت لاحق.
be: Неўдалася стварыць больш урокаў. Калі ласка, паспрабуйце яшчэ раз пазней.
da: Noget gik galt under genereringen af flere lektioner. Prøv venligst igen senere.
de: Etwas ist schief gelaufen bei der Generierung weiterer Lektionen. Bitte versuchen Sie es später erneut.
es: Algo salió mal mientras se generaban más lecciones. Por favor, inténtelo de nuevo más tarde.
fr: Quelque chose a mal tourné lors de la génération de plus de leçons. Veuillez réessayer plus tard.
id: Terjadi kesalahan saat menghasilkan lebih banyak pelajaran. Silakan coba lagi nanti.
it: Qualcosa è andato storto durante la generazione di ulteriori lezioni. Per favore, riprova più tardi.
ja: レッスンの追加生成中に何か問題が発生しました。後でもう一度お試しください。
ms: Sesuatu telah berlaku salah semasa menjana lebih banyak pelajaran. Sila cuba lagi kemudian.
no: Noe gikk galt da flere leksjoner ble generert. Vennligst prøv igjen senere.
pl: Wystąpił błąd podczas generowania więcej lekcji. Proszę spróbować ponownie później.
pt: Algo deu errado ao gerar mais lições. Por favor, tente novamente mais tarde.
ru: Что-то пошло не так при создании дополнительных уроков. Пожалуйста, попробуйте снова позже.
sv: Något gick fel vid generering av fler lektioner. Var vänlig försök igen senare.
th: เกิดข้อผิดพลาดขณะสร้างบทเรียนเพิ่มเติม กรุณาลองใหม่ภายหลัง
tr: Daha fazla ders oluşturulurken bir şeyler yanlış gitti. Lütfen daha sonra tekrar deneyin.
uk: Сталася помилка під час генерації додаткових уроків. Будь ласка, спробуйте ще раз пізніше.
vi: Đã xảy ra lỗi trong quá trình tạo thêm bài học. Vui lòng thử lại sau.

source: Sorry for that, but AI costs money... Unfortunately... But you can buy a short-term period to try the app and decide if it fits your needs.
uk: На жаль, AI коштує грошей... На жаль... Але ви можете купити короткостроковий період, щоб спробувати застосунок і вирішити, чи підходить він вам.

source: Sorry, there is no daily question available for today. Please check back tomorrow!
id: Maaf, tidak ada pertanyaan harian tersedia untuk hari ini. Silakan periksa kembali besok!
it: Mi dispiace, non ci sono domande giornaliere disponibili per oggi. Si prega di ricontrollare domani!
ja: 申し訳ありませんが、本日利用可能なデイリークエスチョンはありません。明日またチェックしてください！
no: Beklager, det er ingen daglig spørsmål tilgjengelig for i dag. Vennligst sjekk igjen i morgen!
pl: Przepraszamy, dzisiaj nie ma dostępnego pytania dnia. Prosimy sprawdzić jutro!
ru: Извините, на сегодня нет доступного вопроса дня. Пожалуйста, зайдите завтра!
sv: Tyvärr finns det ingen daglig fråga tillgänglig för idag. Vänligen kom tillbaka imorgon!
uk: Вибачте, сьогодні немає доступного щоденного питання. Будь ласка, перевірте завтра!

source: Spanish Learning Plan
ar: خطة التعلم الإسبانية
be: План вучэння іспанскай мовы
da: Spansk Læringsplan
de: Spanisch Lernplan
es: Plan de Aprendizaje de Español
fr: Plan d'apprentissage de l'espagnol
id: Rencana Belajar Spanyol
it: Piano di Apprendimento Spagnolo
ja: スペイン語学習計画
ms: Pelan Pembelajaran Bahasa Sepanyol
no: Spansk Læringsplan
pl: Plan Nauczania Hiszpańskiego
pt: Plano de Aprendizagem de Espanhol
ru: План изучения испанского
sv: Spanska inlärningsplan
th: แผนการเรียนภาษาสเปน
tr: İspanyolca Öğrenme Planı
uk: План навчання іспанської
vi: Kế Hoạch Học Tiếng Tây Ban Nha

source: Speak naturally, without overthinking
ar: تحدث بشكل طبيعي، دون التفكير المفرط
be: Гаварыце натуральна, не перадумваючы занадта шмат
da: Tal naturligt, uden at overtænke det
de: Sprich natürlich, ohne zu viel nachzudenken
es: Habla de manera natural, sin pensarlo demasiado
fr: Parlez naturellement, sans trop réfléchir
id: Berbicaralah secara alami, tanpa berpikir berlebihan
it: Parla in modo naturale, senza pensarci troppo
ja: 自然に話しましょう、深く考えすぎないでください。
no: Snakk naturlig, uten å overtenke
pl: Mów naturalnie, nie myśląc zbytnio
pt: Fale naturalmente, sem pensar demais
ru: Говорите естественно, не задумываясь слишком много
sv: Tala naturligt, utan att överanalysera
th: พูดตามธรรมชาติ โดยไม่ต้องคิดมากเกินไป
tr: Kendi kendinize çok düşünmeden, doğal bir şekilde konuşun
uk: Говоріть природно, не замислюючись занадто.
vi: Nói một cách tự nhiên, đừng suy nghĩ quá nhiều

source: Speaking
ar: التحدث
be: Гаворка
da: Tale
de: Sprechen
es: Hablando
fr: Parler
id: Berbicara
it: Parlare
ja: 話す
ms: Bercakap
no: Snakke
pl: Mówienie
pt: Falar
ru: Говорение
sv: Tala
th: การพูด
tr: Konuşma
uk: Говоріння
vi: Nói chuyện

source: Speaking and writing practice
ar: ممارسة التحدث والكتابة
be: Практыка маўлення і пісьма
da: Tale- og skriveøvelser
de: Sprech- und Schreibübungen
es: Práctica de hablar y escribir
fr: Pratique de la parole et de l'écriture
id: Berlatih berbicara dan menulis
it: Pratica di conversazione e scrittura
ja: スピーキングとライティングの練習
no: Snakke- og skriveøvelse
pl: Ćwiczenia w mówieniu i pisaniu
pt: Prática de fala e escrita
ru: Практика говорения и письма
sv: Tal- och skrivövningar
th: ฝึกฝนการพูดและการเขียน
tr: Konuşma ve yazma pratiği
uk: Практика говоріння та письма
vi: Luyện tập nói và viết

source: Speaking practice
ar: ممارسة التحدث
be: Практыка маўлення
da: Taleøvelse
de: Sprechübung
es: Práctica de conversación
fr: Pratique de la parole
id: Latihan berbicara
it: Pratica di conversazione
ja: スピーキング練習
no: Snakkeøvelse
pl: Ćwiczenie mówienia
pt: Prática de fala
ru: Практика устной речи
sv: Talövning
th: การฝึกพูด
tr: Konuşma pratiği
uk: Практика розмовної мови
vi: Luyện nói

source: Speaking with a Psychologist
ar: التحدث مع طبيب نفسي
be: Гаворка з псіхалогам
da: At tale med en psykolog
de: Sprechen mit einem Psychologen
es: Hablar con un Psicólogo
fr: Parler avec un Psychologue
id: Berbicara dengan Seorang Psikolog
it: Parlare con uno Psicologo
ja: 心理学者との対話
ms: Bercakap dengan seorang Psikolog
no: Å snakke med en psykolog
pl: Rozmowa z psychologiem
pt: Conversando com um Psicólogo
ru: Общение с психологом
sv: Prata med en psykolog
th: การพูดคุยกับนักจิตวิทยา
tr: Bir Psikolog ile Konuşma
uk: Говоріння з психологом
vi: Nói chuyện với một Nhà tâm lý học

source: speculative fiction
ar: خيال تكهني
be: спекулятыўная фантастыка
da: spekulativ fiktion
de: spekulative Fiktion
es: ficción especulativa
fr: fiction spéculative
id: fiksi spekulatif
it: fiction speculativa
ja: 推理フィクション
ms: fiksyen spekulatif
no: spekulativ fiksjon
pl: spekulatywna fikcja
pt: ficção especulativa
ru: спекулятивная фантастика
sv: spekulativ fiktion
th: นิยายเชิงคาดการณ์
tr: spekülatif kurgu
uk: спекулятивна фантастика
vi: tiểu thuyết suy đoán

source: Stand out in behavioral rounds
ar: تميز في جولات السلوك
be: Выдзяляйцеся ў паводзінкавых раўндах
da: Skil dig ud i adfærdsmæssige runder
de: Heben Sie sich in Verhaltensrunden ab
es: Destaca en las rondas de comportamiento
fr: Sortez du lot lors des tours de comportement
id: Berdiri Keluar dalam Putaran Perilaku
it: Distinguersi nei colloqui comportamentali
ja: 行動ラウンドで目立つ
ms: Menonjol dalam pusingan tingkah laku
no: Skil deg ut i atferdsrunder
pl: Wyróżnij się w rundach behawioralnych
pt: Destaque-se nas rodadas comportamentais
ru: Выделяйтесь на поведенческих собеседованиях
sv: Stick ut i beteendeomgångar
th: โดดเด่นในการสัมภาษณ์แบบพฤติกรรม
tr: Davranışsal mülakat turlarında öne çıkın
uk: Виділяйтеся на поведінкових раундах
vi: Nổi bật trong các vòng phỏng vấn hành vi

source: Stars
ar: النجوم
be: Зоркі
da: Stjerner
de: Sterne
es: Estrellas
fr: Étoiles
id: Bintang
it: Stelle
ja: スターズ
ms: Bintang-bintang
no: Stjerner
pl: Gwiazdy
pt: Estrelas
ru: Звезды
sv: Stjärnor
th: ดาว
tr: Yıldızlar
uk: Зірки
vi: Ngôi sao

source: Start
ar: ابدأ
be: Пачаць
es: Inicio
fr: Démarrer
id: Mulai
it: Inizio
ja: 開始
ms: Mula
pt: Iniciar
ru: Начать
th: เริ่มต้น
tr: Başla
uk: Почати
vi: Bắt đầu

source: Start a call
id: Mulai panggilan
it: Avvia una chiamata
ja: 通話を開始
no: Start en samtale
pl: Rozpocznij rozmowę
ru: Начать звонок
sv: Starta ett samtal
uk: Розпочати дзвінок

source: Start a casual call to practice your communication skills. This is a no-strings-attached conversation if you'd like to chat in a casual setting.
id: Mulai panggilan santai untuk melatih keterampilan komunikasi Anda. Ini adalah percakapan tanpa ikatan jika Anda ingin mengobrol dalam suasana santai.
it: Avvia una chiamata informale per esercitare le tue capacità comunicative. Questa è una conversazione senza impegno se desideri chiacchierare in un contesto informale.
ja: カジュアルな通話を始めて、コミュニケーションスキルを練習しましょう。気軽に会話したい場合の拘束のない会話です。
no: Start en uformell samtale for å øve på dine kommunikasjonsevner. Dette er en samtale uten forpliktelser hvis du ønsker å chatte i en uformell setting.
pl: Rozpocznij swobodną rozmowę, aby ćwiczyć swoje umiejętności komunikacyjne. Jest to niezobowiązująca rozmowa, jeśli chcesz porozmawiać w luźnym otoczeniu.
ru: Начните непринужденный разговор, чтобы практиковать свои навыки общения. Это непринужденная беседа без обязательств, если вы хотите поболтать в неформальной обстановке.
sv: Starta ett informellt samtal för att öva dina kommunikationsfärdigheter. Detta är ett kravlöst samtal om du vill prata i en avslappnad miljö.
uk: Почніть невимушений дзвінок, щоб попрактикувати свої навички спілкування. Це розмова без зобов'язань, якщо ви хочете поспілкуватися у невимушеній обстановці.

source: Start a mock interview
ar: ابدأ مقابلة وهمية
be: Пачаць імітацыйнае сумоўе
da: Start en mock-interview
de: Starte ein Vorstellungsrollenspiel
es: Iniciar una entrevista simulada
fr: Démarrer une simulation d'entretien
id: Mulai wawancara tiruan
it: Inizia un'intervista simulata
ja: 模擬面接を開始する
no: Begynn en imitasjonsintervju
pl: Rozpocznij próbny wywiad
pt: Iniciar uma simulação de entrevista
ru: Начать пробное интервью
sv: Starta en praktikintervju
th: เริ่มสัมภาษณ์จำลอง
tr: Bir deneme mülakatı başlat
uk: Розпочати пробну співбесіду
vi: Bắt đầu một buổi phỏng vấn giả định

source: Start Call
ar: ابدأ المكالمة
be: Пачаць званок
da: Start opkald
de: Anruf starten
es: Iniciar llamada
fr: Commencer l'appel
id: Mulai Panggilan
it: Avvia Chiamata
ja: plaintext 通話開始
no: Start samtale
pl: Rozpocznij rozmowę
pt: Iniciar Chamada
ru: Начать звонок
sv: Starta samtal
th: เริ่มการโทร
tr: Çağrıyı Başlat
uk: Запустити дзвінок
vi: Bắt đầu cuộc gọi

source: Start Debate
ar: ابدأ النقاش
be: Пачаць Дэбаты
da: Start debat
de: Debatte beginnen
es: Iniciar debate
fr: Commencer le débat
id: Mulai Debat
it: Avvia Dibattito
ja: ディベートを開始
no: Start debatt
pl: Rozpocznij debatę
pt: Iniciar Debate
ru: Начать дебаты
sv: Starta Debatt
th: เริ่มดีเบต
tr: Tartışmayı Başlat
uk: Розпочати дебати
vi: Khởi động Tranh luận

source: Start game
id: Mulai permainan
it: Inizia gioco
ja: ゲーム開始
no: Start spill
ru: Начать игру
uk: Почати гру

source: Start Learning
ar: ابدأ التعلم
be: Пачаць навучанне
da: Start med at lære
de: Beginnen Sie zu lernen
es: Comienza a Aprender
fr: Commencer à Apprendre
id: Mulai Belajar
it: Inizia a Imparare
ja: 学習を始める
ms: Mula Belajar
no: Start Læring
pl: Rozpocznij naukę
pt: Comece a Aprender
ru: Начать обучение
sv: Börja Lära Dig
th: เริ่มการเรียนรู้
tr: Öğrenmeye Başla
uk: Почніть навчання
vi: Bắt Đầu Học

source: Start Learning Now
ar: ابدأ التعلم الآن
be: Пачаць навучанне зараз
da: Start med at lære nu
de: plaintext Jetzt mit dem Lernen beginnen
es: Comienza a Aprender Ahora
fr: Commencez à apprendre maintenant
id: Mulai Belajar Sekarang
it: Inizia a Imparare Adesso
ja: 今すぐ学び始める
ms: Mula Belajar Sekarang
no: Begynn å lære nå
pl: Rozpocznij naukę teraz
pt: Comece a Aprender Agora
ru: Начните учиться сейчас
sv: Börja Lära nu
th: เริ่มการเรียนรู้ตอนนี้
tr: Şimdi Öğrenmeye Başla
uk: Почніть вчитися зараз
vi: Bắt đầu học ngay bây giờ

source: Start Lesson
es: Iniciar lección
id: Mulai Pelajaran
it: Inizia Lezione
ja: レッスンを開始
no: Start leksjon
pl: Rozpocznij lekcję
pt: Iniciar Aula
ru: Начать урок
sv: Starta lektion
uk: Розпочати урок

source: Start Monthly Plan
ar: ابدأ الخطة الشهرية
be: Пачаць штомесячны план
da: Start månedlig plan
de: Beginne Monatsplan
es: Comenzar Plan Mensual
fr: Démarrer le forfait mensuel
id: Mulai Paket Bulanan
it: Inizia il Piano Mensile
ja: 月額プランを開始
no: Start månedlig plan
pl: Rozpocznij miesięczny plan
pt: Iniciar Plano Mensal
ru: Начать ежемесячный план
sv: Starta Månadsplan
th: เริ่มแผนรายเดือน
tr: Aylık Planı Başlat
uk: Розпочати Місячний План
vi: Bắt đầu Kế hoạch Hàng tháng

source: Start Practicing
ar: ابدأ الممارسة
be: Пачаць практыкавацца
da: Begynd at Øve
de: Mit dem Üben beginnen
es: Comienza a Practicar
fr: Commencer à pratiquer
id: Mulai Berlatih
it: Inizia a Praticare
ja: 練習を始める
ms: Mula Berlatih
no: Start Øving
pl: Rozpocznij praktykę
pt: Comece a Praticar
ru: Начать практику
sv: Börja öva
th: เริ่มฝึกฝน
tr: Alıştırmaya Başla
uk: Почати практикуватися
vi: Bắt đầu Luyện tập

source: Start Speaking
es: Empieza a Hablar
id: Mulai Berbicara
it: Inizia a Parlare
ja: 話し始める
ms: Mula Bercakap
no: Begynn å snakke
pl: Zacznij Mówić
pt: Iniciar Fala
ru: Начать говорить
sv: Börja Tala
uk: Почати говорити

source: Start speaking practice
ar: ابدأ ممارسة التحدث
be: Пачаць практыку размовы
da: Start taletræning
de: Beginnen Sie mit der Sprachübung
es: Comienza la práctica de conversación
fr: Commencez la pratique de la parole
id: Mulai latihan berbicara
it: Inizia la pratica di conversazione
ja: 音声練習を開始
no: Begynn taletrening
pl: Rozpocznij praktykę mówienia
pt: Iniciar prática de conversação
ru: Начать практику разговорной речи
sv: Börja talövning
th: เริ่มการฝึกพูด
tr: Konuşma pratiğine başla
uk: Розпочати практику мовлення
vi: Bắt đầu thực hành nói

source: Start Speaking Practice
ar: ابدأ ممارسة التحدث
be: Пачніце практыку маўлення
da: Start Taletræning
de: Starten Sie die Sprechübung
es: Comenzar la Práctica de Habla
fr: Commencer la pratique de la parole
id: Mulai Latihan Berbicara
it: Inizia la Pratica di Conversazione
ja: 話す練習を始める
ms: Mulakan Latihan Berbicara
no: Start Snakkeforøvelse
pl: Rozpocznij praktykę mówienia
pt: Comece a Prática de Fala
ru: Начать практику разговора
sv: Starta talövning
th: เริ่มฝึกพูด
tr: Konuşma Pratiğine Başla
uk: Почніть практику розмови
vi: Bắt đầu thực hành nói chuyện

source: Start Test
ar: ابدأ الاختبار
be: Пачаць тэст
es: Iniciar prueba
fr: Démarrer le test
id: Mulai Tes
it: Inizia Test
ja: テストを開始
ms: Mula Ujian
no: plaintext Start Test ```
pl: Rozpocznij Test
pt: Iniciar Teste
ru: Начать тест
sv: Börja test
th: เริ่มทดสอบ
tr: Testi Başlat
uk: Почати тест
vi: Bắt đầu Kiểm tra

source: Start Turn
id: Mulai Giliran
it: Inizio Turno
ja: ターン開始
ru: Начать ход
uk: Почати хід

source: Start using the app
uk: Почати використовувати додаток
