Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Success!
ar: نجاح!
be: Поспех!
da: Succes!
de: Erfolg!
es: ¡Éxito!
fr: Succès !
id: Sukses!
it: Successo!
ja: 成功！
ms: Kejayaan!
no: Suksess!
pl: Sukces!
pt: Sucesso!
ru: Успех!
sv: Framgång!
th: สำเร็จ!
tr: Başarılı!
vi: Thành công!

source: Thank you for your purchase. Your subscription is now active.
id: Terima kasih atas pembelian Anda. Langganan Anda sekarang aktif.
it: Grazie per il tuo acquisto. Il tuo abbonamento è ora attivo.
ja: ご購入ありがとうございます。ご契約は現在アクティブです。
no: Takk for ditt kjøp. Abonnementet ditt er nå aktivt.
pl: Dziękujemy za zakup. Twoja subskrypcja jest teraz aktywna.
ru: Спасибо за ваш покупку. Ваша подписка теперь активна.
sv: Tack för ditt köp. Din prenumeration är nu aktiv.

source: The Controller of the data entered into the form is Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". The data will be processed in order to provide the service and for marketing purposes – in the case of consent. We would like to inform you about the possibility of withdrawing your consent. For full information on data processing and your rights, see the
ar: مراقب البيانات المدخلة في النموذج هو Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". سيتم معالجة البيانات لتقديم الخدمة ولأغراض التسويق - في حالة الحصول على الرضا. نود أن نبلغك عن إمكانية سحب موافقتك. للحصول على معلومات كاملة عن معالجة البيانات وحقوقك ، انظر إلى
be: Кантролерам дадзеных, уведзеных у форму, з'яўляецца Фундацыя распрацоўкі прадпрыемства "Твой StartUp". Дадзеныя будуць апрацаваны для таго, каб прадастаўляць паслугу і для маркетынгавых мэтаў - у выпадку згоды. Хацелі б апавясціць вас аб магчымасці адклікаць сваю згоду. За поўнай інфармацыяй аб апрацоўцы дадзеных і вашых правах глядзіце
da: Kontrolløren af data indtastet i formularen er Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Data vil blive behandlet for at kunne levere tjenesten og til markedsføringsformål - i tilfælde af samtykke. Vi vil gerne informere dig om muligheden for at trække dit samtykke tilbage. For komplet information om databehandling og dine rettigheder, se
de: Der Kontrolleur der in das Formular eingegebenen Daten ist die Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Die Daten werden verarbeitet, um den Dienst zur Verfügung zu stellen und für Marketingzwecke - im Falle der Zustimmung. Wir möchten Sie über die Möglichkeit des Widerrufs Ihrer Zustimmung informieren. Für vollständige Informationen zur Datenverarbeitung und Ihren Rechten, sehen Sie bitte die
es: El Controlador de los datos ingresados en el formulario es Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Los datos serán procesados con el fin de proporcionar el servicio y para fines de marketing, en caso de consentimiento. Nos gustaría informarle sobre la posibilidad de retirar su consentimiento. Para obtener información completa sobre el procesamiento de datos y sus derechos, consulte la
fr: Le contrôleur des données entrées dans le formulaire est la Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Les données seront traitées afin de fournir le service et à des fins marketing - en cas de consentement. Nous tenons à vous informer de la possibilité de retirer votre consentement. Pour une information complète sur le traitement des données et vos droits, consultez la
id: Pengendali data yang dimasukkan ke dalam formulir adalah Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Data akan diproses untuk menyediakan layanan dan untuk tujuan pemasaran - dalam kasus persetujuan. Kami ingin memberi tahu Anda tentang kemungkinan penarikan persetujuan Anda. Untuk informasi lengkap tentang pemrosesan data dan hak Anda, lihat
it: Il responsabile dei dati inseriti nel modulo è Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". I dati verranno trattati al fine di fornire il servizio e per scopi di marketing - nel caso di consenso. Vorremmo informarvi sulla possibilità di ritirare il vostro consenso. Per informazioni complete sul trattamento dei dati e i vostri diritti, consultate il
ja: フォームに入力されたデータの管理者はFundacja Rozwoju Przedsiębiorczości "Twój StartUp"です。入力されたデータは、サービス提供とマーケティング目的のために処理されます - 同意の場合に限ります。あなたが同意を取り消す可能性についてお知らせしたいと考えています。データ処理とあなたの権利についての詳細情報は、以下をご覧ください
ms: Pengawal data yang dimasukkan ke dalam borang adalah Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Data akan diproses untuk menyediakan perkhidmatan dan untuk tujuan pemasaran – dalam kes persetujuan. Kami ingin memberi tahu anda tentang kemungkinan menarik balik persetujuan anda. Untuk maklumat penuh mengenai pemprosesan data dan hak anda, sila lihat
no: Kontrolleren av dataene som er lagt inn i skjemaet er Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Dataene vil bli behandlet for å tilby tjenesten og for markedsføringsformål - i tilfelle samtykke. Vi ønsker å informere deg om muligheten for å trekke tilbake ditt samtykke. For fullstendig informasjon om databehandling og dine rettigheter, se
pl: Kontrolerem danych wprowadzanych do formularza jest Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Dane będą przetwarzane w celu świadczenia usługi oraz w celach marketingowych - w przypadku udzielenia zgody. Chcielibyśmy poinformować o możliwości wycofania zgody. Pełne informacje na temat przetwarzania danych i Twoich praw znajdziesz w
pt: O Controlador dos dados inseridos no formulário é a Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Os dados serão processados para fornecer o serviço e para fins de marketing – no caso de consentimento. Gostaríamos de informá-lo sobre a possibilidade de retirar o seu consentimento. Para informações completas sobre o processamento de dados e seus direitos, consulte o
ru: Контролером данных, введенных в форму, является Фундация Развития Предпринимательства "Twój StartUp". Данные будут обрабатываться в целях предоставления услуги и для маркетинговых целей - в случае согласия. Мы хотели бы сообщить вам о возможности отказа от вашего согласия. Для полной информации об обработке данных и ваших правах, см.
sv: Den Ansvarige för de uppgifter som anges i formuläret är Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Uppgifterna kommer att behandlas i syfte att tillhandahålla tjänsten och för marknadsföringsändamål – i händelse av samtycke. Vi vill informera om möjligheten att dra tillbaka ditt samtycke. För fullständig information om databehandling och dina rättigheter, se
th: ผู้ควบคุมข้อมูลที่ป้อนเข้าไปในแบบฟอร์มคือ Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". ข้อมูลจะถูกประมวลผลเพื่อให้บริการและเพื่อวัตถุประสงค์ทางการตลาด - ในกรณีที่ได้รับความยินยอม ซึ่งเราต้องการแจ้งให้ทราบเกี่ยวกับความเป็นไปได้ในการถอนความยินยอมของคุณสำหรับข้อมูลการประมวลผลทั้งหมดและสิทธิของคุณ โปรดดูที่
tr: Forma girilen verilerin İşlemcisi, Fundacja Rozwoju Przedsiębiorczości "Twój StartUp"tır. Veriler, hizmeti sağlamak ve pazarlama amacıyla işlenecektir - rıza durumunda. Rızanızı çekme olasılığı hakkında sizi bilgilendirmek isteriz. Veri işleme ve haklarınızla ilgili tam bilgi için, lütfen bakınız
vi: Người điều khiển dữ liệu nhập vào biểu mẫu là Fundacja Rozwoju Przedsiębiorczości "Twój StartUp". Dữ liệu sẽ được xử lý để cung cấp dịch vụ và cho mục đích tiếp thị – trong trường hợp bạn đồng ý. Chúng tôi muốn thông báo cho bạn về khả năng rút lại sự đồng ý của bạn. Để biết thông tin đầy đủ về quá trình xử lý dữ liệu và quyền lợi của bạn, hãy xem

source: Total used:
ar: المجموع المستخدم:
be: Агульнае выкарыстанае:
da: Total brugt:
de: Insgesamt verwendet:
es: Total utilizado:
fr: Total utilisé:
id: Total digunakan:
it: Totale utilizzato:
ja: 合計使用量:
ms: Jumlah digunakan:
no: Totalt brukt:
pl: Całkowicie używane:
pt: Total usado:
ru: Всего использовано:
sv: Totalt använd:
th: ทั้งหมดที่ใช้:
tr: Toplam kullanılan:
vi: Tổng đã sử dụng:

source: TypeScript
ar: تايب سكريبت
id: Jenis Skrip
ja: タイプスクリプト
ms: Jenis Skrip
ru: Тайпскрипт

source: Upgrade your plan to unlock unlimited conversations.
ar: قم بترقية خطتك لفتح محادثات غير محدودة.
be: Абнавіце свой план, каб разблакаваць неабмежаваныя размовы.
da: Opgrader din plan for at låse op for ubegrænsede samtaler.
de: Aktualisieren Sie Ihren Plan, um unbegrenzte Gespräche freizuschalten.
es: Actualiza tu plan para desbloquear conversaciones ilimitadas.
fr: Mettez à niveau votre plan pour débloquer des conversations illimitées.
id: Tingkatkan paket Anda untuk membuka percakapan tanpa batas.
it: Aggiorna il tuo piano per sbloccare conversazioni illimitate.
ja: プランをアップグレードして無制限の会話を解放しましょう。
no: Oppgrader planen din for å låse opp ubegrensede samtaler.
pl: Zaktualizuj swój plan, aby odblokować nieograniczoną liczbę rozmów.
pt: Atualize seu plano para desbloquear conversas ilimitadas.
ru: Обновите свой план, чтобы разблокировать неограниченные разговоры.
sv: Uppgradera din plan för att låsa upp obegränsade konversationer.
th: อัปเกรดแผนของคุณเพื่อปลดล็อกการสนทนาไม่จำกัด
tr: Planınızı yükselterek sınırsız konuşmaların kilidini açın.
vi: Nâng cấp gói của bạn để mở khóa cuộc hội thoại không giới hạn.

source: Using real-time microphone is a premium feature. Please upgrade your plan to access this feature or use recorded audio.
ar: استخدام الميكروفون في الوقت الفعلي هو ميزة حصرية. يرجى ترقية خطتك للوصول إلى هذه الميزة أو استخدام صوت مسجل.
be: Выкарыстанне мікрафона ў рэжыме рэальнага часу з'яўляецца прэміум функцыяй. Калі ласка, абнавіце свой план, каб атрымаць доступ да гэтай функцыі або выкарыстоўвайце запісаны аўдыё.
da: Brug af realtidsmikrofon er en premium-funktion. Opgrader venligst din plan for at få adgang til denne funktion eller brug optaget lyd.
de: Die Verwendung des Echtzeit-Mikrofons ist eine Premium-Funktion. Bitte upgraden Sie Ihren Plan, um auf diese Funktion zuzugreifen, oder verwenden Sie aufgezeichnetes Audio.
es: Usar el micrófono en tiempo real es una función premium. Por favor, actualice su plan para acceder a esta función o utilice audio grabado.
fr: L'utilisation du microphone en temps réel est une fonctionnalité premium. Veuillez mettre à niveau votre plan pour accéder à cette fonctionnalité ou utilisez l'audio enregistré.
id: Penggunaan mikrofon real-time adalah fitur premium. Silakan tingkatkan rencana Anda untuk mengakses fitur ini atau gunakan audio yang direkam.
it: L'utilizzo del microfono in tempo reale è una funzione premium. Per accedere a questa funzione, si prega di aggiornare il proprio piano o utilizzare audio registrato.
ja: リアルタイムマイクの使用はプレミアム機能です。この機能にアクセスするためには、プランをアップグレードするか録音済みのオーディオを使用してください。
no: Bruk av sanntidsmikrofon er en premiumfunksjon. Vennligst oppgrader planen din for å få tilgang til denne funksjonen eller bruk innspilt lyd.
pl: Korzystanie z mikrofonu w czasie rzeczywistym jest funkcją premium. Proszę zaktualizować swój plan, aby uzyskać dostęp do tej funkcji lub użyć nagranego dźwięku.
pt: Usar o microfone em tempo real é um recurso premium. Por favor, atualize seu plano para acessar esse recurso ou use áudio gravado.
ru: Использование микрофона в реальном времени является премиум-функцией. Пожалуйста, обновите свой план, чтобы получить доступ к этой функции или используйте записанное аудио.
sv: Att använda mikrofonen i realtid är en premiumfunktion. Vänligen uppgradera din plan för att få tillgång till denna funktion eller använd inspelat ljud.
th: การใช้ไมโครโฟนแบบเรียลไทม์เป็นฟีเจอร์พิเศษ กรุณาอัปเกรดแผนของคุณเพื่อเข้าถึงฟีเจอร์นี้หรือใช้เสียงที่บันทึกไว้
tr: Gerçek zamanlı mikrofon kullanımı premium bir özelliktir. Bu özelliğe erişmek için lütfen planınızı yükseltin veya kaydedilmiş sesi kullanın.
vi: Việc sử dụng micro thời gian thực là một tính năng cao cấp. Vui lòng nâng cấp kế hoạch của bạn để truy cập tính năng này hoặc sử dụng âm thanh đã ghi.

source: We don't have investors. In some ways, that's a disadvantage — with investor money, we could buy ads, for example. But I really like the feeling of freedom. I like that no one demands the service make money or "pay back" investments. So I hope we never have investors. Freedom matters more.
ja: 投資家はいません。ある意味では、それは不利です。投資家の資金があれば、例えば広告を購入することができるでしょう。でも、私は自由な感じが本当に好きです。誰もがサービスに利益を上げることや投資の「回収」を要求しないことが気に入っています。だから、私は決して投資家を持たないことを望んでいます。自由がより重要です。

source: We don't have subscriptions — and I hope we never will. You buy access for a fixed period of time, and then you can extend it if you want.
ja: 購読制はありません ― 今後も導入したくありません。一定期間のアクセス権を購入し、必要であれば延長することができます。

source: We have a community where you can talk about different topics and share what's on your mind.
ja: 私たちには、さまざまなトピックについて話したり、あなたの考えを共有したりすることができるコミュニティがあります。

source: What one hour means?
ar: ماذا يعني الساعة الواحدة؟
be: Што азначае адзін гадзіна?
da: Hvad betyder en time?
de: Was bedeutet eine Stunde?
es: ¿Qué significa una hora?
fr: Que signifie une heure ?
id: Apa arti satu jam?
it: Cosa significa un'ora?
ja: 1時間とは何を意味しますか？
ms: Apa maksud satu jam?
no: Hva betyr en time?
pl: Co oznacza jedna godzina?
pt: O que significa uma hora?
ru: Что значит один час?
sv: Vad betyder en timme?
th: หมายความว่าอะไรคือหนึ่งชั่วโมง?
tr: Bir saat ne anlama gelir?
vi: Đồng nghĩa với một giờ là gì?

source: What's included?
ar: ما الذي يتضمن؟
be: Што ўключана?
da: Hvad er inkluderet?
de: Was ist inbegriffen?
es: ¿Qué está incluido?
fr: Qu'est-ce qui est inclus ?
id: Apa yang termasuk?
it: Cosa è incluso?
ja: 何が含まれていますか？
ms: Apa yang termasuk?
no: Hva er inkludert?
pl: Co jest zawarte?
pt: O que está incluído?
ru: Что включено?
sv: Vad ingår?
th: อะไรบ้างที่รวมอยู่ในนั้น?
tr: Neler dahil?
vi: Điều gì được bao gồm?

source: You only charged for when AI is actively working: speaking or analyzing your speech.
ar: تتم الرسوم فقط عندما تكون الذكاء الصناعي في حالة عمل فعالة: الكلام أو تحليل خطابك.
be: Вы плаціце толькі за тое, калі AI актыўна працуе: гаворыць або аналізуе вашу мову.
da: Du betaler kun når AI aktivt arbejder: taler eller analyserer din tale.
de: Sie werden nur dann berechnet, wenn die KI aktiv arbeitet: spricht oder Ihre Sprache analysiert.
es: Solo se le cobra cuando la IA está trabajando activamente: hablando o analizando su discurso.
fr: Vous n'êtes facturé que lorsque l'IA travaille activement : en parlant ou en analysant votre discours.
id: Anda hanya dikenakan biaya saat AI sedang aktif bekerja: berbicara atau menganalisis pidato Anda.
it: Verrai addebitato solo quando l'IA è attivamente al lavoro: parlando o analizzando il tuo discorso.
ja: AIが積極的に働いている時だけ課金されます：話すか、あなたの発言を分析する時です。
ms: Anda hanya dikenakan caj bila AI sedang aktif bekerja: berbicara atau menganalisis ucapan anda.
no: Du belastes bare når AI er aktivt i arbeid: snakker eller analyserer talen din.
pl: Płacisz tylko wtedy, gdy AI jest aktywnie pracujące: mówi lub analizuje twoją mowę.
pt: Você só é cobrado quando a IA está trabalhando ativamente: falando ou analisando sua fala.
ru: Вы платите только за активную работу AI: когда он говорит или анализирует вашу речь.
sv: Du debiteras endast när AI aktivt arbetar: talar eller analyserar ditt tal.
th: คุณจะถูกเรียกเก็บเงินเฉพาะเมื่อ AI ทำงานอย่างใช้งานอย่างแท้จริง: พูดหรือวิเคราะห์การพูดของคุณ.
tr: Yalnızca AI aktif olarak çalışırken ücretlendirilirsiniz: konuşurken veya konuşmanızı analiz ederken.
vi: Bạn chỉ phải trả phí khi AI đang hoạt động tích cực: nói chuyện hoặc phân tích lời nói của bạn.

source: Your payment was successful, but updates might take a few minutes
ar: تم الدفع بنجاح، لكن التحديثات قد تستغرق بضع دقائق
be: Ваш плацёж пройшоў паспяхова, але абнаўленні могуць займаць некалькі хвілін
da: Din betaling var vellykket, men opdateringer kan tage et par minutter
de: Ihre Zahlung war erfolgreich, aber Aktualisierungen könnten einige Minuten dauern
es: Su pago fue exitoso, pero las actualizaciones pueden tardar unos minutos
fr: Votre paiement a été réussi, mais les mises à jour pourraient prendre quelques minutes
id: Pembayaran Anda telah berhasil, tetapi pembaharuan mungkin memerlukan beberapa menit
it: Il tuo pagamento è stato eseguito con successo, ma gli aggiornamenti potrebbero richiedere alcuni minuti
ja: お支払いは成功しましたが、更新には数分かかるかもしれません
ms: Pembayaran anda berjaya, tetapi kemas kini mungkin memerlukan beberapa minit
no: Betalingen din var vellykket, men oppdateringer kan ta noen minutter
pl: Twoja płatność została zrealizowana pomyślnie, ale aktualizacje mogą potrwać kilka minut
pt: O seu pagamento foi bem sucedido, mas as atualizações podem levar alguns minutos
ru: Ваш платеж был успешным, но обновления могут занять несколько минут
sv: Din betalning var framgångsrik, men uppdateringar kan ta några minuter
th: การชำระเงินของคุณสำเร็จแล้ว แต่อัปเดตอาจใช้เวลาสักครู่
tr: Ödemeniz başarılı oldu, ancak güncellemeler birkaç dakika sürebilir
vi: Thanh toán của bạn đã thành công, nhưng việc cập nhật có thể mất vài phút

source: | FluencyPal
ar: | فلوينسي بال
da: | FlydendighedsPal
ja: | フルエンシーパル
sv: | FlytPal
tr: | AkıcılıkPal

source: FAQ
ar: أسئلة متكررة
be: ЧАП
ms: Soalan Lazim
ru: Часто задаваемые вопросы
th: คำถามที่พบบ่อย
tr: Sıkça Sorulan Sorular
vi: Câu hỏi thường gặp

source: Feel free to reach out to me with any questions or feedback. I'm always happy to help!
ar: لا تتردد في الاتصال بي إذا كان لديك أي أسئلة أو ملاحظات. أنا دائمًا سعيد بمساعدتك!
be: Не саромейцеся звяртацца да мяне з любымі пытаннямі ці водгукамі. Я заўсёды рады дапамагчы!
de: Fühlen Sie sich frei, mich mit Fragen oder Feedback zu kontaktieren. Ich helfe Ihnen gerne!
es: Siéntase libre de comunicarse conmigo si tiene alguna pregunta o comentario. ¡Siempre estoy dispuesto a ayudar!
fr: N'hésitez pas à me contacter pour toute question ou retour. Je suis toujours heureux d'aider !
id: Silakan hubungi saya jika Anda memiliki pertanyaan atau masukan. Saya selalu senang untuk membantu!
it: Sentiti libero di contattarmi per qualsiasi domanda o feedback. Sono sempre felice di aiutare!
ms: Sila hubungi saya jika anda mempunyai sebarang soalan atau maklum balas. Saya sentiasa gembira untuk membantu!
pl: Czuj się swobodnie, aby skontaktować się ze mną w razie jakichkolwiek pytań lub uwag. Zawsze chętnie pomogę!
pt: Sinta-se à vontade para entrar em contato comigo com quaisquer perguntas ou feedback. Estou sempre feliz em ajudar!
ru: Не стесняйтесь обращаться ко мне с любыми вопросами или отзывами. Я всегда рад помочь!
sv: Känn dig fri att kontakta mig med eventuella frågor eller feedback. Jag hjälper gärna till!
th: รู้สึกฟรีที่จะติดต่อฉันหากมีคำถามหรือข้อเสนอแนะแต่อย่างใด ฉันยินดีที่จะช่วยเสมอ!
tr: Bana herhangi bir sorunuz veya geri bildiriminiz olduğunda ulaşmaktan çekinmeyin. Her zaman yardımcı olmaktan mutluluk duyarım!
vi: Hãy thoải mái liên hệ với tôi nếu bạn có bất kỳ câu hỏi hoặc phản hồi nào. Tôi luôn sẵn sàng giúp đỡ!
