Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Negative comments — Never badmouth past employers. Stay neutral and constructive.
ar: تعليقات سلبية — أبداً لا تسيء إلى أرباب العمل السابقين. كن محايداً وبناءاً.
be: Негатыўныя каментарыі — Ніколі не абкрываеце папярэдніх працадаўцаў. Заставайцеся неўтэчнымі і канструктыўнымі.
da: Negative kommentarer — Tal aldrig dårligt om tidligere arbejdsgivere. Forbliv neutral og konstruktiv.
de: Negative Kommentare — Reden Sie niemals schlecht über ehemalige Arbeitgeber. Bleiben Sie neutral und konstruktiv.
es: Comentarios negativos — Nunca hables mal de tus antiguos empleadores. Mantén la neutralidad y sé constructivo.
fr: Commentaires négatifs — Ne jamais dire du mal des anciens employeurs. Restez neutre et constructif.
id: Komentar negatif — Jangan pernah memburuk-burukkan mantan majikan. Tetap netral dan konstruktif.
it: Commenti negativi — Non parlare mai male dei precedenti datori di lavoro. Rimani neutrale e costruttivo.
ja: ネガティブなコメント — 過去の雇用主を悪口を言うことは絶対に避けましょう。中立的で建設的な姿勢を保ちましょう。
ms: Komen negatif — Jangan pernah mencela bekas majikan. Kekal netral dan konstruktif.
no: Negative kommentarer — Snakk aldri nedsettende om tidligere arbeidsgivere. Hold deg nøytral og konstruktiv.
pl: Negatywne komentarze — Nigdy nie oczerniaj poprzednich pracodawców. Zachowaj neutralność i konstruktywizm.
pt: Comentários negativos — Nunca fale mal de ex-empregadores. Mantenha-se neutro e construtivo.
ru: Негативные комментарии — Никогда не клевещите на своих бывших работодателей. Будьте нейтральны и конструктивны.
sv: Negativa kommentarer — Kritisera aldrig tidigare arbetsgivare. Förbli neutral och konstruktiv.
th: ความคิดเห็นลบ — ไม่ควรพูดเสียดสีนายที่ทำงานล่าสุดของคุณ มองอย่างเป็นกลางและสร้างสรรค์
tr: Olumsuz yorumlar - Asla eski işverenler hakkında kötü konuşmayın. Tarafsız ve yapıcı olun.
uk: Негативні коментарі — Ніколи не зганьблюйте колишніх роботодавців. Будьте нейтральними та конструктивними.
vi: Nhận xét tiêu cực — Đừng bao giờ phê bình nhà tuyển dụng trước đây. Hãy trung lập và xây dựng tích cực.

source: Negotiate senior-level compensation
ar: تفاوض على التعويضات للمستوى التنفيذي
be: Перамовы па кампенсацыі на старэйшым узроўні
da: Forhandle om kompensation på seniorniveau
de: Verhandeln Sie Vergütung auf Führungsebene
es: Negociar compensación a nivel senior
fr: Négocier la rémunération de niveau supérieur
id: Negosiasikan kompensasi tingkat senior
it: Negoziare la retribuzione a livello senior
ja: シニアレベルの報酬を交渉する
ms: Negosiasi pampasan peringkat kanan
no: Forhandle om kompensasjon på seniornivå
pl: Negocjowanie wynagrodzenia na poziomie kierowniczym
pt: Negociar remuneração de nível sênior
ru: Договориться о компенсации для старшего уровня
sv: Förhandla om ersättning på seniornivå
th: เจรจาเรื่องค่าตอบแทนระดับอาวุโส
tr: Üst düzey tazminatı müzakere edin
uk: Вести переговори щодо компенсації на рівні старшого спеціаліста
vi: Đàm phán mức thù lao cho cấp quản lý cao cấp

source: Negotiation practice
ar: التدريب على التفاوض
be: Практыка перамоў
da: Forhandlingsøvelse
de: Verhandlungspraxis
es: Práctica de negociación
fr: Pratique de la négociation
id: Praktik negosiasi
it: Pratica di negoziazione
ja: 交渉の練習
no: Forhandlingsøvelse
pl: Praktyka negocjacji
pt: Prática de negociação
ru: Практика ведения переговоров
sv: Förhandlingsövning
th: การฝึกเจรจาต่อรอง
tr: Müzakere pratiği
uk: Практика ведення переговорів
vi: Thực hành đàm phán

source: Never say “no.” Prepare 2–3 smart questions in advance:
ar: لا تقل أبدًا "لا". قم بتحضير 2-3 أسئلة ذكية مقدمًا:
be: Ніколі не кажыце "не". Падрыхтуйце 2-3 разумныя пытанні наперад:
da: Sig aldrig "nej." Forbered 2-3 smarte spørgsmål på forhånd:
de: Sagen Sie niemals „nein“. Bereiten Sie 2-3 kluge Fragen im Voraus vor:
es: Nunca digas "no". Prepara 2-3 preguntas inteligentes con anticipación:
fr: Ne dites jamais “non.” Préparez 2–3 questions intelligentes à l'avance:
id: Jangan pernah berkata "tidak." Siapkan 2-3 pertanyaan cerdas di muka:
it: Non dire mai "no". Prepara 2-3 domande intelligenti in anticipo:
ja: 「いいえ」とは言わないでください。前もって2-3の賢い質問を準備してください：
ms: Jangan pernah berkata "tidak." Sediakan 2-3 soalan pintar terlebih dahulu:
no: Si aldri "nei." Forbered 2-3 smarte spørsmål på forhånd:
pl: Nigdy nie mów „nie.” Przygotuj 2–3 mądre pytania z wyprzedzeniem:
pt: Nunca diga "não". Prepare 2-3 perguntas inteligentes com antecedência:
ru: Никогда не говорите «нет». Подготовьте заранее 2-3 умных вопроса:
sv: Säg aldrig "nej". Förbered 2-3 smarta frågor i förväg:
th: อย่าเคยพูดว่า "ไม่" เตรียมคำถามที่ฉลาด 2-3 คำล่วงหน้า:
tr: "Asla “hayır” demeyin. Önceden 2-3 akıllı soru hazırlayın:"
uk: Ніколи не говоріть "ні". Підготуйте 2-3 розумні питання заздалегідь:
vi: Đừng bao giờ nói “không.” Chuẩn bị 2-3 câu hỏi thông minh trước:

source: New features & simulations added regularly
ar: ميزات ومحاكاة جديدة تضاف بانتظام
be: Новыя функцыі і мадэляванні дадаюцца рэгулярна
da: Nye funktioner og simuleringer tilføjes regelmæssigt
de: Neue Funktionen und Simulationen werden regelmäßig hinzugefügt.
es: Nuevas funciones y simulaciones añadidas regularmente
fr: Nouvelles fonctionnalités et simulations ajoutées régulièrement
id: Fitur dan simulasi baru ditambahkan secara berkala
it: Nuove funzionalità e simulazioni aggiunte regolarmente
ja: 定期的に新しい機能とシミュレーションが追加されます
no: Nye funksjoner og simuleringer legges til jevnlig
pl: Nowe funkcje i symulacje dodawane regularnie
pt: Novos recursos e simulações adicionados regularmente
ru: Новые функции и симуляции добавляются регулярно
sv: Nya funktioner & simuleringar läggs till regelbundet
th: คุณสมบัติใหม่และการจำลองถูกเพิ่มอย่างสม่ำเสมอ
tr: Yeni özellikler ve simülasyonlar düzenli olarak ekleniyor
uk: Нові функції та симуляції додаються регулярно
vi: Các tính năng và mô phỏng mới được bổ sung thường xuyên

source: New Game
id: Permainan Baru
it: Nuovo Gioco
ja: 新しいゲーム
no: Nytt Spill
ru: Новая игра
uk: Нова гра

source: New Grammar Rules
ar: قواعد النحو الجديدة
be: Новыя граматычныя правілы
da: Nye Grammatikregler
de: Neue Grammatikregeln
es: Nuevas Reglas de Gramática
fr: Nouvelles Règles de Grammaire
id: Aturan Tata Bahasa Baru
it: Nuove Regole di Grammatica
ja: 新しい文法ルール
ms: Peraturan Tatabahasa Baharu
no: Nye grammatikkregler
pl: Nowe Reguły Gramatyki
pt: Novas Regras de Gramática
ru: Новые грамматические правила
sv: Nya Grammatikregler
th: กฎไวยากรณ์ใหม่
tr: Yeni Dilbilgisi Kuralları
uk: Нові граматичні правила
vi: Quy tắc ngữ pháp mới

source: New Words
ar: كلمات جديدة
be: Новыя словы
da: Nye Ord
de: Neue Wörter
es: Nuevas Palabras
fr: Nouveaux Mots
id: Kata Baru
it: Nuove Parole
ja: 新しい単語
ms: Perkataan Baru
no: Nye Ord
pl: Nowe Słowa
pt: Novas Palavras
ru: Новые слова
sv: Nya Ord
th: คำศัพท์ใหม่
tr: Yeni Kelimeler
uk: Нові Слова
vi: Từ mới

source: Next
ar: التالي
be: Далей
da: Næste
de: Nächste
es: Siguiente
fr: Suivant
id: Berikutnya
it: Avanti
ja: 次へ
ms: Seterusnya
no: Neste
pl: Następny
pt: Próximo
ru: Далее
sv: Nästa
th: ถัดไป
tr: İleri
uk: Далі
vi: Tiếp theo

source: Next Lesson
es: Próxima Lección
id: Pelajaran Berikutnya
it: Lezione Successiva
ja: 次のレッスン
no: Neste leksjon
pl: Następna Lekcja
pt: Próxima Lição
ru: Следующий урок
sv: Nästa lektion
uk: Наступний урок

source: Next question
de: Nächste Frage
es: Siguiente pregunta
id: Pertanyaan berikutnya
it: Prossima domanda
ja: 次の質問
no: Neste spørsmål
pl: Następne pytanie
pt: Próxima pergunta
ru: Следующий вопрос
sv: Nästa fråga
th: คำถามถัดไป
tr: Sonraki soru
uk: Наступне запитання
vi: Câu hỏi tiếp theo

source: Next Step
es: Siguiente paso
id: Langkah Berikutnya
it: Prossimo Passo
ja: 次のステップ
no: Neste steg
pl: Następny Krok
pt: Próximo Passo
ru: Следующий шаг
sv: Nästa steg
uk: Наступний крок

source: Next Turn
id: Giliran Berikutnya
it: Prossimo Turno
ja: 次のターン
no: Neste tur
ru: Следующий ход
uk: Наступний Хід

source: No ads, no spam
ar: لا إعلانات، لا بريد مزعج
be: Ніякай рэкламы, ніякага спаму
da: Ingen reklamer, ingen spam
de: Keine Werbung, kein Spam
es: Sin anuncios, sin spam
fr: Pas de publicités, pas de spam
id: Tidak ada iklan, tidak ada spam
it: Nessuna pubblicità, nessun spam
ja: 広告なし、スパムなし
ms: Tiada iklan, tiada spam
no: Ingen annonser, ingen søppelpost
pl: Bez reklam, bez spamu
pt: Sem anúncios, sem spam
ru: Без рекламы, без спама
sv: Inga annonser, inget skräppost
th: ไม่มีโฆษณา, ไม่มีสแปม
tr: Reklam yok, spam yok
uk: Ніякої реклами, ніякого спаму
vi: Không quảng cáo, không thư rác

source: No automatic payment
ar: لا يوجد دفع تلقائي
be: Няма аўтаматычнага аплаты
da: Ingen automatisk betaling
de: Keine automatische Zahlung
es: No pago automático
fr: Aucun paiement automatique
id: Tidak ada pembayaran otomatis
it: Nessun pagamento automatico
ja: 自動支払いなし
ms: Tiada pembayaran automatik
no: Ingen automatisk betaling
pl: Brak automatycznej płatności
pt: Sem pagamento automático
ru: Нет автоматического списания
sv: Ingen automatisk betalning
th: ไม่มีการชำระเงินอัตโนมัติ
tr: Otomatik ödeme yok
uk: Немає автоматичної оплати
vi: Không thanh toán tự động

source: No automatic payment after the trial
ar: لا يوجد دفع تلقائي بعد التجربة
be: Няма аўтаматычнай аплаты пасля пробнага перыяду
da: Ingen automatisk betaling efter prøveperioden
de: Keine automatische Zahlung nach dem Testzeitraum
es: No se realizará un pago automático después de la prueba
fr: Pas de paiement automatique après l'essai
id: Tidak ada pembayaran otomatis setelah masa percobaan
it: Nessun pagamento automatico dopo la prova
ja: お試し期間後、自動支払いはありません
ms: Tiada pembayaran automatik selepas percubaan
no: Ingen automatisk betaling etter prøveperioden
pl: Brak automatycznej płatności po okresie próbnym
pt: Sem pagamento automático após o teste
ru: Нет автоматического платежа после пробного периода
sv: Ingen automatisk betalning efter provperioden
th: ไม่มีการชำระเงินอัตโนมัติหลังจากช่วงทดลองใช้
tr: Denemeden sonra otomatik ödeme yok
uk: Немає автоматичної оплати після пробного періоду
vi: Không có thanh toán tự động sau khi dùng thử

source: No blogs found
ar: لم يتم العثور على مدونات
be: Не знойдзены блогаў
da: Ingen blogs fundet
de: Keine Blogs gefunden
es: No se encontraron blogs
fr: Aucun blog trouvé
id: Tidak ada blog yang ditemukan
it: Nessun blog trovato
ja: ブログが見つかりません
ms: Tiada blog dijumpai
no: Ingen blogger funnet
pl: Nie znaleziono blogów
pt: Nenhum blog encontrado
ru: Не найдено блогов
sv: Inga bloggar hittades
th: ไม่พบบล็อก
tr: Hiç blog bulunamadı
uk: Не знайдено жодного блогу
vi: Không tìm thấy blog

source: No charge will be made
ar: لن يتم فرض أي رسوم
be: Аплата не будзе спаганяцца
da: Der vil ikke blive opkrævet noget gebyr
de: Keine Gebühr wird erhoben
es: No se realizará ningún cargo
fr: Aucun frais ne sera appliqué
id: Tidak ada biaya yang akan dikenakan
it: Nessun addebito verrà effettuato
ja: 料金は発生しません
ms: Tiada caj akan dikenakan
no: Ingen kostnad vil bli pålagt
pl: Nie zostanie naliczona żadna opłata
pt: Nenhuma cobrança será feita
ru: С вас не будет взиматься плата
sv: Ingen avgift kommer att debiteras
th: ไม่ได้คิดค่าใช้จ่าย
tr: Ücret alınmayacaktır
uk: Жодної плати не стягуватиметься
vi: Không có phí nào sẽ được tính

source: No conversations yet
ar: ليس هناك محادثات حتى الآن
be: Пакуль што размоў няма
da: Ingen samtaler endnu
de: Noch keine Unterhaltungen
es: Aún no hay conversaciones
fr: Aucune conversation pour le moment
id: Belum ada percakapan
it: Nessuna conversazione ancora
ja: まだ会話はありません
ms: Tiada perbualan lagi
no: Ingen samtaler ennå
pl: Brak jakichkolwiek rozmów
pt: Nenhuma conversa ainda
ru: Пока нет разговоров
sv: Inga konversationer än
th: ยังไม่มีการสนทนา
tr: Henüz bir konuşma yok
uk: Ще немає розмов
vi: Chưa có cuộc trò chuyện nào

source: No correct words yet.
id: Belum ada kata yang benar.
it: Nessuna parola corretta ancora.
ja: まだ正しい単語はありません。
no: Ingen korrekte ord ennå.
ru: Пока нет правильных слов.
uk: Ще немає правильних слів.

source: No corrections yet
ar: لم تتم أي تصحيحات بعد
be: Пакуль няма правак
da: Ingen rettelser endnu
de: Noch keine Korrekturen
es: Aún no hay correcciones
fr: Aucune correction pour le moment
id: Belum ada koreksi
it: Nessuna correzione ancora
ja: まだ訂正はありません
ms: Belum ada pembetulan
no: Ingen korreksjoner ennå
pl: Brak poprawek do tej pory
pt: Ainda sem correções
ru: Пока нет исправлений
sv: Inga korrigeringar ännu
th: ยังไม่มีการแก้ไข
tr: Henüz bir düzeltme yok
uk: Ще немає виправлень
vi: Chưa có sửa chữa nào

source: No credit card required
ar: لا يتطلب بطاقة ائتمان
be: Не патрабуецца крэдытная карта
da: Ingen kreditkort kræves
de: Keine Kreditkarte erforderlich
es: No se requiere tarjeta de crédito
fr: Aucune carte de crédit requise
id: Tidak memerlukan kartu kredit
it: Non è richiesta alcuna carta di credito
ja: クレジットカードは必要ありません
ms: Tiada kad kredit diperlukan
no: Ingen kredittkort kreves
pl: Nie wymagana karta kredytowa
pt: Sem necessidade de cartão de crédito
ru: Не требуется кредитная карта
sv: Inget kreditkort krävs
th: ไม่ต้องใช้บัตรเครดิต
tr: Kredi kartı gerekli değil
uk: Не потрібно кредитної картки
vi: Không cần thẻ tín dụng

source: No daily question for today
id: Tidak ada pertanyaan harian untuk hari ini
it: Nessuna domanda del giorno per oggi
ja: 今日のデイリークエスチョンはありません
no: Ingen daglig spørsmål for i dag
pl: Brak dzisiejszego pytania
ru: Сегодня нет ежедневного вопроса
sv: Ingen daglig fråga för idag
uk: Сьогодні немає щоденного питання

source: No debates yet
id: Belum ada perdebatan
it: Nessun dibattito ancora
ja: まだ議論がありません
no: Ingen debatter ennå
pl: Brak jeszcze debat
ru: Еще нет дебатов
sv: Inga debatter ännu
uk: Ще немає дебатів

source: No interviews found
ar: لم يتم العثور على مقابلات
be: Интэрв'ю не знойдзеныя
da: Ingen interviews fundet
de: Keine Interviews gefunden
es: No se encontraron entrevistas
fr: Aucune interview trouvée
id: Tidak ada wawancara ditemukan
it: Nessun colloquio trovato
ja: 該当するインタビューが見つかりませんでした
ms: Tiada temu bual ditemui
no: Ingen intervjuer funnet
pl: Nie znaleziono żadnych wywiadów
pt: Nenhuma entrevista encontrada
ru: plaintext Интервью не найдены
sv: Inga intervjuer hittades
th: ไม่พบการสัมภาษณ์
tr: Mülakat bulunamadı
uk: Жодних інтерв'ю не знайдено
vi: Không tìm thấy buổi phỏng vấn nào

source: No messages yet
ar: لا توجد رسائل بعد
be: Яшчэ няма паведамленняў
da: Ingen beskeder endnu
fr: Pas encore de messages
no: Ingen meldinger ennå
uk: Ще немає повідомлень

source: No messages yet. Be the first to share your thoughts!
de: Noch keine Nachrichten. Sei der Erste, der seine Gedanken teilt!
es: No hay mensajes aún. ¡Sé el primero en compartir tus pensamientos!
id: Belum ada pesan. Jadilah yang pertama berbagi pemikiran Anda!
it: Nessun messaggio ancora. Sii il primo a condividere i tuoi pensieri!
ja: まだメッセージはありません。最初にあなたの考えを共有しましょう！
no: Ingen meldinger ennå. Vær den første til å dele dine tanker!
pl: Brak wiadomości. Bądź pierwszym, który podzieli się swoimi przemyśleniami!
pt: Ainda não há mensagens. Seja o primeiro a compartilhar suas ideias!
ru: Нет сообщений. Будьте первым, кто поделится своими мыслями!
sv: Inga meddelanden än. Var den första att dela dina tankar!
th: ยังไม่มีข้อความใดๆ เป็นคนแรกที่แบ่งปันความคิดของคุณ!
tr: Henüz mesaj yok. Düşüncelerinizi paylaşan ilk kişi olun!
uk: Наразі повідомлень немає. Будьте першим, хто поділиться своїми думками!
vi: Chưa có tin nhắn nào. Hãy là người đầu tiên chia sẻ suy nghĩ của bạn!

source: No notes yet. Add a few details so your AI teacher knows you better.
id: Belum ada catatan. Tambahkan beberapa detail agar guru AI Anda lebih mengenal Anda.
it: Nessuna nota ancora. Aggiungi qualche dettaglio affinché il tuo insegnante AI ti conosca meglio.
ja: まだメモはありません。AI教師があなたをよりよく理解できるように、いくつかの詳細を追加してください。
no: Ingen notater ennå. Legg til noen detaljer slik at din AI-lærer blir bedre kjent med deg.
pl: Nie ma jeszcze notatek. Dodaj kilka szczegółów, aby Twój nauczyciel AI lepiej Cię poznał.
ru: Пока нет заметок. Добавьте несколько деталей, чтобы ваш AI учитель узнал вас лучше.
sv: Inga anteckningar än. Lägg till några detaljer så din AI-lärare lär känna dig bättre.
uk: Ще немає нотаток. Додайте кілька деталей, щоб ваш вчитель ІІ міг краще вас пізнати.

source: No payments...
ar: لا يوجد مدفوعات...
be: Без плацяжоў...
da: Ingen betalinger...
de: Keine Zahlungen...
es: Sin pagos...
fr: Aucun paiement...
id: Tidak ada pembayaran...
it: Nessun pagamento...
ja: 支払いなし...
ms: Tiada pembayaran...
no: Ingen betalinger...
pl: Brak płatności...
pt: Sem pagamentos...
ru: Нет платежей...
sv: Inga betalningar...
th: ไม่มีการชำระเงิน...
tr: Ödemeler yok...
uk: Без платежів...
vi: Không thanh toán...

source: No Projections Available
ar: plaintext لا توجد توقعات متاحة
be: Праекцыі недаступныя
da: Ingen projektioner tilgængelige
de: Keine Projektionen verfügbar
es: No hay proyecciones disponibles
fr: Aucune projection disponible
id: Tidak Ada Proyeksi Tersedia
it: Nessuna Proiezione Disponibile
ja: プロジェクションは利用できません
ms: plaintext Tiada Unjuran Tersedia
no: plaintext Ingen prognoser tilgjengelig
pl: Brak dostępnych projekcji
pt: Nenhuma Projeção Disponível
ru: Нет доступных прогнозов
sv: Inga prognoser tillgängliga
th: ไม่มีการคาดการณ์ที่มีอยู่
tr: Kullanılabilir Projeksiyon Yok
uk: Немає доступних проекцій
vi: Không có dự đoán nào có sẵn

source: No reason provided.
ar: لا يوجد سبب مقدم.
be: Прычына не прадастаўлена.
da: Ingen grund angivet.
de: Kein Grund angegeben.
es: No se proporcionó ninguna razón.
fr: Aucune raison fournie.
id: Tidak ada alasan yang diberikan.
it: Nessuna ragione fornita.
ja: 理由が提供されていません。
no: Ingen grunn oppgitt.
pl: Nie podano powodu.
pt: Nenhuma razão fornecida.
ru: Причина не указана.
sv: Ingen anledning angiven.
th: ไม่มีเหตุผลที่ระบุ
tr: Herhangi bir neden belirtilmedi.
uk: Жодної причини не вказано.
vi: Không có lý do được cung cấp.

source: No results found
ar: لم يتم العثور على نتائج
be: Нічога не знойдзена
da: Ingen resultater fundet
de: Keine Ergebnisse gefunden
es: No se encontraron resultados
fr: Aucun résultat trouvé
id: Tidak ditemukan hasil
it: Nessun risultato trovato
ja: 結果が見つかりません
ms: Tiada hasil ditemui
no: Ingen resultater funnet
pl: Brak wyników
pt: Nenhum resultado encontrado
ru: plaintext Результаты не найдены
sv: Inga resultat funna
th: ไม่พบผลลัพธ์
tr: Sonuç bulunamadı
uk: plaintext Результатів не знайдено
vi: Không tìm thấy kết quả

source: No scenarios found
ar: لم يتم العثور على أي سيناريوهات
be: Сцэнары не знойдзены
da: Ingen scenarier fundet
de: Keine Szenarien gefunden
es: No se encontraron escenarios
fr: Aucun scénario trouvé
id: Tidak ditemukan skenario
it: Nessuno scenario trovato
ja: シナリオが見つかりません
ms: Tiada senario dijumpai
no: Ingen scenarioer funnet
pl: Nie znaleziono scenariuszy
pt: Nenhum cenário encontrado
ru: Не найдено сценариев
sv: Inga scenarier hittades
th: ไม่พบสถานการณ์ใด ๆ
tr: Hiç senaryo bulunamadı
uk: Не знайдено сценаріїв
vi: Không tìm thấy kịch bản

source: No support messages yet
id: Belum ada pesan dukungan
it: Nessun messaggio di supporto ancora
ja: サポートメッセージはまだありません
no: Ingen støttemeldinger ennå
pl: Brak jeszcze wiadomości wsparcia
ru: Нет ещё сообщений поддержки
sv: Inga supportmeddelanden ännu
uk: Ще немає повідомлень підтримки

source: No text to translate
ar: ليس هناك نص للترجمة
be: Няма тэксту для перакладу
da: Ingen tekst til oversættelse
de: Kein Text zum Übersetzen
es: Sin texto para traducir
fr: Aucun texte à traduire
id: Tidak ada teks untuk diterjemahkan
it: Nessun testo da tradurre
ja: 翻訳するテキストがありません
ms: Tiada teks untuk diterjemahkan
no: Ingen tekst å oversette
pl: Brak tekstu do tłumaczenia
pt: Sem texto para traduzir
ru: Нет текста для перевода
sv: Ingen text att översätta
th: ไม่มีข้อความที่จะแปล
tr: Çevrilecek metin yok
uk: Немає тексту для перекладу
vi: Không có văn bản để dịch

source: No translation available
ar: لا يتوفر ترجمة
be: Няма перакладу
da: Ingen oversættelse tilgængelig
de: Keine Übersetzung verfügbar
es: No hay traducción disponible
fr: Aucune traduction disponible
id: Tidak ada terjemahan yang tersedia
it: Nessuna traduzione disponibile
ja: 翻訳は利用できません
ms: Tiada terjemahan tersedia
no: Ingen oversettelse tilgjengelig
pl: Brak tłumaczenia
pt: Sem tradução disponível
ru: Перевод недоступен
sv: Ingen översättning tillgänglig
th: ไม่มีการแปลที่สามารถใช้ได้
tr: Çeviri mevcut değil
uk: Переклад недоступний
vi: Không có bản dịch nào có sẵn

source: No turn data available.
id: Tidak ada data giliran yang tersedia.
it: Nessun dato di svolta disponibile.
ja: 利用可能なターンデータがありません。
no: Ingen turdata tilgjengelig.
ru: Данные о повороте недоступны.
uk: Дані про повороти недоступні.

source: No views yet. Be the first to view this post!
de: Noch keine Aufrufe. Seien Sie der Erste, der diesen Beitrag ansieht!
es: Aún no hay vistas. ¡Sé el primero en ver esta publicación!
id: Belum ada tayangan. Jadilah yang pertama melihat postingan ini!
it: Nessuna visualizzazione ancora. Sii il primo a visualizzare questo post!
ja: まだ閲覧されていません。この投稿を最初に閲覧するのはあなたです！
no: Ingen visninger ennå. Bli den første til å se dette innlegget!
pl: Brak wyświetleń. Bądź pierwszy i obejrzyj ten post!
pt: Sem visualizações ainda. Seja o primeiro a visualizar esta postagem!
ru: Просмотров пока нет. Будьте первым, кто посмотрит этот пост!
sv: Inga visningar än. Var först med att se detta inlägg!
th: ยังไม่มีใครเข้าชม มาเป็นคนแรกที่เข้าชมโพสต์นี้!
tr: Henüz görüntülenme yok. Bu gönderiyi ilk görüntüleyen sen ol!
uk: Ще немає переглядів. Станьте першим, хто перегляне цей допис!
vi: Chưa có lượt xem. Hãy là người đầu tiên xem bài viết này!

source: No words used yet
ar: لم يتم استخدام أي كلمات بعد
be: Ніякіх слоў пакуль не выкарыстана
da: Ingen ord brugt endnu
de: Bisher wurden keine Wörter verwendet
es: Aún no se han usado palabras
fr: Aucun mot utilisé pour l'instant
id: Belum ada kata yang digunakan
it: Nessuna parola utilizzata ancora
ja: まだ使用されている単語はありません
ms: Belum ada kata yang digunakan lagi
no: Ingen ord brukt ennå
pl: Nie użyto jeszcze żadnych słów
pt: Nenhuma palavra usada ainda
ru: Пока не использовано ни одного слова
sv: Inga ord använda än
th: ยังไม่มีคำใดๆ ถูกใช้งานเลย
tr: Henüz hiç kelime kullanılmadı
uk: Жодних слів ще не використано
vi: Chưa có từ nào được sử dụng
