Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: You answer questions just like in a real interview and get instant feedback. The AI adapts the questions to your profession and experience. This kind of training helps you identify weak spots, work on your pronunciation, and learn how to handle unexpected questions calmly. You’ll notice your speech becoming more fluent and your answers more polished with each attempt.
ar: تجيب على الأسئلة كما لو كنت في مقابلة حقيقية وتحصل على ردود فعل فورية. تقوم الذكاء الاصطناعي بتكييف الأسئلة وفقًا لمهنتك وخبرتك. يساعد هذا النوع من التدريب على تحديد النقاط الضعيفة، والعمل على لكنتك، وتعلم كيفية التعامل مع الأسئلة غير المتوقعة بهدوء. ستلاحظ أن كلامك يصبح أكثر طلاقة وأجوبتك أكثر تألقًا مع كل محاولة.
be: Вы адказваеце на пытанні так, як на сапраўдным спаборніцтве, і адразу атрымліваеце водгук. Штучны інтэлект адаптуе пытанні пад вашу прафесію і досвед. Гэты тып трэнінгу дапамагае вам выявіць слабыя месцы, працаваць над вашай вымаўленнем і навучыцца спакойна рэагаваць на нечаканыя пытанні. Вы заўважыце, што ваша мова становіцца больш плыннаю, а вашыя адказы больш дбайлівымі з кожнай спробай.
da: Du svarer på spørgsmål ligesom i et rigtigt interview og får øjeblikkelig feedback. AI tilpasser spørgsmålene til din profession og erfaring. Denne form for træning hjælper dig med at identificere svage punkter, arbejde på din udtale, og lære, hvordan man håndterer uventede spørgsmål roligt. Du vil bemærke, at din tale bliver mere flydende, og dine svar bliver mere polerede ved hvert forsøg.
de: Sie beantworten Fragen genau wie in einem echten Vorstellungsgespräch und erhalten sofortiges Feedback. Die KI passt die Fragen an Ihren Beruf und Ihre Erfahrung an. Diese Art von Training hilft Ihnen, Schwachstellen zu identifizieren, an Ihrer Aussprache zu arbeiten und zu lernen, wie Sie unerwartete Fragen ruhig beantworten. Sie werden bemerken, dass Ihre Rede flüssiger wird und Ihre Antworten mit jedem Versuch ausgefeilter werden.
es: Respondes preguntas tal como en una entrevista real y obtienes retroalimentación instantánea. La IA adapta las preguntas a tu profesión y experiencia. Este tipo de entrenamiento te ayuda a identificar puntos débiles, trabajar en tu pronunciación y aprender cómo manejar preguntas inesperadas con calma. Notarás que tu discurso se vuelve más fluido y tus respuestas más pulidas con cada intento.
fr: Vous répondez à des questions tout comme dans une vraie interview et recevez des commentaires instantanés. L'IA adapte les questions à votre profession et à votre expérience. Ce type d'entraînement vous aide à identifier vos points faibles, à travailler sur votre prononciation, et à apprendre comment gérer calmement des questions inattendues. Vous remarquerez que votre discours devient plus fluide et que vos réponses sont de plus en plus soignées à chaque tentative.
id: Anda menjawab pertanyaan layaknya dalam wawancara sungguhan dan mendapatkan umpan balik seketika. AI menyesuaikan pertanyaan berdasarkan profesi dan pengalaman Anda. Pelatihan semacam ini membantu Anda mengidentifikasi kelemahan, berlatih pengucapan, dan belajar cara menangani pertanyaan tak terduga dengan tenang. Anda akan menyadari bahasa Anda menjadi lebih fasih dan jawaban Anda semakin terasah setiap usaha Anda.
it: Rispondi alle domande proprio come in un vero colloquio e ricevi feedback immediati. L'IA adatta le domande alla tua professione ed esperienza. Questo tipo di formazione ti aiuta a identificare i punti deboli, a lavorare sulla tua pronuncia e a imparare come gestire con calma le domande inaspettate. Noterai che il tuo discorso diventa più fluente e le tue risposte più lucide ad ogni tentativo.
ja: あなたはまるで実際の面接のように質問に答え、即時のフィードバックを得ます。AIはあなたの職業と経験に合わせて質問を適応させます。このようなトレーニングは、弱点を見つけ出し、発音の練習をする、そして予期しない質問に落ち着いて対処する方法を学ぶのに役立ちます。あなたはあなたの発言がより流暢になり、あなたの答えが試みるごとにより洗練されることに気付くでしょう。
ms: Anda menjawab soalan sama seperti dalam temuduga sebenar dan mendapat maklum balas serta-merta. AI menyesuaikan soalan kepada profesion dan pengalaman anda. Jenis latihan ini membantu anda mengenal pasti kelemahan, bekerja pada sebutan anda, dan belajar cara menangani soalan yang tidak dijangka dengan tenang. Anda akan menyedari bahasa pertuturan anda menjadi lebih lancar dan jawapan anda lebih terasah dengan setiap percubaan.
no: Du svarer på spørsmål akkurat som i et virkelig intervju og får umiddelbar tilbakemelding. AI-en tilpasser spørsmålene til din yrkesbakgrunn og erfaring. Denne typen trening hjelper deg med å identifisere svake punkter, jobbe med uttalen din, og lære hvordan du skal håndtere uventede spørsmål rolig. Du vil merke at talen din blir mer flytende og svarene dine mer polerte for hver forsøk.
pl: Odpowiadasz na pytania tak, jak podczas prawdziwej rozmowy kwalifikacyjnej i otrzymujesz natychmiastową informację zwrotną. Sztuczna inteligencja dostosowuje pytania do twojego zawodu i doświadczenia. Tego rodzaju trening pomaga ci zidentyfikować słabe punkty, pracować nad wymową i nauczyć się, jak spokojnie radzić sobie z niespodziewanymi pytaniami. Zauważysz, że twoja mowa staje się bardziej płynna, a twoje odpowiedzi bardziej dopracowane z każdym kolejnym podejściem.
pt: Você responde a perguntas como em uma entrevista real e recebe feedback instantâneo. O AI adapta as perguntas à sua profissão e experiência. Esse tipo de treinamento ajuda você a identificar pontos fracos, trabalhar na sua pronúncia e aprender a lidar calmamente com perguntas inesperadas. Você notará que seu discurso se torna mais fluente e suas respostas mais polidas a cada tentativa.
ru: Вы отвечаете на вопросы так же, как на настоящем собеседовании, и получаете мгновенную обратную связь. Искусственный интеллект адаптирует вопросы к вашей профессии и опыту. Такой вид тренировки помогает вам определить слабые места, работать над произношением и научиться спокойно реагировать на неожиданные вопросы. Вы заметите, что ваша речь становится более плавной, а ответы более обработанными с каждой попыткой.
sv: Du svarar på frågor precis som i en riktig intervju och får omedelbar feedback. AI anpassar frågorna till din profession och erfarenhet. Denna typ av träning hjälper dig att identifiera svaga punkter, arbeta på din uttal, och lära dig hur man hanterar oväntade frågor lugnt. Du kommer att märka att ditt tal blir mer flytande och dina svar mer polerade vid varje försök.
th: คุณตอบคำถามเหมือนอยู่ในสถานการณ์สัมภาษณ์จริงและได้รับข้อเสนอแนะทันที โดย AI จะปรับคำถามให้เข้ากับอาชีพและประสบการณ์ของคุณ การฝึกอบรมแบบนี้ช่วยให้คุณระบุจุดอ่อน ฝึกการออกเสียง และเรียนรู้วิธีจัดการกับคำถามที่ไม่คาดคิดอย่างสงบ คุณจะสังเกตุการพูดของคุณเป็นไหลมากขึ้นและคำตอบของคุณดูมีการเตรียมมากขึ้นในทุกครั้งที่ลอง
tr: Gerçek bir mülakatta olduğu gibi soruları yanıtlarsınız ve anında geri bildirim alırsınız. Yapay zeka soruları mesleğinize ve deneyiminize göre uyarlar. Bu tür bir eğitim, zayıf yönlerinizi belirlemenize, telaffuzunuz üzerinde çalışmanıza ve beklenmedik soruları sakin bir şekilde nasıl ele alacağınızı öğrenmenize yardımcı olur. Her denemede konuşmanızın daha akıcı hale geldiğini ve yanıtlarınızın daha çok cilalandığını fark edeceksiniz.
uk: Ви відповідаєте на запитання, як в справжньому інтерв'ю, і одразу отримуєте зворотний зв'язок. Штучний інтелект адаптує питання до вашої професії та досвіду. Такий вид тренувань допомагає вам ідентифікувати слабкі місця, працювати над вашою вимовою та вчитися спокійно реагувати на несподівані питання. Ви помітите, що ваша мова стає більш впевненою, а відповіді більш відточеними з кожною спробою.
vi: Bạn trả lời các câu hỏi giống như trong một cuộc phỏng vấn thực tế và nhận được phản hồi tức thì. AI điều chỉnh các câu hỏi phù hợp với nghề nghiệp và kinh nghiệm của bạn. Loại hình đào tạo này giúp bạn xác định các điểm yếu, làm việc trên phát âm của mình, và học cách xử lý những câu hỏi bất ngờ một cách bình tĩnh. Bạn sẽ nhận thấy giọng nói của mình trở nên trôi chảy hơn và các câu trả lời của bạn trở nên tinh tế hơn sau mỗi lần thử.

source: You are on the waitlist
ar: أنت على قائمة الانتظار
be: Вы знаходзіцеся ў спісе чакання
da: Du er på ventelisten
de: Sie sind auf der Warteliste
es: Estás en la lista de espera
fr: Vous êtes sur la liste d'attente
id: Anda berada di daftar tunggu
it: Sei nella lista d'attesa
ja: あなたはウェイトリストに載っています
ms: Anda berada dalam senarai menunggu
no: Du står på ventelisten
pl: Jesteś na liście oczekujących
pt: Você está na lista de espera
ru: Вы в списке ожидания
sv: Du är på väntelistan
th: คุณอยู่ในรายการรอ
tr: Bekleme listesinde bulunuyorsunuz.
uk: Ви в списку очікування
vi: Bạn đang ở trong danh sách chờ

source: You can add some details regarding your refund request below:
de: Sie können im Folgenden einige Details zu Ihrem Rückerstattungsantrag hinzufügen:
es: Puede agregar algunos detalles sobre su solicitud de reembolso a continuación:
id: Anda dapat menambahkan beberapa detail terkait permintaan pengembalian dana Anda di bawah ini:
it: Puoi aggiungere alcuni dettagli riguardo la tua richiesta di rimborso qui sotto:
ja: 返金リクエストに関する詳細を以下に追加することができます:
no: Du kan legge til noen detaljer angående din forespørsel om refusjon nedenfor:
pl: Możesz dodać szczegóły dotyczące Twojej prośby o zwrot poniżej:
pt: Você pode adicionar alguns detalhes sobre sua solicitação de reembolso abaixo:
ru: Вы можете добавить некоторые детали в отношении вашего запроса на возврат ниже:
sv: Du kan lägga till några detaljer angående din återbetalningsbegäran nedan:
th: คุณสามารถเพิ่มรายละเอียดเกี่ยวกับคำขอคืนเงินของคุณด้านล่าง:
tr: Aşağıya iade talebinizle ilgili bazı ayrıntılar ekleyebilirsiniz:
uk: Ви можете додати деякі деталі щодо вашого запиту на відшкодування нижче:
vi: Bạn có thể thêm một số chi tiết liên quan đến yêu cầu hoàn tiền của mình dưới đây:

source: You can build projects, but **don't know what interviewers actually want to see**
ar: يمكنك بناء مشاريع، ولكن **لا تعرف ما الذي يود المحاورون فعلا رؤيته**
be: Вы можаце будаваць праекты, але **не ведаеце, што на самай справе жадаюць убачыць інтэрв'юеры**
da: Du kan bygge projekter, men **ved ikke, hvad interviewere faktisk vil se**
de: Du kannst Projekte erstellen, aber **weißt nicht, was die Interviewer tatsächlich sehen wollen**
es: Puedes crear proyectos, pero **no sabes qué quieren ver realmente los entrevistadores**
fr: Vous pouvez réaliser des projets, mais **vous ne savez pas ce que les recruteurs veulent réellement voir**
id: Anda dapat membuat proyek, tetapi **tidak tahu apa yang sebenarnya ingin dilihat oleh pewawancara**
it: Puoi creare progetti, ma **non sai cosa vogliono davvero vedere gli intervistatori**
ja: プロジェクトを構築することはできますが、**面接官が実際に何を見たいのかわからない**
no: Du kan bygge prosjekter, men **vet ikke hva intervjuere egentlig vil se**
pl: Możesz tworzyć projekty, ale **nie wiesz, co tak naprawdę chcą zobaczyć rekruterzy**
pt: Você pode construir projetos, mas **não sabe o que os entrevistadores realmente querem ver**
ru: Вы можете создавать проекты, но **не знаете, что на самом деле хотят видеть интервьюеры**
sv: Du kan bygga projekt, men **vet inte vad intervjuare faktiskt vill se**
th: คุณสามารถสร้างโปรเจกต์ได้ แต่**ไม่รู้ว่าผู้สัมภาษณ์ต้องการเห็นอะไรจริงๆ**
tr: Projeler yapabilirsiniz, ancak **görüşmecilerin aslında ne görmek istediğini bilmiyorsunuz**
uk: Ви можете створювати проекти, але **не знаєте, що інтерв'юери насправді хочуть побачити**
vi: Bạn có thể xây dựng các dự án, nhưng **không biết người phỏng vấn thực sự muốn thấy điều gì**

source: You can delete your personal data anytime
ar: يمكنك حذف بياناتك الشخصية في أي وقت
be: Вы можаце выдаліць свае персанальныя дадзеныя ў любы час
da: Du kan slette dine personlige data når som helst
de: Sie können Ihre persönlichen Daten jederzeit löschen
es: Puedes eliminar tus datos personales en cualquier momento
fr: Vous pouvez supprimer vos données personnelles à tout moment
id: Anda dapat menghapus data pribadi Anda kapan saja
it: Puoi eliminare i tuoi dati personali in qualsiasi momento
ja: 個人データはいつでも削除できます
ms: Anda boleh memadam data peribadi anda pada bila-bila masa
no: Du kan slette dine personlige data når som helst
pl: Możesz usunąć swoje dane osobowe w dowolnym momencie
pt: Você pode excluir seus dados pessoais a qualquer momento
ru: Вы можете удалить свои личные данные в любое время
sv: Du kan radera dina personuppgifter när som helst
th: คุณสามารถลบข้อมูลส่วนตัวของคุณได้ทุกเมื่อ
tr: Kişisel verilerinizi istediğiniz zaman silebilirsiniz
uk: Ви можете видалити свої особисті дані будь-коли
vi: Bạn có thể xóa dữ liệu cá nhân của mình bất kỳ lúc nào

source: You can discuss the battle here.
de: Sie können die Schlacht hier diskutieren.
es: Puedes discutir la batalla aquí.
id: Anda dapat mendiskusikan pertempuran di sini.
it: Puoi discutere della battaglia qui.
ja: ここで戦いについて話し合うことができます。
no: Du kan diskutere slaget her.
pl: Możesz omówić bitwę tutaj.
pt: Você pode discutir a batalha aqui.
ru: Вы можете обсудить сражение здесь.
sv: Du kan diskutera striden här.
th: คุณสามารถพูดคุยเกี่ยวกับการรบที่นี่
tr: Savaşı burada tartışabilirsiniz.
uk: Ви можете обговорити битву тут.
vi: Bạn có thể thảo luận về trận chiến ở đây.

source: You can discuss the daily question here.
de: Sie können die Tagesfrage hier besprechen.
es: Puedes discutir la pregunta diaria aquí.
id: Anda dapat mendiskusikan pertanyaan harian di sini.
it: Puoi discutere della domanda del giorno qui.
ja: 日々の質問をここで議論できます。
no: Du kan diskutere dagens spørsmål her.
pl: Możesz omówić codzienne pytanie tutaj.
pt: Você pode discutir a pergunta diária aqui.
ru: Вы можете обсудить ежедневный вопрос здесь.
sv: Du kan diskutera dagens fråga här.
th: คุณสามารถสนทนาเกี่ยวกับคำถามประจำวันได้ที่นี่
tr: Günlük soruyu burada tartışabilirsiniz.
uk: Ви можете обговорити щоденне запитання тут.
vi: Bạn có thể thảo luận câu hỏi hàng ngày ở đây.

source: You can emphasize APIs, databases, or system design, and repeat answers with instant AI feedback anytime.
ar: يمكنك التركيز على واجهات برمجة التطبيقات (APIs)، أو قواعد البيانات، أو تصميم النظام، وتكرار الإجابات مع الحصول على ملاحظات فورية من الذكاء الاصطناعي في أي وقت.
be: Вы можаце падкрэсліць API, базы дадзеных альбо праектаванне сістэмы, і паўтараць адказы з імгненнымі водгукамі штучнага інтэлекту ў любы час.
da: Du kan fremhæve API'er, databaser eller systemdesign og gentage svar med øjeblikkelig AI-feedback når som helst.
de: Sie können APIs, Datenbanken oder Systemdesign betonen und Antworten jederzeit mit sofortigem KI-Feedback wiederholen.
es: Puedes enfatizar las APIs, las bases de datos o el diseño de sistemas, y repetir respuestas con retroalimentación instantánea de IA en cualquier momento.
fr: Vous pouvez insister sur les API, les bases de données ou la conception du système, et répéter les réponses avec un retour instantané de l'IA à tout moment.
id: Anda dapat menekankan pada API, basis data, atau desain sistem, dan mengulangi jawaban dengan umpan balik AI instan kapan saja.
it: Puoi mettere in evidenza le API, i database o il design del sistema e ripetere le risposte con un feedback immediato dell'IA in qualsiasi momento.
ja: API、データベース、またはシステム設計を強調し、いつでも即座にAIフィードバックが得られるように回答を繰り返すことができます。
ms: Anda boleh menekankan API, pangkalan data, atau reka bentuk sistem, dan mengulangi jawapan dengan maklum balas AI serta-merta pada bila-bila masa.
no: Du kan fokusere på API-er, databaser, eller systemdesign, og gjenta svar med umiddelbar AI-tilbakemelding når som helst.
pl: Możesz podkreślić interfejsy API, bazy danych lub projektowanie systemów, a także powtarzać odpowiedzi z natychmiastową informacją zwrotną AI w dowolnym momencie.
pt: Você pode enfatizar APIs, bancos de dados, ou design de sistemas, e repetir as respostas com feedback instantâneo da IA a qualquer momento.
ru: Вы можете сделать акцент на API, базах данных или проектировании систем, а также повторять ответы с мгновенной обратной связью от ИИ в любое время.
sv: Du kan betona API:er, databaser eller systemdesign och repetera svar med omedelbar AI-feedback när som helst.
th: คุณสามารถเน้นที่ API, ฐานข้อมูล, หรือการออกแบบระบบ และทำซ้ำคำตอบพร้อมรับคำติชมจาก AI ทันทีได้ตลอดเวลา
tr: API'leri, veritabanlarını veya sistem tasarımını vurgulayabilir ve anında AI geri bildirimi ile yanıtları dilediğiniz zaman tekrar edebilirsiniz.
uk: Ви можете акцентувати увагу на API, базах даних або проектуванні систем, і повторювати відповіді з миттєвим зворотним зв'язком від штучного інтелекту будь-коли.
vi: Bạn có thể nhấn mạnh các API, cơ sở dữ liệu, hoặc thiết kế hệ thống, và lặp lại câu trả lời với phản hồi AI tức thì bất cứ lúc nào.

source: You can practice for junior frontend interviews including technical rounds, basic coding challenges, HTML/CSS fundamentals, JavaScript basics, and behavioral interviews focused on React basics, responsive design, and web development fundamentals.
ar: يمكنك التدرب على مقابلات الواجهة الأمامية للمبتدئين بما في ذلك الجولات الفنية، تحديات البرمجة الأساسية، أساسيات HTML/CSS، أساسيات JavaScript، ومقابلات السلوك التي تركز على أساسيات React، وتصميم المواقع المتجاوب، وأساسيات تطوير الويب.
be: Вы можаце практыкавацца для інтэрв'ю па junior frontend пасадах, уключаючы тэхнічныя этапы, асноўныя заданні па кодзе, асновы HTML/CSS, асновы JavaScript і паводзінскія інтэрв'ю, накіраваныя на асновы React, адаптыўны дызайн і асновы веб-распрацоўкі.
da: Du kan øve dig til junior frontend-interviews, inklusive tekniske runder, grundlæggende kodeudfordringer, HTML/CSS-fundamentaler, JavaScript-grundprincipper og adfærdsmæssige interviews med fokus på React-grundprincipper, responsivt design og webudviklingsfundamentaler.
de: Sie können für Junior-Frontend-Interviews üben, einschließlich technischer Runden, grundlegender Programmierherausforderungen, HTML/CSS-Grundlagen, JavaScript-Grundlagen und verhaltensorientierter Interviews, die sich auf React-Grundlagen, responsives Design und Webentwicklungsgrundlagen konzentrieren.
es: Puedes practicar para entrevistas de frontend junior, incluidas rondas técnicas, desafíos de codificación básicos, fundamentos de HTML/CSS, conceptos básicos de JavaScript, y entrevistas de comportamiento centradas en los conceptos básicos de React, el diseño responsivo y los fundamentos del desarrollo web.
fr: Vous pouvez vous entraîner pour les entretiens de débutant en frontend, y compris les phases techniques, les défis de codage de base, les fondamentaux HTML/CSS, les bases de JavaScript, et les entretiens comportementaux axés sur les bases de React, la conception réactive, et les fondamentaux du développement web.
id: Anda dapat berlatih untuk wawancara frontend junior termasuk putaran teknis, tantangan pengkodean dasar, dasar-dasar HTML/CSS, dasar-dasar JavaScript, dan wawancara perilaku yang berfokus pada dasar-dasar React, desain responsif, dan dasar-dasar pengembangan web.
it: Puoi esercitarti per i colloqui frontend junior includendo i round tecnici, le sfide di codifica di base, le nozioni fondamentali di HTML/CSS, le basi di JavaScript e i colloqui comportamentali focalizzati sui fondamenti di React, il design responsive e i fondamenti dello sviluppo web.
ja: ジュニアフロントエンドインタビューの練習ができます。これには、技術ラウンド、基本的なコーディングチャレンジ、HTML/CSSの基礎、JavaScriptの基本、およびReactの基礎、レスポンシブデザイン、ウェブ開発の基礎に焦点を当てた行動面接が含まれます。
no: Du kan øve deg til junior frontend-intervjuer, inkludert tekniske runder, grunnleggende koding utfordringer, HTML/CSS fundamentale, JavaScript grunnleggende, og atferdsintervjuer med fokus på React-grunnleggende, responsivt design og webutvikling fundamentale.
pl: Możesz ćwiczyć do rozmów kwalifikacyjnych na młodszego frontend developera, w tym faz technicznych, podstawowych wyzwań związanych z kodowaniem, podstaw HTML/CSS, podstaw JavaScript, oraz rozmów behawioralnych skupiających się na podstawach React, responsywnym projektowaniu i podstawach rozwoju stron internetowych.
pt: Você pode praticar para entrevistas de frontend júnior, incluindo rodadas técnicas, desafios básicos de codificação, fundamentos de HTML/CSS, noções básicas de JavaScript e entrevistas comportamentais focadas em noções básicas de React, design responsivo e fundamentos do desenvolvimento web.
ru: Вы можете практиковаться для интервью на младшего фронтенд-разработчика, включая технические раунды, базовые задания по кодированию, основы HTML/CSS, основы JavaScript и поведенческие интервью, сосредоточенные на основах React, адаптивном дизайне и основах веб-разработки.
sv: Du kan öva inför junior frontend-intervjuer inklusive tekniska omgångar, grundläggande kodningsutmaningar, HTML/CSS-grunder, JavaScript-grunder och beteendeintervjuer med fokus på React-grunder, responsiv design och webbutvecklingens grunder.
th: คุณสามารถฝึกฝนสำหรับการสัมภาษณ์ตำแหน่ง frontend ระดับจูเนียร์ได้ รวมถึงรอบการทดสอบทางเทคนิค การท้าทายการเขียนโค้ดพื้นฐาน พื้นฐานของ HTML/CSS พื้นฐานของ JavaScript และการสัมภาษณ์พฤติกรรมที่เน้นพื้นฐานของ React การออกแบบที่ตอบสนอง และพื้นฐานการพัฒนาเว็บ
tr: Junior frontend mülakatları için teknik aşamalar, temel kodlama zorlukları, HTML/CSS temelleri, JavaScript temel bilgileri ve React temelleri, duyarlı tasarım ve web geliştirme temellerine odaklanan davranışsal mülakatlar dahil pratik yapabilirsiniz.
uk: Ви можете практикуватися для співбесід на позицію молодшого фронтенд-розробника, включаючи технічні раунди, базові завдання з програмування, основи HTML/CSS, основи JavaScript та поведінкові співбесіди, зосереджені на основах React, адаптивному дизайні та основах веб-розробки.
vi: Bạn có thể thực hành cho các buổi phỏng vấn frontend cấp thấp bao gồm các vòng kỹ thuật, thử thách mã hóa cơ bản, kiến ​​thức nền tảng về HTML/CSS, kiến thức cơ bản về JavaScript, và các buổi phỏng vấn hành vi tập trung vào kiến ​​thức cơ bản về React, thiết kế đáp ứng, và kiến ​​thức nền tảng về phát triển web.
