Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Check into a hotel and handle room arrangements in a realistic front-desk setting. Perfect for practicing how to provide reservation details, inquire about amenities, and address special requests. ## Why You Should Play *Hotel Check-in* 1. Gain confidence requesting the services you need while checking into a hotel. 2. Learn to provide personal details and confirm reservations with clarity. 3. Practice asking about amenities like breakfast, Wi-Fi, or late check-out. 4. Discover how to handle unexpected issues, such as room availability or last-minute changes. 5. Sharpen your ability to navigate professional, service-oriented conversations. ## How the Scenario Works You’ll act as the guest arriving at the hotel, while our AI plays the role of a receptionist. The receptionist will ask for your name, reservation details, and any special requests you might have. By responding naturally, you’ll build the conversational skills necessary for a smooth hotel check-in experience.
ar: تحقق من الدخول إلى فندق وتولى ترتيبات الغرف في بيئة استقبال واقعية. مثالي لممارسة كيفية تقديم تفاصيل الحجز، والاستفسار عن المرافق، ومعالجة الطلبات الخاصة. ## لماذا يجب أن تلعب *تسجيل الدخول إلى الفندق* 1. اكتساب الثقة عند طلب الخدمات التي تحتاجها أثناء تسجيل الدخول إلى فندق. 2. تعلم تقديم التفاصيل الشخصية وتأكيد الحجوزات بوضوح. 3. ممارسة السؤال عن المرافق مثل الإفطار، الواي فاي، أو تسجيل المغادرة المتأخر. 4. اكتشاف كيفية التعامل مع المشكلات غير المتوقعة، مثل توفر الغرف أو التغييرات في اللحظة الأخيرة. 5. صقل قدرتك على التعامل مع المحادثات المهنية التي تركز على الخدمة. ## كيف تعمل السيناريو ستقوم بدور الضيف الوافد إلى الفندق، بينما تلعب الذكاء الاصطناعي دور موظف الاستقبال. سيطلب موظف الاستقبال اسمك، تفاصيل الحجز، وأي طلبات خاصة قد تكون لديك. من خلال الرد بشكل طبيعي، ستبني مهارات المحادثة اللازمة لتجربة تسجيل دخول سلسة في الفندق.
be: Зарэгіструйцеся ў гатэлі і займайцеся рэгуляваннем пакояў у рэалістычных умовах стойкі рэгістрацыі. Ідэальна для тых, хто хоча практаваць у наданні дэталяў рэзервавання, ўзнаннях пра дадатковыя паслугі і ў выпадку спецыяльных пажаданняў. ## Чаму варта гуляць у *Hotel Check-in* 1. Набывайце упэўненасці пры запыце паслуг, якія вам патрэбныя, рэгіструючыся ў гатэлі. 2. Навучайцеся аддаваць асабістую інфармацыю і пацвярджваць рэзерваванні зразумела. 3. Практыкуйцеся ў запытах аб дадатковых паслугах, якія могуць вам патрэбныцца, напрыклад, пра сняданак, Wi-Fi або познюю выпіску. 4. Даведайцеся, як рашаць нечаканыя пытанні, напрыклад, каб пра растойкі пакояў або апошнія змены. 5. Падтругайце свой навык арыентавацца ў прафесійных, абслугоўвальных размовах. ## Як працуе гэтый сцэнарій Вы будзеце выступаць у ролі гасця, які прыбывае ў гатэль, а наш ШІ будзе выступаць у ролі адміністратара. Прыемнік попросіць у вас ваша прозвішча, дэтали рэзервавання і любыя адмысловыя пажаданні, якія ў вас могуць быць. Рэагуючы природным чынам, вы набываеце навыкі размовы, неабходныя для гладкага рэгістрацыі ў гатэлі.
da: Check ind på et hotel og håndtér rumarrangementer i en realistisk receptionsindstilling. Perfekt til at øve, hvordan man giver reservationsoplysninger, forespørger om faciliteter og imødekommer særlige anmodninger. ## Hvorfor du bør spille *Hotel Check-in* 1. Få selvtillid til at anmode om de tjenester, du har brug for, når du tjekker ind på et hotel. 2. Lær at give personlige oplysninger og bekræfte reservationer klart. 3. Øv dig i at spørge om faciliteter som morgenmad, Wi-Fi eller sen udtjekning. 4. Opdag, hvordan du håndterer uventede problemer, såsom tilgængelighed af værelser eller ændringer i sidste øjeblik. 5. Skærp din evne til at navigere i professionelle, serviceorienterede samtaler. ## Hvordan scenariet fungerer Du vil agere som gæsten, der ankommer til hotellet, mens vores AI påtager sig rollen som receptionist. Receptionisten vil spørge efter dit navn, reservationsoplysninger og eventuelle særlige anmodninger, du måtte have. Ved at svare naturligt, vil du opbygge de samtalefærdigheder, der er nødvendige for en glat hotel check-in oplevelse.
de: Checken Sie in ein Hotel ein und kümmern Sie sich um die Zimmerarrangements in einem realistischen Empfangsszenario. Perfekt, um zu üben, wie man Reservierungsdetails angibt, nach Annehmlichkeiten fragt und besondere Wünsche berücksichtigt. ## Warum Sie *Hotel Check-in* spielen sollten 1. Gewinnen Sie Selbstvertrauen darin, die benötigten Dienstleistungen beim Check-in in ein Hotel anzufordern. 2. Lernen Sie, persönliche Details anzugeben und Reservierungen klar zu bestätigen. 3. Üben Sie, nach Annehmlichkeiten wie Frühstück, WLAN oder späterer Abreise zu fragen. 4. Entdecken Sie, wie man mit unerwarteten Problemen umgeht, wie z.B. Zimmerverfügbarkeit oder Änderungen in letzter Minute. 5. Schärfen Sie Ihre Fähigkeit, professionelle, serviceorientierte Gespräche zu führen. ## So funktioniert das Szenario Sie werden als Gast auftreten, der im Hotel ankommt, während unsere KI die Rolle eines Empfangsmitarbeiters übernimmt. Der Empfangsmitarbeiter wird nach Ihrem Namen, den Reservierungsdetails und etwaigen besonderen Wünschen fragen. Indem Sie natürlich reagieren, werden Sie die Gesprächskompetenzen entwickeln, die für ein reibungsloses Check-in-Erlebnis im Hotel erforderlich sind.
fr: Check-in dans un hôtel et gestion des arrangements de chambre dans un cadre réaliste de réception. Parfait pour pratiquer comment fournir des détails de réservation, s'informer sur les commodités et répondre à des demandes spéciales. ## Pourquoi vous devriez jouer à *Check-in à l'Hôtel* 1. Gagnez en confiance en demandant les services dont vous avez besoin lors de votre arrivée à l'hôtel. 2. Apprenez à fournir des détails personnels et à confirmer des réservations avec clarté. 3. Entraînez-vous à demander des commodités telles que le petit-déjeuner, le Wi-Fi ou le départ tardif. 4. Découvrez comment gérer des problèmes inattendus, tels que la disponibilité des chambres ou des changements de dernière minute. 5. Affinez votre capacité à naviguer dans des conversations professionnelles orientées vers le service. ## Comment le scénario fonctionne Vous agirez en tant qu'invité arrivant à l'hôtel, tandis que notre IA jouera le rôle d'un réceptionniste. Le réceptionniste vous demandera votre nom, les détails de votre réservation et toute demande spéciale que vous pourriez avoir. En répondant naturellement, vous développerez les compétences conversationnelles nécessaires pour une expérience de check-in fluide à l'hôtel.
id: Check into a hotel and handle room arrangements in a realistic front-desk setting. Perfect for practicing how to provide reservation details, inquire about amenities, and address special requests. ## Mengapa Anda Harus Bermain *Check-in Hotel* 1. Meningkatkan rasa percaya diri dalam meminta layanan yang Anda butuhkan saat check-in ke hotel. 2. Belajar memberikan informasi pribadi dan mengonfirmasi reservasi dengan jelas. 3. Berlatih bertanya tentang fasilitas seperti sarapan, Wi-Fi, atau check-out terlambat. 4. Mengetahui cara menangani masalah yang tidak terduga, seperti ketersediaan kamar atau perubahan mendadak. 5. Memperdalam kemampuan Anda untuk berkomunikasi dalam percakapan profesional yang berorientasi pada layanan. ## Cara Kerja Skenario Anda akan bertindak sebagai tamu yang tiba di hotel, sementara AI kami berperan sebagai resepsionis. Resepsionis akan meminta nama Anda, detail reservasi, dan permintaan khusus yang mungkin Anda miliki. Dengan merespons secara alami, Anda akan membangun keterampilan percakapan yang diperlukan untuk pengalaman check-in hotel yang lancar.
it: Check-in in un hotel e gestire le sistemazioni delle stanze in un contesto realistico alla reception. Perfetto per esercitarsi a fornire dettagli sulla prenotazione, richiedere informazioni sui servizi e affrontare richieste speciali. ## Perché dovresti giocare a *Check-in in hotel* 1. Guadagna fiducia nel richiedere i servizi di cui hai bisogno durante il check-in in un hotel. 2. Impara a fornire dettagli personali e confermare le prenotazioni con chiarezza. 3. Esercitati a chiedere informazioni sui servizi come colazione, Wi-Fi o check-out tardivo. 4. Scopri come gestire problemi imprevisti, come la disponibilità delle stanze o cambiamenti dell'ultimo minuto. 5. Affina la tua capacità di navigare conversazioni professionali e orientate al servizio. ## Come funziona lo scenario Reciterai il ruolo dell'ospite che arriva in hotel, mentre la nostra intelligenza artificiale interpreterà il ruolo di un receptionist. Il receptionist chiederà il tuo nome, i dettagli della prenotazione e eventuali richieste speciali che potresti avere. Rispondendo in modo naturale, svilupperai le abilità conversazionali necessarie per un'esperienza di check-in in hotel senza intoppi.
ja: ホテルにチェックインし、現実的なフロントデスクの設定で部屋の手配を行います。予約の詳細を提供し、設備について問い合わせ、特別なリクエストに応じる方法を練習するのに最適です。 ## なぜ *ホテルチェックイン* をプレイすべきか 1. ホテルにチェックインする際に必要なサービスをリクエストする自信を得る。 2. 個人情報を提供し、予約を明確に確認する方法を学ぶ。 3. 朝食、Wi-Fi、遅いチェックアウトなどの設備について尋ねる練習をする。 4. 部屋の空き状況や直前の変更など、予期しない問題に対処する方法を見つける。 5. プロフェッショナルでサービス志向の会話をうまく進める能力を磨く。 ## シナリオの進行方法 あなたはホテルに到着したゲストとして行動し、私たちのAIが受付係の役割を果たします。受付係はあなたの名前、予約の詳細、そして特別なリクエストについて尋ねます。自然に応答することで、スムーズなホテルチェックイン体験に必要な会話スキルを身に付けることができます。
ms: Semak masuk ke hotel dan uruskan pengaturan bilik dalam suasana kaunter depan yang realistik. Sempurna untuk berlatih cara memberikan butiran tempahan, bertanya tentang kemudahan, dan menangani permintaan khas. ## Kenapa Anda Perlu Bermain *Semak Masuk Hotel* 1. Dapatkan keyakinan meminta perkhidmatan yang anda perlukan semasa mendaftar masuk ke hotel. 2. Belajar memberikan butiran peribadi dan mengesahkan tempahan dengan jelas. 3. Berlatih bertanya tentang kemudahan seperti sarapan, Wi-Fi, atau daftar keluar lewat. 4. Mengetahui cara mengendalikan isu yang tidak dijangka, seperti ketersediaan bilik atau perubahan saat akhir. 5. Asah kemampuan anda untuk menavigasi perbualan yang profesional dan berorientasikan perkhidmatan. ## Bagaimana Senario Berfungsi Anda akan bertindak sebagai tetamu yang tiba di hotel, manakala AI kami memainkan peranan sebagai penyambut tetamu. Penyambut tetamu akan meminta nama anda, butiran tempahan, dan sebarang permintaan khas yang mungkin anda ada. Dengan menjawab secara semula jadi, anda akan membina kemahiran perbualan yang diperlukan untuk pengalaman semak masuk hotel yang lancar.
no: sjekk inn på et hotell og håndter romarrangementer i en realistisk resepsjonsinnstilling. Perfekt for å øve på hvordan man gir reservasjonsdetaljer, spør om fasiliteter og adresserer spesielle forespørselen. ## Hvorfor du bør spille *Hotell Innsjekking* 1. Få selvtillit til å be om tjenestene du trenger når du sjekker inn på et hotell. 2. Lær å gi personlige detaljer og bekrefte reservasjoner med klarhet. 3. Øv på å spørre om fasiliteter som frokost, Wi-Fi eller sen utsjekking. 4. Oppdag hvordan du håndterer uventede problemer, som romtilgjengelighet eller endringer i siste liten. 5. Skjerp evnen din til å navigere i profesjonelle, serviceorienterte samtaler. ## Hvordan scenariet fungerer Du vil opptre som gjesten som ankommer hotellet, mens vår AI spiller rollen som resepsjonist. Resepsjonisten vil be om navnet ditt, reservasjonsdetaljer og eventuelle spesielle forespørsel du måtte ha. Ved å svare naturlig, vil du bygge de samtaleferdighetene som er nødvendige for en smidig innsjekking på hotellet.
pl: Zameldowanie się w hotelu i załatwienie spraw związanych z pokojem w realistycznym środowisku na recepcji. Idealne do ćwiczenia podawania szczegółów rezerwacji, pytania o udogodnienia oraz załatwiania specjalnych próśb. ## Dlaczego warto zagrać w *Zameldowanie w hotelu* 1. Zyskaj pewność siebie w prośbach o potrzebne usługi podczas zameldowania w hotelu. 2. Naucz się podawać dane osobowe i potwierdzać rezerwacje w sposób jasny. 3. Ćwicz zadawanie pytań o udogodnienia, takie jak śniadanie, Wi-Fi czy późne wymeldowanie. 4. Dowiedz się, jak radzić sobie z niespodziewanymi problemami, takimi jak dostępność pokoi czy zmiany na ostatnią chwilę. 5. Doskonal swoje umiejętności poruszania się w profesjonalnych rozmowach ukierunkowanych na obsługę klienta. ## Jak działa scenariusz Będziesz działać jako gość przybywający do hotelu, podczas gdy nasza sztuczna inteligencja odegra rolę recepcjonisty. Recepcjonista zapyta o Twoje imię, szczegóły rezerwacji oraz wszelkie specjalne prośby, które możesz mieć. Odpowiadając naturalnie, zbudujesz umiejętności konwersacyjne potrzebne do płynnego doświadczenia zameldowania w hotelu.
pt: Check-in em um hotel e gerencie os arranjos do quarto em um cenário realista de recepção. Perfeito para praticar como fornecer detalhes da reserva, perguntar sobre comodidades e atender a pedidos especiais. ## Por que você deve jogar *Check-in no Hotel* 1. Ganhe confiança ao solicitar os serviços de que precisa ao fazer check-in em um hotel. 2. Aprenda a fornecer detalhes pessoais e confirmar reservas com clareza. 3. Pratique perguntar sobre comodidades como café da manhã, Wi-Fi ou check-out tardio. 4. Descubra como lidar com problemas inesperados, como disponibilidade de quartos ou mudanças de última hora. 5. Aperfeiçoe sua habilidade de navegar em conversas profissionais e voltadas para o serviço. ## Como o Cenário Funciona Você atuará como o hóspede chegando ao hotel, enquanto nossa IA desempenha o papel de recepcionista. O recepcionista pedirá seu nome, detalhes da reserva e quaisquer pedidos especiais que você possa ter. Ao responder de forma natural, você desenvolverá as habilidades de conversação necessárias para uma experiência suave de check-in no hotel.
ru: Проверьтесь в отеле и организуйте размещение в реалистичной обстановке на стойке регистрации. Отлично подходит для практики предоставления деталей бронирования, запроса удобств и обработки специальных просьб. ## Почему вам стоит сыграть *Регистрация в отеле* 1. Получите уверенность в запросе необходимых услуг при регистрации в отеле. 2. Научитесь предоставлять личные данные и подтверждать бронирования четко. 3. Практикуйте вопросы о удобствах, таких как завтрак, Wi-Fi или поздний выезд. 4. Узнайте, как справляться с непредвиденными проблемами, такими как доступность номеров или изменения в последнюю минуту. 5. Усовершенствуйте свою способность вести профессиональные, ориентированные на обслуживание беседы. ## Как работает сценарий Вы будете выступать в роли гостя, приезжающего в отель, в то время как наш ИИ сыграет роль администратора. Администратор спросит ваше имя, детали бронирования и любые специальные просьбы, которые могут у вас быть. Отвечая естественно, вы развиваете разговорные навыки, необходимые для безупречной регистрации в отеле.
sv: Checka in på ett hotell och hantera rumarrangemang i en realistisk reception. Perfekt för att öva på hur man ger reservationsdetaljer, frågar om bekvämligheter och hanterar särskilda önskemål. ## Varför Du Bör Spela *Hotell Incheckning* 1. Få självförtroende att be om de tjänster du behöver när du checkar in på ett hotell. 2. Lär dig att ge personliga uppgifter och bekräfta reservationer tydligt. 3. Öva på att fråga om bekvämligheter som frukost, Wi-Fi eller sen utcheckning. 4. Upptäck hur man hanterar oväntade problem, såsom rumstillgång eller ändringar i sista minuten. 5. Skärp din förmåga att navigera i professionella, serviceinriktade samtal. ## Hur Scenariot Fungerar Du kommer att agera som gästen som anländer till hotellet, medan vår AI spelar rollen av receptionist. Receptionisten kommer att fråga efter ditt namn, reservationsdetaljer och eventuella särskilda önskemål du kan ha. Genom att svara på ett naturligt sätt kommer du att bygga de konversationsfärdigheter som behövs för en smidig hotellincheckningsupplevelse.
th: เช็คอินเข้าสู่โรงแรมและจัดการการจัดห้องในบรรยากาศที่สมจริงที่แผนกต้อนรับ เหมาะสำหรับการฝึกฝนวิธีการให้รายละเอียดการจอง สอบถามเกี่ยวกับสิ่งอำนวยความสะดวก และจัดการกับคำขอพิเศษ ## ทำไมคุณควรเล่น *การเช็คอินที่โรงแรม* 1. สร้างความมั่นใจในการขอบริการที่คุณต้องการขณะเช็คอินที่โรงแรม 2. เรียนรู้การให้รายละเอียดส่วนตัวและยืนยันการจองอย่างชัดเจน 3. ฝึกการสอบถามเกี่ยวกับสิ่งอำนวยความสะดวก เช่น อาหารเช้า Wi-Fi หรือการเช็คเอาท์ช้า 4. ค้นพบวิธีการจัดการกับปัญหาที่ไม่คาดคิด เช่น ความพร้อมห้องหรือการเปลี่ยนแปลงในนาทีสุดท้าย 5. พัฒนาความสามารถในการสนทนาในเชิงวิชาชีพที่มุ่งเน้นการบริการ ## วิธีการทำงานของสถานการณ์ คุณจะทำหน้าที่เป็นแขกที่มาถึงโรงแรม ในขณะที่ AI ของเราจะทำหน้าที่เป็นพนักงานต้อนรับ พนักงานต้อนรับจะขอชื่อนามสกุล รายละเอียดการจอง และคำขอพิเศษใด ๆ ที่คุณอาจมี โดยการตอบกลับอย่างเป็นธรรมชาติ คุณจะสร้างทักษะการสนทนาที่จำเป็นสำหรับประสบการณ์เช็คอินที่โรงแรมอย่างราบรื่น
vi: Check into a hotel and handle room arrangements in a realistic front-desk setting. Perfect for practicing how to provide reservation details, inquire about amenities, and address special requests. ## Tại sao bạn nên chơi *Nhận phòng Khách sạn* 1. Tăng cường tự tin khi yêu cầu các dịch vụ bạn cần khi nhận phòng khách sạn. 2. Học cách cung cấp thông tin cá nhân và xác nhận đặt phòng một cách rõ ràng. 3. Thực hành hỏi về các tiện nghi như bữa sáng, Wi-Fi hoặc trả phòng muộn. 4. Khám phá cách xử lý các vấn đề bất ngờ, chẳng hạn như sự có sẵn của phòng hoặc thay đổi vào phút cuối. 5. Mài giũa khả năng điều hướng các cuộc trò chuyện chuyên nghiệp, tập trung vào dịch vụ. ## Cách hoạt động của kịch bản Bạn sẽ đóng vai là khách đến khách sạn, trong khi AI của chúng tôi đóng vai là lễ tân. Lễ tân sẽ hỏi tên của bạn, chi tiết đặt phòng và bất kỳ yêu cầu đặc biệt nào bạn có thể có. Bằng cách phản hồi một cách tự nhiên, bạn sẽ xây dựng được kỹ năng giao tiếp cần thiết cho trải nghiệm nhận phòng khách sạn suôn sẻ.

source: Continue to payment
ar: متابعة الدفع
be: Працягнуць да аплаты
da: Fortsæt til betaling
de: Weiter zur Zahlung
es: Continuar al pago
fr: Continuer vers le paiement
id: Lanjutkan ke pembayaran
it: Prosegui al pagamento
ja: 支払いに進む
ms: Teruskan ke pembayaran
no: Fortsett til betaling
pl: Kontynuuj do płatności
pt: Continue para o pagamento
ru: Продолжить к оплате
sv: Fortsätt till betalning
th: ดำเนินการไปยังการชำระเงิน
tr: Ödemeye devam et
vi: Tiếp tục thanh toán

source: Current Balance of AI usage
ar: الرصيد الحالي لاستخدام الذكاء الصناعي
be: Бягучы баланс выкарыстання AI
da: Nuværende Saldo af AI brug
de: Aktueller Kontostand der AI-Nutzung
es: Saldo Actual de uso de IA
fr: Solde actuel de l'utilisation de l'IA
id: Saldo Penggunaan AI Saat Ini
it: Saldo attuale dell'utilizzo di AI
ja: AI使用の現在の残高
ms: Baki Semasa Penggunaan AI
no: Gjeldende saldo for AI-bruk
pl: Aktualne saldo wykorzystania AI
pt: Saldo Atual de uso da IA
ru: Текущий баланс использования AI
sv: Nuvarande balans för AI-användning
th: ยอดคงเหลือที่ใช้ AI ปัจจุบัน
tr: AI kullanımının Güncel Bakiyesi
vi: Số dư hiện tại của việc sử dụng AI

source: EF Core
ar: EF كور
da: EF Kerne
de: EF-Kern
id: EF Inti
ja: EFコア
ms: EF Teras
no: EF Kjerne

source: Enabling ai voice is a premium feature. Please upgrade your plan to access this feature.
ar: تشغيل الصوت الذكي هو ميزة متقدمة. يرجى ترقية خطتك للوصول إلى هذه الميزة.
be: Уключэнне галасы штучнага інтэлекту з'яўляецца прэміум-функцыяй. Калі ласка, абновіце ваш план, каб атрымаць доступ да гэтай функцыі.
da: Aktivering af AI-stemme er en premiumfunktion. Opgrader venligst din plan for at få adgang til denne funktion.
de: Das Aktivieren der KI-Sprachausgabe ist eine Premium-Funktion. Bitte erweitern Sie Ihren Plan, um auf diese Funktion zuzugreifen.
es: Habilitar la voz de IA es una función premium. Por favor, actualice su plan para acceder a esta función.
fr: L'activation de la voix AI est une fonctionnalité premium. Veuillez mettre à jour votre plan pour accéder à cette fonctionnalité.
id: Mengaktifkan suara AI adalah fitur premium. Silakan tingkatkan rencana Anda untuk mengakses fitur ini.
it: Attivare la voce AI è una funzione premium. Si prega di aggiornare il proprio piano per accedere a questa funzione.
ja: AI音声の有効化はプレミアム機能です。この機能を利用するにはプランをアップグレードしてください。
no: Aktivering av ai-stemme er en premiumfunksjon. Vennligst oppgrader planen din for å få tilgang til denne funksjonen.
pl: Włączenie głosu AI jest funkcją premium. Proszę zaktualizować swój plan, aby uzyskać dostęp do tej funkcji.
pt: Habilitar a voz da IA é um recurso premium. Por favor, atualize seu plano para acessar esse recurso.
ru: Включение голосового интерфейса ИИ является премиум функцией. Пожалуйста, обновите свой план, чтобы получить доступ к этой функции.
sv: Aktivering av AI-röst är en premiumfunktion. Vänligen uppgradera din plan för att få tillgång till denna funktion.
th: การเปิดใช้งานเสียง AI เป็นฟีเจอร์ระดับพรีเมียม กรุณาอัปเกรดแผนการใช้งานของคุณเพื่อเข้าถึงฟีเจอร์นี้
tr: AI sesi etkinleştirmek bir premium özelliktir. Bu özelliğe erişmek için lütfen planınızı yükseltin.
vi: Việc bật giọng nói AI là một tính năng cao cấp. Vui lòng nâng cấp gói của bạn để truy cập tính năng này.

source: English Role-Play
ar: دور اللغة الإنجليزية
be: Англійская ролевая гульня
da: Danish Rollespil
de: Deutsch Rollenspiel
es: Rol de Juego en Inglés
fr: Rôle-play en anglais
it: Italiano Gioco di Ruolo
ja: 英語ロールプレイ
no: Engelsk Rollespill
pl: Polski Symulacja Roli
pt: Role-Play em Inglês
ru: Английская Ролевой Игра
sv: Svensk Rollspel
tr: Türkçe Rol Oynama
vi: Vai diễn tiếng Anh

source: FluencyPal
ja: フルエンシーパル
no: FlytendePal
tr: AkıcılıkArkadaşı

source: Github Repository:
ja: GitHubリポジトリ:

source: How long will my hours last?
ar: كم ستدوم ساعاتي؟
be: Як доўга будуць дзейнічаць мае гадзіны?
da: Hvor længe vil mine timer vare?
de: Wie lange werden meine Stunden dauern?
es: ¿Cuánto durarán mis horas?
fr: Combien de temps dureront mes heures ?
id: Berapa lama jam saya akan bertahan?
it: Quanto dureranno le mie ore?
ja: 私の時間はどれくらい続きますか？
ms: Berapa lama jam saya akan bertahan?
no: Hvor lenge vil timene mine vare?
pl: Jak długo potrwają moje godziny?
pt: Por quanto tempo durarão minhas horas?
ru: Сколько продлится моё время?
sv: Hur länge kommer mina timmar att räcka?
th: ชั่วโมงของฉันจะยาวนานเท่าไหร่?
tr: Saatlerim ne kadar sürecek?
vi: Thời gian của tôi kéo dài bao lâu?

source: I've been working on this project for about a year already, and I think I'll keep working on it for a long time. There's no risk of funding being cut or the project going bankrupt — because there is no funding. The project lives as long as there's money for servers. And if one day I'm poor enough that I can't afford them… well, we'll rent cheaper servers 🙂
ja: このプロジェクトにはすでに約1年携わっており、今後も長く取り組んでいくつもりです。資金が削減されるリスクや、プロジェクトが破産するリスクはありません — なぜなら資金がないからです。サーバーのためのお金がある限り、プロジェクトは続きます。そして、もしある日、サーバーを維持できないほど貧乏になったら… まあ、もっと安いサーバーを借りますね 🙂

source: Jest & React Testing Library
ar: جست ومكتبة اختبار React
de: Jest & React-Testbibliothek
fr: Jest & Bibliothèque de test React
ja: Jest と React テスティング ライブラリ
tr: Jest & React Test Kütüphanesi

source: Junior Frontend Developer
ar: مطور واجهة أمامية مبتدئ
da: Junior Frontend Udvikler
de: Junior-Frontend-Entwickler
es: Junior Desarrollador Frontend
fr: Développeur Frontend Junior
id: Pengembang Frontend Junior
ja: ジュニアフロントエンドデベロッパー
no: Junior Frontend-utvikler
pt: Desenvolvedor Frontend Júnior
ru: Младший Frontend-разработчик
sv: Junior Frontend-utvecklare
th: นักพัฒนา Frontend จูเนียร์
vi: Nhà phát triển Frontend Junior
