Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Goal: at least <0>{minWords}</0> words
ar: الهدف: على الأقل <0>{minWords}</0> كلمة
be: Мэта: прынамсі <0>{minWords}</0> слоў
da: Mål: mindst <0>{minWords}</0> ord
de: Ziel: mindestens <0>{minWords}</0> Wörter
es: Objetivo: al menos <0>{minWords}</0> palabras
fr: Objectif : au moins <0>{minWords}</0> mots
id: Goal: at least <0>{minWords}</0> kata
it: Obiettivo: almeno <0>{minWords}</0> parole
ja: 目標: 少なくとも<0>{minWords}</0>語
ms: Matlamat: sekurang-kurangnya <0>{minWords}</0> perkataan
no: Mål: minst <0>{minWords}</0> ord
pl: Cel: co najmniej <0>{minWords}</0> słów
pt: Meta: pelo menos <0>{minWords}</0> palavras
ru: Цель: не менее <0>{minWords}</0> слов
sv: Mål: minst <0>{minWords}</0> ord
th: เป้าหมาย: อย่างน้อย <0>{minWords}</0> คำ
tr: Amaç: en az <0>{minWords}</0> kelime
uk: Ціль: щонайменше <0>{minWords}</0> слів
vi: Mục tiêu: ít nhất <0>{minWords}</0> từ

source: Good direction, but your answer is too shallow for a senior role. Mention measuring first (profiling with React DevTools and the browser Performance panel), then specific bottlenecks (large bundles, unnecessary network calls, expensive components). Strengthen your answer by adding concrete techniques: code splitting via dynamic imports, memoizing expensive selectors, virtualization for long lists, and leveraging browser caching and a CDN. Close with how you'd monitor improvements over time.
ar: التوجيه جيد، لكن إجابتك سطحية للغاية بالنسبة لدور رفيع المستوى. اذكر القياس أولاً (التوصيف باستخدام React DevTools ولوحة الأداء في المتصفح)، ثم العوائق المحددة (الحزم الكبيرة، استدعاءات الشبكة غير الضرورية، المكونات المكلفة). عزز إجابتك بإضافة تقنيات ملموسة: تقسيم الشيفرة عبر الواردات الديناميكية، حفظ المتغيرات المؤقتة للاختيارات المكلفة، التمثيل الافتراضي للقوائم الطويلة، والاستفادة من التخزين المؤقت للمتصفح وCDN. اختتم بكيفية مراقبة التحسينات بمرور الوقت.
be: Добры напрамак, але ваш адказ занадта павярхоўны для старэйшай пазіцыі. Згадайце спачатку вымярэнне (профіляванне з дапамогай React DevTools і панэлі Performance у браўзеры), затым канкрэтныя вузкія месцы (вялікія пакеты, непатрэбныя сеткавыя выклікі, дарагія кампаненты). Узмацніце свой адказ, дадаўшы канкрэтныя тэхнікі: падзел кода з дапамогай дынамічных імпортаў, мемоізацыю дарагіх селектараў, віртуалізацыю для доўгіх спісаў і выкарыстанне кэшавання браўзера і CDN. Завяршыце тым, як вы б адсочвалі паляпшэнні з цягам часу.
da: God retning, men dit svar er for overfladisk til en seniorrolle. Nævn først måling (profilering med React DevTools og browserens Performance-panel), derefter specifikke flaskehalse (store bundter, unødvendige netværkskald, dyre komponenter). Styrk dit svar ved at tilføje konkrete teknikker: kodeopdeling via dynamiske imports, memoizing af dyre selectors, virtualisering til lange lister, og udnyttelse af browser caching og en CDN. Afslut med, hvordan du vil overvåge forbedringer over tid.
de: Gute Richtung, aber Ihre Antwort ist zu oberflächlich für eine Senior-Rolle. Erwähnen Sie zuerst das Messen (Profiling mit React DevTools und dem Performance-Panel des Browsers), dann spezifische Engpässe (große Bundles, unnötige Netzwerkaufrufe, kostspielige Komponenten). Stärken Sie Ihre Antwort, indem Sie konkrete Techniken hinzufügen: Code-Splitting durch dynamische Importe, Memoisierung teurer Selektoren, Virtualisierung für lange Listen und Nutzung von Browser-Caching und einem CDN. Schließen Sie damit ab, wie Sie Verbesserungen im Laufe der Zeit überwachen würden.
es: Buena dirección, pero tu respuesta es demasiado superficial para un rol senior. Menciona primero la medición (perfilando con React DevTools y el panel de Rendimiento del navegador), luego cuellos de botella específicos (grandes paquetes, llamadas de red innecesarias, componentes costosos). Fortalece tu respuesta añadiendo técnicas concretas: división de código mediante importaciones dinámicas, memorización de selectores costosos, virtualización para listas largas y aprovechamiento del caché del navegador y una CDN. Cierra con cómo monitorearías las mejoras a lo largo del tiempo.
fr: Bonne direction, mais votre réponse est trop superficielle pour un rôle senior. Mentionnez d'abord la mesure (profilage avec React DevTools et le panneau de performance du navigateur), puis les goulets d'étranglement spécifiques (grands bundles, appels réseau inutiles, composants coûteux). Renforcez votre réponse en ajoutant des techniques concrètes : découpage du code via l'importation dynamique, mise en mémoire des sélecteurs coûteux, virtualisation pour les longues listes, et exploitation de la mise en cache du navigateur et d'un CDN. Terminez par la façon dont vous surveilleriez les améliorations au fil du temps.
id: Arah yang baik, tetapi jawaban Anda terlalu dangkal untuk peran senior. Sebutkan pengukuran terlebih dahulu (pemrofilan dengan React DevTools dan panel Kinerja browser), kemudian hambatan spesifik (bundel besar, panggilan jaringan yang tidak perlu, komponen yang mahal). Perkuat jawaban Anda dengan menambahkan teknik konkret: pembagian kode melalui impor dinamis, memoriisasi pemilih yang mahal, virtualisasi untuk daftar panjang, dan memanfaatkan cache browser serta CDN. Akhiri dengan bagaimana Anda akan memantau perbaikan seiring waktu.
it: Buona direzione, ma la tua risposta è troppo superficiale per un ruolo senior. Menziona prima la misurazione (profilatura con React DevTools e il pannello Prestazioni del browser), poi strozzature specifiche (grandi bundle, chiamate di rete non necessarie, componenti onerosi). Rafforza la tua risposta aggiungendo tecniche concrete: divisione del codice tramite importazioni dinamiche, memoizzazione di selettori costosi, virtualizzazione per liste lunghe e sfruttare la cache del browser e un CDN. Concludi con come monitoreresti i miglioramenti nel tempo.
ja: 良い方向性ですが、シニアの役割にはあなたの回答は浅すぎます。まず最初に測定方法について述べてください（React DevTools とブラウザーのパフォーマンスパネルを用いたプロファイリング）、次に具体的なボトルネック（大きなバンドル、不必要なネットワーク呼び出し、高価なコンポーネント）を述べましょう。具体的な技術を追加してあなたの回答を強化してください：動的インポートを使ったコード分割、負荷の高いセレクタのメモ化、長いリストに対する仮想化、ブラウザのキャッシュと CDN を活用する。最後に、どのように時間をかけて改善を監視するかで締めくくりましょう。
ms: Arah yang baik, tetapi jawapan anda terlalu cetek untuk peranan senior. Sebutkan pengukuran terlebih dahulu (pemprofilan dengan React DevTools dan panel Prestasi pelayar), kemudian halangan tertentu (bundel besar, panggilan rangkaian yang tidak perlu, komponen yang mahal). Kuatkan jawapan anda dengan menambah teknik konkrit: pemecahan kod melalui import dinamik, mememosisikan pemilih mahal, pemvirtualan untuk senarai panjang, dan memanfaatkan cache pelayar dan CDN. Akhiri dengan bagaimana anda akan memantau penambahbaikan dari masa ke masa.
no: God retning, men svaret ditt er for overfladisk for en seniorrolle. Nevn måling først (profilering med React DevTools og nettleserens ytelsespanel), deretter spesifikke flaskehalser (store pakker, unødvendige nettverkskall, dyre komponenter). Forsterk svaret ditt ved å legge til konkrete teknikker: kode splitting via dynamiske importeringer, memoisering av dyre selektorer, virtualisering for lange lister, og utnytting av nettleserens caching og et CDN. Avslutt med hvordan du vil overvåke forbedringer over tid.
pl: Dobra wskazówka, ale twoja odpowiedź jest zbyt powierzchowna jak na rolę starszego specjalisty. Wspomnij najpierw o pomiarach (profilowanie z użyciem React DevTools i panelu wydajności przeglądarki), a następnie konkretnych wąskich gardłach (duże paczki, niepotrzebne zapytania sieciowe, kosztowne komponenty). Wzmocnij swoją odpowiedź, dodając konkretne techniki: dzielenie kodu za pomocą dynamicznych importów, zapamiętywanie kosztownych selektorów, wirtualizacja dla długich list oraz wykorzystanie pamięci podręcznej przeglądarki i CDN. Zakończ, jak monitorowałbyś ulepszenia w czasie.
pt: Boa direção, mas sua resposta é superficial demais para um cargo sênior. Mencione a mensuração primeiro (perfilagem com React DevTools e o painel de Performance do navegador), depois gargalos específicos (pacotes grandes, chamadas de rede desnecessárias, componentes caros). Fortaleça sua resposta adicionando técnicas concretas: divisão de código via importações dinâmicas, memoização de seletores caros, virtualização para listas longas e aproveitamento do cache do navegador e de uma CDN. Encerre com como você monitoraria as melhorias ao longo do tempo.
ru: Хорошее направление, но ваш ответ слишком поверхностный для старшей роли. Упомяните сначала измерение (профилирование с помощью React DevTools и панели Performance в браузере), затем конкретные узкие места (большие бандлы, ненужные сетевые вызовы, затратные компоненты). Укрепите свой ответ, добавив конкретные техники: разделение кода с помощью динамических импортов, мемоизация затратных селекторов, виртуализация для длинных списков и использование кэширования браузера и CDN. Завершите тем, как вы будете мониторить улучшения со временем.
sv: Bra riktning, men ditt svar är för ytligt för en senior roll. Nämn mätning först (profilering med React DevTools och webbläsarens prestandapanel), sedan specifika flaskhalsar (stora paket, onödiga nätverksanrop, dyra komponenter). Stärk ditt svar genom att lägga till konkreta tekniker: klyva kod genom dynamiska importer, memoization av dyra selektorer, virtualisering för långa listor, och utnyttja webbläsarcaching och en CDN. Avsluta med hur du skulle övervaka förbättringar över tid.
th: คำแนะนำดี แต่คำตอบของคุณยังตื้นเกินไปสำหรับบทบาทระดับอาวุโส ควรกล่าวถึงการวัดผลก่อน (การสร้างโปรไฟล์ด้วย React DevTools และแผง Performance ของเบราว์เซอร์) จากนั้นระบุปัญหาคอขวดเฉพาะ (ชุดโค้ดขนาดใหญ่, การเรียกเครือข่ายที่ไม่จำเป็น, ส่วนประกอบที่มีค่าใช้จ่ายสูง) เสริมสร้างคำตอบของคุณโดยเพิ่มเทคนิคที่เป็นรูปธรรม: การแยกโค้ดผ่านการนำเข้าแบบไดนามิก, การจดจำตัวเลือกที่มีค่าใช้จ่ายสูง, การจำลองความจริงสำหรับรายการที่ยาว และการใช้การแคชและ CDN ของเบราว์เซอร์ ปิดท้ายด้วยวิธีที่คุณจะติดตามการปรับปรุงตามเวลา
tr: İyi bir yönlendirme, ancak cevabınız kıdemli bir rol için çok yüzeysel. Öncelikle ölçüm yapmayı (React DevTools ile profil oluşturma ve tarayıcı Performans paneli ile) ardından belirli darboğazları (büyük paketler, gereksiz ağ çağrıları, pahalı bileşenler) belirtin. Cevabınızı somut teknikler ekleyerek güçlendirin: dinamik ithalatlar yoluyla kod bölme, pahalı seçicileri memoize etme, uzun listeler için sanallaştırma ve tarayıcı önbelleği ile CDN kullanma. Zamanla iyileşmeleri nasıl izleyeceğinizi belirterek sonlandırın.
uk: Гарний напрямок, але ваша відповідь занадто поверхнева для старшої ролі. Спочатку згадайте вимірювання (профілювання за допомогою React DevTools і панелі Performance в браузері), потім конкретні вузькі місця (великі пакети, непотрібні мережеві виклики, дорогі компоненти). Посильте вашу відповідь, додавши конкретні техніки: розбиття коду за допомогою динамічних імпортів, мемоізацію дорогих селекторів, віртуалізацію для довгих списків і використання кешування браузера та CDN. Закінчіть тим, як ви б відстежували покращення з часом.
vi: Hướng đi tốt, nhưng câu trả lời của bạn quá nông cho một vai trò cấp cao. Đề cập đến việc đo lường trước (hồ sơ với React DevTools và bảng Hiệu suất của trình duyệt), sau đó đến các nút thắt cụ thể (gói lớn, cuộc gọi mạng không cần thiết, thành phần tốn kém). Tăng cường câu trả lời của bạn bằng cách thêm các kỹ thuật cụ thể: phân tách mã thông qua việc nhập động, ghi nhớ các bộ lọc tốn kém, ảo hóa cho danh sách dài, và tận dụng bộ nhớ cache của trình duyệt và CDN. Kết thúc với cách bạn sẽ theo dõi cải tiến theo thời gian.

source: Good for trying the service. It's about 3-5 short conversations with AI. Or one long practice session. You decide!
uk: Добре для спроби сервісу. Це приблизно 3-5 коротких розмов з AI. Або одне довге тренування. Вибір за вами!

source: Good preparation today means career success tomorrow.
ar: التحضير الجيد اليوم يعني نجاح الوظيفة غدًا.
be: Добрая падрыхтоўка сёння азначае кар'ерны успех заўтра.
da: God forberedelse i dag betyder karrieresucces i morgen.
de: Gute Vorbereitung heute bedeutet Karriereerfolg morgen.
es: Una buena preparación hoy significa éxito profesional mañana.
fr: Une bonne préparation aujourd'hui signifie le succès professionnel demain.
id: Persiapan baik hari ini berarti sukses karir di hari esok.
it: Un buon preparativo oggi significa successo nella carriera domani.
ja: 今日の良い準備は、明日のキャリア成功を意味します。
ms: Persediaan yang baik hari ini bermakna kejayaan kerjaya esok hari.
no: God forberedelse i dag betyr karrieresuksess i morgen.
pl: Dobra przygotowanie dzisiaj oznacza sukces w karierze jutro.
pt: Uma boa preparação hoje significa sucesso na carreira amanhã.
ru: Хорошая подготовка сегодня означает карьерный успех завтра.
sv: God förberedelse idag betyder karriärframgång imorgon.
th: การเตรียมตัวดีในวันนี้หมายความว่าความสำเร็จในอาชีพในวันพรุ่งนี้
tr: Bugün iyi bir hazırlık, yarın kariyer başarısı anlamına gelir.
uk: Гарна підготовка сьогодні означає кар'єрний успіх завтра.
vi: Sự chuẩn bị tốt hôm nay nghĩa là sự thành công trong sự nghiệp ngày mai.

source: Good start! You correctly identified the scoping difference. To strengthen your answer for a junior role, add these points: var allows redeclaration and hoisting behavior (initialized as undefined), let prevents redeclaration in the same scope, and const also requires initialization and prevents reassignment (though objects/arrays can still be mutated). Mention that const and let are preferred in modern JavaScript. This shows you understand not just what, but why and when to use each.
ar: بداية جيدة! لقد حددت بشكل صحيح الفرق في النطاق. لتعزيز إجابتك لدور صغير، أضف هذه النقاط: var يسمح بإعادة التصريح وسلوك الرفع (مُهيأ كغير معرف)، let يمنع إعادة التصريح في نفس النطاق، وconst يتطلب أيضًا التهيئة ويمنع إعادة التعيين (على الرغم من أنه يمكن تغيير الكائنات/المصفوفات). اذكر أن const وlet يُفضلان في جافا سكريبت الحديثة. هذا يظهر أنك تفهم ليس فقط ماذا، ولكن لماذا ومتى يجب استخدام كل منها.
be: Добры пачатак! Вы правільна вызначылі розніцу ў вобласці бачнасці. Для таго, каб умацаваць ваш адказ на пасаду малодшага спецыяліста, дадайце гэтыя моманты: var дазваляе паўторнае аб'яўленне і паводзіць сябе з падняццем (ініцыялізуецца як undefined), let прадухіляе паўторнае аб'яўленне ў той жа вобласці бачнасці, а таксама const патрабуе ініцыялізацыі і прадухіляе пераназначэнне (але аб'екты/масівы ўсё ж могуць быць зменены). Згадайце, што const і let пераважнейшыя ў сучасным JavaScript. Гэта паказвае, што вы разумееце не толькі "што", але і "чаму" і "калі" выкарыстоўваць кожны з іх.
da: God start! Du identificerede korrekt forskellen i omfang. For at styrke dit svar til en juniorrolle, tilføj disse punkter: var tillader redeklaration og hoisting-adfærd (initialiseret som undefined), let forhindrer redeklaration i samme omfang, og const kræver også initialisering og forhindrer ny tildeling (selvom objekter/arrays stadig kan ændres). Nævn, at const og let foretrækkes i moderne JavaScript. Dette viser, at du forstår ikke kun hvad, men hvorfor og hvornår man skal bruge hver.
de: Guter Start! Sie haben den Unterschied im Umfang korrekt erkannt. Um Ihre Antwort für eine Juniorrolle zu verstärken, fügen Sie diese Punkte hinzu: var erlaubt die Neudeklaration und hat ein Hoisting-Verhalten (initialisiert als undefined), let verhindert die Neudeklaration im selben Umfang, und const erfordert ebenfalls eine Initialisierung und verhindert die erneute Zuweisung (obwohl Objekte/Arrays weiterhin verändert werden können). Erwähnen Sie, dass const und let in modernem JavaScript bevorzugt werden. Dies zeigt, dass Sie nicht nur verstehen, was, sondern auch warum und wann man jeden verwendet.
es: ¡Buen comienzo! Has identificado correctamente la diferencia de alcance. Para fortalecer tu respuesta para un rol junior, añade estos puntos: var permite una redeclaración y un comportamiento de elevación (inicializado como indefinido), let previene la redeclaración en el mismo ámbito, y const también requiere inicialización y previene la reasignación (aunque los objetos/arrays todavía pueden ser mutados). Menciona que const y let son preferidos en JavaScript moderno. Esto muestra que entiendes no solo qué, sino por qué y cuándo usar cada uno.
fr: Bon début ! Vous avez correctement identifié la différence de portée. Pour renforcer votre réponse pour un rôle junior, ajoutez ces points : var permet la redéclaration et le comportement de hoisting (initialisé en tant qu'undefined), let empêche la redéclaration dans le même scope, et const nécessite également une initialisation et empêche la réaffectation (bien que les objets/tableaux puissent toujours être mutés). Mentionnez que const et let sont préférés dans le JavaScript moderne. Cela montre que vous comprenez non seulement quoi, mais aussi pourquoi et quand utiliser chacun.
id: Bagus sekali! Anda telah mengidentifikasi perbedaan lingkup dengan benar. Untuk memperkuat jawaban Anda untuk peran junior, tambahkan poin-poin ini: var memungkinkan redeklarasi dan memiliki perilaku hoisting (diinisialisasi sebagai undefined), let mencegah redeklarasi dalam lingkup yang sama, dan const juga memerlukan inisialisasi serta mencegah penggantian nilai (meskipun objek/array masih dapat diubah). Sebutkan bahwa const dan let lebih disukai dalam JavaScript modern. Ini menunjukkan bahwa Anda memahami tidak hanya apa, tetapi juga mengapa dan kapan menggunakan masing-masing.
it: Buon inizio! Hai correttamente identificato la differenza di ambito. Per rafforzare la tua risposta per un ruolo junior, aggiungi questi punti: var permette la ridefinizione e il comportamento di hoisting (inizializzato come undefined), let impedisce la ridefinizione nello stesso ambito, e const richiede anche l'inizializzazione e impedisce la riassegnazione (anche se oggetti/array possono ancora essere mutati). Menziona che const e let sono preferiti nel moderno JavaScript. Questo dimostra che comprendi non solo cosa, ma anche perché e quando utilizzare ciascuno.
ja: 良いスタートです！スコープの違いを正しく識別しました。ジュニアの役割に対する回答を強化するために、次のポイントを追加してください：var は再宣言とホイスティングの動作を許可し（未定義として初期化）、let は同じスコープでの再宣言を防ぎ、const は初期化を要求し、再代入を防ぎます（ただしオブジェクトや配列は変異可能）。現代のJavaScriptでは const と let が推奨されることを言及してください。これにより、何を使うだけでなく、なぜ、いつ使うのかもしっかり理解していることが示されます。
no: God start! Du identifiserte korrekt forskjellen på omfang. For å styrke svaret ditt for en juniorrolle, legg til disse punktene: var tillater gjenoppretting og heising (initialisert som undefined), let forhindrer gjenoppretting i samme omfang, og const krever også initialisering og forhindrer reassignering (selv om objekter/arrayer fortsatt kan muteres). Nevne at const og let er å foretrekke i moderne JavaScript. Dette viser at du forstår ikke bare hva, men hvorfor og når du skal bruke hver.
pl: Dobry początek! Prawidłowo zidentyfikowałeś różnicę w zakresie. Aby wzmocnić swoją odpowiedź na stanowisko juniora, dodaj te punkty: var pozwala na ponowne zadeklarowanie i ma zachowanie hoistingu (zainicjalizowane jako undefined), let uniemożliwia ponowne zadeklarowanie w tym samym zakresie, a const również wymaga inicjalizacji i zapobiega ponownemu przypisaniu (choć obiekty/tablice wciąż mogą być modyfikowane). Wspomnij, że const i let są preferowane we współczesnym JavaScript. To pokazuje, że rozumiesz nie tylko co, ale dlaczego i kiedy używać każdego z nich.
pt: Bom começo! Você identificou corretamente a diferença de escopo. Para reforçar sua resposta para um papel júnior, adicione esses pontos: var permite a reatribuição e o comportamento de içamento (inicializado como indefinido), let impede a reatribuição no mesmo escopo, e const também requer inicialização e impede a reatribuição (embora objetos/arrays ainda possam ser mutados). Mencione que const e let são preferidos no JavaScript moderno. Isso demonstra que você entende não apenas o que, mas por que e quando usar cada um.
ru: Хорошее начало! Вы правильно определили различие в области видимости. Чтобы укрепить ваш ответ для младшей роли, добавьте следующие моменты: var позволяет повторное объявление и обладает поведением всплытия (инициализируется как undefined), let предотвращает повторное объявление в одном и том же объеме, а const также требует инициализации и предотвращает переназначение (хотя объекты/массивы все еще могут изменяться). Упомяните, что const и let предпочтительны в современном JavaScript. Это показывает, что вы понимаете не только что, но и зачем и когда использовать каждый из них.
sv: Bra början! Du identifierade korrekt skillnaden i avgränsning. För att stärka ditt svar för en junior roll, lägg till dessa punkter: var tillåter omdeklarering och hoisting-beteende (initialiseras som undefined), let förhindrar omdeklarering i samma scope, och const kräver också initialisering och förhindrar omtilldelning (även om objekt/arrayer fortfarande kan ändras). Nämn att const och let föredras i modern JavaScript. Detta visar att du förstår inte bara vad, utan också varför och när du ska använda varje.
th: เริ่มต้นได้ดี! คุณระบุความแตกต่างของขอบเขตได้ถูกต้อง เพื่อเสริมความแข็งแกร่งในคำตอบของคุณสำหรับบทบาทระดับจูเนียร์ ให้เพิ่มจุดเหล่านี้: var อนุญาตให้มีการประกาศซ้ำและพฤติกรรมการยก (initialized as undefined), let ป้องกันการประกาศซ้ำในขอบเขตเดียวกัน, และ const ยังต้องการการเริ่มต้นและป้องกันการกำหนดค่าใหม่ (แม้ว่าวัตถุ/อาร์เรย์สามารถเปลี่ยนแปลงได้) ระบุว่า const และ let ได้รับการแนะนำใน JavaScript ยุคใหม่ ซึ่งแสดงให้เห็นว่าคุณไม่เพียงเข้าใจว่าควรใช้อะไร แต่ยังรวมถึงเหตุผลและเวลาที่จะใช้แต่ละประเภทด้วย
tr: İyi başlangıç! Alan farkını doğru şekilde belirttin. Bir başlangıç düzeyi rolü için cevabını güçlendirmek adına şu noktaları ekle: var, yeniden tanımlamaya ve hoisting davranışına izin verir (tanımsız olarak başlatılır), let, aynı kapsamda yeniden tanımlamayı önler ve const da başlatmayı gerektirir ve yeniden atamayı önler (ancak nesneler/diziler hala değiştirilebilir). Modern JavaScript'te const ve let'in tercih edildiğini belirt. Bu, yalnızca neyin doğru olduğunu anlamadığını, aynı zamanda ne zaman ve neden kullanman gerektiğini gösterir.
uk: Добрий початок! Ви правильно визначили різницю в області видимості. Щоб укріпити вашу відповідь для позиції молодшого розробника, додайте ці моменти: var дозволяє повторну декларацію та підняття (ініціалізується як undefined), let запобігає повторній декларації в тій самій області видимості, а const також вимагає ініціалізації і забороняє повторне присвоєння (хоча об'єкти/масиви все ж можуть бути змінені). Згадайте, що const і let є кращими в сучасному JavaScript. Це показує, що ви розумієте не лише що, а й чому та коли використовувати кожне з них.
vi: Khởi đầu tốt! Bạn đã xác định đúng sự khác biệt về phạm vi. Để củng cố câu trả lời của bạn cho vị trí nhân viên mới, hãy thêm những điểm sau: var cho phép khai báo lại và hành vi nâng lên (được khởi tạo dưới dạng undefined), let ngăn chặn khai báo lại trong cùng một phạm vi, và const cũng yêu cầu khởi tạo và ngăn chặn gán lại (mặc dù các đối tượng/mảng vẫn có thể bị thay đổi). Đề cập rằng const và let được ưa chuộng trong JavaScript hiện đại. Điều này cho thấy bạn hiểu không chỉ là cái gì, mà còn là lý do và khi nào nên sử dụng từng cái.

source: Google Calls emulator
ar: مُحاكي المكالمات من جوجل
be: Эмулятар выклікаў Google
da: Google Opkald emulator
es: Emulador de Llamadas de Google
fr: Émulateur d'appels Google
it: Emulatore di Chiamate Google
ja: Google Calls エミュレーター
pt: Emulador de Chamadas do Google
ru: Эмулятор вызовов Google
tr: Google Aramalar emülatörü
uk: Емулятор викликів Google

source: Grammar
ar: القواعد
be: Граматыка
da: Grammatik
de: Grammatik
es: Gramática
fr: Grammaire
id: Tata Bahasa
it: Grammatica
ja: 文法
ms: Tatabahasa
no: Grammatikk
pl: Gramatyka
pt: Gramática
ru: Грамматика
sv: Grammatik
th: ไวยากรณ์
tr: Dilbilgisi
uk: Граматика
vi: Ngữ pháp
