Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: The AI feedback on my CSS and JavaScript answers was spot-on. I improved my responses immediately.
ar: كانت ملاحظات الذكاء الاصطناعي على إجابات CSS و JavaScript الخاصة بي دقيقية للغاية. لقد حسنت إجاباتي على الفور.
be: Зваротная сувязь AI па маіх адказах на CSS і JavaScript была дакладнай. Я адразу палепшыў свае адказы.
da: AI-feedbacken på mine CSS- og JavaScript-svar var helt præcis. Jeg forbedrede mine svar med det samme.
de: Das KI-Feedback zu meinen CSS- und JavaScript-Antworten war genau richtig. Ich konnte meine Antworten sofort verbessern.
es: La retroalimentación de la IA sobre mis respuestas de CSS y JavaScript fue precisa. Mejoré mis respuestas de inmediato.
fr: Le retour d'information de l'IA sur mes réponses en CSS et JavaScript était très précis. J'ai amélioré mes réponses immédiatement.
id: Masukan AI pada jawaban CSS dan JavaScript saya sangat tepat. Saya langsung meningkatkan jawaban saya.
it: Il feedback dell'AI sulle mie risposte CSS e JavaScript è stato perfetto. Ho migliorato le mie risposte immediatamente.
ja: AIによる私のCSSとJavaScriptの回答へのフィードバックは的確でした。私はすぐに自分の回答を改善しました。
ms: Maklum balas AI pada jawapan CSS dan JavaScript saya adalah tepat. Saya segera memperbaiki jawapan saya.
no: AI-tilbakemeldingen på mine CSS- og JavaScript-svar var helt presis. Jeg forbedret svarene mine umiddelbart.
pl: Informacja zwrotna dotycząca moich odpowiedzi na CSS i JavaScript od sztucznej inteligencji była trafna. Natychmiast poprawiłem swoje odpowiedzi.
pt: O feedback da IA sobre minhas respostas em CSS e JavaScript foi preciso. Imediatamente melhorei minhas respostas.
ru: Обратная связь AI по моим ответам на CSS и JavaScript была точной. Я сразу же улучшил свои ответы.
sv: AI-feedbacken på mina svar om CSS och JavaScript var mitt i prick. Jag förbättrade mina svar omedelbart.
th: ความคิดเห็นจาก AI เกี่ยวกับคำตอบ CSS และ JavaScript ของฉันนั้นตรงเป้า ฉันปรับปรุงคำตอบของฉันทันที
tr: CSS ve JavaScript yanıtlarımla ilgili yapay zeka geri bildirimi tam isabetti. Yanıtlarımı hemen geliştirdim.
uk: Відгук від ШІ щодо моїх відповідей на CSS і JavaScript був точним. Я негайно поліпшив свої відповіді.
vi: Phản hồi AI về câu trả lời CSS và JavaScript của tôi rất chính xác. Tôi đã cải thiện các câu trả lời của mình ngay lập tức.

source: The answer should not take more than 300 words. ~2 minutes.
de: Die Antwort sollte nicht mehr als 300 Wörter umfassen. ~2 Minuten.
es: La respuesta no debe exceder las 300 palabras. ~2 minutos.
id: Jawabannya seharusnya tidak lebih dari 300 kata. ~2 menit.
it: La risposta non dovrebbe superare le 300 parole. ~2 minuti.
ja: 回答は300語を超えないようにしてください。おおよそ2分です。
no: Svaret bør ikke være mer enn 300 ord. ~2 minutter.
pl: Odpowiedź nie powinna przekraczać 300 słów. ~2 minuty.
pt: A resposta não deve ter mais de 300 palavras. ~2 minutos.
ru: Ответ не должен превышать 300 слов. ~2 минуты.
sv: Svaret bör inte vara mer än 300 ord. ~2 minuter.
th: คำตอบไม่ควรเกิน 300 คำ ~2 นาที
tr: Cevap 300 kelimeden fazla olmamalıdır. ~2 dakika.
uk: Відповідь не повинна перевищувати 300 слів. ~2 хвилини.
vi: Câu trả lời không nên dài quá 300 từ. ~2 phút.

source: The API versioning and resiliency practice helped me answer confidently. I got an offer in two weeks.
ar: ساعدتني ممارسة إصدار واجهة برمجة التطبيقات والمرونة في الإجابة بثقة. حصلتُ على عرض في غضون أسبوعين.
be: Практыка версіяніравання API і ўстойлівасці дапамагла мне ўпэўнена адказаць. Я атрымаў прапанову праз два тыдні.
da: API-versionering og robusthedspraksis hjalp mig med at svare selvsikkert. Jeg fik et tilbud efter to uger.
de: Die Versionierung der API und die Praxis der Widerstandsfähigkeit haben mir geholfen, selbstbewusst zu antworten. Ich habe in zwei Wochen ein Angebot erhalten.
es: La práctica de versiones de API y resiliencia me ayudó a responder con confianza. Recibí una oferta en dos semanas.
fr: La pratique de la versionnage de l'API et de la résilience m'a aidé à répondre en toute confiance. J'ai reçu une offre en deux semaines.
id: Praktik versi API dan ketahanan membantu saya menjawab dengan percaya diri. Saya mendapatkan tawaran dalam dua minggu.
it: La pratica della versioning e della resilienza delle API mi ha aiutato a rispondere con sicurezza. Ho ricevuto un'offerta in due settimane.
ja: API のバージョン管理とレジリエンシーの実践が、自信を持って回答するのに役立ちました。2週間でオファーを受け取りました。
ms: Amalan pengurusan versi API dan keteguhan membantu saya menjawab dengan yakin. Saya menerima tawaran dalam masa dua minggu.
no: API-versjonering og motstandsdyktighetspraksis hjalp meg å svare med selvtillit. Jeg fikk et tilbud innen to uker.
pl: Praktyka wersjonowania API i odporności pomogła mi odpowiedzieć z pewnością siebie. Dostałem ofertę w ciągu dwóch tygodni.
pt: A prática de versionamento e resiliência da API me ajudou a responder com confiança. Recebi uma oferta em duas semanas.
ru: Практика версионирования API и устойчивости помогла мне уверенно ответить. Я получил предложение через две недели.
sv: API-versionering och motståndskraftspraxis hjälpte mig att svara med självförtroende. Jag fick ett erbjudande inom två veckor.
th: การใช้งาน API รุ่นใหม่และการฝึกฝนเพื่อเพิ่มความทนทานช่วยให้ฉันตอบได้อย่างมั่นใจ ฉันได้รับข้อเสนอในสองสัปดาห์
tr: API sürümleme ve dayanıklılık uygulaması, sorularıma güvenle yanıt vermeme yardımcı oldu. İki hafta içinde bir teklif aldım.
uk: Практика версійності API та стійкості допомогла мені впевнено відповідати. Я отримав пропозицію роботи через два тижні.
vi: Việc thực hành phiên bản hóa API và khả năng chống chịu đã giúp tôi trả lời một cách tự tin. Tôi đã nhận được lời mời trong vòng hai tuần.

source: The biggest challenge in learning
de: Die größte Herausforderung beim Lernen
es: El mayor desafío en el aprendizaje
id: Tantangan terbesar dalam belajar
it: La sfida più grande nell'apprendimento
ja: 学習における最大の課題
no: Den største utfordringen i læring
pl: Największe wyzwanie w nauce
pt: O maior desafio em aprender
ru: Самая большая проблема в обучении
sv: Den största utmaningen i lärande
th: ความท้าทายที่ใหญ่ที่สุดในการเรียนรู้
tr: Öğrenmede en büyük zorluk
uk: Найбільший виклик у навчанні
vi: Thách thức lớn nhất trong việc học hỏi

source: The first few minutes of an interview are often dedicated to casual conversation — also known as 'SmallTalk'. Recruiters use this time to create a friendly atmosphere and get to know you a bit better.
ar: تُخصص الدقائق الأولى من المقابلة في الغالب للمحادثة العرضية - المعروفة أيضاً بـ 'الحديث الصغير'. يستخدم المجندين هذا الوقت لخلق جو ودي والتعرف عليك بشكل أفضل قليلاً.
be: Першыя некалькі хвілін інтэрвію часта прысвячаюцца неканкрэтнай размове — якую яшчэ называюць 'SmallTalk'. Рэкрутары выкарыстоўваюць гэты час для стварэння дружнага атмасферу і лепшага вас пазнання.
da: De første par minutter af et interview er ofte dedikeret til afslappet samtale - også kendt som 'SmallTalk'. Rekrutterere bruger denne tid til at skabe en venlig atmosfære og lære dig lidt bedre at kende.
de: Die ersten Minuten eines Vorstellungsgesprächs werden oft für eine lockere Unterhaltung genutzt - auch als 'SmallTalk' bekannt. Personalvermittler nutzen diese Zeit, um eine freundliche Atmosphäre zu schaffen und Sie etwas besser kennenzulernen.
es: Los primeros minutos de una entrevista a menudo se dedican a la conversación informal, también conocida como 'SmallTalk'. Los reclutadores utilizan este tiempo para crear un ambiente amigable y conocerte un poco mejor.
fr: Les premières minutes d'un entretien sont souvent consacrées à une conversation informelle — aussi connue sous le nom de 'SmallTalk'. Les recruteurs utilisent ce temps pour créer une atmosphère conviviale et pour mieux vous connaître.
id: Beberapa menit pertama dalam sebuah wawancara seringkali didedikasikan untuk percakapan santai — juga dikenal sebagai 'SmallTalk'. Perekrut menggunakan waktu ini untuk menciptakan suasana yang ramah dan mengenal Anda sedikit lebih baik.
it: I primi minuti di un colloquio sono spesso dedicati alla conversazione informale, conosciuta anche come 'SmallTalk'. I reclutatori utilizzano questo tempo per creare un'atmosfera amichevole e per conoscerti un po' meglio.
ja: 面接の最初の数分は、カジュアルな会話に費やされることがよくあります - これは「スモールトーク」もといです。リクルーターは、この時間を使って友好的な雰囲気を作り出し、あなたのことをもう少し理解するために使用します。
ms: Beberapa minit pertama temu duga seringkali ditujukan untuk perbualan santai - yang juga dikenali sebagai 'SmallTalk'. Perekrut menggunakan masa ini untuk mencipta suasana yang mesra dan mengenali anda sedikit lebih baik.
no: De første minuttene av et intervju er ofte viet til uformell samtale - også kjent som 'SmallTalk'. Rekrutterere bruker denne tiden til å skape en vennlig atmosfære og bli litt bedre kjent med deg.
pl: Pierwsze kilka minut rozmowy kwalifikacyjnej jest często poświęcone na luźną rozmowę, znaną również jako 'SmallTalk'. Rekruterzy wykorzystują ten czas, aby stworzyć przyjazną atmosferę i lepiej Cię poznać.
pt: Os primeiros minutos de uma entrevista são frequentemente dedicados a uma conversa casual — também conhecida como 'SmallTalk'. Os recrutadores usam esse tempo para criar uma atmosfera amigável e conhecê-lo um pouco melhor.
ru: Первые несколько минут интервью часто посвящены неформальному общению, известному как 'SmallTalk'. Рекрутеры используют это время, чтобы создать дружественную атмосферу и немного лучше узнать вас.
sv: De första minuterna av en intervju ägnas ofta åt vardagligt samtal - också känt som 'SmallTalk'. Rekryterare använder denna tid till att skapa en vänlig atmosfär och lära känna dig lite bättre.
th: ไม่กี่นาทีแรกของการสัมภาษณ์มักจะมอบให้สำหรับการสนทนาทั่วไป - ซึ่งเรียกว่า 'SmallTalk' ผู้สรรหาบุคลากรใช้เวลานี้เพื่อสร้างบรรยากาศที่เป็นมิตรและทำความรู้จักคุณมากขึ้นเล็กน้อย
tr: Bir mülakatın ilk birkaç dakikası genellikle gündelik sohbete ayrılır - aynı zamanda 'SmallTalk' olarak da bilinir. İşe alımcılar bu süreyi dostça bir atmosfer yaratmak ve sizi biraz daha iyi tanımak için kullanır.
uk: Перші кілька хвилин співбесіди часто присвячені неформальній бесіді - так званому 'SmallTalk'. Рекрутери використовують цей час, щоб створити дружню атмосферу та краще вас пізнати.
vi: Những phút đầu của buổi phỏng vấn thường được dành để trò chuyện không chính thức - còn được gọi là 'SmallTalk'. Nhà tuyển dụng sử dụng thời gian này để tạo ra một không khí thân thiện và hiểu bạn hơn một chút.

source: The key differences between them.
ar: الاختلافات الرئيسية بينهما.
be: Ключавыя адрозненні паміж імі.
da: De væsentlige forskelle mellem dem.
de: Die wesentlichen Unterschiede zwischen ihnen.
es: Las diferencias clave entre ellos.
fr: Les différences principales entre eux.
id: Perbedaan utama antara mereka.
it: Le differenze chiave tra di loro.
ja: 彼らの主な違い。
no: De viktigste forskjellene mellom dem.
pl: Kluczowe różnice między nimi.
pt: As principais diferenças entre eles.
ru: Ключевые различия между ними.
sv: De viktigaste skillnaderna mellan dem.
th: ความแตกต่างที่สำคัญระหว่างพวกเขา
tr: Aralarındaki temel farklar.
uk: Ключові відмінності між ними.
vi: Sự khác biệt chính giữa chúng.

source: The key: small posts are valid. One sentence is enough.
uk: Ключ: маленькі пости прийнятні. Одного речення достатньо.

source: The last question before we create your plan
de: Die letzte Frage, bevor wir Ihren Plan erstellen.
es: La última pregunta antes de crear tu plan
id: Pertanyaan terakhir sebelum kami membuat rencana Anda
it: L'ultima domanda prima di creare il tuo piano
ja: プランを作成する前の最後の質問
no: Det siste spørsmålet før vi lager planen din
pl: Ostatnie pytanie, zanim stworzymy Twój plan
pt: A última pergunta antes de criarmos seu plano
ru: Последний вопрос перед тем, как мы создадим ваш план
sv: Den sista frågan innan vi skapar din plan
th: คำถามสุดท้ายก่อนที่เราจะสร้างแผนของคุณ
tr: Planınızı oluşturmadan önceki son soru
uk: Останнє питання перед створенням вашого плану
vi: Câu hỏi cuối cùng trước khi chúng tôi tạo kế hoạch của bạn

source: The main idea is to build a service that lives for a long time and stays fun. A service where, on the About page, I can write to you like a friend — not like a "user."
ja: 基本的なアイデアは、長い間続く楽しいサービスを作ることです。「ユーザー」ではなく、「友達」のようにAboutページであなたに書けるようなサービスです。
no: Hovedideen er å bygge en tjeneste som lever lenge og forblir morsom. En tjeneste hvor jeg, på Om-siden, kan skrive til deg som en venn — ikke som en "bruker."
uk: Основна ідея полягає в тому, щоб створити сервіс, який існує довго та залишається цікавим. Сервіс, на сторінці "Про нас" якого я можу писати вам, як другу — не як "користувачу".

source: The paid plan gives you full access to all FluencyPal features, including unlimited speaking practice, all learning modes, personalized practice plans, and progress tracking.
ar: توفر لك الخطة المدفوعة الوصول الكامل إلى جميع ميزات FluencyPal، بما في ذلك ممارسة الحديث غير المحدودة، جميع أوضاع التعلم، خطط الممارسة المخصصة، وتتبع التقدم.
be: Платны план дае вам поўны доступ да ўсіх функцый FluencyPal, уключаючы неабмежаваную практыку маўлення, усе рэжымы навучання, персаналізаваныя планы практыкі і адсочванне прагрэсу.
da: Den betalte plan giver dig fuld adgang til alle FluencyPal-funktioner, inklusive ubegrænset taletræning, alle læringstilstande, personlige træningsplaner og fremskriftssporing.
de: Der kostenpflichtige Plan bietet Ihnen vollen Zugriff auf alle FluencyPal-Funktionen, einschließlich unbegrenzter Sprechübungen, aller Lernmodi, personalisierter Übungspläne und Fortschrittsverfolgung.
es: El plan de pago te da acceso completo a todas las funciones de FluencyPal, incluyendo práctica de conversación ilimitada, todos los modos de aprendizaje, planes de práctica personalizados y seguimiento del progreso.
fr: Le plan payant vous donne un accès complet à toutes les fonctionnalités de FluencyPal, y compris la pratique de la parole illimitée, tous les modes d'apprentissage, des plans de pratique personnalisés, et le suivi des progrès.
id: Paket berbayar memberi Anda akses penuh ke semua fitur FluencyPal, termasuk latihan berbicara tanpa batas, semua mode pembelajaran, rencana latihan yang dipersonalisasi, dan pelacakan kemajuan.
it: Il piano a pagamento ti dà pieno accesso a tutte le funzionalità di FluencyPal, inclusa la pratica di conversazione illimitata, tutte le modalità di apprendimento, piani di pratica personalizzati e monitoraggio dei progressi.
ja: 有料プランに加入すると、無制限のスピーキング練習、すべての学習モード、個別の練習プラン、進捗状況の追跡を含む、FluencyPalのすべての機能に完全にアクセスできます。
no: Den betalte planen gir deg full tilgang til alle FluencyPal-funksjoner, inkludert ubegrenset taletrening, alle læringsmoduser, personlig tilpassede treningsplaner og sporing av fremgang.
pl: Płatny plan zapewnia pełny dostęp do wszystkich funkcji FluencyPal, w tym nieograniczonej praktyki mówienia, wszystkich trybów nauki, spersonalizowanych planów ćwiczeń oraz śledzenia postępów.
pt: O plano pago dá-lhe acesso total a todas as funcionalidades do FluencyPal, incluindo prática de conversação ilimitada, todos os modos de aprendizagem, planos de prática personalizados e acompanhamento de progresso.
ru: Платный план предоставляет вам полный доступ ко всем функциям FluencyPal, включая неограниченную практику разговорной речи, все режимы обучения, персонализированные планы практики и отслеживание прогресса.
sv: Betalplanen ger dig full åtkomst till alla FluencyPal-funktioner, inklusive obegränsad talövning, alla lärandemodes, personliga övningsplaner och framstegsövervakning.
th: แผนการชำระเงินจะมอบสิทธิ์ในการเข้าถึงฟีเจอร์ทั้งหมดยกเว้นใน FluencyPal ให้กับคุณ รวมถึงฝึกการพูดไม่จำกัด ทุกโหมดการเรียนรู้ แผนการฝึกที่ปรับให้เหมาะสมกับคุณ และการติดตามความก้าวหน้า
tr: Ücretli plan, sınırsız konuşma pratiği, tüm öğrenme modları, kişiselleştirilmiş pratik planları ve ilerleme takibi dahil olmak üzere tüm FluencyPal özelliklerine tam erişim sağlar.
uk: Платний план надає вам повний доступ до всіх функцій FluencyPal, включаючи необмежену практику мовлення, всі режими навчання, персоналізовані плани практики та відстеження прогресу.
vi: Gói trả phí cho phép bạn truy cập đầy đủ tất cả các tính năng của FluencyPal, bao gồm thực hành nói không giới hạn, tất cả các chế độ học, kế hoạch thực hành cá nhân hóa, và theo dõi tiến trình.

source: The personalized feedback showed me exactly what I was doing wrong in my technical explanations. Game changer.
ar: أظهر لي التعليق الشخصي بالضبط ما كنت أفعله بشكل خاطئ في شروحاتي التقنية. تغيير اللعبة.
be: Персаналізаваная зваротная сувязь дакладна паказала мне, што я рабіў няправільна ў сваіх тэхнічных тлумачэннях. Гэта змяніла гульню.
da: Den personlige feedback viste mig præcis, hvad jeg gjorde forkert i mine tekniske forklaringer. Game changer.
de: Das personalisierte Feedback hat mir genau gezeigt, was ich bei meinen technischen Erklärungen falsch gemacht habe. Ein echter Wendepunkt.
es: El feedback personalizado me mostró exactamente en qué me estaba equivocando en mis explicaciones técnicas. Un cambio total.
fr: Le retour d'information personnalisé m'a montré exactement ce que je faisais mal dans mes explications techniques. Révolutionnaire.
id: Umpan balik yang dipersonalisasi menunjukkan kepada saya dengan tepat apa yang saya lakukan salah dalam penjelasan teknis saya. Mengubah permainan.
it: Il feedback personalizzato mi ha mostrato esattamente cosa stavo sbagliando nelle mie spiegazioni tecniche. Cambiamo le carte in tavola.
ja: パーソナライズされたフィードバックは、私の技術的な説明で何が間違っているかを正確に教えてくれました。ゲームチェンジャーです。
ms: Maklum balas peribadi menunjukkan kepada saya dengan tepat apa yang saya lakukan salah dalam penjelasan teknikal saya. Pengubah permainan.
no: Den personlige tilbakemeldingen viste meg nøyaktig hva jeg gjorde feil i mine tekniske forklaringer. En skikkelig forandring.
pl: Spersonalizowana informacja zwrotna pokazała mi dokładnie, co robię źle w moich technicznych wyjaśnieniach. Przełomowa zmiana.
pt: O feedback personalizado mostrou-me exatamente o que eu estava fazendo de errado nas minhas explicações técnicas. Mudança de jogo.
ru: Персонализированный отзыв показал мне, что именно я делал неправильно в своих технических объяснениях. Переворот в игре.
sv: Den personliga återkopplingen visade mig exakt vad jag gjorde fel i mina tekniska förklaringar. En riktig förändring.
th: คำติชมเฉพาะบุคคลได้แสดงให้ฉันเห็นอย่างชัดเจนว่าฉันทำอะไรผิดในคำอธิบายทางเทคนิคของฉัน ถือเป็นตัวเปลี่ยนเกม
tr: Kişiselleştirilmiş geri bildirim, teknik açıklamalarımda neyi yanlış yaptığımı tam olarak gösterdi. Oyunun kurallarını değiştiren bir hamle.
uk: Персоналізований зворотній зв'язок показав мені точно, що я робив не так у своїх технічних поясненнях. Це змінило правила гри.
vi: Phản hồi cá nhân hóa đã chỉ cho tôi chính xác những gì tôi làm sai trong các giải thích kỹ thuật của mình. Thay đổi cục diện.

source: The request will be sent to user {userName}.
ar: سيتم إرسال الطلب إلى المستخدم {userName}.
be: Запыт будзе адпраўлены карыстальніку {userName}.
da: Anmodningen vil blive sendt til bruger {userName}.
de: Die Anfrage wird an den Benutzer {userName} gesendet.
es: La solicitud será enviada al usuario {userName}.
fr: La demande sera envoyée à l'utilisateur {userName}.
id: Permintaan akan dikirim ke pengguna {userName}.
it: La richiesta sarà inviata all'utente {userName}.
ja: リクエストはユーザー {userName} に送信されます。
no: Forespørselen vil bli sendt til bruker {userName}.
pl: Żądanie zostanie wysłane do użytkownika {userName}.
pt: A solicitação será enviada para o usuário {userName}.
ru: Запрос будет отправлен пользователю {userName}.
sv: Begäran kommer att skickas till användare {userName}.
th: คำขอจะถูกส่งไปยังผู้ใช้ {userName}.
tr: İstek, {userName} kullanıcısına gönderilecek.
uk: Запит буде надіслано користувачу {userName}.
vi: Yêu cầu sẽ được gửi tới người dùng {userName}.

source: The winner earns {points} game points!
ar: الفائز يكسب {points} نقاط في اللعبة!
be: Пераможца зарабляе {points} гульнявых балаў!
da: Vinderen tjener {points} spillepoint!
de: Der Gewinner erhält {points} Spielpunkte!
es: ¡El ganador gana {points} puntos de juego!
fr: Le gagnant gagne {points} points de jeu !
id: Pemenang mendapatkan {points} poin permainan!
it: Il vincitore guadagna {points} punti gioco!
ja: 勝者は{points}ゲームポイントを獲得します！
no: Vinneren tjener {points} spillpoeng!
pl: Zwycięzca zdobywa {points} punkty w grze!
pt: O vencedor ganha {points} pontos de jogo!
ru: Победитель зарабатывает {points} игровых очков!
sv: Vinnaren tjänar {points} spelpoäng!
th: ผู้ชนะได้รับ {points} คะแนนจากเกม!
tr: Kazanan {points} oyun puanı kazanıyor!
uk: Переможець заробляє {points} ігрових балів!
vi: Người chiến thắng sẽ kiếm được {points} điểm trò chơi!

source: The winner gets {points} game points!
ar: يحصل الفائز على {points} نقاط لعبة!
be: Пераможца атрымлівае {points} гульнявых ачкоў!
da: Vinderen får {points} spilpoint!
de: Der Gewinner erhält {points} Spielpunkte!
es: ¡El ganador obtiene {points} puntos de juego!
fr: Le gagnant obtient {points} points de jeu !
id: Pemenang mendapatkan {points} poin permainan!
it: Il vincitore ottiene {points} punti gioco!
ja: 優勝者には {points} ゲームポイントが贈られます！
no: Vinneren får {points} spillpoeng!
pl: Zwycięzca otrzymuje {points} punktów w grze!
pt: O vencedor ganha {points} pontos de jogo!
ru: Победитель получает {points} игровых очков!
sv: Vinnaren får {points} poäng i spelet!
th: ผู้ชนะได้รับ {points} คะแนนเกม!
tr: Kazanan {points} oyun puanı alır!
uk: Переможець отримує {points} ігрових балів!
vi: Người chiến thắng nhận được {points} điểm trò chơi!

source: The winner has been declared.
ar: تم إعلان الفائز.
be: Пераможца быў абвешчаны.
da: Vinderen er blevet erklæret.
de: Der Gewinner wurde bekannt gegeben.
es: El ganador ha sido declarado.
fr: Le gagnant a été déclaré.
id: Pemenang telah diumumkan.
it: Il vincitore è stato dichiarato.
ja: 勝者が宣言されました。
no: Vinneren er erklært.
pl: Zwycięzca został ogłoszony.
pt: O vencedor foi declarado.
ru: Победитель был объявлен.
sv: Vinnaren har utsetts.
th: ผู้ชนะได้ถูกประกาศแล้ว
tr: Kazanan ilan edildi.
uk: Переможця оголошено.
vi: Người chiến thắng đã được công bố.

source: There are no investors. In some ways, that's a disadvantage — with investor money, I could buy ads, for example. But I really like the feeling of freedom. I like that no one demands the service make money or "pay back" investments. So I hope there will never be investors. Freedom matters more.
no: Det er ingen investorer. På noen måter er det en ulempe — med investorpenger kunne jeg for eksempel kjøpt annonser. Men jeg liker virkelig følelsen av frihet. Jeg liker at ingen krever at tjenesten tjener penger eller "tilbakebetaler" investeringer. Så jeg håper det aldri vil være investorer. Frihet betyr mer.
uk: Тут немає інвесторів. У певному сенсі, це недолік — наприклад, з грошима від інвесторів я міг би купити рекламу. Але мені справді подобається почуття свободи. Мені подобається, що ніхто не вимагає від сервісу заробляти гроші або "виправдовувати" інвестиції. Тому я сподіваюся, що інвесторів ніколи не буде. Свобода означає більше.

source: There is a community here where you can talk about different topics and share what's on your mind.
no: Det er et fellesskap her hvor du kan snakke om forskjellige emner og dele det du tenker på.
uk: Є спільнота, де ви можете обговорювати різні теми та ділитися тим, що у вас на думці.
