Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Can I practice languages other than English?
ar: هل يمكنني ممارسة لغات أخرى غير الإنجليزية؟
be: Ці магу я практаваць мовы, адмысловыя ад англійскай?
da: Kan jeg øve sprog udover engelsk?
de: Kann ich Sprachen neben Englisch üben?
es: ¿Puedo practicar idiomas además del inglés?
fr: Puis-je pratiquer des langues autres que l'anglais ?
id: Bisakah saya berlatih bahasa selain Inggris?
it: Posso praticare lingue diverse dall'inglese?
ja: 他の言語を練習することはできますか？
ms: Bolehkah saya berlatih bahasa selain Bahasa Inggeris?
no: Kan jeg øve på språk annet enn engelsk?
pl: Czy mogę ćwiczyć języki inne niż angielski?
pt: Posso praticar idiomas além do inglês?
ru: Могу ли я практиковать языки, кроме английского?
sv: Kan jag öva andra språk än engelska?
th: ฉันสามารถฝึกภาษาอื่นนอกเหนือจากภาษาอังกฤษได้ไหม?
tr: Diğer dillerde de pratik yapabilir miyim?
uk: Чи можу я практикувати мови, окрім англійської?
vi: Tôi có thể luyện tập các ngôn ngữ khác ngoài tiếng Anh không?

source: Can I stop using FluencyPal anytime?
ar: هل يمكنني التوقف عن استخدام FluencyPal في أي وقت؟
be: Ці магу я спыніць выкарыстанне FluencyPal у любы час?
da: Kan jeg stoppe med at bruge FluencyPal når som helst?
de: Kann ich die Nutzung von FluencyPal jederzeit beenden?
es: ¿Puedo dejar de usar FluencyPal en cualquier momento?
fr: Puis-je arrêter d'utiliser FluencyPal à tout moment ?
id: Apakah saya dapat berhenti menggunakan FluencyPal kapan saja?
it: Posso smettere di usare FluencyPal in qualsiasi momento?
ja: FluencyPalはいつでも使用を停止できますか？
no: Kan jeg slutte å bruke FluencyPal når som helst?
pl: Czy mogę przestać używać FluencyPal w dowolnym momencie?
pt: Posso parar de usar o FluencyPal a qualquer momento?
ru: Могу ли я перестать пользоваться FluencyPal в любое время?
sv: Kan jag sluta använda FluencyPal när som helst?
th: ฉันสามารถหยุดใช้ FluencyPal ได้ทุกเมื่อหรือไม่?
tr: FluencyPal'i istediğim zaman kullanmayı bırakabilir miyim?
uk: Чи можу я перестати користуватися FluencyPal у будь-який час?
vi: Tôi có thể ngừng sử dụng FluencyPal bất cứ lúc nào không?

source: Can I use FluencyPal for free?
ar: هل يمكنني استخدام FluencyPal مجانًا؟
be: Ці магу я выкарыстоўваць FluencyPal бясплатна?
da: Kan jeg bruge FluencyPal gratis?
de: Kann ich FluencyPal kostenlos nutzen?
es: ¿Puedo usar FluencyPal de forma gratuita?
fr: Puis-je utiliser FluencyPal gratuitement ?
id: Bisakah saya menggunakan FluencyPal secara gratis?
it: Posso usare FluencyPal gratuitamente?
ja: FluencyPalを無料で使用できますか？
no: Kan jeg bruke FluencyPal gratis?
pl: Czy mogę korzystać z FluencyPal za darmo?
pt: Posso usar o FluencyPal de graça?
ru: Могу ли я использовать FluencyPal бесплатно?
sv: Kan jag använda FluencyPal gratis?
th: ฉันสามารถใช้ FluencyPal ได้ฟรีหรือไม่?
tr: FluencyPal'i ücretsiz kullanabilir miyim?
uk: Чи можу я використовувати FluencyPal безкоштовно?
vi: Tôi có thể sử dụng FluencyPal miễn phí không?

source: Cancel
ar: إلغاء
be: Скасаваць
da: Annuller
de: Abbrechen
es: Cancelar
fr: Annuler
id: Batal
it: Annulla
ja: キャンセル
ms: Batal
no: Avbryt
pl: Anuluj
pt: Cancelar
ru: Отмена
sv: Avbryt
th: ยกเลิก
tr: İptal
uk: Скасувати
vi: Hủy bỏ

source: Cancel recording
ar: إلغاء التسجيل
be: Скасаваць запіс
da: Annuller optagelse
de: Aufnahme abbrechen
es: Cancelar grabación
fr: Annuler l'enregistrement
id: Batalkan perekaman
it: Annulla registrazione
ja: 録音をキャンセル
ms: Batalkan rakaman
no: Avbryt opptak
pl: Anuluj nagrywanie
pt: Cancelar gravação
ru: Отменить запись
sv: Avbryt inspelning
th: ยกเลิกการบันทึก
tr: Kaydı iptal et
uk: Скасувати запис
vi: Hủy bỏ ghi âm

source: Candidate's answer
ar: إجابة المرشح
be: Адказ кандыдата
da: Kandidatens svar
de: Antwort des Kandidaten
es: Respuesta del candidato
fr: Réponse du candidat
id: Jawaban Kandidat
it: Risposta del candidato
ja: 候補者の回答
ms: Jawapan calon
no: Kandidatens svar
pl: Odpowiedź kandydata
pt: Resposta do candidato
ru: Ответ кандидата
sv: Kandidatens svar
th: คำตอบของผู้สมัคร
tr: Adayın cevabı
uk: Відповідь кандидата
vi: Câu trả lời của ứng viên

source: Candidates targeting product companies with distributed backends
ar: المرشحون الذين يستهدفون شركات المنتجات ذات الأنظمة الخلفية الموزعة
be: Кандыдаты, якія нацэлены на прадуктовыя кампаніі з размеркаванымі бэкэндамі
da: Kandidater, der sigter mod produktvirksomheder med distribuerede backend-systemer
de: Kandidaten, die auf Produktunternehmen mit verteilten Backends abzielen
es: Candidatos que tienen como objetivo empresas de productos con backend distribuido
fr: Les candidats ciblant les entreprises de produits avec des backends distribués
id: Kandidat menargetkan perusahaan produk dengan backend terdistribusi
it: Candidati che puntano ad aziende di prodotto con backend distribuiti
ja: プロダクト企業と分散バックエンドをターゲットにする候補者
ms: Kandidat mensasarkan syarikat produk dengan infrastruktur belakang yang diedarkan
no: Kandidater som retter seg mot produktselskaper med distribuerte backend-systemer
pl: Kandydaci celujący w firmy produktowe z rozproszonymi backendami
pt: Candidatos direcionados a empresas de produtos com backends distribuídos
ru: Кандидаты, нацеленные на продуктовые компании с распределёнными бэкендами
sv: Kandidater som riktar in sig på produktföretag med distribuerade backend-system
th: ผู้สมัครที่มุ่งเน้นไปที่บริษัทผลิตภัณฑ์ที่มีระบบเบื้องหลังแบบกระจาย
tr: Dağıtılmış backendlere sahip ürün şirketlerini hedefleyen adaylar
uk: Кандидати, які орієнтуються на продуктові компанії з розподіленими бекендами
vi: Các ứng viên nhắm đến các công ty sản phẩm với các backend phân tán

source: Candidates who already know the basics but struggle to articulate decisions clearly in interviews
ar: المرشحين الذين يعرفون الأساسيات بالفعل ولكنهم يواجهون صعوبة في التعبير عن قراراتهم بوضوح في المقابلات
be: Кандыдаты, якія ўжо ведаюць асновы, але маюць цяжкасці з выразным высказваннем рашэнняў на сумоўях
da: Kandidater, der allerede kender det grundlæggende, men har svært ved at formulere beslutninger klart i interviews
de: Kandidaten, die bereits die Grundlagen kennen, aber Schwierigkeiten haben, Entscheidungen in Interviews klar zu artikulieren.
es: Candidatos que ya conocen los conceptos básicos pero tienen dificultades para articular decisiones con claridad en las entrevistas
fr: Les candidats qui connaissent déjà les bases mais ont du mal à articuler clairement leurs décisions lors des entretiens
id: Kandidat yang sudah mengetahui dasar-dasar tetapi kesulitan untuk menyampaikan keputusan dengan jelas dalam wawancara
it: Candidati che già conoscono le basi ma hanno difficoltà ad articolare chiaramente le decisioni durante i colloqui
ja: 基礎を既に理解しているが、面接において判断を明確に説明するのに苦労している候補者
ms: Calon yang sudah tahu asas tetapi bergelut untuk menyampaikan keputusan dengan jelas dalam temu duga.
no: Kandidater som allerede kjenner det grunnleggende, men sliter med å artikulere beslutninger tydelig i intervjuer
pl: Kandydaci, którzy już znają podstawy, ale mają trudności z jasnym artykułowaniem decyzji podczas rozmów kwalifikacyjnych
pt: Candidatos que já conhecem o básico, mas têm dificuldades para articular decisões claramente em entrevistas
ru: Кандидаты, которые уже знают основы, но испытывают трудности с четким изложением решений на собеседованиях.
sv: Kandidater som redan känner till grunderna men har svårt att tydligt formulera beslut under intervjuer
th: ผู้สมัครที่ทราบพื้นฐานอยู่แล้วแต่ยังคงมีปัญหาในการอธิบายการตัดสินใจอย่างชัดเจนในระหว่างการสัมภาษณ์
tr: Zaten temel bilgileri bilen ancak mülakatlarda kararlarını net bir şekilde ifade etmekte zorlanan adaylar
uk: Кандидати, які вже знають основи, але мають труднощі з чітким формулюванням рішень на співбесідах
vi: Những ứng viên đã biết những kiến thức cơ bản nhưng gặp khó khăn trong việc trình bày rõ ràng các quyết định trong các cuộc phỏng vấn

source: Card verified. Loading...
ar: تم التحقق من البطاقة. جارٍ التحميل...
be: Карта праверана. Загрузка...
da: Kort bekræftet. Indlæser...
de: Karte verifiziert. Wird geladen...
es: Tarjeta verificada. Cargando...
fr: Carte vérifiée. Chargement...
id: Kartu terverifikasi. Memuat...
it: Carta verificata. Caricamento in corso...
ja: カードが確認されました。読み込み中...
ms: Kad disahkan. Memuat...
no: Kortet er bekreftet. Laster inn...
pl: Karta zweryfikowana. Ładowanie...
pt: Cartão verificado. Carregando...
ru: Карта подтверждена. Загрузка...
sv: Kort verifierat. Laddar...
th: บัตรได้รับการยืนยันแล้ว กำลังโหลด...
tr: Kart doğrulandı. Yükleniyor...
uk: Картка підтверджена. Завантаження...
vi: Thẻ đã được xác minh. Đang tải...

source: Career Advancement
ar: تقدم المسار الوظيفي
be: Прасоўванне па Кар'еры
da: Karrierefremme
de: Beruflicher Aufstieg
es: Avance Profesional
fr: Avancement de Carrière
id: Kemajuan Karir
it: Avanzamento di carriera
ja: キャリアの向上
ms: Peningkatan Kerjaya
no: Karrierefremgang
pl: Rozwój Kariery
pt: Avanço na Carreira
ru: Карьерный рост
sv: Karriärutveckling
th: ความก้าวหน้าในอาชีพ
tr: Kariyer İlerlemesi
uk: Просування по кар'єрі
vi: Sự Thăng Tiến Trong Sự Nghiệp

source: Career benefit:
ar: الفائدة المهنية:
be: Кар'ерны выгад:
da: Karriere fordel:
de: Karrierevorteil:
es: Beneficio profesional:
fr: Avantage de carrière:
id: Manfaat karir:
it: Beneficio professionale:
ja: キャリアのメリット:
ms: Manfaat kerjaya:
no: Karrierefordel:
pl: Korzyść zawodowa:
pt: Benefício de carreira:
ru: Преимущества для карьеры:
sv: Karriärfördel:
th: ผลประโยชน์ทางอาชีพ:
tr: Kariyer faydası:
uk: Користь для кар'єри:
vi: Lợi ích nghề nghiệp:

source: Chat
ar: الدردشة
be: Чат
de: Plaudern
es: Charlar
fr: Bavarder
id: Obrolan
ja: チャット
pl: Czat
pt: Bate-papo
ru: Чат
sv: Chatt
th: แชท
tr: Sohbet
uk: Чат
vi: Trò chuyện

source: Chat between you and {userName}
de: Unterhaltung zwischen Ihnen und {userName}
es: Chat entre tú y {userName}
id: Obrolan antara Anda dan {userName}
it: Chat tra te e {userName}
ja: {userName}とのチャット
no: Chat mellom deg og {userName}
pl: Czat między tobą a {userName}
pt: Conversa entre você e {userName}
ru: Чат между вами и {userName}
sv: Chat mellan dig och {userName}
th: การสนทนาระหว่างคุณกับ {userName}
tr: Senin ile {userName} arasında sohbet
uk: Чат між вами та {userName}
vi: Cuộc trò chuyện giữa bạn và {userName}

source: Chat deleted successfully.
id: Obrolan berhasil dihapus.
it: Chat eliminata con successo.
ja: チャットが正常に削除されました。
no: Chat slettet vellykket.
pl: Czat został pomyślnie usunięty.
ru: Чат успешно удален.
sv: Chat raderad framgångsrikt.
uk: Чат успішно видалено.

source: Chat history
ar: سجل المحادثة
be: Гісторыя чата
da: Chat historik
de: Chatverlauf
es: Historial de chat
fr: Historique de chat
id: Riwayat obrolan
it: Cronologia chat
ja: チャット履歴
ms: Sejarah sembang
no: Chatthistorikk
pl: Historia czatu
pt: Histórico de chat
ru: История чата
sv: Chatt-historik
th: ประวัติการแชท
tr: Sohbet geçmişi
uk: Історія чату
vi: Lịch sử trò chuyện

source: Chat not found or you don't have access to it.
de: Chat nicht gefunden oder Sie haben keinen Zugriff darauf.
es: Chat no encontrado o no tienes acceso a él.
id: Obrolan tidak ditemukan atau Anda tidak memiliki akses ke dalamnya.
it: Chat non trovato o non hai accesso ad esso.
ja: チャットが見つからない、またはあなたにはアクセス権がありません。
no: Chat ikke funnet, eller du har ikke tilgang til det.
pl: Czat nie znaleziony lub nie masz do niego dostępu.
pt: Chat não encontrado ou você não tem acesso a ele.
ru: Чат не найден или у вас нет доступа к нему.
sv: Chatten hittades inte eller så har du inte åtkomst till den.
th: ไม่พบการสนทนาหรือคุณไม่มีสิทธิ์ในการเข้าถึง
tr: Sohbet bulunamadı veya bu sohbete erişiminiz yok.
uk: Чат не знайдено або у вас немає доступу до нього.
vi: Cuộc trò chuyện không được tìm thấy hoặc bạn không có quyền truy cập vào nó.

source: Chat with a Fellow Dog Owner
ar: تحدث مع مالك كلب آخر
be: Пагутарайце з уладальнікам сабакі
da: Chat med en Medhundeejer
de: Chatte mit einem anderen Hundebesitzer
es: Chatea con otro propietario de perro
fr: Discuter avec un autre propriétaire de chien
id: Berbincang dengan Pemilik Anjing Lain
it: Chatta con un Altrettanto Amante dei Cani
ja: 同じ犬を飼っている飼い主とチャットする
ms: Bersihkan dengan Pemilik Anjing Lain
no: Chat med en medhundeeier
pl: Porozmawiaj z innym właścicielem psa
pt: Converse com Outro Dono de Cão
ru: Поговорите с другим владельцем собаки
sv: Chatta med en annan hundägare
th: แชทกับเจ้าของสุนัขคนอื่น
tr: Diğer Bir Köpek Sahibiyle Sohbet Et
uk: Поспілкуйтесь з іншими власниками собак
vi: Chat với một Chủ Sở Hữu Chó Khác

source: Check proposed words
ar: تحقق من الكلمات المقترحة
be: Праверце прапанаваныя словы
da: Tjek foreslåede ord
de: Überprüfen Sie vorgeschlagene Wörter
es: Revisa las palabras propuestas
fr: Vérifiez les mots proposés
id: Periksa kata-kata yang diusulkan
it: Controlla le parole proposte
ja: 提案された単語を確認してください
ms: Periksa kata-kata yang dicadangkan
no: Sjekk foreslåtte ord
pl: Sprawdź proponowane słowa
pt: Verifique as palavras propostas
ru: Проверьте предложенные слова
sv: Kontrollera föreslagna ord
th: ตรวจสอบคำที่เสนอ
tr: Önerilen kelimeleri kontrol edin
uk: Перевірте запропоновані слова
vi: Kiểm tra các từ đề xuất

source: Check your email
ar: تحقق من بريدك الإلكتروني
be: Праверце сваю электронную пошту
da: Tjek din email
de: Überprüfen Sie Ihre E-Mail
es: Verifica tu correo electrónico
fr: Vérifiez votre e-mail
id: Periksa email Anda
it: Controlla la tua email
ja: メールを確認する
no: Sjekk e-posten din
pl: Sprawdź swój e-mail
pt: Verifique o seu e-mail
ru: Проверьте свою электронную почту
sv: Kontrollera din e-post
th: ตรวจสอบอีเมลของคุณ
tr: E-postanızı kontrol edin
uk: Перевірте вашу електронну пошту
vi: Kiểm tra email của bạn

source: Check Your Progress
ar: تحقق من تقدمك
be: Праверце Ваш Прагрэс
da: Tjek din fremgang
de: Überprüfen Sie Ihren Fortschritt
es: Verifica tu Progreso
fr: Vérifiez vos progrès
id: Periksa Kemajuan Anda
it: Controlla i tuoi progressi
ja: 進捗を確認する
ms: Semak Kemajuan Anda
no: Sjekk Fremdriften Din
pl: Sprawdź swój postęp
pt: Verifique Seu Progresso
ru: Проверьте свой прогресс
sv: Kontrollera Ditt Framsteg
th: ตรวจสอบความก้าวหน้าของคุณ
tr: İlerlemenizi Kontrol Edin
uk: Перевірте Свій Прогрес
vi: Kiểm Tra Tiến Trình Của Bạn

source: Check your spam folder if you don't see the email.
ar: تحقق من مجلد البريد العشوائي إذا لم تجد الرسالة الإلكترونية.
be: Праверце спам, калі вы не бачыце ліст.
da: Tjek din spam-mappe, hvis du ikke kan se e-mailen.
de: Überprüfen Sie Ihren Spam-Ordner, wenn Sie die E-Mail nicht sehen.
es: Verifique su carpeta de spam si no ve el correo electrónico.
fr: Vérifiez votre dossier de spam si vous ne voyez pas l'e-mail.
id: Periksa folder spam Anda jika Anda tidak melihat email tersebut.
it: Controlla la cartella spam se non visualizzi l'email.
ja: メールが見当たらない場合は、迷惑メールフォルダを確認してください。
no: Sjekk søppelpostmappen hvis du ikke ser e-posten.
pl: Sprawdź folder spam, jeśli nie widzisz wiadomości e-mail.
pt: Verifique a pasta de spam se não vir o e-mail.
ru: Проверьте папку со спамом, если вы не видите электронное письмо.
sv: Kontrollera din skräppostmapp om du inte ser e-postmeddelandet.
th: ตรวจสอบโฟลเดอร์สแปมหากคุณไม่เห็นอีเมล
tr: E-postayı göremezseniz, spam klasörünüzü kontrol edin.
uk: Перевірте папку зі спамом, якщо ви не бачите електронного листа.
vi: Kiểm tra thư mục thư rác của bạn nếu bạn không thấy email.

source: Check-In
ar: تسجيل الدخول
be: Рэгістрацыя
da: Tjek Ind
de: Einchecken
es: Registro
fr: Enregistrement
id: Cek-In
ja: チェックイン
ms: Daftar Masuk
no: Innsjekking
pl: Zameldowanie
ru: Регистрация
sv: Incheckning
th: เช็คอิน
tr: Giriş Yap
uk: Реєстрація
vi: Kiểm tra-In

source: Chinese Learning Plan
ar: خطة تعلم الصينية
be: План вучэбы кітайскай мовы
da: Kinesisk Læringsplan
de: Chinesischer Lernplan
es: Plan de Aprendizaje de Chino
fr: Plan d'Apprentissage du Chinois
id: Rencana Belajar Bahasa China
it: Piano di Apprendimento Cinese
ja: 中国語学習計画
ms: Rancangan Pembelajaran Bahasa Cina
no: Kinesisk Læringsplan
pl: Plan Nauki Chińskiego
pt: Plano de Aprendizagem de Chinês
ru: План изучения китайского
sv: Kinesisk Läroplan
th: แผนการเรียนภาษาจีน
tr: Çince Öğrenme Planı
uk: План вивчення китайської
vi: Kế Hoạch Học Tiếng Trung

source: Choose how long each turn lasts and how many rounds to play.
id: Pilih berapa lama setiap giliran berlangsung dan berapa banyak ronde untuk dimainkan.
it: Scegli la durata di ogni turno e il numero di round da giocare.
ja: 各ターンの持続時間とプレイするラウンド数を選択してください。
no: Velg hvor lenge hver tur varer, og hvor mange runder som skal spilles.
ru: Выберите, сколько будет длиться каждый ход и сколько раундов сыграть.
uk: Виберіть, скільки триватиме кожен хід і скільки раундів грати.

source: Choose isolation levels, model aggregates, and write efficient queries.
ar: اختر مستويات العزل، نماذج التراكم، واكتب استفسارات فعالة.
be: Выбірайце ўзроўні ізаляцыі, мадэльныя агрэгаты і пішыце эфектыўныя запыты.
da: Vælg isolationsniveauer, modellér aggregater og skriv effektive forespørgsler.
de: Wählen Sie Isolationsstufen, modellieren Sie Aggregationen und schreiben Sie effiziente Abfragen.
es: Elige niveles de aislamiento, modela agregados y escribe consultas eficientes.
fr: Choisissez des niveaux d'isolation, modélisez des agrégats et écrivez des requêtes efficaces.
id: Pilih tingkat isolasi, modelkan agregat, dan tulis kueri yang efisien.
it: Scegli i livelli di isolamento, modella gli aggregati e scrivi query efficienti.
ja: 分離レベルを選択し、集計モデルを作成し、効率的なクエリを書く。
ms: Pilih tahap pengasingan, model agregat, dan tulis pertanyaan yang cekap.
no: Velg isolasjonsnivåer, modellaggregater, og skriv effektive spørringer.
pl: Wybierz poziomy izolacji, modeluj agregaty i pisz wydajne zapytania.
pt: Escolha níveis de isolamento, modele agregados e escreva consultas eficientes.
ru: Выберите уровни изоляции, создайте агрегаты модели и пишите эффективные запросы.
sv: Välj isoleringsnivåer, modellera aggregat och skriv effektiva frågor.
th: เลือกระดับการแยก, สร้างรูปแบบกลุ่มรวม, และเขียนคำสั่งค้นหาที่มีประสิทธิภาพ
tr: İzolasyon seviyelerini seçin, model toplamlarını oluşturun ve etkili sorgular yazın.
uk: Виберіть рівні ізоляції, моделюйте агрегати і пишіть ефективні запити.
vi: Chọn mức độ cô lập, mô hình hóa các tổng hợp, và viết các truy vấn hiệu quả.

source: Choose Language Level
id: Pilih Tingkat Bahasa
it: Scegli Livello Linguistico
ja: 言語レベルを選択
no: Velg språknivå
ru: Выберите уровень языка
uk: Виберіть рівень мови

source: Choose Site Language
ar: اختر لغة الموقع
be: Выберыце мову сайта
da: Vælg sprog for websiden
de: Wählen Sie die Sprache der Website
es: Elige el Idioma del Sitio
fr: Choisir la langue du site
id: Pilih Bahasa Situs
it: Scegli la Lingua del Sito
ja: サイトの言語を選択
ms: Pilih Bahasa Tapak
no: Velg nettstedsspråk
pl: Wybierz Język Strony
pt: Escolha o Idioma do Site
ru: Выберите язык сайта
sv: Välj Webbplatsens Språk
th: เลือกภาษาของเว็บไซต์
tr: Site Dili Seçin
uk: Виберіть мову сайту
vi: Chọn Ngôn ngữ Trang Web

source: Choose the voice for your AI teacher
id: Pilih suara untuk guru AI Anda
it: Scegli la voce per il tuo insegnante AI
ja: AI教師の声を選択してください
no: Velg stemmen til din AI-lærer
pl: Wybierz głos dla swojego nauczyciela AI
ru: Выберите голос для вашего AI учителя
sv: Välj rösten för din AI-lärare
uk: Виберіть голос для свого AI вчителя

source: Choose your game mode
id: Pilih mode permainan Anda
it: Scegli la modalità di gioco
ja: ゲームモードを選択してください
no: Velg spillmodus
ru: Выберите режим игры
uk: Виберіть режим гри

source: Choose your interlocutor
no: Velg din samtalepartner
uk: Виберіть вашого співрозмовника

source: Choose your interview preparation plan
ar: اختر خطة التحضير للمقابلة الخاصة بك
be: Абярыце свой план падрыхтоўкі да інтэрв'ю
da: Vælg din forberedelsesplan til interviewet
de: Wählen Sie Ihren Vorbereitungsplan für das Interview
es: Elige tu plan de preparación para entrevistas
fr: Choisissez votre plan de préparation à l'entretien
id: Pilih rencana persiapan wawancara Anda
it: Scegli il tuo piano di preparazione all'intervista
ja: 面接準備プランを選択してください
ms: Pilih pelan persediaan temu duga anda
no: Velg din intervjuforberedelsesplan
pl: Wybierz swój plan przygotowań do rozmowy kwalifikacyjnej
pt: Escolha o seu plano de preparação para entrevista
ru: Выберите свой план подготовки к собеседованию
sv: Välj din intervju förberedelseplan
th: เลือกแผนการเตรียมตัวสำหรับการสัมภาษณ์ของคุณ
tr: Mülakat hazırlık planınızı seçin
uk: Виберіть свій план підготовки до співбесіди
vi: Chọn gói chuẩn bị phỏng vấn của bạn

source: Choose Your Language Level
ar: اختر مستوى لغتك
be: Выберыце свой узровень мовы
da: Vælg Dit Sprog Niveau
de: Wählen Sie Ihr Sprachniveau
es: Elija Su Nivel de Idioma
fr: Choisissez Votre Niveau de Langue
id: Pilih Tingkat Bahasa Anda
it: Scegli il Tuo Livello di Lingua
ja: あなたの言語レベルを選択してください
ms: Pilih Tahap Bahasa Anda
no: Velg språknivået ditt
pl: Wybierz swój poziom języka
pt: Escolha o Seu Nível de Linguagem
ru: Выберите ваш уровень владения языком
sv: Välj Din Språknivå
th: เลือกระดับภาษาของคุณ
tr: Dil Seviyenizi Seçin
uk: Оберіть свій рівень мови
vi: Chọn Trình độ Ngôn ngữ của Bạn

source: Circuit Breaker
ar: قاطع التيار
be: Абрэзчык ланцуга
da: Kredsafbryder
de: Leistungsschalter
es: Interruptor automático
fr: Disjoncteur
id: Pemutus Sirkuit
it: Interruttore Automàtico
ja: サーキットブレーカー
ms: Pemutus Litar
no: Strømbryter
pl: Wyłącznik automatyczny
pt: Interruptor Automático
ru: Автоматический выключатель
th: Circuit Breaker เซอร์กิตเบรกเกอร์
tr: Devre Kesici
uk: Вимикач ланцюга
vi: Bộ Ngắt Mạch

source: Clear structure for system design. I finally explained trade-offs without rambling.
ar: هيكلية واضحة لتصميم النظام. لقد شرحت في النهاية المزايا والعيوب دون الإسهاب في الكلام.
be: Чыстая структура для праектавання сістэмы. Я нарэшце растлумачыў кампрамісы без залішніх падрабязнасцяў.
da: Klar struktur for systemdesign. Jeg forklarede endelig kompromiser uden at rode rundt.
de: Klare Struktur für Systemdesign. Ich habe endlich die Kompromisse erklärt, ohne abzuschweifen.
es: Estructura clara para el diseño del sistema. Finalmente expliqué los compromisos sin divagar.
fr: Structure claire pour la conception du système. J'ai finalement expliqué les compromis sans divaguer.
id: Struktur yang jelas untuk desain sistem. Saya akhirnya menjelaskan trade-off tanpa berbelit-belit.
it: Struttura chiara per la progettazione del sistema. Ho finalmente spiegato i compromessi senza divagare.
ja: システムデザインの明確な構造。ついに寄り道せずにトレードオフを説明しました。
ms: Struktur jelas untuk reka bentuk sistem. Akhirnya saya menerangkan kompromi tanpa merapu.
no: Klar struktur for systemdesign. Jeg forklarte endelig avveininger uten å bli for omstendelig.
pl: Przejrzysta struktura projektowania systemu. W końcu wyjaśniłem kompromisy bez rozwlekania.
pt: Estrutura clara para o design do sistema. Finalmente expliquei as compensações sem divagar.
ru: Четкая структура для проектирования системы. Наконец-то объяснил компромиссы без лишних разговоров.
sv: Klar struktur för systemdesign. Jag förklarade äntligen kompromisser utan att svamla.
th: โครงสร้างที่ชัดเจนสำหรับการออกแบบระบบ ในที่สุดฉันก็อธิบายข้อแลกเปลี่ยนโดยไม่พูดวกไปวนมา
tr: Sistem tasarımı için net yapı. Sonunda tavizleri dolandırmadan açıkladım.
uk: Чітка структура для проектування систем. Нарешті пояснив компроміси без багатослів'я.
vi: Cấu trúc rõ ràng cho thiết kế hệ thống. Cuối cùng tôi đã giải thích được sự đánh đổi mà không dài dòng.

source: Close
ar: إغلاق
be: Зачыніць
da: Luk
de: Schließen
es: Cerrar
fr: Fermer
id: Tutup
it: Chiudi
ja: 閉じる
ms: Tutup
no: Lukk
pl: Zamknij
pt: Fechar
ru: Закрыть
sv: Stäng
th: ปิด
tr: Kapat
uk: Закрити
vi: Đóng
