Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Yes. You can earn free full access by ranking in the top 5 of the FluencyPal game. The game is free to play.
ar: نعم. يمكنك الحصول على وصول كامل مجاني من خلال تصنيفك ضمن أفضل 5 مراكز في لعبة FluencyPal. اللعبة مجانية للعب.
be: Так. Вы можаце атрымаць бясплатны поўны доступ, займаючы месца ў топ-5 у гульні FluencyPal. Гульня бясплатная для гульні.
da: Ja. Du kan opnå gratis fuld adgang ved at placere dig i top 5 i FluencyPal-spillet. Spillet er gratis at spille.
de: Ja. Sie können kostenlosen Vollzugang erhalten, indem Sie unter den Top 5 des FluencyPal-Spiels rangieren. Das Spiel ist kostenlos spielbar.
es: Sí. Puedes obtener acceso completo gratuito si te encuentras entre los 5 primeros en el juego FluencyPal. El juego es gratis para jugar.
fr: Oui. Vous pouvez obtenir un accès complet gratuit en vous classant parmi les 5 premiers du jeu FluencyPal. Le jeu est gratuit à jouer.
id: Ya. Anda bisa mendapatkan akses penuh secara gratis dengan meraih peringkat 5 besar dalam permainan FluencyPal. Permainan ini gratis untuk dimainkan.
it: Sì. Puoi ottenere l'accesso completo gratuito classificandoti tra i primi 5 del gioco FluencyPal. Il gioco è gratuito.
ja: はい。「FluencyPal」ゲームでトップ5にランクインすることで、無料でフルアクセスを獲得することができます。このゲームは無料で遊ぶことができます。
no: Ja. Du kan få gratis full tilgang ved å rangere blant de 5 beste i FluencyPal-spillet. Spillet er gratis å spille.
pl: Tak. Możesz uzyskać darmowy pełny dostęp, plasując się w pierwszej piątce gry FluencyPal. Gra jest darmowa.
pt: Sim. Você pode ganhar acesso total gratuito ficando entre os 5 primeiros no jogo FluencyPal. O jogo é gratuito para jogar.
ru: Да. Вы можете получить полный доступ бесплатно, заняв место в топ-5 игры FluencyPal. Игра является бесплатной для игры.
sv: Ja. Du kan få gratis full tillgång genom att ranka bland de topp 5 i FluencyPal-spelet. Spelet är gratis att spela.
th: ใช่ คุณสามารถรับสิทธิ์เต็มรูปแบบฟรีโดยการติดอันดับใน 5 อันดับแรกของเกม FluencyPal เกมนี้เล่นได้ฟรี
tr: Evet. FluencyPal oyununda en iyi 5 içine girerek ücretsiz tam erişim kazanabilirsiniz. Oyun oynamak ücretsizdir.
uk: Так. Ви можете отримати безкоштовний повний доступ, увійшовши до п'ятірки лідерів у грі FluencyPal. Гра є безкоштовною для гри.
vi: Vâng. Bạn có thể kiếm quyền truy cập đầy đủ miễn phí bằng cách xếp hạng trong top 5 của trò chơi FluencyPal. Trò chơi này miễn phí để chơi.

source: Yes. You can tailor sessions to your learning goals and the technologies you're studying (React, JavaScript, HTML/CSS). You can also focus on specific areas like DOM manipulation, responsive design, or common junior-level interview questions.
ar: نعم. يمكنك تخصيص الجلسات لتتناسب مع أهداف التعلم الخاصة بك والتقنيات التي تدرسها (React، JavaScript، HTML/CSS). يمكنك أيضًا التركيز على مجالات محددة مثل التلاعب بالـ DOM، التصميم المستجيب، أو الأسئلة الشائعة في مقابلات المستوى المبتدئ.
be: Так. Вы можаце наладзіць сеансы ў адпаведнасці з вашымі навучальнымі мэтамі і тэхналогіямі, якія вы вывучаеце (React, JavaScript, HTML/CSS). Вы таксама можаце засяродзіцца на канкрэтных галінах, такіх як маніпуляцыя DOM, адаптыўны дызайн або распаўсюджаныя пытанні на інтэрв'ю для пачаткоўцаў.
da: Ja. Du kan tilpasse sessionerne til dine læringsmål og de teknologier, du studerer (React, JavaScript, HTML/CSS). Du kan også fokusere på specifikke områder som DOM-manipulation, responsivt design eller almindelige spørgsmål til junior-niveau jobsamtaler.
de: Ja. Sie können Sitzungen an Ihre Lernziele und die Technologien, die Sie studieren (React, JavaScript, HTML/CSS), anpassen. Sie können sich auch auf spezifische Bereiche konzentrieren, wie DOM-Manipulation, responsives Design oder häufige Interviewfragen auf Junior-Level.
es: Sí. Puedes personalizar las sesiones según tus objetivos de aprendizaje y las tecnologías que estás estudiando (React, JavaScript, HTML/CSS). También puedes centrarte en áreas específicas como la manipulación del DOM, el diseño responsivo o preguntas comunes de entrevistas a nivel junior.
fr: Oui. Vous pouvez personnaliser les sessions en fonction de vos objectifs d'apprentissage et des technologies que vous étudiez (React, JavaScript, HTML/CSS). Vous pouvez également vous concentrer sur des domaines spécifiques tels que la manipulation du DOM, la conception responsive, ou les questions d'entretien courantes au niveau junior.
id: Ya. Anda dapat menyesuaikan sesi dengan tujuan belajar Anda dan teknologi yang sedang Anda pelajari (React, JavaScript, HTML/CSS). Anda juga dapat fokus pada area tertentu seperti manipulasi DOM, desain responsif, atau pertanyaan wawancara tingkat junior yang umum.
it: Sì. Puoi personalizzare le sessioni in base ai tuoi obiettivi di apprendimento e alle tecnologie che stai studiando (React, JavaScript, HTML/CSS). Puoi anche concentrarti su aree specifiche come la manipolazione del DOM, il design responsivo o le domande comuni delle interviste a livello junior.
ja: はい。あなたの学習目標や学んでいる技術（React、JavaScript、HTML/CSS）に合わせてセッションをカスタマイズすることができます。また、DOM操作、レスポンシブデザイン、一般的なジュニアレベルの面接質問のような特定の分野に焦点を当てることもできます。
no: Ja. Du kan tilpasse øktene til dine læringsmål og teknologiene du studerer (React, JavaScript, HTML/CSS). Du kan også fokusere på spesifikke områder som DOM-manipulasjon, responsivt design, eller vanlige intervju spørsmål på juniornivå.
pl: Tak. Możesz dostosować sesje do swoich celów nauki i technologii, które studiujesz (React, JavaScript, HTML/CSS). Możesz także skupić się na konkretnych obszarach, takich jak manipulacja DOM, projektowanie responsywne, czy typowe pytania na rozmowy kwalifikacyjne na poziomie juniora.
pt: Sim. Você pode personalizar as sessões de acordo com seus objetivos de aprendizado e as tecnologias que está estudando (React, JavaScript, HTML/CSS). Você também pode se concentrar em áreas específicas como manipulação do DOM, design responsivo ou perguntas comuns em entrevistas para nível júnior.
ru: Да. Вы можете адаптировать занятия в соответствии с вашими учебными целями и изучаемыми технологиями (React, JavaScript, HTML/CSS). Вы также можете сосредоточиться на конкретных областях, таких как работа с DOM, адаптивный дизайн или распространенные вопросы для собеседований на младшие позиции.
sv: Ja. Du kan anpassa sessionerna efter dina inlärningsmål och de teknologier du studerar (React, JavaScript, HTML/CSS). Du kan även fokusera på specifika områden som DOM-manipulation, responsiv design eller vanliga intervjufrågor på juniornivå.
th: ใช่ คุณสามารถปรับแต่งเซสชั่นให้ตรงกับเป้าหมายการเรียนรู้ของคุณและเทคโนโลยีที่คุณกำลังศึกษาอยู่ (React, JavaScript, HTML/CSS) คุณยังสามารถเน้นไปที่ส่วนเฉพาะเจาะจง เช่น การจัดการ DOM, การออกแบบที่ตอบสนอง หรือคำถามสัมภาษณ์ระดับจูเนียร์ที่พบได้บ่อย
tr: Evet. Oturumları öğrenme hedeflerinize ve üzerinde çalıştığınız teknolojilere (React, JavaScript, HTML/CSS) göre uyarlayabilirsiniz. Ayrıca, DOM manipülasyonu, duyarlı tasarım veya yaygın junior seviyesindeki mülakat soruları gibi belirli alanlara odaklanabilirsiniz.
uk: Так. Ви можете адаптувати сесії до ваших навчальних цілей і технологій, які ви вивчаєте (React, JavaScript, HTML/CSS). Ви також можете зосередитися на конкретних областях, таких як маніпуляція з DOM, адаптивний дизайн або типові запитання на співбесіді для початкового рівня.
vi: Vâng. Bạn có thể tùy chỉnh các buổi học theo mục tiêu học tập của mình và các công nghệ bạn đang nghiên cứu (React, JavaScript, HTML/CSS). Bạn cũng có thể tập trung vào các lĩnh vực cụ thể như thao tác DOM, thiết kế đáp ứng, hoặc các câu hỏi phỏng vấn phổ biến ở mức độ junior.

source: Yes. You can tailor sessions to your target role, tech stack (React, Vue, Angular, etc.), and seniority level. You can also focus on specific areas like system design, performance optimization, or behavioral questions.
ar: نعم. يمكنك تخصيص الجلسات وفقًا لدورك المستهدف، وتقنية التطوير (React، Vue، Angular، إلخ)، ومستوى الأقدمية. يمكنك أيضًا التركيز على مجالات محددة مثل تصميم النظام، تحسين الأداء، أو الأسئلة السلوكية.
be: Так. Вы можаце наладзіць сесіі ў адпаведнасці з вашай мэтанакіраванай роляй, тэхналагічным стэкам (React, Vue, Angular і г.д.) і ўзроўнем старшынства. Вы таксама можаце засяродзіцца на пэўных абласцях, такіх як дызайн сістэмы, аптымізацыя прадукцыйнасці або паводзінскія пытанні.
da: Ja. Du kan skræddersy sessioner til din målfunktion, tech stack (React, Vue, Angular, osv.) og senioritetsniveau. Du kan også fokusere på specifikke områder som systemdesign, performanceoptimering eller adfærdsspørgsmål.
de: Ja. Sie können Sitzungen auf Ihre Zielrolle, den Tech-Stack (React, Vue, Angular, etc.) und das Senioritätsniveau zuschneiden. Sie können sich auch auf bestimmte Bereiche wie Systemdesign, Leistungsoptimierung oder Verhaltensfragen konzentrieren.
es: Sí. Puede personalizar las sesiones según su rol objetivo, conjunto de tecnologías (React, Vue, Angular, etc.) y nivel de senioridad. También puede centrarse en áreas específicas como diseño de sistemas, optimización del rendimiento o preguntas sobre comportamiento.
fr: Oui. Vous pouvez adapter les sessions à votre rôle cible, pile technologique (React, Vue, Angular, etc.) et niveau de séniorité. Vous pouvez également vous concentrer sur des domaines spécifiques comme la conception de systèmes, l'optimisation des performances ou les questions comportementales.
id: Ya. Anda dapat menyesuaikan sesi dengan peran target Anda, set tech (React, Vue, Angular, dll.), dan tingkat senioritas. Anda juga dapat fokus pada area-area spesifik seperti desain sistem, optimisasi kinerja, atau pertanyaan perilaku.
it: Sì. Puoi personalizzare le sessioni per il tuo ruolo di destinazione, stack tecnologico (React, Vue, Angular, ecc.) e livello di anzianità. Puoi anche concentrarti su aree specifiche come la progettazione del sistema, l'ottimizzazione delle prestazioni o le domande comportamentali.
ja: はい。あなたの目指す役割、技術スタック（React、Vue、Angularなど）、およびシニアリティレベルに合わせてセッションをカスタマイズできます。また、システム設計、パフォーマンスの最適化、行動に関する質問など、特定の分野に焦点を当てることもできます。
ms: Ya. Anda boleh menyesuaikan sesi kepada peranan sasaran anda, timbunan teknologi (React, Vue, Angular, dll.), dan tahap senioriti. Anda juga boleh memberi tumpuan kepada bidang-bidang tertentu seperti reka bentuk sistem, pengoptimuman prestasi, atau soalan-soalan tingkah laku.
no: Ja. Du kan tilpasse øktene til din målrolle, teknologistakk (React, Vue, Angular, osv.), og senioritetsnivå. Du kan også fokusere på spesifikke områder som systemdesign, ytelsesoptimalisering, eller adferdsspørsmål.
pl: Tak. Możesz dostosować sesje do swojej docelowej roli, stosu technologicznego (React, Vue, Angular, itp.) oraz poziomu zaawansowania. Możesz również skupić się na konkretnych obszarach, takich jak projektowanie systemu, optymalizacja wydajności czy pytania behawioralne.
pt: Sim. Você pode personalizar as sessões para o seu cargo-alvo, pilha de tecnologia (React, Vue, Angular, etc.) e nível de senioridade. Você também pode focar em áreas específicas como design de sistemas, otimização de desempenho ou questões comportamentais.
ru: Да. Вы можете настроить сессии в соответствии с вашей целевой ролью, технологическим стеком (React, Vue, Angular и т.д.) и уровнем квалификации. Вы также можете сосредоточиться на конкретных областях, таких как системный дизайн, оптимизация производительности или поведенческие вопросы.
sv: Ja. Du kan anpassa sessionerna efter din målinriktade roll, teknologistack (React, Vue, Angular, etc.) och senioritetsnivå. Du kan också fokusera på specifika områden som systemdesign, prestandaoptimering eller beteendefrågor.
th: ใช่ คุณสามารถปรับแต่งเซสชันให้เหมาะสมกับบทบาทเป้าหมายของคุณ, เทคโนโลยีที่ใช้ (React, Vue, Angular, ฯลฯ), และระดับความอาวุโสได้ นอกจากนี้ คุณยังสามารถมุ่งเน้นไปที่ด้านเฉพาะเช่น การออกแบบระบบ, การปรับปรุงประสิทธิภาพ, หรือคำถามพฤติกรรมได้อีกด้วย
tr: Evet. Oturumları hedeflediğiniz role, teknoloji yığınına (React, Vue, Angular, vb.) ve kıdem seviyenize göre uyarlayabilirsiniz. Ayrıca sistem tasarımı, performans optimizasyonu veya davranışsal sorular gibi belirli alanlara odaklanabilirsiniz.
uk: Так. Ви можете підлаштувати сесії під вашу цільову роль, технологічний стек (React, Vue, Angular тощо) і рівень старшинства. Ви також можете зосередитися на конкретних сферах, таких як системний дизайн, оптимізація продуктивності або поведінкові питання.
vi: Vâng. Bạn có thể điều chỉnh các phiên học cho vai trò mục tiêu của mình, ngăn xếp công nghệ (React, Vue, Angular, v.v.), và cấp độ thâm niên. Bạn cũng có thể tập trung vào các lĩnh vực cụ thể như thiết kế hệ thống, tối ưu hóa hiệu suất, hoặc các câu hỏi hành vi.

source: Yes. You'll practice SQL vs NoSQL decisions, isolation levels, EF Core tips, caching, and data consistency patterns.
ar: نعم. ستتمرن على قرارات SQL مقابل NoSQL، ومستويات العزل، ونصائح EF Core، والتخزين المؤقت، وأنماط اتساق البيانات.
be: Так. Вы будзеце практыкавацца ў прыняцці рашэнняў паміж SQL і NoSQL, узроўняў ізаляцыі, парадаў EF Core, кэшаванні і шаблонаў кансістэнтнасці дадзеных.
da: Ja. Du vil øve dig på beslutninger omkring SQL vs NoSQL, isolationsniveauer, EF Core tips, caching og datakonsistensmønstre.
de: Ja. Sie werden SQL- vs. NoSQL-Entscheidungen, Isolationsstufen, EF-Core-Tipps, Caching und Datenkonsistenzmuster üben.
es: Sí. Practicarás decisiones entre SQL y NoSQL, niveles de aislamiento, consejos de EF Core, almacenamiento en caché y patrones de consistencia de datos.
fr: Oui. Vous allez pratiquer les décisions SQL vs NoSQL, les niveaux d'isolation, les conseils EF Core, la mise en cache et les schémas de cohérence des données.
id: Ya. Anda akan berlatih keputusan SQL vs NoSQL, tingkat isolasi, tips EF Core, caching, dan pola konsistensi data.
it: Sì. Eserciterai le decisioni tra SQL e NoSQL, i livelli di isolamento, i consigli su EF Core, la memorizzazione nella cache e i modelli di coerenza dei dati.
ja: はい。SQL 対 NoSQL の決定、分離レベル、EF Core のヒント、キャッシング、およびデータ一貫性パターンを実践します。
ms: Ya. Anda akan berlatih keputusan SQL vs NoSQL, tahap pengasingan, tip EF Core, caching, dan corak konsistensi data.
no: Ja. Du vil øve på SQL vs NoSQL-beslutninger, isolasjonsnivåer, EF Core-tips, caching og datakonsistensmønstre.
pl: Tak. Będziesz ćwiczyć podejmowanie decyzji dotyczących SQL kontra NoSQL, poziomy izolacji, wskazówki EF Core, buforowanie oraz wzorce spójności danych.
pt: Sim. Você praticará decisões de SQL versus NoSQL, níveis de isolamento, dicas de EF Core, cache e padrões de consistência de dados.
ru: Да. Вы будете практиковаться в принятии решений SQL и NoSQL, уровнях изоляции, советах по EF Core, кэшировании и паттернах согласованности данных.
sv: Ja. Du kommer att öva beslut om SQL vs NoSQL, isoleringsnivåer, EF Core-tips, caching och mönster för datakonsekvens.
th: ใช่ คุณจะฝึกฝนการตัดสินใจระหว่าง SQL และ NoSQL ระดับการแยก การใช้ EF Core เทคนิคการแคช และรูปแบบความสอดคล้องของข้อมูล
tr: Evet. SQL ve NoSQL kararları, izolasyon seviyeleri, EF Core ipuçları, önbellekleme ve veri tutarlılığı modelleri üzerinde pratik yapacaksınız.
uk: Так. Ви будете практикуватися у прийнятті рішень щодо SQL та NoSQL, рівнів ізоляції, порад щодо EF Core, кешування та шаблонів узгодженості даних.
vi: Vâng. Bạn sẽ thực hành các quyết định về SQL so với NoSQL, các cấp độ cô lập, mẹo EF Core, bộ nhớ đệm, và các mẫu nhất quán dữ liệu.

source: Yesterday
ja: 昨日
no: I går
uk: Вчора

source: You
ar: أنت
be: Вы
da: Du
de: Sie
es: Tú
fr: Vous
id: Anda
it: Tu
ja: あなた
ms: Anda
no: Du
pl: Ty
pt: Você
ru: Ты
sv: Du
th: คุณ
tr: Sen
uk: Ви
vi: Bạn

source: You and your AI partner alternate turns describing and guessing words without directly naming them. This encourages creative thinking and fluent expression, adapting to your language proficiency.
ar: أنت وشريكك الذكاء الاصطناعي تتناوبان الأدوار في وصف وتخمين الكلمات دون تسميتها مباشرةً. هذا يشجع التفكير الإبداعي والتعبير الطليق، متكيفاً مع مستوى اتقانك للغة.
be: Вы і ваш штучны інтэлект начаргова апісваеце і адгадваеце словы, не называючы іх напрамую. Гэта спасціжае крэатыўнае мысленне і плавнае выказванне, адаптуючыся да вашага воладання мовай.
da: Du og din AI-partner skifter tur til at beskrive og gætte ord uden direkte at navngive dem. Dette tilskynder kreativ tænkning og flydende udtryk, tilpasset til din sprogfærdighed.
de: Sie und Ihr KI-Partner wechseln sich ab, indem Sie Wörter beschreiben und erraten, ohne sie direkt zu benennen. Dies fördert kreatives Denken und flüssigen Ausdruck und passt sich Ihrer Sprachkompetenz an.
es: Tú y tu compañero de IA alternan turnos describiendo y adivinando palabras sin nombrarlas directamente. Esto fomenta el pensamiento creativo y la expresión fluida, adaptándose a tu nivel de dominio del idioma.
fr: Vous et votre partenaire IA alternez les tours pour décrire et deviner des mots sans les nommer directement. Cela encourage la pensée créative et l'expression fluide, en s'adaptant à votre compétence linguistique.
id: Anda dan mitra AI Anda bergiliran mendeskripsikan dan menebak kata-kata tanpa langsung menyebutkan mereka. Ini mendorong pemikiran kreatif dan ekspresi lancar, menyesuaikan dengan kemampuan bahasa Anda.
it: Tu e il tuo partner AI alternatevi a turns descrivendo e indovinando parole senza nominarle direttamente. Questo incoraggia il pensiero creativo e l'espressione fluente, adattandosi alla tua competenza linguistica.
ja: あなたとあなたのAIパートナーは、直接名前を挙げることなく単語を説明し、予測するターンを交互に行います。これは創造的な思考と流暢な表現を鼓舞し、あなたの言語能力に適応します。
ms: Anda dan pasangan AI anda bergiliran menggambarkan dan menebak kata-kata tanpa secara langsung menyebut mereka. Ini mendorong berfikir kreatif dan pengekspressian lancar, menyesuaikan kepada kecekapan bahasa anda.
no: Du og din AI-partner tar hver sin tur til å beskrive og gjette ord uten å direkte navngi dem. Dette fremmer kreativ tenkning og flytende uttrykk, og tilpasser til din språkdyktighet.
pl: Ty i twój partner AI naprzemiennie opisujecie i zgadujecie słowa bez ich bezpośredniego nazywania. To zachęca do kreatywnego myślenia i płynnej ekspresji, dostosowując się do twojego poziomu biegłości językowej.
pt: Você e seu parceiro AI alternam turnos descrevendo e adivinhando palavras sem nomeá-las diretamente. Isso incentiva o pensamento criativo e a expressão fluente, adaptando-se ao seu proficiência em idiomas.
ru: Вы и ваш партнер-ИИ по очереди описываете и угадываете слова, не называя их напрямую. Это стимулирует творческое мышление и свободное выражение, адаптируясь к вашему уровню владения языком.
sv: Du och din AI-partner turas om att beskriva och gissa ord utan att direkt namnge dem. Detta uppmuntrar till kreativt tänkande och flytande uttryck, anpassat till din språkfärdighet.
th: คุณและคู่ครับ AI สลับเวรที่อธิบายและทายคำโดยไม่ต้องพูดชื่อของคำตรงๆ ซึ่งจะส่งเสริมการคิดสร้างสรรค์และการแสดงออกที่ไหลลื่น รับมือกับระดับความสามารถในการใช้ภาษาของคุณ
tr: Siz ve AI ortağınız, sırayla sözcükleri doğrudan adlandırmadan açıklama ve tahmin etme işlemini gerçekleştirirsiniz. Bu, yaratıcı düşünmeyi ve akıcı ifadeyi teşvik eder, dil yeterliliğinize uyum sağlar.
uk: Ви та ваш партнер AI по черзі описуєте та вгадуєте слова без їх безпосереднього називання. Це стимулює креативне мислення та вільне вираження, адаптуючись до вашого рівня володіння мовою.
vi: Bạn và đối tác AI của bạn lần lượt mô tả và đoán từ mà không trực tiếp đặt tên cho chúng. Điều này khuyến khích tư duy sáng tạo và biểu hiện trôi chảy, thích nghi với trình độ ngôn ngữ của bạn.
