Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Our AI evaluates your answers for technical accuracy (HTML/CSS, JavaScript basics, React fundamentals), clarity, and communication. You receive helpful suggestions on how to improve your answers and build confidence for junior-level interviews.
ar: يقيّم الذكاء الاصطناعي لدينا إجاباتك من حيث الدقة التقنية (أساسيات HTML/CSS، وجافا سكريبت، وأساسيات React)، والوضوح، والاتصال. ستحصل على اقتراحات مفيدة حول كيفية تحسين إجاباتك وبناء الثقة لمقابلات المستوى المبتدئ.
be: Наш штучны інтэлект ацэньвае вашы адказы на тэхнічную дакладнасць (HTML/CSS, асновы JavaScript, асновы React), яснасць і камунікацыю. Вы атрымліваеце карысныя парады па паляпшэнні вашых адказаў і павышэнні ўпэўненасці на інтэрв'ю на ўзроўні малодшага спецыяліста.
da: Vores AI vurderer dine svar for teknisk nøjagtighed (HTML/CSS, JavaScript-grundlæggende, React-grundlæggende), klarhed og kommunikation. Du modtager nyttige forslag til, hvordan du kan forbedre dine svar og opbygge selvtillid til junior-niveau interviews.
de: Unsere KI bewertet Ihre Antworten hinsichtlich technischer Genauigkeit (HTML/CSS, JavaScript-Grundlagen, React-Grundlagen), Klarheit und Kommunikation. Sie erhalten hilfreiche Vorschläge, wie Sie Ihre Antworten verbessern und Vertrauen für Interviews auf Junior-Ebene aufbauen können.
es: Nuestra IA evalúa tus respuestas en cuanto a precisión técnica (HTML/CSS, fundamentos de JavaScript, fundamentos de React), claridad y comunicación. Recibes sugerencias útiles sobre cómo mejorar tus respuestas y ganar confianza para entrevistas de nivel junior.
fr: Notre IA évalue vos réponses pour leur précision technique (HTML/CSS, bases de JavaScript, fondamentaux de React), clarté et communication. Vous recevez des suggestions utiles sur la manière d'améliorer vos réponses et de gagner en confiance pour des entretiens de niveau junior.
id: AI kami mengevaluasi jawaban Anda berdasarkan ketepatan teknis (HTML/CSS, dasar-dasar JavaScript, fundamental React), kejelasan, dan komunikasi. Anda akan menerima saran yang bermanfaat tentang cara meningkatkan jawaban Anda dan membangun kepercayaan diri untuk wawancara tingkat junior.
it: La nostra IA valuta le tue risposte per accuratezza tecnica (HTML/CSS, basi di JavaScript, fondamenti di React), chiarezza e comunicazione. Ricevi suggerimenti utili su come migliorare le tue risposte e costruire fiducia per i colloqui di livello junior.
ja: 私たちのAIは、技術的な正確性（HTML/CSS、JavaScript基礎、React基礎）、明確さ、そしてコミュニケーションについてあなたの回答を評価します。あなたの回答を改善し、ジュニアレベルの面接に対する自信を築くための有益な提案を受け取ります。
no: Vår AI evaluerer dine svar for teknisk nøyaktighet (HTML/CSS, grunnleggende JavaScript, React grunnprinsipper), klarhet og kommunikasjon. Du mottar nyttige forslag til hvordan du kan forbedre dine svar og bygge selvtillit for junior-nivå intervjuer.
pl: Nasz AI ocenia Twoje odpowiedzi pod względem technicznej dokładności (HTML/CSS, podstawy JavaScript, fundamenty Reacta), klarowności i komunikacji. Otrzymujesz przydatne sugestie, jak poprawić swoje odpowiedzi i zbudować pewność siebie na rozmowy kwalifikacyjne na poziomie juniora.
pt: Nosso IA avalia suas respostas quanto à precisão técnica (HTML/CSS, fundamentos de JavaScript, fundamentos do React), clareza e comunicação. Você recebe sugestões úteis sobre como melhorar suas respostas e ganhar confiança para entrevistas de nível júnior.
ru: Наш ИИ оценивает ваши ответы на точность использования технологий (HTML/CSS, основы JavaScript, основы React), ясность и умение коммуникации. Вы получаете полезные рекомендации по улучшению ваших ответов и повышению уверенности на собеседованиях начального уровня.
sv: Vår AI utvärderar dina svar för teknisk noggrannhet (HTML/CSS, grundläggande JavaScript, grundläggande React), tydlighet och kommunikation. Du får hjälpsamma förslag på hur du kan förbättra dina svar och bygga självförtroende inför intervjuer på juniornivå.
th: AI ของเราประเมินคำตอบของคุณสำหรับความแม่นยำทางเทคนิค (HTML/CSS, พื้นฐานของ JavaScript, พื้นฐานของ React), ความชัดเจน, และการสื่อสาร คุณจะได้รับข้อเสนอแนะที่มีประโยชน์เกี่ยวกับวิธีการปรับปรุงคำตอบของคุณและสร้างความมั่นใจสำหรับการสัมภาษณ์ในระดับจูเนียร์
tr: AI'ımız, verdiğiniz cevapları teknik doğruluk (HTML/CSS, JavaScript temelleri, React temelleri), açıklık ve iletişim açısından değerlendirir. Cevaplarınızı nasıl geliştirebileceğiniz ve başlangıç seviyesi mülakatlar için güven oluşturabileceğiniz konusunda faydalı öneriler alırsınız.
uk: Наш ІІ оцінює ваші відповіді щодо технічної точності (HTML/CSS, основи JavaScript, основи React), зрозумілості та комунікації. Ви отримуєте корисні поради, як покращити ваші відповіді та підвищити впевненість для інтерв'ю на рівні джуніора.
vi: AI của chúng tôi đánh giá câu trả lời của bạn về độ chính xác kỹ thuật (HTML/CSS, các kiến thức cơ bản về JavaScript, các nguyên tắc cơ bản của React), sự rõ ràng và khả năng giao tiếp. Bạn sẽ nhận được những gợi ý hữu ích về cách cải thiện câu trả lời và xây dựng sự tự tin cho các cuộc phỏng vấn ở cấp độ sơ cấp.

source: Our AI evaluates your answers for technical depth (architecture, performance, state management), clarity, structure, and communication. You receive concrete suggestions on what to add, remove, or reframe to sound like a strong senior frontend engineer.
ar: لدينا الذكاء الاصطناعي يقوم بتقييم إجاباتك بناءً على العمق التقني (الهندسة، الأداء، إدارة الحالة)، الوضوح، الهيكل، والتواصل. ستتلقى اقتراحات ملموسة حول ما يمكن إضافته، إزالته، أو إعادة صياغته ليبدو وكأنك مهندس واجهات أمامية كبير وقوي.
be: Наш AI ацэньвае вашы адказы на тэхнічную глыбіню (архітэктура, прадукцыйнасць, кіраванне станам), яснасць, структуру і камунікацыю. Вы атрымліваеце канкрэтныя прапановы, што дадаць, выдаліць або перасфармаваць, каб гучаць як моцны сеньёр frontend-інжынер.
da: Vores AI evaluerer dine svar for teknisk dybde (arkitektur, ydeevne, tilstandsadministration), klarhed, struktur og kommunikation. Du modtager konkrete forslag til, hvad der skal tilføjes, fjernes eller omformuleres for at lyde som en stærk senior frontend-ingeniør.
de: Unsere KI bewertet Ihre Antworten hinsichtlich technischer Tiefe (Architektur, Leistung, Zustandsverwaltung), Klarheit, Struktur und Kommunikation. Sie erhalten konkrete Vorschläge, was Sie hinzufügen, entfernen oder umformulieren sollten, um wie ein starker Senior Frontend-Entwickler zu klingen.
es: Nuestra IA evalúa tus respuestas en cuanto a profundidad técnica (arquitectura, rendimiento, gestión de estado), claridad, estructura y comunicación. Recibes sugerencias concretas sobre lo que debes añadir, eliminar o replantear para sonar como un sólido ingeniero frontend senior.
fr: Notre IA évalue vos réponses en fonction de la profondeur technique (architecture, performance, gestion d'état), de la clarté, de la structure et de la communication. Vous recevez des suggestions concrètes sur ce qu'il faut ajouter, supprimer ou reformuler pour vous faire paraître comme un ingénieur frontend senior compétent.
id: AI kami mengevaluasi jawaban Anda berdasarkan kedalaman teknis (arsitektur, kinerja, manajemen status), kejelasan, struktur, dan komunikasi. Anda akan menerima saran konkret tentang apa yang harus ditambahkan, dihapus, atau direformulasi agar terdengar seperti insinyur frontend senior yang kuat.
it: La nostra AI valuta le tue risposte per profondità tecnica (architettura, prestazioni, gestione dello stato), chiarezza, struttura e comunicazione. Ricevi suggerimenti concreti su cosa aggiungere, rimuovere o riformulare per apparire come un valido ingegnere frontend senior.
ja: 私たちのAIは、あなたの回答を技術的深み（アーキテクチャ、パフォーマンス、状態管理）、明快さ、構造、およびコミュニケーションについて評価します。強力なシニアフロントエンドエンジニアとして響くように、追加すべき点、削除すべき点、または再構成すべき点について具体的な提案を受け取ります。
ms: AI kami menilai jawapan anda berdasarkan kedalaman teknikal (arkitektur, prestasi, pengurusan keadaan), kejelasan, struktur, dan komunikasi. Anda menerima cadangan konkrit tentang apa yang perlu ditambah, dibuang, atau ditukar untuk kedengaran seperti seorang jurutera frontend senior yang cekap.
no: Vår AI evaluerer dine svar for teknisk dybde (arkitektur, ytelse, tilstandshåndtering), klarhet, struktur og kommunikasjon. Du mottar konkrete forslag om hva du bør legge til, fjerne eller omformulere for å fremstå som en dyktig senior frontend-utvikler.
pl: Nasz AI ocenia Twoje odpowiedzi pod względem głębokości technicznej (architektura, wydajność, zarządzanie stanem), jasności, struktury i komunikacji. Otrzymujesz konkretne sugestie dotyczące dodawania, usuwania lub przekształcania, aby brzmieć jak silny starszy inżynier frontend.
pt: Nossa IA avalia suas respostas quanto à profundidade técnica (arquitetura, desempenho, gerenciamento de estado), clareza, estrutura e comunicação. Você recebe sugestões concretas sobre o que adicionar, remover ou reformular para soar como um forte engenheiro frontend sênior.
ru: Наш ИИ оценивает ваши ответы на предмет технической глубины (архитектура, производительность, управление состоянием), ясности, структуры и коммуникации. Вы получаете конкретные предложения о том, что добавить, удалить или изменить, чтобы звучать как опытный фронтенд-инженер уровня Senior.
sv: Vår AI utvärderar dina svar för teknisk djup (arkitektur, prestanda, tillståndshantering), tydlighet, struktur och kommunikation. Du får konkreta förslag på vad som ska läggas till, tas bort, eller omformuleras för att låta som en stark senior frontend-utvecklare.
th: AI ของเราจะประเมินคำตอบของคุณจากความลึกทางเทคนิค (สถาปัตยกรรม, ประสิทธิภาพ, การจัดการสถานะ), ความชัดเจน, โครงสร้าง, และการสื่อสาร คุณจะได้รับคำแนะนำที่เป็นรูปธรรมเกี่ยวกับสิ่งที่ควรเพิ่ม, ลบ, หรือจัดกรอบใหม่เพื่อให้ฟังดูเหมือนวิศวกรฟรอนต์เอนด์ระดับอาวุโสที่แข็งแกร่ง
tr: Yapay zekamız, cevaplarınızı teknik derinlik (mimari, performans, durum yönetimi), açıklık, yapı ve iletişim açısından değerlendirir. Güçlü bir kıdemli frontend mühendisi gibi görünmek için neleri eklemeniz, çıkarmanız veya yeniden çerçevelemeniz gerektiğine dair somut öneriler alırsınız.
uk: Наш ІІ оцінює ваші відповіді за технічною глибиною (архітектура, продуктивність, управління станом), ясністю, структурою та комунікацією. Ви отримуєте конкретні рекомендації щодо того, що додати, видалити чи змінити, щоб звучати як сильний старший фронтенд-інженер.
vi: AI của chúng tôi đánh giá câu trả lời của bạn dựa trên độ sâu kỹ thuật (kiến trúc, hiệu suất, quản lý trạng thái), độ rõ ràng, cấu trúc, và giao tiếp. Bạn nhận được các gợi ý cụ thể về những gì cần thêm, loại bỏ, hoặc điều chỉnh để nghe giống như một kỹ sư frontend cấp cao mạnh mẽ.

source: Over-rehearsed answers — Don’t memorize; prepare ideas and speak naturally.
ar: إجابات مُعَدة بإفراط - لا تحفظها؛ قم بالتحضير للأفكار وتكلم بطريقة طبيعية.
be: Перазанадта трэніраваныя адказы - Не заўважайце; падрыхтуйце ідэі і гаварыце натуральна.
da: Over-øvede svar — Husk ikke; forbered idéer og tal naturligt.
de: Überstudiert Antworten — Nicht auswendig lernen; Ideen vorbereiten und natürlich sprechen.
es: Respuestas sobre-ensayadas — No memorices; prepara ideas y habla de forma natural.
fr: Réponses trop répétées — Ne mémorisez pas ; préparez des idées et parlez naturellement.
id: Jawaban yang terlalu dihapal — Jangan hafal; siapkan ide dan bicara secara alami.
it: Risposte troppo esercitate — Non memorizzare; prepara le idee e parla naturalmente.
ja: 過度に練習された答え - 暗記するのではなく、アイデアを準備し、自然に話しましょう。
ms: Jawapan yang terlalu dihafal — Jangan hafal; siapkan idea dan bercakap secara semula jadi.
no: Overøvede svar — Ikke pugg; forbered ideer og snakk naturlig.
pl: Przećwiczone odpowiedzi — Nie zapamiętuj; przygotuj pomysły i mów naturalnie.
pt: Respostas excessivamente ensaiadas — Não decore; prepare ideias e fale naturalmente.
ru: Зазубренные ответы — Не заучивайте; подготавливайте идеи и говорите естественно.
sv: Överrepeterade svar — Memorera inte; förbered idéer och tala naturligt.
th: การตอบที่ฝึกซ้อมเกินไป — อย่าจำ; เตรียมความคิดและพูดอย่างธรรมชาติ.
tr: Aşırı ezberlenmiş cevaplar — Ezberlemeyin; fikirlerinizi hazırlayın ve doğal konuşun.
uk: Занадто відточені відповіді — не запам'ятовуйте; підготуйте ідеї та говоріть природньо.
vi: Câu trả lời quá chuẩn bị — Đừng học thuộc lòng; chuẩn bị ý tưởng và nói một cách tự nhiên.

source: Page
ar: صفحة
be: Старонка
da: Side
de: Seite
es: Página
id: Halaman
it: Pagina
ja: ページ
ms: Halaman
no: Side
pl: Strona
pt: Página
ru: Страница
sv: Sida
th: หน้า
tr: Sayfa
uk: Сторінка
vi: Trang

source: Page Language
ar: لغة الصفحة
be: Мова старонкі
da: Sprog på side
de: Seitensprache
es: Idioma de la página
fr: Langage de la Page
id: Bahasa Halaman
it: Lingua della Pagina
ja: ページ言語
ms: Bahasa Laman
no: Sidespråk
pl: Język strony
pt: Idioma da Página
ru: Язык страницы
sv: Sidans språk
th: ภาษาของหน้าเว็บ
tr: Sayfa Dili
uk: Мова сторінки
vi: Ngôn ngữ Trang

source: Paid plan:
ar: خطة مدفوعة:
be: Платны план:
da: Betalt plan:
de: Bezahlter Plan:
es: Plan de pago:
fr: plaintext Plan payant :
id: Paket berbayar:
it: Piano a pagamento:
ja: 有料プラン:
no: Betalt plan:
pl: Plan płatny:
pt: Plano pago:
ru: Платный план:
sv: Betald plan:
th: แผนชำระเงิน:
tr: Ücretli plan:
uk: Платний план:
vi: Gói trả phí:

source: parallel lives
ar: حيوات متوازية
be: паралельныя жыцці
da: parallelle liv
de: parallele Leben
es: vidas paralelas
fr: vies parallèles
id: kehidupan paralel
it: vite parallele
ja: 平行する人生
ms: kehidupan selari
no: parallelle liv
pl: równoległe życia
pt: vidas paralelas
ru: параллельные жизни
sv: parallella liv
tr: paralel hayatlar
uk: паралельні життя
vi: cuộc sống song song

source: Paste vacancy description if you have it. You can also write a brief summary of the job requirements.
ar: يرجى لصق وصف الوظيفة إذا كان لديك ذلك. يمكنك أيضًا كتابة ملخص موجز لمتطلبات الوظيفة.
be: Устаўце апісанне вакансіі, калі ёсць у вас. Вы таксама можаце напісаць кароткую зводку патрабаванняў да работы.
da: Indsæt stillingsbeskrivelse, hvis du har den. Du kan også skrive et kort resumé af jobkravene.
de: Fügen Sie die Stellenbeschreibung ein, wenn Sie sie haben. Sie können auch eine kurze Zusammenfassung der Stellenanforderungen schreiben.
es: Pega la descripción del puesto si la tienes. También puedes escribir un breve resumen de los requisitos del trabajo.
fr: Collez la description du poste si vous l'avez. Vous pouvez également écrire un bref résumé des exigences du poste.
id: Tempelkan deskripsi lowongan jika Anda memilikinya. Anda juga dapat menulis ringkasan singkat tentang persyaratan pekerjaan.
it: Incolla la descrizione della posizione se ce l'hai. Puoi anche scrivere un breve riepilogo dei requisiti per il lavoro.
ja: вакансииの説明文を貼り付けてください。職務要件の簡単な概要を記入することもできます。
ms: Sila tampalkan penerangan jawatan jika anda memilikinya. Anda juga boleh menulis ringkasan ringkas tentang keperluan pekerjaan.
no: Lim inn stillingsbeskrivelse hvis du har det. Du kan også skrive et kort sammendrag av jobbkvalifikasjonene.
pl: Wklej opis oferty pracy, jeśli go posiadasz. Możesz również napisać krótkie podsumowanie wymagań dotyczących pracy.
pt: Cole sua descrição da vaga se você a tiver. Você também pode escrever um resumo breve dos requisitos do trabalho.
ru: Вставьте описание вакансии, если оно у вас есть. Вы также можете написать краткое резюме требований к работе.
sv: Kasta in beskrivning av tjänsten om du har den. Du kan också skriva en kort sammanfattning av jobbkvalifikationerna.
th: วางคำอธิบายตำแหน่งงานหากคุณมีอยู่ คุณยังสามารถเขียนสรุปย่อเกี่ยวกับความต้องการของงานได้ด้วย
tr: Boş pozisyon açıklamasını varsa yapıştırın. Ayrıca iş gereksinimlerinin kısa bir özetini de yazabilirsiniz.
uk: Вставте опис вакансії, якщо він у вас є. Ви також можете написати короткий підсумок вимог до роботи.
vi: Dán mô tả công việc nếu bạn có. Bạn cũng có thể viết một tóm tắt ngắn gọn về các yêu cầu công việc.

source: Paste your CV text here. You can also write a brief summary of your experience.
ar: ألصق نص سيرتك الذاتية هنا. يمكنك أيضًا كتابة ملخص موجز عن تجربتك.
be: Устаўце тэкст сваёй працоўнай біяграфіі тут. Вы таксама можаце напісаць кароткае агляднае апісанне свайго досведу.
da: Indsæt din CV-tekst her. Du kan også skrive et kort resumé af din erfaring.
de: Fügen Sie hier Ihren Lebenslauf-Text ein. Sie können auch eine kurze Zusammenfassung Ihrer Erfahrungen schreiben.
es: Pega el texto de tu currículum aquí. También puedes escribir un breve resumen de tu experiencia.
fr: Collez votre texte de CV ici. Vous pouvez également écrire un bref résumé de votre expérience.
id: Tempelkan teks CV Anda di sini. Anda juga dapat menulis ringkasan singkat tentang pengalaman Anda.
it: Incolla qui il testo del tuo CV. Puoi anche scrivere un breve riepilogo della tua esperienza.
ja: ここにあなたの履歴書のテキストを貼り付けてください。あなたの経験の簡単な概要を書くこともできます。
ms: Tampalkan teks CV anda di sini. Anda juga boleh menulis ringkasan ringkas mengenai pengalaman anda.
no: Lim inn CV-teksten din her. Du kan også skrive et kort sammendrag av erfaringen din.
pl: Wklej tutaj tekst swojego CV. Możesz także napisać krótki podsumowanie swojego doświadczenia.
pt: Cole o texto do seu CV aqui. Você também pode escrever um breve resumo da sua experiência.
ru: Вставьте текст вашего резюме здесь. Вы также можете написать краткое резюме вашего опыта.
sv: Klistra in din CV-text här. Du kan också skriva en kort sammanställning av din erfarenhet.
th: วางข้อความประวัติย่อของคุณที่นี่ คุณยังสามารถเขียนสรุปประสบการณ์ของคุณได้สั้น ๆ
tr: CV metninizi buraya yapıştırın. Ayrıca deneyiminizle ilgili kısa bir özet yazabilirsiniz.
uk: Вставте текст вашого резюме тут. Ви також можете написати короткий підсумок вашого досвіду.
vi: Dán văn bản CV của bạn vào đây. Bạn cũng có thể viết một tóm tắt ngắn gọn về kinh nghiệm của mình.

source: Pay
ar: ادفع
be: Аплата
da: Betale
de: Bezahlen
es: Pagar
fr: Payer
id: Bayar
it: Paga
ja: 支払い
ms: Bayar
no: Betal
pl: Zapłać
pt: Pagar
ru: Платить
sv: Betala
th: ชำระเงิน
tr: Öde
uk: Платити
vi: Trả tiền

source: Pay with crypto
ar: ادفع بالعملات المشفرة
be: Аплаціць крыптавалютаю
da: Betal med krypto
de: Mit Krypto bezahlen
es: Pagar con criptomoneda
fr: Payer avec des cryptomonnaies
id: Bayar dengan kripto
it: Paga con criptovaluta
ja: 暗号通貨で支払う
ms: Bayar dengan kripto
no: Betal med krypto
pl: Zapłać kryptowalutą
pt: Pagar com cripto
ru: Оплатите криптовалютой
sv: Betala med krypto
th: ชำระเงินด้วยคริปโต
tr: Kripto ile öde
uk: Сплатити криптовалютою
vi: Thanh toán bằng tiền điện tử

source: Pay with Stars
ar: ادفع بالنجوم
be: Аплаціць зоркамі
da: Betal med Stjerner
de: Mit Sternen bezahlen
es: Paga con Estrellas
fr: Payer avec des Étoiles
id: Bayar dengan Bintang
it: Paga con Stelle
ja: スターで支払う
ms: Bayar dengan Bintang
no: Betal med Stjerner
pl: Zapłać Gwiazdkami
pt: Pague com Estrelas
ru: Оплатить звездами
sv: Betala med stjärnor
th: จ่ายด้วยดาว
tr: Yıldızlarla Öde
uk: Оплатити Зірками
vi: Trả bằng Sao

source: Payment
ar: الدفع
be: Аплата
da: Betaling
de: Zahlung
es: Pago
fr: Paiement
id: Pembayaran
it: Pagamento
ja: 支払い
ms: Pembayaran
no: Betaling
pl: Płatność
pt: Pagamento
ru: Оплата
sv: Betalning
th: การชำระเงิน
tr: Ödeme
uk: Оплата
vi: Thanh toán

source: Payment failed! Please try again.
ar: فشل الدفع! يرجى المحاولة مرة أخرى.
be: Аплата не выканана! Калі ласка, паспрабуйце зноў.
da: Betaling mislykkedes! Prøv venligst igen.
de: Zahlung fehlgeschlagen! Bitte versuchen Sie es erneut.
es: ¡Pago fallido! Por favor, inténtelo de nuevo.
fr: Échec du paiement ! Veuillez réessayer.
id: Pembayaran gagal! Silakan coba lagi.
it: Pagamento fallito! Per favore riprova.
ja: 支払いに失敗しました！もう一度お試しください。
ms: Pembayaran gagal! Sila cuba lagi.
no: Betaling mislyktes! Vennligst prøv igjen.
pl: Płatność nie powiodła się! Spróbuj ponownie.
pt: Falha no pagamento! Por favor, tente novamente.
ru: Платеж не выполнен! Пожалуйста, попробуйте еще раз.
sv: Betalning misslyckades! Försök igen.
th: การชำระเงินล้มเหลว! โปรดลองอีกครั้ง
tr: Ödeme başarısız oldu! Lütfen tekrar deneyin.
uk: Оплата не пройшла! Спробуйте ще раз.
vi: Thanh toán không thành công! Vui lòng thử lại.

source: Payment History
ar: تاريخ الدفع
be: Гісторыя плацяжоў
da: Betalingshistorik
de: Zahlungsverlauf
es: Historial de Pagos
fr: Historique des Paiements
id: Riwayat Pembayaran
it: Cronologia dei Pagamenti
ja: 支払い履歴
ms: Sejarah Pembayaran
no: Betalingshistorikk
pl: Historia Płatności
pt: Histórico de Pagamento
ru: История платежей
sv: Betalningshistorik
th: ประวัติการชำระเงิน
tr: Ödeme Geçmişi
uk: Історія платежів
vi: Lịch sử Thanh toán

source: Payment option
ar: خيار الدفع
be: Варыянт аплаты
da: Betalingsmulighed
de: Zahlungsmethode
es: Opción de pago
fr: Option de paiement
id: Opsi pembayaran
it: Opzione di pagamento
ja: 支払いオプション
ms: Pilihan pembayaran
no: Betalingsalternativ
pl: Opcja płatności
pt: Opção de pagamento
ru: Способ оплаты
sv: Betalningsalternativ
th: ตัวเลือกการชำระเงิน
tr: Ödeme seçeneği
uk: Варіант оплати
vi: Tùy chọn thanh toán

source: Payment successful!
id: Pembayaran berhasil!
it: Pagamento riuscito!
ja: 支払いが成功しました！
no: Betaling vellykket!
pl: Płatność zakończona sukcesem!
ru: Платеж успешно выполнен!
sv: Betalning lyckades!
uk: Оплата успішна!

source: Performance & Optimization
ar: الأداء والتحسين
be: Выкананне і аптымізацыя
da: Ydeevne & Optimering
de: Leistung & Optimierung
es: Rendimiento y Optimización
fr: Performance & Optimisation
id: Kinerja & Optimisasi
it: Prestazioni e Ottimizzazione
ja: パフォーマンス & 最適化
ms: Prestasi & Pengoptimuman
no: Ytelse og optimalisering
pl: Wydajność i Optymalizacja
pt: Desempenho e Otimização
ru: Производительность и оптимизация
sv: Prestanda och optimering
th: ประสิทธิภาพ & การเพิ่มประสิทธิภาพ
tr: Performans ve Optimizasyon
uk: Продуктивність та оптимізація
vi: Hiệu Suất & Tối Ưu Hoá

source: Performance and architecture patterns for senior roles
ar: أنماط الأداء والهندسة للأدوار العليا
be: Шаблоны прадукцыйнасці і архітэктуры для старэйшых роляў
da: Ydeevne- og arkitekturmodeller for seniorroller
de: Leistung und Architektur-Muster für leitende Rollen
es: Patrones de rendimiento y arquitectura para roles senior
fr: Schémas de performance et d'architecture pour les rôles seniors
id: Pola kinerja dan arsitektur untuk peran senior
it: Schemi di prestazioni e architettura per ruoli senior
ja: シニアロールのためのパフォーマンスとアーキテクチャパターン
ms: Pola prestasi dan seni bina untuk peranan kanan
no: Ytelse og arkitekturmønstre for seniorroller
pl: Wzorce wydajności i architektury dla starszych ról
pt: Desempenho e padrões de arquitetura para cargos seniores
ru: Шаблоны производительности и архитектуры для старших ролей
sv: Prestanda- och arkitekturmönster för seniorroller
th: รูปแบบสมรรถนะและสถาปัตยกรรมสำหรับตำแหน่งอาวุโส
tr: Kıdemli roller için performans ve mimari kalıplar
uk: Продуктивність та архітектурні шаблони для старших ролей
vi: Các mô hình hiệu suất và kiến trúc cho các vai trò cấp cao

source: Performance Metrics
ar: معايير الأداء
be: Параметры эфектыўнасці
da: Præstationsmålinger
de: Leistungskennzahlen
es: Métricas de Rendimiento
fr: Métriques de performance
id: Metik Kinerja
it: Metriche di Prestazione
ja: パフォーマンス指標
ms: Metrik Prestasi
no: Ytelsesmetrikker
pl: Metryki Wydajności
pt: Métricas de Desempenho
ru: Метрики производительности
sv: Prestandamått
th: ตัวชี้วัดประสิทธิภาพ
tr: Performans Metrikleri
uk: Метрики продуктивності
vi: Hiệu Suất Hoạt Động
