Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Warm-up
ar: إحماء
be: Размінка
da: Opvarmning
de: Aufwärmen
es: Calentamiento
fr: Échauffement
id: Pemanasan
it: Riscaldamento
ja: ウォームアップ
no: Oppvarming
pl: Rozgrzewka
pt: Aquecimento
ru: Разминка
sv: Uppvärmning
th: วอร์มอัพ
tr: Isınma
uk: Розминка
vi: Khởi động

source: Warsaw
ar: وارسو
be: Варшава
da: Warszawa
de: Warschau
es: Varsovia
fr: Varsovie
id: Warsawa
it: Varsavia
ja: ワルシャワ
no: Warszawa
pl: Warszawa
pt: Varsóvia
ru: Варшава
sv: Warszawa
th: วอร์ซอ
tr: Varşova
uk: Варшава

source: WCAG Standards
ar: معايير WCAG
be: Стандарты WCAG
da: WCAG-standarder
es: Estándares WCAG
fr: Normes WCAG
id: Standar WCAG
it: Standard WCAG
ja: WCAG基準
ms: Piawaian WCAG
no: WCAG-standarder
pl: Standardy WCAG
pt: Padrões WCAG
ru: Стандарты WCAG
sv: WCAG-standarder
th: มาตรฐาน WCAG
tr: WCAG Standartları
uk: Стандарти WCAG
vi: Tiêu chuẩn WCAG

source: We appreciate your feedback!
ar: نحن نقدر ملاحظاتك!
be: Мы цанім Ваш водгук!
da: Vi sætter pris på din feedback!
de: Wir schätzen Ihr Feedback!
es: ¡Agradecemos tus comentarios!
fr: Nous apprécions vos commentaires !
id: Kami menghargai umpan balik Anda!
it: Apprezziamo il tuo feedback!
ja: あなたのフィードバックに感謝します！
ms: Kami menghargai maklum balas anda!
no: Vi setter pris på tilbakemeldingen din!
pl: Cenimy Twoją opinię!
pt: Agradecemos o seu feedback!
ru: Мы ценим ваш отзыв!
sv: Vi uppskattar din feedback!
th: เราขอขอบคุณสำหรับคำติชมของคุณ!
tr: Geri bildiriminizi takdir ediyoruz!
uk: Ми цінуємо ваш відгук!
vi: Chúng tôi rất trân trọng phản hồi của bạn!

source: We are ready to craft your plan.
de: Wir sind bereit, Ihren Plan zu erstellen.
es: Estamos listos para elaborar su plan.
id: Kami siap merancang rencana Anda.
it: Siamo pronti a creare il tuo piano.
ja: 私たちはあなたのプランを作成する準備ができています。
no: Vi er klare til å utforme din plan.
pl: Jesteśmy gotowi do opracowania Twojego planu.
pt: Estamos prontos para elaborar seu plano.
ru: Мы готовы составить ваш план.
sv: Vi är redo att utforma din plan.
th: พร้อมที่จะสร้างแผนของคุณแล้ว
tr: Planınızı oluşturmaya hazırız.
uk: Ми готові скласти ваш план.
vi: Chúng tôi đã sẵn sàng để xây dựng kế hoạch của bạn.

source: We can send you marketing emails
de: Wir können Ihnen Werbe-E-Mails senden
es: Podemos enviarte correos electrónicos de marketing
id: Kami dapat mengirimkan email pemasaran kepada Anda
it: Possiamo inviarti email di marketing
ja: マーケティングメールをお送りすることができます
no: Vi kan sende deg markedsførings-e-poster
pl: Możemy wysyłać do Ciebie e-maile marketingowe
pt: Podemos enviar e-mails de marketing a você
ru: Мы можем отправить вам маркетинговые письма
sv: Vi kan skicka marknadsföringsmejl till dig
th: เราสามารถส่งอีเมลการตลาดให้คุณได้
tr: Size pazarlama e-postaları gönderebiliriz
uk: Ми можемо надсилати вам маркетингові електронні листи

source: We process your voice using AI
ar: نحن نقوم بمعالجة صوتك باستخدام الذكاء الاصطناعي
be: Мы апрацоўваем ваш голас з дапамогай ІІ
da: Vi behandler din stemme ved hjælp af AI
de: Wir verarbeiten Ihre Stimme mit KI
es: Procesamos tu voz usando IA
fr: Nous traitons votre voix à l'aide de l'IA
id: Kami memproses suara Anda menggunakan AI
it: Elaboriamo la tua voce utilizzando l'IA
ja: 私たちはAIを使用してあなたの声を処理します
ms: Kami memproses suara anda menggunakan AI
no: Vi behandler stemmen din ved hjelp av AI
pl: Przetwarzamy Twój głos za pomocą AI
pt: Processamos sua voz usando IA
ru: Мы обрабатываем ваш голос с помощью ИИ
sv: Vi bearbetar din röst med hjälp av AI
th: เราประมวลผลเสียงของคุณโดยใช้ AI
tr: Sesinizi AI kullanarak işliyoruz
uk: Ми обробляємо ваш голос за допомогою ШІ
vi: Chúng tôi xử lý giọng nói của bạn bằng AI

source: We sent a sign-in link to your email. Please check your inbox and click the link to sign in.
ar: لقد أرسلنا رابط تسجيل الدخول إلى بريدك الإلكتروني. يرجى التحقق من صندوق الوارد لديك والنقر على الرابط لتسجيل الدخول.
be: Мы адпраўляем спасылку для ўваходу на ваш электронны адрас. Калі ласка, праверце сваю паштовую скрыню і націсніце на спасылку, каб увайсці.
da: Vi har sendt et log-in link til din email. Venligst tjek din indbakke og klik på linket for at logge ind.
de: Wir haben Ihnen einen Anmeldelink per E-Mail gesendet. Bitte überprüfen Sie Ihr Postfach und klicken Sie auf den Link, um sich anzumelden.
es: Hemos enviado un enlace de inicio de sesión a tu correo electrónico. Por favor, revisa tu bandeja de entrada y haz clic en el enlace para iniciar sesión.
fr: Nous avons envoyé un lien de connexion à votre e-mail. Veuillez vérifier votre boîte de réception et cliquer sur le lien pour vous connecter.
id: Kami mengirimkan tautan masuk ke email Anda. Silakan periksa kotak masuk Anda dan klik tautannya untuk masuk.
it: Abbiamo inviato un link di accesso alla tua email. Si prega di controllare la tua casella di posta e cliccare sul link per accedere.
ja: メールにサインインリンクを送りました。受信トレイを確認して、そのリンクをクリックしてサインインしてください。
no: Vi har sendt en påloggingslink til e-posten din. Vennligst sjekk innboksen din og klikk på linken for å logge inn.
pl: Wysłaliśmy link logowania na Twój adres e-mail. Sprawdź swoją skrzynkę odbiorczą i kliknij link, aby się zalogować.
pt: Enviamos um link de acesso para o seu e-mail. Por favor, verifique sua caixa de entrada e clique no link para acessar.
ru: Мы отправили ссылку для входа на вашу электронную почту. Пожалуйста, проверьте свой почтовый ящик и нажмите на ссылку для входа.
sv: Vi har skickat en inloggningslänk till din e-post. Vänligen kontrollera din inkorg och klicka på länken för att logga in.
th: เราได้ส่งลิงก์สำหรับลงชื่อเข้าใช้ไปยังอีเมลของคุณแล้ว กรุณาตรวจสอบกล่องจดหมายของคุณและคลิกลิงก์เพื่อเข้าใช้
tr: E-postanıza bir oturum açma bağlantısı gönderdik. Lütfen gelen kutunuzu kontrol edin ve oturum açmak için bağlantıyı tıklayın.
uk: Ми надіслали посилання для входу на вашу електронну пошту. Будь ласка, перевірте свою скриньку і натисніть на посилання, щоб увійти.
vi: Chúng tôi đã gửi một liên kết đăng nhập tới email của bạn. Vui lòng kiểm tra hộp thư đến và nhấp vào liên kết để đăng nhập.

source: We use cookies to enhance your experience
ar: نحن نستخدم ملفات تعريف الارتباط لتحسين تجربتك
be: Мы выкарыстоўваем файлы cookie, каб палепшыць ваш вопыт
da: Vi bruger cookies til at forbedre din oplevelse
de: Wir verwenden Cookies, um Ihre Erfahrung zu verbessern.
es: Usamos cookies para mejorar su experiencia
fr: Nous utilisons des cookies pour améliorer votre expérience
id: Kami menggunakan cookie untuk meningkatkan pengalaman Anda
it: Usiamo i cookie per migliorare la tua esperienza
ja: 私たちはお客様の体験を向上させるためにクッキーを使用します
ms: Kami menggunakan kuki untuk meningkatkan pengalaman anda
no: Vi bruker informasjonskapsler for å forbedre opplevelsen din
pl: Używamy plików cookie, aby zwiększyć Twoje doznania
pt: Usamos cookies para melhorar sua experiência
ru: Мы используем файлы cookie, чтобы улучшить ваш опыт
sv: Vi använder cookies för att förbättra din upplevelse
th: เราใช้คุกกี้เพื่อเพิ่มประสบการณ์ของคุณ
tr: Deneyiminizi geliştirmek için çerezleri kullanıyoruz
uk: Ми використовуємо файли cookie, щоб покращити ваш досвід
vi: Chúng tôi sử dụng cookie để nâng cao trải nghiệm của bạn

source: We will delete your data, but information about your balance will be stored for one year.
ar: سنقوم بحذف بياناتك، ولكن المعلومات حول رصيدك ستُحفظ لمدة عام واحد.
be: Мы выдалім вашыя дадзеныя, але інфармацыя пра ваш баланс будзе захавана на працягу аднаго года.
da: Vi vil slette dine data, men information om din saldo vil blive opbevaret i et år.
de: Wir werden Ihre Daten löschen, aber Informationen über Ihr Guthaben werden für ein Jahr gespeichert.
es: Eliminaremos tus datos, pero la información sobre tu saldo se almacenará durante un año.
fr: Nous supprimerons vos données, mais les informations sur votre solde seront conservées pour une année.
id: Kami akan menghapus data Anda, tetapi informasi tentang saldo Anda akan disimpan selama satu tahun.
it: Elimineremo i tuoi dati, ma le informazioni sul tuo saldo saranno conservate per un anno.
ja: あなたのデータは削除されますが、残高に関する情報は一 年間保管されます。
ms: Kami akan memadam data anda, tetapi maklumat tentang baki anda akan disimpan selama satu tahun.
no: Vi vil slette dataene dine, men informasjon om saldoen din vil bli lagret i ett år.
pl: Usuniemy twoje dane, ale informacje o twoim saldzie zostaną przechowywane przez jeden rok.
pt: Nós vamos apagar seus dados, mas as informações sobre seu saldo serão armazenadas por um ano.
ru: Мы удалим ваши данные, но информация о вашем балансе будет храниться в течение одного года.
sv: Vi kommer att radera dina data, men information om ditt saldo kommer att lagras i ett år.
th: เราจะลบข้อมูลของคุณ แต่ข้อมูลเกี่ยวกับยอดคงเหลือของคุณจะถูกเก็บไว้เป็นเวลาหนึ่ง ปี
tr: Verilerinizi sileceğiz, ancak bakiye bilgileriniz bir yıl boyunca saklanacaktır.
uk: Ми видалимо ваші дані, але інформація про ваш баланс буде зберігатися протягом одного року.
vi: Chúng tôi sẽ xóa dữ liệu của bạn, nhưng thông tin về số dư của bạn sẽ được lưu trữ trong một năm.

source: We will speak freely
ar: سنتحدث بحرية
be: Мы будзем казаць свабодна
da: Vi vil tale frit
de: Wir werden frei sprechen
es: Hablaremos libremente
fr: Nous parlerons librement
id: Kami akan berbicara dengan bebas
it: Parleremo liberamente
ja: 自由に話しましょう
ms: Kami akan bercakap dengan bebas
no: Vi vil tale fritt
pl: Będziemy mówić swobodnie
pt: Iremos falar livremente
ru: Мы будем говорить свободно
sv: Vi kommer att tala fritt
th: เราจะพูดอย่างอิสระ
tr: Özgürce konuşacağız
uk: Ми будемо говорити вільно
vi: Chúng ta sẽ nói chuyện một cách tự do

source: We're ready to begin!
es: ¡Estamos listos para comenzar!
id: Kami siap untuk memulai!
it: Siamo pronti per iniziare!
ja: 私たちは始める準備ができました！
no: Vi er klare til å begynne!
pl: Jesteśmy gotowi, aby zacząć!
pt: Estamos prontos para começar!
ru: Мы готовы начать!
sv: Vi är redo att börja!
uk: Ми готові розпочати!

source: Weaknesses:
ar: ضعف:
be: Слабасткі:
da: Svagheder:
de: Schwächen:
es: Debilidades:
fr: Faiblesses:
id: Kelemahan:
it: Punti deboli:
ja: 弱点:
ms: Kelemahan:
no: Svakheter:
pl: Słabości:
pt: Fraquezas:
ru: Слабые стороны:
sv: Svagheter:
th: ความอ่อนแอ:
tr: Zayıflıklar:
uk: Слабкі сторони:
vi: Nhược điểm:

source: web developer interview preparation
ar: إعداد مقابلة مطور الويب
be: падрыхтоўка да інтэрв'ю на пасаду вэб-распрацоўшчыка
da: webudvikler interview forberedelse
de: Vorbereitung auf das Vorstellungsgespräch für Webentwickler
es: preparación para la entrevista de desarrollador web
fr: préparation à l'entretien de développeur web
id: persiapan wawancara pengembang web
it: preparazione per il colloquio da sviluppatore web
ja: ウェブ開発者面接準備
ms: persediaan temu duga pembangun web
no: webutvikler intervjuforberedelse
pl: przygotowanie do rozmowy kwalifikacyjnej na stanowisko programisty webowego
pt: preparação para entrevista de desenvolvedor web
ru: подготовка к собеседованию для веб-разработчика
sv: webbutvecklarens intervjuförberedelse
th: การเตรียมตัวสัมภาษณ์นักพัฒนาเว็บ
tr: web geliştirici mülakat hazırlığı
uk: підготовка до співбесіди веб-розробника
vi: chuẩn bị phỏng vấn nhà phát triển web

source: Webcam access denied. Please enable webcam permissions in your browser settings.
ar: رفض الوصول إلى كاميرا الويب. يُرجى تمكين أذونات كاميرا الويب في إعدادات المتصفح لديك.
be: Доступ да вэб-камеры забаронены. Калі ласка, уключыце дазволы на доступ да вэб-камеры ў наладах вашага браузера.
da: Webcam-adgang nægtet. Aktiver venligst webcam-tilladelser i dine browserindstillinger.
de: Webcam-Zugriff verweigert. Bitte aktivieren Sie die Webcam-Berechtigungen in Ihren Browser-Einstellungen.
es: Acceso a la cámara web denegado. Por favor, habilita los permisos de la cámara web en la configuración de tu navegador.
fr: L'accès à la webcam est refusé. Veuillez activer les autorisations de la webcam dans les paramètres de votre navigateur.
id: Akses webcam ditolak. Silakan aktifkan izin webcam di pengaturan browser Anda.
it: Accesso alla webcam negato. Si prega di abilitare le autorizzazioni della webcam nelle impostazioni del browser.
ja: ウェブカメラへのアクセスが拒否されました。ブラウザの設定でウェブカメラの許可を有効にしてください。
no: Webkamera-tilgang nektet. Vennligst aktiver webkamera-tillatelser i nettleserinnstillingene dine.
pl: Dostęp do kamery internetowej został odrzucony. Proszę włączyć uprawnienia do kamery internetowej w ustawieniach przeglądarki.
pt: Acesso à webcam negado. Por favor, ative as permissões da webcam nas configurações do seu navegador.
ru: Доступ к веб-камере запрещен. Пожалуйста, включите разрешения для веб-камеры в настройках вашего браузера.
sv: Webbkameratillgång nekad. Vänligen aktivera webbkamerabehörigheter i dina webbläsarinställningar.
th: การเข้าถึงเว็บแคมถูกปฏิเสธ กรุณาเปิดใช้งานการอนุญาตเว็บแคมในการตั้งค่าเบราว์เซอร์ของคุณ
tr: Webcam erişimi reddedildi. Lütfen tarayıcı ayarlarınızdan webcam izinlerini etkinleştirin.
uk: Доступ до вебкамери відхилено. Будь ласка, увімкніть дозволи для вебкамери у налаштуваннях вашого браузера.
vi: Quyền truy cập webcam bị từ chối. Vui lòng bật quyền truy cập webcam trong cài đặt trình duyệt của bạn.

source: Webcam Feedback Preview
ar: معاينة تعليقات كاميرا الويب
be: Папярэдні прагляд зваротнай сувязі вэб-камеры
da: Webcam Feedback-forhåndsvisning
de: Webcam-Vorschau-Feedback
es: Vista previa de retroalimentación de Webcam
fr: Aperçu du Retour Vidéo de la Webcam
id: Pratinjau Umpan Balik Webcam
it: Anteprima Feedback Webcam
ja: ウェブカメラフィードバックプレビュー
no: Forhåndsvisning av webkameratilbakemelding
pl: Podgląd danych z kamery internetowej
pt: Pré-visualização de Feedback da Webcam
ru: Предварительный просмотр обратной связи с веб-камеры
sv: Webbkamera Förhandsgranskning av Feedback
th: การแสดงตัวอย่างข้อเสนอแนะของเว็บแคม
tr: Webcam Geri Bildirim Önizlemesi
uk: Попередній перегляд зворотного зв'язку з вебкамери
vi: Xem trước Phản hồi Webcam

source: Webcam Setup
es: Configuración de la Cámara Web
id: Pengaturan Webcam
it: Configurazione Webcam
ja: ウェブカメラのセットアップ
no: Webkameraoppsett
pl: Konfiguracja kamery internetowej
pt: Configuração da Webcam
ru: Настройка веб-камеры
sv: Webbkamera Inställning
uk: Налаштування веб-камери

source: Week
de: Woche
es: Semana
id: Minggu
it: Settimana
ja: 週間
no: Uke
pl: Tydzień
pt: Semana
ru: Неделя
sv: Vecka
th: สัปดาห์
tr: Hafta
uk: Тиждень
vi: Tuần

source: week
de: Woche
es: semana
id: minggu
it: settimana
ja: 週
no: uke
pl: tydzień
pt: semana
ru: неделя
sv: vecka
th: สัปดาห์
tr: hafta
uk: тиждень
vi: tuần

source: Welcome to Your Junior Frontend Developer Interview Prep
ar: مرحبا بك في الاستعداد لمقابلة مطور الواجهة الأمامية للمبتدئين الخاصة بك
be: Сардэчна запрашаем на Сацыяльную падрыхтоўку да інтэрв'ю Малодшага Фронтэнд-распрацоўшчыка
da: Velkommen til din forberedelse til junior frontend-udviklerinterviewet
de: Willkommen zu Ihrer Vorbereitung auf das Vorstellungsgespräch für Junior-Frontend-Entwickler
es: Bienvenido a tu Preparación para la Entrevista de Desarrollador Frontend Junior
fr: Bienvenue dans votre préparation d'entretien pour développeur frontend junior
id: Selamat Datang di Persiapan Wawancara Developer Frontend Junior Anda
it: Benvenuto alla Tua Preparazione per il Colloquio da Junior Frontend Developer
ja: ジュニアフロントエンド開発者インタビュー準備へようこそ
no: Velkommen til din forberedelse til intervju for junior frontend-utvikler
pl: Witamy w przygotowaniach do rozmowy kwalifikacyjnej na stanowisko Junior Frontend Developer
pt: Bem-vindo ao Seu Preparatório para Entrevista de Desenvolvedor Frontend Júnior
ru: Добро пожаловать на подготовку к собеседованию на позицию младшего фронтенд-разработчика
sv: Välkommen till Din Förberedelse för Junior Frontend Utvecklarintervju
th: ยินดีต้อนรับสู่การเตรียมตัวสัมภาษณ์นักพัฒนาฝั่งหน้ารุ่นเยาว์ของคุณ
tr: Junior Frontend Developer Mülakat Hazırlığı'na Hoş Geldiniz
uk: Ласкаво просимо до Підготовки до Співбесіди на Молодшого Фронтенд-Розробника
vi: Chào mừng bạn đến với Chuẩn bị phỏng vấn Junior Frontend Developer của bạn

source: Welcome to Your Senior Frontend Developer Interview Prep
ar: مرحبا بك في الإعداد لمقابلة مطور الواجهات الأمامية المتقدم لديك
be: Сардэчна запрашаем у Падрыхтоўку да Сумоіспыту на Пазіцыю Старшага Фронтэнд-Распрацоўшчыка
da: Velkommen til Din Senior Frontend Udvikler Interview Forberedelse
de: Willkommen bei Ihrer Vorbereitung auf das Vorstellungsgespräch zum Senior Frontend Developer
es: Bienvenido a tu Preparación para la Entrevista de Desarrollador Frontend Senior
fr: Bienvenue à votre Préparation à l'Entretien de Développeur Frontend Senior
id: Selamat Datang di Persiapan Wawancara Senior Frontend Developer Anda
it: Benvenuto alla tua preparazione per il colloquio da sviluppatore frontend senior
ja: あなたのシニアフロントエンド開発者面接準備へようこそ
ms: Selamat Datang ke Persiapan Temuduga Pembangun Frontend Kanan Anda
no: Velkommen til ditt forberedelseskurs for intervju som Senior Frontend-utvikler
pl: Witamy w przygotowaniach do rozmowy kwalifikacyjnej na stanowisko Senior Frontend Developer
pt: Bem-vindo à Sua Preparação para Entrevista de Desenvolvedor Frontend Sênior
ru: Добро пожаловать в подготовку к интервью на должность старшего фронтенд-разработчика
sv: Välkommen till din förberedelse för intervju som Senior Frontend-utvecklare
th: ยินดีต้อนรับสู่การเตรียมตัวสัมภาษณ์สำหรับนักพัฒนาฝั่งหน้าอาวุโสของคุณ
tr: Kıdemli Frontend Geliştirici Mülakat Hazırlığınıza Hoş Geldiniz
uk: Ласкаво просимо до підготовки до співбесіди на позицію старшого фронтенд-розробника
vi: Chào mừng bạn đến với Chuẩn bị Phỏng vấn Lập trình viên Giao diện cao cấp của bạn

source: Wellness
ar: العافية
be: Благасостаянне
de: Wohlbefinden
es: Bienestar
fr: Bien-être
id: Kesejahteraan
it: Benessere
ja: ウェルネス
ms: Kesejahteraan
no: Velvære
pl: Dobrobyt
pt: Bem-estar
ru: Благополучие
sv: Välbefinnande
th: สุขภาพและสุขภาพจิต
tr: Sağlık
uk: Благополуччя
vi: Sức khỏe

source: What are HTML semantic elements and why are they important?
ar: ما هي العناصر الدلالية في HTML ولماذا هي مهمة؟
be: Што такое семантычныя элементы HTML і чаму яны важныя?
da: Hvad er HTML-semantiske elementer, og hvorfor er de vigtige?
de: Was sind HTML-Semantikelemente und warum sind sie wichtig?
es: ¿Qué son los elementos semánticos de HTML y por qué son importantes?
fr: Qu'est-ce que les éléments sémantiques HTML et pourquoi sont-ils importants ?
id: Apa itu elemen semantik HTML dan mengapa mereka penting?
it: Quali sono gli elementi semantici HTML e perché sono importanti?
ja: HTMLのセマンティック要素とは何ですか、そしてなぜそれらが重要なのですか？
no: Hva er HTML-semantiske elementer og hvorfor er de viktige?
pl: Czym są semantyczne elementy HTML i dlaczego są ważne?
pt: O que são elementos semânticos HTML e por que são importantes?
ru: Что такое семантические элементы HTML и почему они важны?
sv: Vad är HTML-semantiska element och varför är de viktiga?
th: องค์ประกอบทางความหมายของ HTML คืออะไร และทำไมถึงมีความสำคัญ?
tr: HTML anlamsal öğeler nelerdir ve neden önemlidirler?
uk: Що таке семантичні елементи HTML і чому вони важливі?
vi: Các thành phần ngữ nghĩa HTML là gì và tại sao chúng quan trọng?

source: What can I post?
uk: Що я можу опублікувати?

source: What challenges you face
de: Welche Herausforderungen stehen Ihnen gegenüber?
es: ¿Qué desafíos enfrentas?
id: Apa tantangan yang Anda hadapi
it: Quali sfide affronti
ja: あなたが直面する課題
no: Hvilke utfordringer står du overfor
pl: Jakie wyzwania napotykasz
pt: Quais desafios você enfrenta
ru: С какими проблемами вы сталкиваетесь
sv: Vilka utmaningar står du inför
th: อะไรคือความท้าทายที่คุณเผชิญ
tr: Karşılaştığınız zorluklar nelerdir?
uk: Які виклики ви стикаєтеся
vi: Những thử thách bạn gặp phải

source: What do I get with the paid plan?
ar: ما الذي أحصل عليه مع الخطة المدفوعة؟
be: Што я атрымліваю з платным планам?
da: Hvad får jeg med betalingsplanen?
de: Was bekomme ich mit dem kostenpflichtigen Plan?
es: ¿Qué obtengo con el plan de pago?
fr: Qu'obtiens-je avec le plan payant ?
id: Apa yang saya dapatkan dengan paket berbayar?
it: Cosa ottengo con il piano a pagamento?
ja: 有料プランで何が得られますか？
no: Hva får jeg med betalingstjenesten?
pl: Co otrzymam z płatnym planem?
pt: O que eu recebo com o plano pago?
ru: Что я получу платно?
sv: Vad får jag med betalplanen?
th: ฉันจะได้รับอะไรจากแผนการชำระเงิน?
tr: Ücretli planla ne elde ederim?
uk: Що я отримую з платним планом?
vi: Tôi nhận được gì với gói trả phí?

source: What do I need to use FluencyPal?
ar: ما الذي أحتاجه لاستخدام FluencyPal؟
be: Што мне трэба, каб выкарыстоўваць FluencyPal?
da: Hvad har jeg brug for for at bruge FluencyPal?
de: Was benötige ich, um FluencyPal zu verwenden?
es: ¿Qué necesito para usar FluencyPal?
fr: De quoi ai-je besoin pour utiliser FluencyPal ?
id: Apa yang saya perlukan untuk menggunakan FluencyPal?
it: Di cosa ho bisogno per utilizzare FluencyPal?
ja: FluencyPalを利用するには何が必要ですか?
no: Hva trenger jeg for å bruke FluencyPal?
pl: Czego potrzebuję, aby korzystać z FluencyPal?
pt: O que eu preciso para usar o FluencyPal?
ru: Что мне нужно для использования FluencyPal?
sv: Vad behöver jag för att använda FluencyPal?
th: ฉันต้องใช้อะไรบ้างในการใช้ FluencyPal?
tr: FluencyPal'i kullanmak için neye ihtiyacım var?
uk: Що мені потрібно для використання FluencyPal?
vi: Tôi cần gì để sử dụng FluencyPal?

source: What do you think?
de: Was denkst du?
es: ¿Qué piensas?
id: Apa pendapat Anda?
it: Cosa ne pensi?
ja: 何を考えていますか？
no: Hva synes du?
pl: Co myślisz?
pt: O que você acha?
ru: Что вы думаете?
sv: Vad tycker du?
th: คุณคิดว่าอย่างไร?
tr: Ne düşünüyorsun?
uk: Що ви думаєте?
vi: Bạn nghĩ sao?

source: What I can do for you:
ar: ما يمكنني فعله من أجلك:
be: Што я магу зрабіць для вас:
da: Hvad jeg kan gøre for dig:
de: Was ich für Sie tun kann:
es: Lo que puedo hacer por ti:
fr: Ce que je peux faire pour vous :
id: Apa yang bisa saya lakukan untuk Anda:
it: Cosa posso fare per te:
ja: 私があなたのためにできること：
ms: Apa yang boleh saya lakukan untuk anda:
no: Hva kan jeg gjøre for deg:
pl: Co mogę dla ciebie zrobić:
pt: O que posso fazer por você:
ru: Что я могу сделать для вас:
sv: Vad jag kan göra för dig:
th: สิ่งที่ฉันสามารถทำให้คุณได้:
tr: Yardımcı olabileceğim şeyler:
uk: Що я можу зробити для вас:
vi: Cái gì tôi có thể làm cho bạn:

source: What is FluencyPal?
ar: ما هو FluencyPal؟
be: Што такое FluencyPal?
da: Hvad er FluencyPal?
de: Was ist FluencyPal?
es: ¿Qué es FluencyPal?
fr: Qu'est-ce que FluencyPal ?
id: Apa itu FluencyPal?
it: Cosa è FluencyPal?
ja: FluencyPalとは何ですか？
ms: Apa itu FluencyPal?
no: Hva er FluencyPal?
pl: Czym jest FluencyPal?
pt: O que é o FluencyPal?
ru: Что такое FluencyPal?
sv: Vad är FluencyPal?
th: FluencyPal คืออะไร?
tr: FluencyPal nedir?
uk: Що таке FluencyPal?
vi: FluencyPal là gì?
