Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Prepare short, honest, and positive answers with real-life examples.
ar: قم بإعداد إجابات قصيرة، صادقة، وإيجابية مع أمثلة من الحياة الواقعية.
be: Падрыхтуйце кароткія, чэсныя і пазітыўныя адказы з рэальнымі прыкладамі.
da: Forbered korte, ærlige og positive svar med eksempler fra det virkelige liv.
de: Bereiten Sie kurze, ehrliche und positive Antworten mit Beispielen aus dem echten Leben vor.
es: Prepara respuestas cortas, honestas y positivas con ejemplos de la vida real.
fr: Préparez des réponses courtes, honnêtes et positives avec des exemples tirés de la vie réelle.
id: Siapkan jawaban yang singkat, jujur, dan positif dengan contoh-contoh dari kehidupan nyata.
it: Preparati risposte brevi, oneste e positive con esempi pratici dalla vita reale.
ja: 現実の例を用いて、短く、正直で、ポジティブな答えを準備してください。
ms: Sediakan jawapan yang pendek, jujur, dan positif dengan contoh-contoh kehidupan sebenar.
no: Forbered korte, ærlige og positive svar med eksempler fra det virkelige liv.
pl: Przygotuj krótkie, szczere i pozytywne odpowiedzi z rzeczywistymi przykładami.
pt: Prepare respostas curtas, honestas e positivas com exemplos da vida real.
ru: Подготовьте короткие, честные и позитивные ответы с примерами из реальной жизни.
sv: Förbered korta, ärliga och positiva svar med verkliga exempel.
th: เตรียมคำตอบที่สั้น ๆ ซื่อสัตย์ และเชิงบวกด้วยตัวอย่างจากชีวิตจริง
tr: Gerçek hayat örnekleri ile kısa, dürüst ve olumlu yanıtlar hazırlayın.
uk: Підготуйте короткі, чесні та позитивні відповіді з прикладами з реального життя.
vi: Chuẩn bị những câu trả lời ngắn gọn, chân thật và tích cực với các ví dụ từ thực tế.

source: Prepare to showcase your portfolio, discuss your learning journey, and secure your first professional role.
ar: استعد لعرض حقيبتك، ومناقشة رحلتك التعليمية، وتأمين دورك المهني الأول.
be: Падрыхтуйцеся прадэманстраваць сваё партфоліо, абмеркаваць ваш шлях у навучанні і заваяваць вашу першую прафесійную ролю.
da: Forbered dig på at fremvise din portefølje, diskutere din læringsrejse og sikre din første professionelle rolle.
de: Bereiten Sie sich darauf vor, Ihr Portfolio zu präsentieren, Ihren Lernweg zu besprechen und Ihre erste professionelle Rolle zu sichern.
es: Prepárate para mostrar tu portafolio, discutir tu viaje de aprendizaje y asegurar tu primer rol profesional.
fr: Préparez-vous à présenter votre portfolio, à discuter de votre parcours d'apprentissage et à décrocher votre premier rôle professionnel.
id: Persiapkan untuk memamerkan portofolio Anda, membahas perjalanan belajar Anda, dan mengamankan peran profesional pertama Anda.
it: Prepara a mostrare il tuo portfolio, discuti il tuo percorso di apprendimento e assicurati il tuo primo ruolo professionale.
ja: ポートフォリオを披露する準備をし、学習の旅を話し合い、最初のプロの役割を確保しましょう。
no: Forbered deg på å vise frem porteføljen din, diskutere din læringsreise, og sikre deg din første profesjonelle rolle.
pl: Przygotuj się, aby zaprezentować swoje portfolio, omówić swoją ścieżkę nauki i zdobyć swoją pierwszą profesjonalną rolę.
pt: Prepare-se para exibir seu portfólio, discutir sua jornada de aprendizagem e garantir seu primeiro cargo profissional.
ru: Подготовьтесь продемонстрировать свое портфолио, обсудить ваш путь обучения и получить вашу первую профессиональную роль.
sv: Förbered dig på att visa upp din portfolio, diskutera din läranderesa och säkra din första professionella roll.
th: เตรียมแสดงผลงานของคุณ พูดคุยเกี่ยวกับเส้นทางการเรียนรู้ของคุณ และคว้าบทบาทงานมืออาชีพครั้งแรกของคุณ
tr: Portföyünüzü sergilemeye, öğrenme yolculuğunuzu tartışmaya ve ilk profesyonel rolünüzü güvence altına almaya hazırlanın.
uk: Підготуйтеся продемонструвати своє портфоліо, обговорити свій шлях навчання та отримати свою першу професійну роль.
vi: Chuẩn bị để trình bày danh mục đầu tư của bạn, thảo luận về hành trình học tập của bạn và đảm bảo vai trò chuyên nghiệp đầu tiên của bạn.

source: Preparing for an interview in English takes time, but it pays off. Use the tips from this article, practice with FluencyPal’s interview simulator, and walk into your next job interview with confidence.
ar: الاستعداد لمقابلة باللغة الإنجليزية يستغرق وقتًا، ولكنه يعود بالنفع. استخدم النصائح من هذا المقال، وتدرب مع محاكاة المقابلات من FluencyPal، وادخل إلى مقابلة عملك التالية بثقة.
be: Падрыхтоўка да інтэрв'ю на англійскай мове займае час, але гэта аплацоўваецца. Выкарыстоўвайце парады з гэтай стацьі, трэніруйцеся з дапамогай сімулятара інтэрв'ю FluencyPal і ўвайдзіце на наступнае працоўнае інтэрв'ю з упэўненасцю.
da: Forberedelse til et interview på engelsk tager tid, men det betaler sig. Brug tipsene fra denne artikel, øv dig med FluencyPal's interviewsimulator, og gå ind til dit næste jobinterview med selvtillid.
de: Die Vorbereitung auf ein Interview auf Englisch erfordert Zeit, aber es zahlt sich aus. Nutzen Sie die Tipps aus diesem Artikel, üben Sie mit FluencyPal's Interview-Simulator und treten Sie Ihrem nächsten Vorstellungsgespräch mit Selbstvertrauen gegenüber.
es: Prepararse para una entrevista en inglés lleva tiempo, pero vale la pena. Utiliza los consejos de este artículo, practica con el simulador de entrevistas de FluencyPal y entra a tu próxima entrevista de trabajo con confianza.
fr: La préparation pour un entretien en anglais prend du temps, mais cela en vaut la peine. Utilisez les conseils de cet article, pratiquez avec le simulateur d'entretien de FluencyPal, et entrez dans votre prochain entretien d'embauche avec confiance.
id: Bersiap untuk wawancara dalam bahasa Inggris memerlukan waktu, tetapi ini sangat berharga. Gunakan tips dari artikel ini, berlatihlah dengan simulator wawancara FluencyPal, dan masuklah ke wawancara pekerjaan berikutnya dengan percaya diri.
it: Prepararsi per un colloquio in inglese richiede tempo, ma ne vale la pena. Usa i consigli di questo articolo, pratica con il simulatore di colloqui di FluencyPal e entra con fiducia nel tuo prossimo colloquio di lavoro.
ja: 英語の面接の準備には時間がかかりますが、それは報われます。この記事のヒントを活用し、FluencyPalの面接シミュレーターで練習し、次の求人面接に自信を持って臨みましょう。
ms: Menyediakan diri untuk temuduga dalam bahasa Inggeris memerlukan masa, tetapi ia memberikan hasil. Gunakanlah tips dari artikel ini, latihlah diri anda dengan simulator temuduga FluencyPal, dan masuklah ke temuduga kerja seterusnya anda dengan penuh keyakinan.
no: Å forberede seg til et intervju på engelsk tar tid, men det lønner seg. Bruk tipsene fra denne artikkelen, øv med FluencyPals intervjusimulator, og gå inn i ditt neste jobbintervju med selvtillit.
pl: Przygotowanie do rozmowy kwalifikacyjnej w języku angielskim wymaga czasu, ale się opłaca. Skorzystaj z porad z tego artykułu, ćwicz przy użyciu symulatora rozmów kwalifikacyjnych FluencyPal i podejdź do swojej następnej rozmowy o pracę z pewnością siebie.
pt: A preparação para uma entrevista em inglês leva tempo, mas compensa. Use as dicas deste artigo, pratique com o simulador de entrevistas do FluencyPal e entre na sua próxima entrevista de emprego com confiança.
ru: Подготовка к собеседованию на английском языке занимает время, но оно окупается. Используйте советы из этой статьи, практикуйте с помощью симулятора интервью FluencyPal и приходите на следующее собеседование с уверенностью.
sv: Förberedelser inför en intervju på engelska tar tid, men det lönar sig. Använd tipsen från denna artikel, öva med FluencyPals intervjusimulator, och gå in i din nästa jobbintervju med självförtroende.
th: การเตรียมตัวสำหรับสัมภาษณ์งานในภาษาอังกฤษต้องใช้เวลา แต่มันคุ้มค่า ใช้เคล็ดลับจากบทความนี้ ฝึกฝนด้วยสมูเลเตอร์สัมภาษณ์ของ FluencyPal แล้วเดินเข้าไปในการสัมภาษณ์งานครั้งถัดไปของคุณด้วยความมั่นใจ
tr: İngilizce bir mülakata hazırlanmak zaman alır, ancak karşılığını verir. Bu makaleden alınan tavsiyeleri kullanın, FluencyPal'ın mülakat simülatörü ile pratik yapın ve bir sonraki iş mülakatına güvenle girin.
uk: Підготовка до інтерв'ю англійською мовою займає час, але вона виправдовує себе. Використовуйте поради з цієї статті, тренуйтеся за допомогою симулятора співбесіди FluencyPal і йдіть на своє наступне співбесіду з впевненістю.
vi: Chuẩn bị cho một cuộc phỏng vấn bằng tiếng Anh mất thời gian, nhưng nó sẽ mang lại lợi ích. Sử dụng các mẹo từ bài viết này, thực hành với trình mô phỏng phỏng vấn của FluencyPal, và tiến vào cuộc phỏng vấn công việc tiếp theo của bạn với sự tự tin.

source: Preparing the brain
ar: تجهيز الدماغ
be: Падрыхтоўка мозга
da: Forbereder hjernen
de: Vorbereitung des Gehirns
es: Preparando el cerebro
fr: Préparation du cerveau
id: Mempersiapkan otak
it: Preparando il cervello
ja: 脳を準備する
ms: Menyediakan otak
no: Forbereder hjernen
pl: Przygotowanie mózgu
pt: Preparando o cérebro
ru: Подготовка мозга
sv: Förbereder hjärnan
th: เตรียมสมอง
tr: Beyni hazırlama
uk: Підготовка мозку
vi: Chuẩn bị cho bộ não

source: Preparing your game...
id: Menyiapkan permainan Anda...
it: Preparazione del tuo gioco...
ja: ゲームの準備中...
no: Forbereder spillet ditt...
ru: Подготовка вашей игры...
uk: Підготовка вашої гри...

source: Previous Question
id: Pertanyaan Sebelumnya
it: Domanda precedente
ja: 前の質問
no: Forrige spørsmål
pl: Poprzednie Pytanie
ru: Предыдущий вопрос
sv: Föregående fråga
uk: Попереднє питання

source: Price
ar: سعر
be: Цана
da: Pris
de: Preis
es: Precio
fr: Prix
id: Harga
it: Prezzo
ja: 価格
ms: Harga
no: Pris
pl: Cena
pt: Preço
ru: Цена
sv: Pris
th: ราคา
tr: Fiyat
uk: Ціна
vi: Giá

source: Priority support
ar: الدعم ذو الأولوية
be: Прыярытэтная падтрымка
da: Prioritetsstøtte
de: Prioritätsunterstützung
es: Soporte prioritario
fr: Support prioritaire
id: Dukungan prioritas
it: Supporto prioritario
ja: 優先サポート
no: Prioritert støtte
pl: Priorytetowe wsparcie
pt: Suporte prioritário
ru: Приоритетная поддержка
sv: Prioriterad support
th: การสนับสนุนลำดับความสำคัญ
tr: Öncelikli destek
uk: Пріоритетна підтримка
vi: Hỗ trợ ưu tiên

source: Privacy Policy
ar: سياسة الخصوصية
be: Палітыка прыватнасці
da: Privatlivspolitik
de: Datenschutzrichtlinie
es: Política de Privacidad
fr: Politique de confidentialité
id: Kebijakan Privasi
it: Politica sulla Privacy
ja: プライバシーポリシー
ms: Dasar Privasi
no: Personvernerklæring
pl: Polityka Prywatności
pt: Política de Privacidade
ru: Политика конфиденциальности
sv: Integritetspolicy
th: นโยบายความเป็นส่วนตัว
tr: Gizlilik Politikası
uk: Політика конфіденційності
vi: Chính sách Bảo mật

source: Private Messages
id: Pesan Pribadi
it: Messaggi Privati
ja: プライベートメッセージ
no: Privatmeldinger
pl: Wiadomości Prywatne
ru: Личные Сообщения
sv: Privata Meddelanden
uk: Приватні повідомлення

source: Problem Solving
ar: حل المشكلات
be: Рашэнне праблем
da: Problemløsning
de: Problemlösung
es: Resolución de Problemas
fr: Résolution de Problèmes
id: Pemecahan Masalah
it: Risoluzione dei problemi
ja: 問題解決
ms: Penyelesaian Masalah
no: Problemløsning
pl: Rozwiązywanie problemów
pt: Resolução de Problemas
ru: Решение проблем
sv: Problemlösning
th: การแก้ปัญหา
tr: Problem Çözme
uk: Розв'язання задач
vi: Giải Quyết Vấn Đề

source: Processing answers...
ar: معالجة الإجابات...
be: Апрацоўка адказаў...
da: Behandler svar...
de: Verarbeitung der Antworten...
es: Procesando respuestas...
fr: Traitement des réponses...
id: Memproses jawaban...
it: Elaborazione delle risposte...
ja: 回答を処理中...
no: Behandler svar...
pl: Przetwarzanie odpowiedzi...
pt: Processando respostas...
ru: Обработка ответов...
sv: Bearbetar svar...
th: กำลังประมวลผลคำตอบ...
tr: Cevaplar işleniyor...
uk: Обробка відповідей...
vi: Đang xử lý câu trả lời...

source: Processing existing knowledge in that brain...
ar: جاري معالجة المعرفة الموجودة في ذلك الدماغ...
be: Апрацоўка існуючых ведаў у гэтым мозгу...
da: Behandler eksisterende viden i den hjerne...
de: Verarbeitung des vorhandenen Wissens in diesem Gehirn...
es: Procesando el conocimiento existente en ese cerebro...
fr: Traitement des connaissances existantes dans ce cerveau...
id: Memproses pengetahuan yang ada di otak tersebut...
it: Elaborando le conoscenze esistenti in quel cervello...
ja: その脳で既存の知識を処理しています...
ms: Memproses pengetahuan yang ada di dalam otak itu...
no: Behandler eksisterende kunnskap i den hjernen...
pl: Przetwarzanie istniejącej wiedzy w tym mózgu...
pt: Processando o conhecimento existente naquele cérebro...
ru: Обработка существующих знаний в этом мозгу...
sv: Bearbetar befintlig kunskap i den hjärnan...
th: กำลังประมวลผลความรู้ที่มีอยู่ในสมองนั้น...
tr: O beyindeki mevcut bilgiyi işliyor...
uk: Обробка існуючих знань в цьому мозку...
vi: Đang xử lý kiến thức hiện có trong não...

source: Processing...
ar: plaintext جارٍ المعالجة...
be: Апрацоўка...
da: Behandling...
de: Verarbeitung...
es: Procesando...
fr: Traitement en cours...
id: Memproses...
it: Elaborazione...
ja: 処理中...
ms: Sedang Memproses...
no: Behandler...
pl: Przetwarzanie...
pt: Processando...
ru: Обработка...
sv: Bearbetar...
th: กำลังประมวลผล...
tr: İşleniyor...
uk: Обробка...
vi: Đang xử lý...

source: Product
ar: منتج
be: Прадукт
da: Produkt
de: Produkt
es: Producto
fr: Produit
id: Produk
it: Prodotto
ja: 製品
ms: Produk
no: Produkt
pl: Produkt
pt: Produto
ru: Продукт
sv: Produkt
th: ผลิตภัณฑ์
tr: Ürün
uk: Продукт
vi: Sản phẩm

source: Professional
ar: محترف
be: Професійны
da: Professionel
de: Professionell
es: Profesional
fr: Professionnel
id: Profesional
it: Professionale
ja: プロフェッショナル
ms: Profesional
no: Profesjonell
pl: Profesjonalny
pt: Profissional
ru: Профессиональный
sv: Professionell
th: มืออาชีพ
tr: Profesyonel
uk: Професійний
vi: Chuyên nghiệp

source: Professional Development
ar: التطوير المهني
be: Професійнае развіццё
da: Professionel Udvikling
de: Berufliche Weiterbildung
es: Desarrollo Profesional
fr: Développement Professionnel
id: Pengembangan Profesional
it: Sviluppo Professionale
ja: プロフェッショナル開発
ms: Pembangunan Profesional
no: Profesjonell Utvikling
pl: Rozwój zawodowy
pt: Desenvolvimento Profissional
ru: Профессиональное Развитие
sv: Professionell Utveckling
th: การพัฒนาทักษะทางวิชาชีพ
tr: Profesyonel Gelişim
uk: Професійний розвиток
vi: Phát Triển Chuyên Môn

source: Professionals transitioning from other fields into frontend engineering
ar: محترفون ينتقلون من مجالات أخرى إلى هندسة الواجهة الأمامية
be: Прафесіяналы, якія пераходзяць з іншых абласцей у фронтэнд распрацоўку
da: Professionelle, der skifter fra andre områder til frontend-ingeniørarbejde
de: Fachleute, die von anderen Bereichen in das Frontend-Engineering wechseln
es: Profesionales que realizan la transición de otros campos hacia la ingeniería frontend
fr: Les professionnels en transition depuis d'autres domaines vers l'ingénierie frontend
id: Profesional yang beralih dari bidang lain ke rekayasa frontend
it: Professionisti che passano da altri settori all'ingegneria frontend
ja: 他の分野からフロントエンドエンジニアリングに転職するプロフェッショナル
no: Profesjonelle som bytter fra andre felt til frontend-utvikling
pl: Profesjonaliści przechodzący z innych dziedzin do inżynierii frontendowej
pt: Profissionais em transição de outras áreas para a engenharia frontend
ru: Профессионалы, переходящие из других сфер в разработку интерфейсов
sv: Professionella som övergår från andra områden till frontend-utveckling
th: ผู้เชี่ยวชาญที่เปลี่ยนจากสาขาอื่นไปยังวิศวกรรมส่วนหน้าผู้ใช้
tr: Diğer alanlardan ön uç mühendisliğine geçiş yapan profesyoneller
uk: Фахівці, які переходять з інших галузей у frontend-розробку
vi: Chuyên gia chuyển đổi từ các lĩnh vực khác sang kỹ thuật frontend

source: Profile
ar: الملف الشخصي
be: Профіль
da: Profil
de: Profil
es: Perfil
fr: Profil
id: Profil
it: Profilo
ja: プロフィール
ms: Profil
no: Profil
pl: Profil
pt: Perfil
ru: Профиль
sv: Profil
th: โปรไฟล์
tr: Profil
uk: Профіль
vi: Hồ sơ

source: Progress Calendar
ar: تقويم التقدم
be: Каляндар прагрэсу
da: Fremskridtskalender
de: Fortschrittskalender
es: Calendario de Progreso
fr: Calendrier de Progrès
id: Kalender Kemajuan
it: Calendario dei Progressi
ja: 進行カレンダー
ms: Kalendar Kemajuan
no: Fremdriftskalender
pl: Kalendarz Postępów
pt: Calendário de Progresso
ru: Календарь Прогресса
sv: Framstegskalender
th: ปฏิทินความก้าวหน้า
tr: İlerleme Takvimi
uk: Календар прогресу
vi: Lịch Trình Tiến Trình

source: Progress Tracking
ar: تتبع التقدم
be: Стежка за прагрэсам
de: Fortschrittsverfolgung
es: Seguimiento de Progreso
fr: Suivi des progrès
id: Pelacakan Kemajuan
it: Tracciamento dei Progressi
ja: 進捗追跡
ms: Pemantauan Kemajuan
no: Fremsrittsoppfølging
pl: Śledzenie Postępów
pt: Rastreamento de Progresso
ru: Отслеживание Прогресса
sv: Uppföljning av framsteg
th: การติดตามความก้าวหน้า
tr: İlerleme Takibi
uk: Відстеження прогресу
vi: Theo dõi tiến độ

source: Progress tracking
ar: تتبع التقدم
be: Сачыненне прагрэсу
da: Fremdriftssporing
de: Fortschrittsverfolgung
es: Seguimiento del progreso
fr: Suivi de la progression
id: Pelacakan kemajuan
it: Monitoraggio dei progressi
ja: 進行状況の追跡
ms: Pemantauan kemajuan
no: Fremdriftssporing
pl: Śledzenie postępów
pt: Acompanhamento de progresso
ru: Отслеживание прогресса
sv: Framstegsspårning
th: การติดตามความคืบหน้า
tr: İlerleme takibi
uk: Відстеження прогресу
vi: Theo dõi tiến trình

source: Psychologist
ar: عالم نفس
be: Псіхолаг
da: Psykolog
de: Psychologe
es: Psicólogo
fr: Psychologue
id: Psikolog
it: Psicologo
ja: 心理学者
ms: Psikolog
no: Psykolog
pl: Psycholog
pt: Psicólogo
ru: Психолог
sv: Psykolog
th: นักจิตวิทยา
tr: Psikolog
uk: Психолог
vi: Nhà tâm lý học

source: Psychology
ar: علم النفس
be: Псіхалогія
da: Psykologi
de: Psychologie
es: Psicología
fr: Psychologie
id: Psikologi
it: Psicologia
ja: 心理学
ms: Psikologi
no: Psykologi
pl: Psychologia
pt: Psicologia
ru: Психология
sv: Psykologi
th: จิตวิทยา
tr: Psikoloji
uk: Психологія
vi: Tâm lý học

source: Public Talk Skills
ar: مهارات التحدث العام
be: Навыкі публічнай мовы
da: Offentlige Talefærdigheder
de: Öffentliche Sprechfähigkeiten
es: Habilidades para el Habla Pública
fr: Compétences de prise de parole en public
id: Keterampilan Berbicara di Publik
it: Competenze di Conversazione Pubblica
ja: パブリックトークスキル
ms: Kemahiran Berbicara di Umum
no: Offentlige Talferdigheter
pl: Umiejętności Prowadzenia Publicznych Rozmów
pt: Habilidades de Fala Pública
ru: Навыки публичных выступлений
sv: Offentliga talferdigheter
th: ทักษะการพูดแบบสาธารณะ
tr: Kamuoyuna Konuşma Becerileri
uk: Навички публічних виступів
vi: Kỹ năng Thuyết trình Công cộng

source: Publish an answer
ar: نشر إجابة
be: Апублікаваць адказ
da: Udgiv et svar
de: Veröffentliche eine Antwort
es: Publicar una respuesta
fr: Publier une réponse
id: Terbitkan jawaban
it: Pubblica una risposta
ja: 回答を公開
ms: Terbitkan jawapan
no: Publiser et svar
pl: Opublikuj odpowiedź
pt: Publicar uma resposta
ru: Опубликовать ответ
sv: Publicera ett svar
th: เผยแพร่คำตอบ
tr: Bir cevap yayınla
uk: Опублікувати відповідь
vi: Xuất bản câu trả lời

source: published
ar: منشور
be: апублікавана
da: udgivet
de: veröffentlicht
es: publicado
fr: publié
id: diterbitkan
it: pubblicato
ja: 公開済み
ms: diterbitkan
no: publisert
pl: opublikowany
pt: publicado
ru: опубликовано
sv: publicerad
th: เผยแพร่แล้ว
tr: yayınlandı
uk: опубліковано
vi: đã xuất bản

source: Question
ar: سؤال
be: Пытанне
da: Spørgsmål
de: Frage
es: Pregunta
id: Pertanyaan
it: Domanda
ja: 質問
ms: Soalan
no: Spørsmål
pl: Pytanie
pt: Pergunta
ru: Вопрос
sv: Fråga
th: คำถาม
tr: Soru
uk: Питання
vi: Câu hỏi

source: Questions matched to your backend stack
ar: أسئلة متوافقة مع حزمة البرمجيات الخلفية الخاصة بك
be: Пытанні, якія адпавядаюць вашаму стеку бэкенда
da: Spørgsmål matchet til din backend-stak
de: Fragen, die zu Ihrem Backend-Stack passen
es: Preguntas coincidentes con tu pila de backend
fr: Questions correspondant à votre pile de backend
id: Pertanyaan yang sesuai dengan tumpukan backend Anda
it: Domande abbinate al tuo stack backend
ja: バックエンドスタックに合わせた質問
ms: Soalan yang dipadankan dengan tumpukan backend anda
no: Spørsmål tilpasset din backend-stakk
pl: Pytania dopasowane do twojego stosu backendowego
pt: Perguntas correspondentes à sua pilha de backend
ru: Вопросы, соответствующие вашему стеку backend
sv: Frågor matchade mot din backend-stack
th: คำถามที่ตรงกับเทคโนโลยีแบ็คเอนด์ของคุณ
tr: Arka plan yığınıza uygun sorular
uk: Запитання, які відповідають вашій серверній архітектурі
vi: Các câu hỏi phù hợp với ngăn xếp nền tảng của bạn

source: Questions to Ask the Employer
ar: أسئلة لطرحها على صاحب العمل
be: Пытанні, якія трэба задаць працадаўцу
da: Spørgsmål til Arbejdsgiveren
de: Fragen an den Arbeitgeber
es: Preguntas para Hacer al Empleador
fr: Questions à Poser à l'Employeur
id: Pertanyaan untuk Ditanyakan kepada Pemberi Kerja
it: Domande da fare al datore di lavoro
ja: 雇用者に尋ねるべき質問
ms: Soalan Untuk Ditanya Kepada Majikan
no: Spørsmål til Arbeidsgiveren
pl: Pytania do Pracodawcy
pt: Perguntas para Fazer ao Empregador
ru: Вопросы для работодателя
sv: Frågor att Ställa till Arbetsgivaren
th: คำถามที่ควรถามจากนายจ้าง
tr: İşverene Sorulacak Sorular
uk: Питання до роботодавця
vi: Câu hỏi Đặt cho Nhà Tuyển dụng

source: Questions you will practice
ar: أسئلة ستقوم بممارستها
be: Пытанні, якія вы будзеце практыкаваць
da: Spørgsmål du vil øve dig på
de: Fragen, die Sie üben werden
es: Preguntas que practicarás
fr: Questions que vous allez pratiquer
id: Questions you will practice Pertanyaan yang akan Anda praktikkan
it: Domande che praticherai
ja: 練習する質問
ms: Soalan yang akan anda amalkan
no: Spørsmål du vil øve på
pl: Pytania, które będziesz ćwiczyć
pt: Perguntas que você irá praticar
ru: Вопросы, которые вы будете практиковать
sv: Frågor du kommer att öva på
th: คำถามที่คุณจะฝึกฝน
tr: Uygulayacağınız sorular
uk: Запитання, які ви будете практикувати
vi: Các câu hỏi bạn sẽ thực hành

source: Queues
ar: طوابير
be: Чаргі
da: Køer
de: Warteschlangen
es: Colas
fr: Files d’attente
id: Antrean
it: Code di attesa
ja: キュー
ms: Barisan
no: Køer
pl: Kolejki
pt: Filas
ru: Очереди
sv: Köer
th: คิว
tr: Kuyruklar
uk: Черги
vi: plaintext Hàng đợi

source: Rank
id: Peringkat
it: Classifica
ja: ランク
no: Rang
ru: Ранг
uk: Ранг

source: Rank in the top 5 to get the app for free
ar: تصنف ضمن أفضل 5 للحصول على التطبيق مجاناً
be: Увайдзіце ў топ-5, каб атрымаць дадатак бясплатна
da: Rangér blandt top 5 for at få appen gratis
de: Rangieren Sie unter den Top 5, um die App kostenlos zu erhalten
es: Clasifica en el top 5 para obtener la aplicación gratis
fr: Classez-vous dans le top 5 pour obtenir l'application gratuitement
id: Masuk dalam 5 besar untuk mendapatkan aplikasi ini secara gratis
it: Classificati tra i primi 5 per ottenere l'app gratuitamente
ja: トップ5にランクインするとアプリを無料で入手できます
ms: Terdapat dalam 5 teratas untuk mendapatkan aplikasi ini secara percuma
no: Rangér blant topp 5 for å få appen gratis
pl: Znajdź się w pierwszej piątce, aby otrzymać aplikację za darmo
pt: Fique entre os 5 melhores para obter o aplicativo gratuitamente
ru: Войдите в топ-5, чтобы получить приложение бесплатно
sv: Ranka bland de topp 5 för att få appen gratis
th: ติดอันดับใน 5 อันดับแรกเพื่อรับแอปฟรี
tr: İlk 5 içinde yer alın ve uygulamayı ücretsiz olarak edinin
uk: Увійдіть до топ 5, щоб отримати додаток безкоштовно
vi: Đứng trong top 5 để nhận ứng dụng miễn phí
