Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Create Your Own Scenario
ar: أنشئ سيناريو خاص بك
be: Стварыце свой уласны сцэнарый
da: Opret Dit Eget Scenarie
de: Erstelle Dein eigenes Szenario
es: Crea Tu Propia Escenario
fr: Créez Votre Propre Scénario
id: Buat Skenario Anda Sendiri
it: Crea il Tuo Scenario
ja: 自分のシナリオを作成する
ms: Buat Senario Anda Sendiri
no: Lag ditt eget scenario
pl: Stwórz swoją własną sytuację
pt: Crie Seu Próprio Cenário
ru: Создайте свой собственный сценарий
sv: Skapa ditt eget scenario
th: สร้างสถานการณ์ของคุณเอง
tr: Kendi Senaryonuzu Oluşturun
uk: Створіть свій власний сценарій
vi: Tạo Kịch Bản Của Bạn

source: Creative Description
id: Deskripsi Kreatif
it: Descrizione Creativa
ja: クリエイティブな説明
no: Kreativ Beskrivelse
ru: Креативное описание
uk: Креативний опис

source: Credit Card Already Confirmed
ar: بطاقة الائتمان تم تأكيدها بالفعل
be: Крэдытная картка ўжо пацверджаная
da: Kreditkort Allerede Bekræftet
de: Kreditkarte bereits bestätigt
es: Tarjeta de Crédito Ya Confirmada
fr: Carte de Crédit Déjà Confirmée
id: Kartu Kredit Sudah Dikonfirmasi
it: Carta di Credito già Confermata
ja: クレジットカードはすでに確認済み
ms: Kad Kredit Telah Disahkan
no: Kredittkort Allerede Bekreftet
pl: Karta Kredytowa Już Potwierdzona
pt: Cartão de Crédito Já Confirmado
ru: Кредитная карта уже подтверждена
sv: Kreditkort redans bekräftat
th: ยืนยันบัตรเครดิตแล้ว
tr: Kredi Kartı Zaten Onaylandı
uk: Кредитну карту вже підтверджено
vi: Thẻ Tín Dụng Đã Được Xác Nhận

source: Credit Card Check
ar: فحص بطاقة الائتمان
be: Праверка крэдытнай карты
da: Kreditkortkontrol
de: Kreditkartenprüfung
es: Verificación de Tarjeta de Crédito
fr: Vérification de Carte de Crédit
id: Pemeriksaan Kartu Kredit
it: Verifica Carta di Credito
ja: クレジットカードの確認
ms: Pemeriksaan Kad Kredit
no: Kredittkort Sjekk
pl: Sprawdzenie Karty Kredytowej
pt: Verificação de Cartão de Crédito
ru: Проверка кредитной карты
sv: Kreditkortskontroll
th: ตรวจสอบบัตรเครดิต
tr: Kredi Kartı Kontrolü
uk: Перевірка кредитної картки
vi: Kiểm Tra Thẻ Tín Dụng

source: csharp developer interview
ar: مقابلة مطور سي شارب
be: с# распрацоўшчык інтэрв'ю
da: csharp udvikler interview
de: csharp-Entwickler Vorstellungsgespräch
es: entrevista para desarrollador de csharp
fr: entretien développeur csharp
id: wawancara pengembang csharp
it: colloquio per sviluppatore csharp
ja: csharp開発者 面接
ms: temubual pembangun csharp
no: csharp utvikler intervju
pl: wywiad z programistą C#
pt: entrevista para desenvolvedor csharp
ru: интервью с разработчиком на C#
sv: csharp utvecklarintervju
th: การสัมภาษณ์นักพัฒนาซีชาร์ป
tr: csharp geliştirici mülakatı
uk: інтерв'ю розробника C#
vi: phỏng vấn nhà phát triển csharp

source: Current Lesson
id: Pelajaran Saat Ini
it: Lezione attuale
ja: 現在のレッスン
no: Nåværende leksjon
pl: Obecna Lekcja
ru: Текущий урок
sv: Nuvarande lektion
uk: Поточний урок

source: Current Scores
id: Skor Saat Ini
it: Punteggi Attuali
ja: 現在のスコア
no: Nåværende Poengsum
ru: Текущие оценки
uk: Поточні Бали

source: Custom
ar: مخصص
be: Правіць
da: Brugerdefineret
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
id: Kustom
it: Personalizzato
ja: カスタム
no: Egendefinert
pt: Personalizado
ru: Пользовательский
sv: Anpassad
th: กำหนดเอง
tr: Özel
uk: Користувацький
vi: Tùy chỉnh

source: Custom features
ar: ميزات مخصصة
be: Спецыяльныя функцыі
da: Tilpassede funktioner
de: Benutzerdefinierte Funktionen
es: Características personalizadas
fr: Caractéristiques personnalisées
id: Fitur khusus
it: Funzionalità personalizzate
ja: カスタム機能
ms: Ciri-ciri khas
no: Egendefinerte funksjoner
pl: Funkcje dostosowane
pt: Recursos personalizados
ru: Пользовательские функции
sv: Anpassade funktioner
th: คุณสมบัติที่กำหนดเอง
tr: Özel özellikler
uk: Спеціальні функції
vi: Tính năng tùy chỉnh

source: Custom interview roadmap
ar: خارطة الطريق المخصصة للمقابلة
be: Індывідуальны план падрыхтоўкі да сумоўя
da: Tilpasset interview køreplan
de: Benutzerdefinierter Interview-Fahrplan
es: Hoja de ruta personalizada para entrevistas
fr: Feuille de route personnalisée pour l'entretien
id: Rencana wawancara kustom
it: Roadmap personalizzato per l'intervista
ja: カスタムインタビューロードマップ
no: Tilpasset intervjuroadmap
pl: Indywidualny plan nauki do rozmowy kwalifikacyjnej
pt: Roteiro de entrevista personalizado
ru: Индивидуальный план собеседования
sv: Anpassad intervjuplan
th: โร้ดแมปการสัมภาษณ์ที่กำหนดเอง
tr: Özel mülakat yol haritası
uk: Індивідуальний план співбесіди
vi: Lộ trình phỏng vấn tùy chỉnh

source: Custom pricing
ar: تسعير مخصص
be: Індывідуальнае цэнаўтварэнне
da: Brugerdefineret prissætning
de: Benutzerdefinierte Preisgestaltung
es: Precios personalizados
fr: Tarification personnalisée
id: Harga khusus
it: Prezzi personalizzati
ja: カスタム価格設定
no: Tilpasset prissetting
pl: Dostosowane ceny
pt: Preço personalizado
ru: Индивидуальное ценообразование
sv: Anpassad prissättning
th: การกำหนดราคาที่กำหนดเอง
tr: Özel fiyatlandırma
uk: Індивідуальне ціноутворення
vi: Giá tùy chỉnh

source: Customize a conversation to fit your unique learning needs
ar: خصص محادثة لتتناسب مع احتياجاتك التعليمية الفريدة
be: Наладзьце размову, каб яна адпавядала вашым унікальным патрэбам у навучанні
da: Tilpas en samtale til at passe til dine unikke læringsbehov
de: Passen Sie ein Gespräch an, um Ihre einzigartigen Lernbedürfnisse zu erfüllen
es: Personaliza una conversación para adaptarla a tus necesidades de aprendizaje únicas
fr: Personnalisez une conversation pour répondre à vos besoins d'apprentissage uniques
id: Sesuaikan percakapan untuk memenuhi kebutuhan pembelajaran unik Anda
it: Personalizza una conversazione per adattarla alle tue esigenze di apprendimento uniche
ja: あなたのユニークな学習ニーズに合わせて会話をカスタマイズします。
ms: Sesuaikan perbualan untuk memenuhi keperluan pembelajaran unik anda
no: Tilpass en samtale for å imøtekomme dine unike læringsbehov
pl: Dostosuj rozmowę do swoich unikalnych potrzeb w nauce
pt: Personalize uma conversa para atender às suas necessidades de aprendizagem únicas
ru: Настройте разговор под ваши уникальные учебные потребности
sv: Anpassa en konversation för att passa dina unika inlärningsbehov
th: ปรับแต่งการสนทนาให้เหมาะกับความต้องการในการเรียนรู้เฉพาะของคุณ
tr: Kendi benzersiz öğrenme ihtiyaçlarınıza uygun bir konuşmayı özelleştirin
uk: Налаштуйте розмову відповідно до ваших унікальних потреб навчання
vi: Tùy chỉnh một cuộc hội thoại để phù hợp với nhu cầu học tập độc đáo của bạn

source: CV-based answer optimization
ar: التحسين المستند إلى السيرة الذاتية للإجابة
be: Аптымізацыя адказаў на аснове рэзюмэ (CV)
da: CV-baseret svaroptimering
de: CV-basiertes Antwort-Optimierungssystem
es: Optimización de respuestas basada en CV
fr: Optimisation des réponses basées sur le CV
id: Optimalisasi jawaban berbasis CV
it: Ottimizzazione delle risposte basata su CV
ja: CVベースの回答最適化
ms: Pengoptimuman jawapan berasaskan CV
no: CV-basert svaroptimalisering
pl: Optymalizacja odpowiedzi na podstawie CV
pt: Otimização de respostas baseada em CV
ru: Оптимизация ответов на основе резюме
sv: CV-baserad svaroptimering
th: การเพิ่มประสิทธิภาพคำตอบโดยใช้ CV
tr: CV tabanlı cevap optimizasyonu
uk: Оптимізація відповідей на основі резюме
vi: Tối ưu hóa câu trả lời dựa trên CV

source: Cypress & E2E Testing
ar: سيبريس & اختبار من البداية إلى النهاية (E2E)
be: Cypress і E2E Тэсціраванне
da: Cypress & E2E Testning
de: Cypress & E2E-Tests
es: Pruebas de extremo a extremo (E2E) y Cypress
fr: Cypress & Tests E2E
id: Cypress & Pengujian E2E
it: Cypress & Test E2E
ja: Cypress & E2E テスト
ms: Cypress & Ujian E2E
pl: Cypress i testowanie E2E
pt: Cypress & Testes E2E
ru: Cypress и E2E-тестирование
sv: Cypress & E2E-testning
th: การทดสอบ Cypress & E2E
tr: Cypress & Uçtan Uca (E2E) Test Etme
uk: Cypress & E2E тестування
vi: Cypress & Kiểm thử E2E

source: Daily conversations without fear of judgment
ar: محادثات يومية دون الخوف من الحكم
be: Штодзённыя размовы без страху асуджэння
da: Daglige samtaler uden frygt for at blive dømt
de: Tägliche Gespräche ohne Angst vor Beurteilung
es: Conversaciones diarias sin miedo al juicio
fr: Conversations quotidiennes sans peur d'être jugé
id: Percakapan sehari-hari tanpa rasa takut dihakimi
it: Conversazioni quotidiane senza paura di essere giudicati
ja: 判断を恐れずに日常会話
ms: Perbualan harian tanpa rasa takut dihakimi
no: Daglige samtaler uten frykt for å bli dømt
pl: Codzienne rozmowy bez obawy przed oceną
pt: Conversas diárias sem medo de julgamento
ru: Ежедневные разговоры без страха осуждения
sv: Dagliga samtal utan rädsla för att bli dömd
th: การสนทนาประจำวันโดยไม่ต้องกลัวการตัดสิน
tr: Yargılama korkusu olmadan günlük konuşmalar
uk: Щоденні розмови без страху судження
vi: Những cuộc trò chuyện hàng ngày không sợ bị đánh giá

source: Daily interview without fear of judgment
ar: مقابلة يومية بدون خوف من الحكم
be: Штодзённае інтэрв'ю без страху асуджэння
da: Daglig interview uden frygt for vurdering
de: Tägliches Interview ohne Angst vor Beurteilung
es: Entrevista diaria sin miedo al juicio
fr: Entretien quotidien sans peur du jugement
id: Wawancara harian tanpa takut dinilai
it: Colloquio quotidiano senza il timore di essere giudicati
ja: ジャッジされることなく、毎日のインタビュー
ms: Temu bual harian tanpa rasa takut dinilai
no: Daglig intervju uten frykt for vurdering
pl: Codzienny wywiad bez obawy o osąd
pt: Entrevista diária sem medo de julgamento
ru: Ежедневное собеседование без страха осуждения
sv: Daglig intervju utan rädsla för att bli bedömd
th: การสัมภาษณ์รายวันโดยไม่ต้องกลัวการถูกตัดสิน
tr: Yargılanma korkusu olmadan günlük röportaj
uk: Щоденне інтерв’ю без страху бути осудженим
vi: Phỏng vấn hàng ngày mà không sợ bị đánh giá

source: Daily Language Practice
ar: الممارسة اليومية للغة
be: Шкодныя моўныя практыкі
da: Daglig Sprogpraksis
de: Tägliche Sprachpraxis
es: Práctica Diaria de Idioma
fr: Pratique Quotidienne de la Langue
id: Praktek Bahasa Sehari-hari
it: Pratica Giornaliera della Lingua
ja: 毎日の言語練習
ms: Amalan Bahasa Harian
no: Daglig Språk Praksis
pl: Codzienna Praktyka Językowa
pt: Prática Diária de Linguagem
ru: Ежедневная практика языка
sv: Daglig Språkträning
th: การฝึกภาษาประจำวัน
tr: Günlük Dil Pratiği
uk: Щоденна практика мови
vi: Thực Hành Ngôn Ngữ Hàng Ngày

source: Daily Question Chat
de: Tägliche Frage Chat
es: Chat de Pregunta Diaria
id: Obrolan Pertanyaan Harian
it: Chat Domanda Quotidiana
ja: デイリークエスチョンチャット
no: Daglig Spørsmål Chat
pl: Codzienne Pytanie na Czacie
pt: Chat de Perguntas Diárias
ru: Ежедневный Вопрос Чат
sv: Daglig Frågechatt
th: แชทถามตอบประจำวัน
tr: Günlük Soru Sohbeti
uk: Щоденний запитання чат
vi: Trò chuyện Câu hỏi Hàng ngày

source: Daily Questions
id: Pertanyaan Harian
it: Domande giornaliere
ja: デイリークエスチョン
no: Daglige spørsmål
pl: Codzienne pytania
ru: Ежедневные вопросы
sv: Dagliga frågor
uk: Щоденні запитання

source: Daily speaking tasks introduce new vocabulary and sentence structures, help you build a learning habit, and reinforce your skills to improve fluency faster.
ar: تساعد مهام التحدث اليومية في تقديم مفردات وهياكل جمل جديدة، وتساعدك في بناء عادة التعلم، وتقوي مهاراتك لتحسين الطلاقة بشكل أسرع.
be: Штодзённыя размоўныя заданні ўводзяць новы слоўнік і структуры сказаў, дапамагаюць вырабіць звычку навучання і ўмацоўваюць вашы навыкі для больш хуткага паляпшэння свабоды маўлення.
da: Daglige taletasks introducerer nyt ordforråd og sætningsstrukturer, hjælper dig med at opbygge en læringsvane og styrker dine færdigheder for at forbedre flydende tale hurtigere.
de: Tägliche Sprechaufgaben führen neues Vokabular und Satzstrukturen ein, helfen Ihnen, eine Lerngewohnheit zu entwickeln, und festigen Ihre Fähigkeiten, um die Sprachgewandtheit schneller zu verbessern.
es: Las tareas diarias de conversación introducen nuevo vocabulario y estructuras de oraciones, te ayudan a crear un hábito de aprendizaje y refuerzan tus habilidades para mejorar la fluidez más rápidamente.
fr: Les tâches quotidiennes de parole introduisent de nouveaux vocabulaires et structures de phrases, vous aident à créer une habitude d'apprentissage et renforcent vos compétences pour améliorer plus rapidement votre fluidité.
id: Tugas berbicara harian memperkenalkan kosakata dan struktur kalimat baru, membantu Anda membangun kebiasaan belajar, dan memperkuat keterampilan Anda untuk meningkatkan kelancaran lebih cepat.
it: Le attività quotidiane di conversazione introducono nuovo vocabolario e strutture delle frasi, ti aiutano a costruire un'abitudine di apprendimento e rafforzano le tue competenze per migliorare più rapidamente la fluidità.
ja: 毎日のスピーキングタスクは、新しい語彙や文構造を紹介し、学習習慣を築くのを助け、スキルを強化して流暢さをより速く向上させます。
no: Daglige taletreningsoppgaver introduserer nytt vokabular og setningsstrukturer, hjelper deg med å bygge en læringsvane, og forsterker dine ferdigheter for å forbedre flyt raskere.
pl: Codzienne zadania mówienia wprowadzają nowe słownictwo i struktury zdań, pomagają w budowaniu nawyku uczenia się oraz wzmacniają umiejętności, aby szybciej poprawić płynność.
pt: Tarefas de conversação diárias introduzem novos vocabulários e estruturas de frases, ajudam a criar um hábito de aprendizado, e reforçam suas habilidades para melhorar a fluência mais rapidamente.
ru: Ежедневные задания на говорение вводят новую лексику и структуры предложений, помогают сформировать привычку к обучению и укрепляют ваши навыки для более быстрого улучшения беглости.
sv: Dagliga samtalsuppgifter introducerar nytt ordförråd och nya meningsstrukturer, hjälper dig att bygga en lärandevana och förstärker dina färdigheter för att snabbare förbättra ditt flyt.
th: งานพูดรายวันแนะนำคำศัพท์และโครงสร้างประโยคใหม่ ช่วยสร้างนิสัยการเรียนรู้และเสริมทักษะของคุณเพื่อพัฒนาความคล่องแคล่วได้เร็วขึ้น
tr: Günlük konuşma görevleri yeni kelime hazinesi ve cümle yapılarını tanıtır, öğrenme alışkanlığı oluşturmanıza yardımcı olur ve yeteneklerinizi pekiştirerek akıcılığınızı daha hızlı geliştirir.
uk: Щоденні розмовні завдання вводять нову лексику та структури речень, допомагають вам сформувати звичку до навчання і зміцнюють ваші навички, щоб швидше покращити вільне володіння мовою.
vi: Các nhiệm vụ nói hàng ngày giới thiệu từ vựng và cấu trúc câu mới, giúp bạn xây dựng thói quen học tập và củng cố kỹ năng của bạn để cải thiện khả năng lưu loát nhanh hơn.

source: Daily Tasks
ar: المهام اليومية
be: Штодзённыя заданні
da: Daglige Opgaver
de: Tägliche Aufgaben
es: Tareas Diarias
fr: Tâches Quotidiennes
id: Tugas Harian
it: Compiti Giornalieri
ja: 日々のタスク
ms: Tugas Harian
no: Daglige Oppgaver
pl: Codzienne zadania
pt: Tarefas Diárias
ru: Ежедневные задачи
sv: Dagliga uppgifter
th: งานประจำวัน
tr: Günlük Görevler
uk: Щоденні Завдання
vi: Nhiệm vụ hàng ngày

source: Danish Learning Plan
ar: خطة التعلم الدنماركية
be: План вучэння данскай мовы
da: Dansk Læringsplan
de: Dänischer Lernplan
es: Plan de Aprendizaje de Danés
fr: Plan d'Apprentissage Danois
id: Rencana Belajar Bahasa Denmark
it: Piano di Apprendimento del Danese
ja: デンマーク語学習計画
ms: Rancangan Pembelajaran Bahasa Denmark
no: Dansk Læringsplan
pl: Plan Nauki Duńskiego
pt: Plano de Aprendizagem em Dinamarquês
ru: План изучения датского
sv: Danska Inlärningsplanen
th: แผนการเรียนรู้ภาษาเดนมาร์ก
tr: Danimarka Öğrenme Planı
uk: План навчання датської
vi: Kế Hoạch Học Tiếng Đan Mạch

source: Data & Storage
ar: البيانات والتخزين
be: Дадзеныя і захоўванне
da: Data & Lagring
de: Daten & Speicherung
es: Datos y Almacenamiento
fr: Données & Stockage
id: Data & Penyimpanan
it: Dati e Archiviazione
ja: データとストレージ
ms: Data & Penyimpanan
no: Data & Lagring
pl: Dane i Storage
pt: Dados e Armazenamento
ru: Данные и хранилище
sv: Data & Lagring
th: ข้อมูล & การจัดเก็บ
tr: Veri ve Depolama
uk: Дані та Зберігання
vi: Dữ liệu & Lưu trữ

source: Data & Transactions
ar: البيانات والمعاملات
be: Дадзеныя і транзакцыі
da: Data & Transaktioner
de: Daten & Transaktionen
es: Datos y Transacciones
fr: Données et transactions
id: Data & Transaksi
it: Dati e Transazioni
ja: データ & トランザクションズ
ms: Data & Transaksi
no: Data & Transaksjoner
pl: Dane i transakcje
pt: Dados & Transações
ru: Данные и транзакции
sv: Data & Transaktioner
th: ข้อมูล & ธุรกรรม
tr: Veri ve İşlemler
uk: Дані та транзакції
vi: Dữ liệu & Giao dịch

source: Databases & Transactions
ar: قواعد البيانات والمعاملات
be: Базы дадзеных і транзакцыі
da: Databaser & Transaktioner
de: Datenbanken & Transaktionen
es: Bases de datos y transacciones
fr: Bases de données & Transactions
id: Basis Data & Transaksi
it: Basi di dati e transazioni
ja: データベースとトランザクション
ms: Pangkalan Data & Transaksi
no: Databaser & Transaksjoner
pl: Bazy danych i transakcje
pt: Bancos de Dados & Transações
ru: Базы данных и транзакции
sv: Databaser & Transaktioner
th: ฐานข้อมูล & ธุรกรรม
tr: Veritabanları ve İşlemler
uk: Бази даних і транзакції
vi: Cơ sở dữ liệu & Giao dịch

source: Day
de: Tag
es: Día
id: Hari
it: Giorno
ja: 日
no: Dag
pl: Dzień
pt: Dia
ru: День
sv: Dag
th: วัน
tr: Gün
uk: День
vi: Ngày

source: day
de: Tag
es: día
id: hari
it: giorno
ja: 日
no: dag
pl: dzień
pt: dia
ru: день
sv: dag
th: วัน
tr: gün
uk: день
vi: ngày

source: days in a row!
ja: 連続日数!
no: dager på rad!
uk: днів поспіль!

source: Debate
ar: مناظرة
be: Дэбаты
da: Debat
de: Debatte
fr: Débat
id: Debat
it: Dibattito
ja: 討論
no: Debatt
pl: Debata
ru: Дебаты
sv: Debatt
th: อภิปราย
tr: Tartışma
uk: Дебати
vi: Tranh luận

source: Debate Chat
de: Debatten-Chat
es: Chat de Debate
id: Obrolan Debat
it: Chat di Dibattito
ja: ディベートチャット
no: Debatt Chat
pl: Czat Debatowy
pt: Chat de Debate
ru: Чат-дебаты
sv: Debattchatt
th: การสนทนาโต้แย้ง
tr: Tartışma Sohbeti
uk: Дискусійний чат
vi: Trò chuyện tranh luận

source: Debate ended!
ar: النقاش انتهى!
be: Дэбаты завершыліся!
da: Debat afsluttet!
de: Debatte beendet!
es: ¡Debate terminado!
fr: Débat terminé !
id: Perdebatan berakhir!
it: Il dibattito è terminato!
ja: ディベート終了！
no: Debatt avsluttet!
pl: Debata zakończona!
pt: O debate terminou!
ru: Дебаты окончены!
sv: Debatten avslutad!
th: การถกเถียงสิ้นสุดลง!
tr: Tartışma sona erdi!
uk: Дебати завершено!
vi: Tranh luận kết thúc!

source: Debate Request
ar: طلب مناظرة
be: Запыт на дэбаты
da: Anmodning om debat
de: Debattenanfrage
es: Solicitud de Debate
fr: Demande de débat
id: Permintaan Debat
it: Richiesta di dibattito
ja: ディベートのリクエスト
no: Debattforespørsel
pl: Prośba o debatę
pt: Solicitação de Debate
ru: Запрос на Дебаты
sv: Debattförfrågan
th: คำขอการโต้วาที
tr: Tartışma Talebi
uk: Запит на дебати
vi: Yêu cầu tranh luận

source: Debate Request Sent!
ar: تم إرسال طلب المناظرة!
be: Запыт на дэбаты адпраўлены!
da: Debatanmodning sendt!
de: Debattenanfrage gesendet!
es: ¡Solicitud de Debate Enviada!
fr: plaintext Demande de débat envoyée !
id: Permintaan Debat Dikirim!
it: Richiesta di Dibattito Inviata!
ja: ディベートリクエストが送信されました！
no: Debattforespørsel sendt!
pl: Prośba o Debatę Wysłana!
pt: Pedido de Debate Enviado!
ru: Запрос на дебаты отправлен!
sv: plaintext Debattförfrågan skickad!
th: คำขอการโต้วาทีถูกส่งแล้ว!
tr: Tartışma İsteği Gönderildi!
uk: Запит на дебати надіслано!
vi: Yêu Cầu Tranh Luận Đã Được Gửi!

source: Debate started!
ar: بدأ النقاش!
be: Дэбаты пачаліся!
da: Debat startet!
de: Debatte gestartet!
es: ¡El debate ha comenzado!
fr: Débat commencé !
id: Debat dimulai!
it: Il dibattito è iniziato!
ja: ディベートが始まりました！
no: Debatt startet!
pl: Rozpoczęła się debata!
pt: Debate iniciado!
ru: Дебаты начались!
sv: Debatt startad!
th: การโต้วาทีเริ่มขึ้นแล้ว!
tr: Tartışma başladı!
uk: Дебати розпочаті!
vi: Cuộc tranh luận đã bắt đầu!

source: Debate topics will be selected randomly.
ar: سيتم اختيار مواضيع النقاش بشكل عشوائي.
be: Тэмы для дэбатаў будуць выбірацца выпадковым чынам.
da: Debatemner vil blive valgt tilfældigt.
de: Debattenthemen werden zufällig ausgewählt.
es: Los temas de debate se seleccionarán al azar.
fr: Les sujets de débat seront sélectionnés au hasard.
id: Topik debat akan dipilih secara acak.
it: Gli argomenti del dibattito saranno selezionati casualmente.
ja: ランダムにディベートトピックが選ばれます。
no: Debattemner vil bli valgt tilfeldig.
pl: Tematy debaty będą wybierane losowo.
pt: Tópicos de debate serão selecionados aleatoriamente.
ru: Темы для дебатов будут выбраны случайным образом.
sv: Debattämnen kommer att väljas slumpmässigt.
th: หัวข้ออภิปรายจะถูกสุ่มเลือก
tr: Tartışma konuları rastgele seçilecektir.
uk: Теми для дебатів обиратимуться випадковим чином.
vi: Các chủ đề tranh luận sẽ được chọn ngẫu nhiên.

source: Debates
id: Debat
it: Debattiti
ja: ディベート
no: Debatter
pl: Debaty
ru: Дебаты
sv: Debatteringar
uk: Дебати

source: Debates and discussions
ar: المناظرات والمناقشات
be: Дэбаты і дыскусіі
da: Debatter og diskussioner
de: Debatten und Diskussionen
es: Debates y discusiones
fr: Débats et discussions
id: Debat dan diskusi
it: Debates e discussioni
ja: ディベートとディスカッション
no: Debatter og diskusjoner
pl: Debaty i dyskusje
pt: Debates e discussões
ru: Дебаты и обсуждения
sv: Debatter och diskussioner
th: การโต้วาทีและการอภิปราย
tr: Tartışmalar ve müzakereler
uk: Дебати та обговорення
vi: Tranh luận và thảo luận

source: Delete
de: Löschen
es: Eliminar
id: Hapus
it: Elimina
ja: 削除
no: Slett
pl: Usuń
pt: Excluir
ru: Удалить
sv: Radera
th: ลบ
tr: Sil
uk: Видалити
vi: Xóa

source: Delete account
ar: حذف الحساب
be: Выдаліць уліковы запіс
da: Slet konto
de: Konto löschen
es: Eliminar cuenta
fr: Supprimer le compte
id: Hapus akun
it: Elimina account
ja: アカウントを削除する
ms: Padam akaun
no: Slett konto
pl: Usuń konto
pt: Excluir conta
ru: Удалить аккаунт
sv: Radera konto
th: ลบบัญชี
tr: Hesabı Sil
uk: Видалити аккаунт
vi: Xóa tài khoản

source: Delete account (Total)
ar: حذف الحساب (كليًا)
be: Выдаліць уліковы запіс (Усяго)
da: Slet konto (Total)
de: Konto löschen (Gesamt)
es: Eliminar cuenta (Total)
fr: Supprimer le compte (Total)
id: Hapus akun (Total)
it: Elimina account (Totale)
ja: アカウントを削除 (合計)
ms: Padam akaun (Total)
no: Slett konto (Total)
pl: Usuń konto (Całkowite)
pt: Deletar conta (Total)
ru: Удалить аккаунт (Total)
sv: Ta bort konto (Totalt)
th: ลบบัญชี (ทั้งหมด)
tr: Hesabı Sil (Toplam)
uk: Видалити обліковий запис (Усього)
vi: Xóa tài khoản (Tổng cộng)

source: Delete chat
id: Hapus obrolan
it: Elimina chat
ja: チャットを削除
no: Slett chat
pl: Usuń czat
ru: Удалить чат
sv: Radera chatt
uk: Видалити чат

source: Delete current goal
ar: حذف الهدف الحالي
be: Выдаліць цяперашнюю мэту
da: Slet nuværende mål
de: Aktuelles Ziel löschen
es: Eliminar objetivo actual
fr: Supprimer l'objectif actuel
id: Hapus tujuan saat ini
it: Elimina l'obiettivo corrente
ja: 現在の目標を削除
ms: Padam matlamat semasa
no: Slett nåværende mål
pl: Usuń aktualny cel
pt: Excluir objetivo atual
ru: Удалить текущую цель
sv: Radera nuvarande mål
th: ลบเป้าหมายปัจจุบัน
tr: Mevcut hedefi sil
uk: Видалити поточну мету
vi: Xóa mục tiêu hiện tại

source: Deleting...
ar: جاري الحذف...
be: Выдаляецца...
da: Sletter...
de: Löschen...
es: Eliminando...
fr: Suppression...
id: Menghapus...
it: Eliminando...
ja: 削除中...
ms: Memadam...
no: Sletter...
pl: Usuwanie...
pt: Excluindo...
ru: Удаление...
sv: Raderar...
th: กำลังลบ...
tr: Siliniyor...
uk: Видалення...
vi: Đang xóa...
