Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Role play allows you to practice real-life scenarios in a safe environment, helping you build confidence and improve your language skills.
ar: تسمح لك الأدوار القائمة على اللعب بممارسة سيناريوهات الحياة الحقيقية في بيئة آمنة، مما يساعدك على بناء الثقة وتحسين مهارات اللغة.
be: Гульня ў ролі дазваляе вам прабаваць рэальныя сітуацыі ў бяспечным асяроддзі, што дапамагае пабудаваць упэўненасць у сабе і палепшыць свае моўныя навыкі.
da: Rollespil giver dig mulighed for at øve virkelige scenarier i et sikkert miljø, hjælper dig med at opbygge selvtillid og forbedre dine sprogfærdigheder.
de: Rollenspiele ermöglichen es Ihnen, reale Szenarien in einer sicheren Umgebung zu üben, was Ihnen hilft, Selbstvertrauen aufzubauen und Ihre Sprachkenntnisse zu verbessern.
es: El juego de roles te permite practicar escenarios de la vida real en un entorno seguro, ayudándote a construir confianza y mejorar tus habilidades lingüísticas.
fr: Le jeu de rôle vous permet de vous exercer à des scénarios de la vie réelle dans un environnement sûr, vous aidant à renforcer votre confiance et à améliorer vos compétences linguistiques.
id: Peran bermain memungkinkan Anda untuk berlatih skenario kehidupan nyata dalam lingkungan yang aman, membantu Anda membangun kepercayaan diri dan meningkatkan keterampilan bahasa Anda.
it: Il gioco di ruolo ti permette di esercitarti in scenari della vita reale in un ambiente sicuro, aiutandoti a costruire fiducia e a migliorare le tue competenze linguistiche.
ja: 役割遊びは、安全な環境で現実のシナリオを練習することができます。これにより自信を築き、言語スキルを向上させることができます。
ms: Permainan lakonan membolehkan anda berlatih senario kehidupan sebenar dalam persekitaran yang selamat, membantu anda membina keyakinan dan meningkatkan kemahiran bahasa anda.
no: Rollespill lar deg øve på virkelige scenarier i et trygt miljø, noe som hjelper deg med å bygge selvtillit og forbedre dine språkferdigheter.
pl: Role play pozwala na praktykowanie realnych scenariuszy w bezpiecznym środowisku, pomagając Ci zbudować pewność siebie i doskonalić umiejętności językowe.
pt: O role play permite que você pratique cenários da vida real em um ambiente seguro, ajudando a construir confiança e aprimorar suas habilidades linguísticas.
ru: Ролевая игра позволяет вам отрабатывать реальные жизненные сценарии в безопасной среде, помогая вам набираться уверенности и улучшать свои языковые навыки.
sv: Rollspel låter dig öva på verkliga scenarier i en säker miljö, vilket hjälper dig att bygga självförtroende och förbättra dina språkkunskaper.
th: การเล่นบทบาทช่วยให้คุณได้ฝึกซ้อมสถานการณ์ในชีวิตจริงในสภาพแวดล้อมที่ปลอดภัย ช่วยสร้างความมั่นใจและปรับปรุงทักษะการใช้ภาษาของคุณ
tr: Rol oyunu, güveninizi artırmanıza ve dil becerilerinizi geliştirmenize yardımcı olan güvenli bir ortamda gerçek hayat senaryolarını pratik etmenize olanak sağlar.
uk: Рольові ігри дозволяють вам практикувати реальні життєві сценарії у безпечному середовищі, допомагаючи вам набрати впевненості та покращити ваші мовні навички.
vi: Việc tham gia vào các tình huống giả tưởng giúp bạn thực hành các kịch bản trong đời thực trong một môi trường an toàn, giúp bạn xây dựng sự tự tin và cải thiện kỹ năng ngôn ngữ của bạn.

source: Role Play Scenarios
ar: سيناريوهات الأدوار القائمة
be: Сцэнарыі ролевых гульняў
da: Rollespilsscenarier
de: Rollenspielszenarien
es: Escenarios de Rol
fr: Scénarios de Jeu de Rôle
id: Skenario Peran Bermain
it: Scenari di Ruolo
ja: ロールプレイシナリオ
ms: Senario Peranan Bermain
no: Rollespillsscenarier
pl: Scenariusze gier fabularnych
pt: Cenários de Role Play
ru: Ролевые сценарии
sv: Rollspelsscenarier
th: สถานการณ์เล่นบทบาท
tr: Rol Oynama Senaryoları
uk: Рольові сценарії
vi: Tình huống đóng vai

source: Role-Play
ar: تقمص الأدوار
be: Ролевая гульня
da: Rollespil
de: Rollen-Spiel
es: Juego de Roles
fr: Rôle-Play
id: Peran-Peran
it: Ruolo-Play
ja: 役割演技
ms: Peranan-Permainan
no: Rollespill
pt: Interpretação de Papéis
ru: Ролевая игра
sv: Rollspel
th: บทบาทการเล่น
tr: Rol Oynama
uk: Рольова гра
vi: Vai diễn

source: Role-play scenarios
ar: سيناريوهات تمثيل الأدوار
be: Ролевыя сцэнары
da: Role-play scenarier
de: Rollenspiel-Szenarien
es: Escenarios de juego de roles
fr: Scénarios de jeu de rôle
id: Skenario permainan peran
it: Scenari di ruolo
ja: ロールプレイシナリオ
ms: Senario berperanan
no: Rollespillscenarier
pl: Scenariusze odgrywania ról
pt: Cenários de interpretação de papéis
ru: Сценарии ролевых игр
sv: Rollspelsscenarier
th: บทบาท-เล่นสถานการณ์
tr: Rol yapma senaryoları
uk: Сценарії рольової гри
vi: Kịch bản đóng vai

source: Role-Play scenarios to practice
ar: سيناريوهات الأدوار للتدريب
be: Ролевыя сцэнары для практыкі
da: Rollespilsscenarier til øvelse
de: Rollenspiel-Szenarien zum Üben
es: Escenarios de Role-Play para practicar
fr: Scénarios de jeu de rôle pour s'entraîner
id: Skenario Role-Play untuk berlatih
it: Scenari di Role-Play per praticare
ja: ロールプレイシナリオで練習する
ms: Skenario peranan untuk berlatih
no: Rollelek-scenarioer for å øve
pl: Scenariusze do zabawy w rolę do ćwiczenia
pt: Cenários de Role-Play para prática
ru: Сценарии ролевых игр для практики
sv: Rollspelsscenarier att öva på
th: บทบาทเล่นเพื่อฝึกฝน
tr: Rol oynama senaryolarıyla pratik yapın
uk: Сценарії рольових ігор для практики
vi: Các kịch bản diễn tập để thực hành

source: Role-Plays
ar: لعب الأدوار
be: Ролавыя гульні
da: Roller-spil
de: Rollenspiele
fr: Jeux de rôle
id: Peran-Permain
it: Role-Play
ja: ロールプレイ
ms: Peranan-Peranan
no: Rollerollen
pl: Role-Playe
ru: Ролевые Игры
sv: Rollspel
th: บทบาทสมมติ
tr: Rol Oyunları
uk: Рольові Ігри
vi: Vai trò diễn xuất

source: Roleplay Preview
ar: معاينة تبادل الأدوار
be: Прагледжванне ролевых гульняў
da: Roleplay Forhåndsvisning
de: Rollenspiel-Vorschau
es: Vista previa de juego de roles
fr: plaintext Aperçu du Jeu de Rôle
id: Pratinjau Bermain Peran
it: Anteprima di Gioco di Ruolo
ja: ロールプレイ プレビュー
no: Forhåndsvisning av Rollespill
pl: Podgląd odgrywania ról
pt: Visualização de Roleplay
ru: Предварительный просмотр ролевой игры
sv: Rollspelsförhandsvisning
th: ตัวอย่างบทบาทสมมติ
tr: Rol Yapma Önizlemesi
uk: Попередній перегляд рольової гри
vi: Xem trước nhập vai

source: Round Settings
id: Pengaturan Putaran
it: Impostazioni del turno
ja: ラウンド設定
no: Rundeinnstillinger
ru: Настройки раунда
uk: Налаштування Раунду

source: Round {current} / {total}
id: Putaran {current} / {total}
ja: ラウンド {current} / {total}
no: Runde {current} / {total}
ru: Раунд {current} / {total}
uk: Раунд {current} / {total}

source: Round {current} of {total}
id: Putaran {current} dari {total}
ja: ラウンド {current} / {total}
no: Runde {nåværende} av {totalt}
ru: Раунд {current} из {total}
uk: Раунд {current} із {total}

source: Routing
ar: التوجيه
be: Маршрутызацыя
de: Routen
es: Enrutamiento
fr: Routage
id: Pengarahan
it: Instradamento
ja: ルーティング
ms: Penghalaan
no: Rutering
pt: Encaminhamento
ru: Маршрутизация
sv: Ruttning
th: การกำหนดเส้นทาง
tr: Yönlendirme
uk: Маршрутизація
vi: Định tuyến

source: Rule
ar: قاعدة
be: Правіла
da: Regel
de: Regel
es: Regla
fr: Règle
id: Aturan
it: Regola
ja: ルール
ms: Peraturan
no: Regel
pl: Reguła
pt: Regra
ru: Правило
sv: Regel
th: กฎ
tr: Kural
uk: Правило
vi: Quy tắc

source: Rule of the day
ar: قاعدة اليوم
be: Правіла дня
da: Regel for dagen
de: Regel des Tages
es: Regla del día
fr: Règle du jour
id: Aturan hari ini
it: Regola del giorno
ja: 今日のルール
ms: Peraturan hari ini
no: Regel for dagen
pl: Zasada dnia
pt: Regra do dia
ru: Правило дня
sv: Regel för dagen
th: กฎของวัน
tr: Günün Kuralı
uk: Правило дня
vi: Quy tắc của ngày

source: Rules to Learn
es: Reglas para Aprender
id: Aturan untuk Belajar
it: Regole da Imparare
ja: 学ぶためのルール
no: Regler å Lære
pl: Zasady do nauki
pt: Regras para Aprender
ru: Правила для изучения
sv: Regler att Lära Sig
uk: Правила для вивчення

source: Russian Learning Plan
ar: خطة تعلم الروسية
be: План вучэбы па рускай мове
da: Russisk Læringsplan
de: Russischer Lernplan
es: Plan de Aprendizaje de Ruso
fr: Plan d'Apprentissage Russe
id: Rencana Belajar Bahasa Rusia
it: Piano di Apprendimento Russo
ja: ロシア語学習計画
ms: Pelan Pembelajaran Rusia
no: Russisk Læringsplan
pl: Plan Nauki Rosyjskiego
pt: Plano de Aprendizagem de Russo
ru: План изучения русского языка
sv: Rysk inlärningsplan
th: แผนการเรียนรู้ภาษารัสเซีย
tr: Rusça Öğrenme Planı
uk: План навчання російської
vi: Kế Hoạch Học Tiếng Nga

source: Salary and leveling discussions feel **awkward or one-sided**
ar: المناقشات حول الرواتب والمستويات تشعر بأنها **محرجة أو أحادية الجانب**
be: Абмеркаванні заробку і ўзроўню здаюцца **нязручнымі або аднабаковымі**
da: Lønsamtaler og drøftelser om niveau kan føles **akavet eller ensidige**
de: Gehalt- und Niveaubesprechungen wirken **unangenehm oder einseitig**
es: Las discusiones sobre salario y nivelación se sienten **incómodas o unilaterales**
fr: Les discussions sur le salaire et les niveaux semblent **gênantes ou à sens unique**
id: Diskusi tentang gaji dan peningkatan level terasa **canggung atau tidak seimbang**
it: Le discussioni su stipendio e inquadramento sembrano **imbarazzanti o unilaterali**
ja: 給与とレベルの議論は、**気まずさや一方的な**感じがします
no: Lønns- og nivådiskusjoner føles **awkward eller ensidige**
pl: Dyskusje o wynagrodzeniach i poziomach czują się **niezręczne lub jednostronne**
pt: Discussões sobre salário e nivelamento parecem **estranhas ou unilaterais**
ru: Обсуждение заработной платы и уровней ощущается **неловким или односторонним**
sv: Lön och nivådiskussioner känns **obekväma eller ensidiga**
th: การพูดคุยเกี่ยวกับเงินเดือนและระดับรู้สึก **อึดอัดหรือลำเอียงไปด้านเดียว**
tr: Maaş ve seviye belirleme tartışmaları **garip veya tek taraflı** hissettiriyor
uk: Обговорення заробітної плати та рівня **викликають відчуття незручності або однобічності**
vi: Các cuộc thảo luận về lương và cấp bậc cảm thấy **khó xử hoặc thiên lệch**

source: Salary negotiation interview with AI SEO
ar: مقابلة تفاوض على الراتب مع AI SEO
be: Сустрэча па перамовах аб зарплаце з AI SEO
da: Lønforhandlingsinterview med AI SEO
de: Gehaltverhandlungsgespräch mit KI-SEO
es: Entrevista de negociación salarial con AI SEO
fr: Entretien de négociation salariale avec AI SEO
id: Wawancara negosiasi gaji dengan AI SEO
it: Colloquio di negoziazione salariale con AI SEO
ja: AI SEOとの給与交渉面接
ms: Temu bual rundingan gaji dengan AI SEO
no: Lønnsforhandlingsintervju med AI SEO
pl: Negocjacje płacowe z AI SEO
pt: Entrevista para negociação salarial com AI SEO
ru: Собеседование по зарплате с ИИ SEO
sv: Lönesamtal med AI SEO
th: การสัมภาษณ์การเจรจาเงินเดือนกับ AI SEO
tr: AI SEO ile maaş pazarlığı görüşmesi
uk: Співбесіда щодо обговорення зарплати з AI SEO
vi: Phỏng vấn đàm phán lương với AI SEO

source: Salary negotiation preparation
ar: التحضير لمفاوضات الراتب
be: Падрыхтоўка да перамоў аб заработнай плаце
da: Forberedelse til lønforhandling
de: Vorbereitung auf Gehaltsverhandlungen
es: Preparación para la negociación salarial
fr: Préparation à la négociation salariale
id: Persiapan negosiasi gaji
it: Preparazione alla negoziazione salariale
ja: 給与交渉の準備
ms: Persediaan rundingan gaji
no: Forberedelse til lønnsforhandlinger
pl: Przygotowanie do negocjacji wynagrodzenia
pt: Preparação para negociação salarial
ru: Подготовка к переговорам о зарплате
sv: Förberedelse för löneförhandlingar
th: การเตรียมการเจรจาเรื่องเงินเดือน
tr: Maaş pazarlığına hazırlık
uk: Підготовка до переговорів про заробітну плату
vi: Chuẩn bị đàm phán lương

source: Save
ar: حفظ
be: Захаваць
da: Gem
de: Speichern
es: Guardar
fr: plaintext Enregistrer
id: Simpan
it: Salva
ja: 保存
no: Lagre
pl: Zapisz
pt: Salvar
ru: Сохранить
sv: Spara
th: บันทึก
tr: Kaydet
uk: Зберегти
vi: Lưu

source: Saying “I don’t know” directly — Instead say: “That’s an interesting question. Let me think for a moment.”
ar: القول "لا أعرف" مباشرة - بدلاً من ذلك قل: "هذا سؤال مثير للاهتمام. دعني أفكر للحظة."
be: Казаць "Я не ведаю" напрамую — Замест гэтага скажыце: "Гэта цікавае пытанне. Дайце падумаць на хвілінку."
da: At sige "Jeg ved ikke" direkte - I stedet sige: "Det er et interessant spørgsmål. Lad mig tænke et øjeblik."
de: Direkt sagen "Ich weiß nicht" — Stattdessen sagen Sie: "Das ist eine interessante Frage. Lassen Sie mich einen Moment nachdenken."
es: Decir "No sé" directamente — En lugar de eso diga: "Esa es una pregunta interesante. Permíteme pensar por un momento."
fr: Dire « Je ne sais pas » directement — Dites plutôt: « C'est une question intéressante. Laissez-moi réfléchir un instant. »
id: Mengatakan "Saya tidak tahu" secara langsung — Sebaliknya katakan: "Itu pertanyaan yang menarik. Biarkan saya berpikir sejenak."
it: Dire direttamente "Non lo so" — Invece di dire: "È una domanda interessante. Lasciami pensare per un momento."
ja: 「分からない」とは直接言わずに ― 代わりにこのように言いましょう：「それは興味深い質問ですね。少し考えさせてください。」
ms: Mengatakan "Saya tidak tahu" secara langsung - Sebaliknya katakan: "Itu adalah soalan yang menarik. Biarkan saya fikir seketika."
no: Å si "Jeg vet ikke" direkte - I stedet si: "Det er et interessant spørsmål. La meg tenke et øyeblikk."
pl: Mówienie bezpośrednio „Nie wiem” — Zamiast tego powiedz: „To interesujące pytanie. Pozwól mi na chwilę pomyśleć.”
pt: Dizer "Eu não sei" diretamente — Em vez disso, diga: "Essa é uma pergunta interessante. Deixe-me pensar por um momento."
ru: Говорить «Я не знаю» напрямую — Вместо этого скажите: «Это интересный вопрос. Дайте мне подумать на миг.»
sv: Att säga “Jag vet inte” direkt — Istället säg: “Det är en intressant fråga. Låt mig tänka en stund.”
th: การพูดว่า "ฉันไม่รู้" โดยตรง — แทนที่จะพูดว่า: "นั่นคือคำถามที่น่าสนใจ ขอฉันคิดสักครู่"
tr: "Doğrudan “Bilmiyorum” demek yerine — Şöyle deyin: “Bu ilginç bir soru. Biraz düşüneyim.”"
uk: Говорити "Я не знаю" напряму - Замість цього скажіть: "Це цікаве питання. Дайте мені подумати на мить."
vi: Nói trực tiếp "Tôi không biết" — Thay vào đó, hãy nói: "Đó là một câu hỏi thú vị. Để tôi suy nghĩ một chút."

source: Scenario Description
ar: وصف السيناريو
be: Апісанне сцэнарыя
da: Scenariebeskrivelse
de: Szenariobeschreibung
es: Descripción del escenario
fr: Description du Scénario
id: Deskripsi Skenario
it: Descrizione dello Scenario
ja: シナリオ説明
ms: Penerangan Senario
no: Scenario Beskrivelse
pl: Opis scenariusza
pt: Descrição do Cenário
ru: Сценарий Описание
sv: Scenario Beskrivning
th: คำอธิบายสถานการณ์
tr: Senaryo Tanımı
uk: Опис Сценарію
vi: Mô tả tình huống

source: Score
de: Punktzahl
es: Puntuación
id: Skor
it: Punteggio
ja: スコア
no: Poengsum
pl: Wynik
pt: Pontuação
ru: Счет
sv: Poäng
th: คะแนน
tr: Puan
uk: Оцінка
vi: Điểm số

source: Scoreboard
id: Papan Skor
it: Tabellone segnapunti
ja: スコアボード
no: Poengtavle
ru: Табло
uk: Табло

source: Screening
ar: التقييم الأولي
be: Скрынінг
de: Abfrage
es: Detección
fr: Dépistage
id: Penyaringan
it: Schermatura
ja: スクリーニング
pl: Przesiewanie
pt: Triagem
ru: Скрининг
th: การคัดกรอง
tr: Eleme işlemi
uk: Скринінг
vi: Sàng lọc

source: Screening interview with AI recruiter
ar: مقابلة الفرز مع المجند الذكاء الاصطناعي
be: Скрынінгавае інтэрв'ю з AI-рэкрутарам
da: Screeninginterview med AI-rekrutterer
de: Vorstellungsgespräch mit KI-Recruiter
es: Entrevista de selección con reclutador de IA
fr: Entretien de présélection avec un recruteur IA
id: Wawancara penyaringan dengan perekrut AI
it: Colloquio di screening con il reclutatore AI
ja: AIリクルーターとのスクリーニングインタビュー
ms: Temuduga saringan dengan perekrut AI
no: Screeningsintervju med AI-rekrutterer
pl: Rozmowa wstępna z rekruterem AI
pt: Entrevista de triagem com recrutador de IA
ru: Собеседование с AI-рекрутером
sv: Screeningsintervju med AI-rekryterare
th: การสัมภาษณ์คัดกรองกับผู้สรรหา AI
tr: AI işe alım uzmanı ile tarama görüşmesi
uk: Співбесіда з рекрутером AI
vi: Phỏng vấn sơ tuyển với nhà tuyển dụng AI

source: Second Place
de: Zweiter Platz
es: Segundo lugar
id: Peringkat Kedua
it: Secondo Posto
ja: セカンドプレース
no: Andreplass
pl: Drugie Miejsce
pt: Segundo Lugar
ru: Второе место
sv: Andra plats
th: อันดับที่สอง
tr: İkinci Yer
uk: Друге місце
vi: Vị Trí Thứ Hai

source: See strengths and gaps across core backend topics.
ar: شاهد نقاط القوة والفجوات في مواضيع المكونات الخلفية الأساسية.
be: Паглядзіце моцныя бакі і прабелы ў асноўных тэмах бекэнда.
da: Se styrker og mangler på tværs af kerne backend-emner.
de: Sehen Sie Stärken und Lücken in zentralen Backend-Themen.
es: Ve fortalezas y brechas en temas principales de backend.
fr: Voir les forces et les lacunes dans les sujets essentiels du backend.
id: Lihat kekuatan dan kelemahan di seluruh topik inti backend.
it: Vedi punti di forza e lacune nei temi principali del backend.
ja: コアバックエンドのトピック全体での強みとギャップを確認する。
ms: Lihat kekuatan dan jurang merentas topik teras backend.
no: Se styrker og mangler på tvers av kjerne backend-emner.
pl: Zobacz mocne strony i luki w kluczowych tematach dotyczących backendu.
pt: Veja as forças e lacunas em tópicos principais de backend.
ru: Увидеть сильные и слабые стороны по основным темам серверной части.
sv: Se styrkor och brister inom grundläggande backend-ämnen.
th: ดูจุดแข็งและช่องว่างในหัวข้อหลักของการทำงานเบื้องหลัง.
tr: Temel backend konularındaki güçlü ve zayıf yönleri görün.
uk: Дізнайтеся про сильні сторони та прогалини в основних темах бекенду.
vi: Xem điểm mạnh và khoảng trống trên các chủ đề cốt lõi của backend.

source: See the type of backend feedback you'll get
ar: شاهد نوع التعليقات الخلفية التي ستحصل عليها
be: Паглядзіце, які від зваротнай сувязі ад бекэнда вы атрымаеце
da: Se den type feedback fra backend, du vil få
de: Sieh dir die Art von Backend-Feedback an, die du erhalten wirst
es: Ve el tipo de comentarios del backend que recibirás
fr: Voyez le type de retour backend que vous recevrez
id: Lihat jenis umpan balik backend yang akan Anda dapatkan
it: Vedi il tipo di feedback backend che riceverai
ja: バックエンドフィードバックの種類をご覧ください
ms: Lihat jenis maklum balas backend yang anda akan terima
no: Se typen tilbakemelding fra backend du vil motta
pl: Zobacz, jaki rodzaj informacji zwrotnych z backendu otrzymasz
pt: Veja o tipo de feedback do backend que você receberá
ru: Посмотрите, какие отзывы от обратной связи на бэкенде вы получите
sv: Se vilken typ av feedback från backend du kommer att få
th: ดูประเภทของคำแนะนำจากทางฝั่งแบ็กเอนด์ที่คุณจะได้รับ
tr: Aldığınız geri bildirim türünü görün
uk: Дізнайтеся, який зворотний зв'язок від бекенду ви отримаєте
vi: Xem loại phản hồi backend mà bạn sẽ nhận được

source: See the type of feedback you'll get
ar: شاهد نوع الملاحظات التي ستحصل عليها
be: Паглядзіце, які тып зваротнай сувязі вы атрымаеце
da: Se den type feedback, du vil få
de: Sehen Sie, welche Art von Feedback Sie erhalten werden
es: Vea el tipo de comentarios que recibirá
fr: Voyez le type de retour que vous recevrez
id: Lihat jenis umpan balik yang akan Anda dapatkan
it: Vedi il tipo di feedback che riceverai
ja: 受け取るフィードバックの種類をご覧ください
ms: Lihat jenis maklum balas yang akan anda terima
no: Se typen tilbakemelding du vil få
pl: Zobacz, jaki rodzaj opinii otrzymasz
pt: Veja o tipo de feedback que você receberá
ru: Узнайте, какой тип обратной связи вы получите
sv: Se vilken typ av feedback du kommer att få
th: ดูประเภทของคำติชมที่คุณจะได้รับ
tr: Alacağınız geri bildirim türünü görün
uk: Дізнайтеся, який тип зворотного зв'язку ви отримаєте
vi: Xem loại phản hồi bạn sẽ nhận được

source: See your improvements and track your learning journey
ar: راقب تحسيناتك وتتبع رحلة تعلمك
be: Бачыце свае паляпшэнні і сачыце за сваім шляхам навучання
da: Se dine forbedringer og spor din læringsrejse
de: Sehen Sie Ihre Verbesserungen und verfolgen Sie Ihren Lernweg
es: Vea sus mejoras y siga su camino de aprendizaje
fr: Voyez vos améliorations et suivez votre parcours d'apprentissage
id: Lihat peningkatan Anda dan lacak perjalanan belajar Anda
it: Vedi i tuoi miglioramenti e traccia il tuo percorso di apprendimento
ja: あなたの進歩を見て、学習の旅を追跡してください
ms: Lihat peningkatan anda dan lacak perjalanan pembelajaran anda
no: Se dine forbedringer og spor din læringsreise
pl: Zobacz swoje postępy i śledź swoją ścieżkę nauki
pt: Veja suas melhorias e acompanhe sua jornada de aprendizado
ru: Увидьте свои улучшения и отслеживайте свой обучающий путь
sv: Se dina förbättringar och följ din inlärningsresa
th: ดูความคืบหน้าและติดตามการเรียนรู้ของคุณ
tr: İlerlemelerinizi görün ve öğrenme yolculuğunuzu izleyin
uk: Бачте свої покращення та відслідковуйте свій навчальний шлях
vi: Xem sự cải thiện của bạn và theo dõi hành trình học của bạn

source: Select all
id: Pilih semua
it: Seleziona tutto
ja: すべて選択
no: Velg alle
ru: Выбрать все
uk: Вибрати все

source: Select Categories
id: Pilih Kategori
it: Seleziona Categorie
ja: カテゴリーを選択
no: Velg Kategorier
ru: Выберите категории
uk: Виберіть категорії

source: Select languages
ar: اختر اللغات
be: Выберыце мовы
da: Vælg sprog
de: Sprachen auswählen
es: Seleccionar idiomas
fr: Sélectionnez les langues
id: Pilih bahasa
it: Seleziona lingue
ja: 言語を選択
ms: Pilih bahasa
no: Velg språk
pl: Wybierz języki
pt: Selecione idiomas
ru: Выбрать языки
sv: Välj språk
th: เลือกภาษา
tr: Dilleri seçin
uk: Вибрати мови
vi: Chọn ngôn ngữ

source: Select the voice your AI teacher will use during conversations.
ja: 会話中にAI教師が使用する声を選択します。
no: Velg stemmen som AI-læreren din vil bruke under samtaler.
uk: Виберіть голос, який ваш AI-вчитель використовуватиме під час розмов.

source: Select your game avatar
ar: اختر صورة شخصية للعبة الخاصة بك
be: Выберыце свой аватар у гульні
da: Vælg din spilavatar
de: Wählen Sie Ihren Spiel-Avatar aus
es: Seleccione su avatar de juego
fr: Sélectionnez votre avatar de jeu
id: Pilih avatar permainan Anda
it: Seleziona il tuo avatar di gioco
ja: ゲームアバターを選択
ms: Pilih avatar permainan anda
no: Velg din spilleavatar
pl: Wybierz swojego awatara z gry
pt: Selecione seu avatar de jogo
ru: Выберите своего игрового аватара
sv: Välj din spelavatar
th: เลือกอวาตาร์เกมของคุณ
tr: Oyun avatarınızı seçin
uk: Виберіть свій аватар у грі
vi: Chọn hình đại diện trò chơi của bạn

source: Select your preferred language
ar: حدد لغتك المفضلة
be: Выберыце ваш пераважны мову
da: Vælg dit foretrukne sprog
de: Wählen Sie Ihre bevorzugte Sprache aus
es: Seleccione su idioma preferido
fr: Sélectionnez votre langue préférée
id: Pilih bahasa yang Anda inginkan
it: Seleziona la tua lingua preferita
ja: お好みの言語を選択してください
ms: Pilih bahasa pilihan anda
no: Velg ditt foretrukne språk
pl: Wybierz preferowany język
pt: Selecione o seu idioma preferido
ru: Выберите предпочитаемый язык
sv: Välj ditt föredragna språk
th: เลือกภาษาที่คุณต้องการ
tr: Tercih ettiğiniz dili seçin
uk: Виберіть вашу бажану мову
vi: Chọn ngôn ngữ ưa thích của bạn

source: Self-Introduction: Talking About Yourself
ar: التعريف بالنفس: الحديث عن نفسك
be: Самаузнаёмства: Размова пра сябе
da: Selv-Introduktion: At Tale Om Dig Selv
de: Selbstvorstellung: Über sich selbst sprechen
es: Auto-presentación: Hablando de ti mismo
fr: Présentation personnelle: Parler de soi-même
id: Perkenalan Diri: Berbicara Tentang Diri Sendiri
it: Autopresentazione: Parlare di te stesso
ja: 自己紹介：自分自身について話す
ms: Perkenalan Diri: Bercakap Mengenai Diri Anda
no: Selvintroduksjon: Snakk om deg selv
pl: Samoprezentacja: Rozmawianie o sobie
pt: Apresentação Pessoal: Falando sobre Si Mesmo
ru: Самопредставление: Рассказ о себе
sv: Självintroduktion: Att prata om dig själv
th: การแนะนำตัว: การพูดเกี่ยวกับตัวเอง
tr: Kendini Tanıtma: Kendinden Bahsetme
uk: Самопредставлення: Розповідаємо про себе
vi: Tự giới thiệu: Nói về bản thân
