Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Start Your Backend Interview Test
ar: ابدأ اختبار المقابلة الخلفية الخاصة بك
be: Пачніце свой тэст на інтэрв'ю для бэкэнд-распрацоўшчыка
da: Start din backend-interviewtest
de: Beginnen Sie Ihren Backend-Interview-Test
es: Inicie su Prueba de Entrevista de Backend
fr: Démarrez votre test d'entretien backend
id: Mulai Tes Wawancara Backend Anda
it: Inizia il tuo test di intervista per il backend
ja: バックエンドインタビューテストを開始する
ms: Mulakan Ujian Temuduga Belakang Anda
no: Start din Backend-intervjutest
pl: Rozpocznij test rozmowy kwalifikacyjnej na Backend
pt: Inicie Seu Teste de Entrevista de Backend
ru: Начать тестирование навыков бэкенд-разработки
sv: Starta ditt backend-intervjutest
th: เริ่มการทดสอบสัมภาษณ์ด้านหลังของคุณ
tr: Backend Mülakat Testinize Başlayın
uk: Розпочніть свій тест для співбесіди на посаду бекенд-розробника
vi: Bắt đầu Bài Kiểm Tra Phỏng Vấn Backend của Bạn

source: Start Your Interview Test
ar: ابدأ اختبار المقابلة الخاص بك
be: Пачніце свой тэставы інтэрв'ю
da: Start din interviewtest
de: Starten Sie Ihren Interview-Test
es: Inicia Tu Prueba de Entrevista
fr: Démarrez Votre Test d'Entretien
id: Mulai Tes Wawancara Anda
it: Inizia il tuo test di intervista
ja: インタビューテストを開始する
ms: Mulakan Ujian Temuduga Anda
no: Start ditt intervju-test
pl: Rozpocznij swój test rozmowy kwalifikacyjnej
pt: Inicie Seu Teste de Entrevista
ru: Начать тестирование собеседования
sv: Starta ditt intervjutest
th: เริ่มการทดสอบสัมภาษณ์ของคุณ
tr: Başvurunuzu Başlatın Test
uk: Почніть свій інтерв'ю-тест
vi: Bắt Đầu Bài Kiểm Tra Phỏng Vấn Của Bạn

source: Start Your Journey to Fluent Conversations Now
ar: ابدأ رحلتك نحو المحادثات الطليقة الآن
be: Пачніце сваю падарожжу да вольных размоваў цяпер
da: Start Din Rejse til Flydende Samtaler Nu
de: Beginne jetzt deine Reise zu fließenden Gesprächen
es: Comienza Tu Viaje hacia Conversaciones Fluidas Ahora
fr: Commencez Votre Voyage vers des Conversations Fluides Maintenant
id: Mulailah Perjalanan Anda Menuju Percakapan Lancar Sekarang
it: Inizia il tuo viaggio verso conversazioni fluenti ora
ja: 今すぐ流暢な会話への旅を始めましょう
ms: Mulakan Perjalanan Anda ke Perbualan Lancar Sekarang
no: Start din reise mot flytende samtaler nå
pl: Rozpocznij swoją podróż do płynnych konwersacji już teraz
pt: Inicie Sua Jornada para Conversas Fluentes Agora
ru: Начните свое путешествие к свободным разговорам сейчас
sv: Börja din resa mot flytande konversationer nu
th: เริ่มการเดินทางของคุณสู่การสนทนาที่คล่องแคล่วตอนนี้
tr: Hızla Akıcı Konuşmalara Geçiş Yolculuğunuza Şimdi Başlayın
uk: Розпочніть свою подорож до вільного спілкування зараз
vi: Bắt Đầu Hành Trình Đến Những Cuộc Hội Thoại Lưu Loát Ngay Bây Giờ

source: Start your way to fluency
ar: ابدأ رحلتك نحو الطلاقة
be: Пачніце свой шлях да валодання
da: Start din vej til flydende
de: Beginnen Sie Ihren Weg zur Fließendheit
es: Comienza tu camino hacia la fluidez
fr: Commencez votre chemin vers la fluidité
id: Mulai jalanmu menuju kelancaran
it: Inizia il tuo percorso verso la padronanza
ja: 流暢さへのあなたの道を始めましょう
ms: Mulakan perjalanan anda ke arah kefasihan
no: Begynn din vei til flytende språk
pl: Rozpocznij swoją drogę do biegłości
pt: Comece seu caminho para a fluência
ru: Начните свой путь к владению языком
sv: Starta din väg till flytande
th: เริ่มทางของคุณสู่การใช้ภาษาได้คล่องแคล่ว
tr: Akıcılığa doğru yolculuğunuza başlayın
uk: Розпочніть шлях до володіння
vi: Bắt đầu con đường của bạn để trở nên thành thạo

source: Start | 5 min
ar: ابدأ | 5 دقائق
be: Пачаць | 5 хв
es: Iniciar | 5 min
fr: Commencer | 5 min
id: Mulai | 5 menit
it: Inizio | 5 min
ja: スタート | 5分
ms: Mula | 5 min
pl: Rozpocznij | 5 min
pt: Iniciar | 5 min
ru: Начать | 5 мин
th: เริ่ม | 5 นาที
tr: Başlat | 5 dakika
uk: Старт | 5 хв
vi: Bắt đầu | 5 phút

source: Starting webcam...
ar: يتم تشغيل كاميرا الويب...
be: Пачатак працы вэб-камеры...
da: Starter webcam...
de: Starte Webcam...
es: Iniciando la cámara web...
fr: Démarrage de la webcam...
id: Memulai webcam...
it: Avvio della webcam...
ja: ウェブカメラを起動しています...
no: Starter webkamera...
pl: Uruchamianie kamery...
pt: Iniciando webcam...
ru: Запуск веб-камеры...
sv: Startar webbkamera...
th: กำลังเริ่มกล้องเว็บแคม...
tr: Webcam başlatılıyor...
uk: Запуск вебкамери...
vi: Bắt đầu webcam...

source: State Management
ar: إدارة الحالة
be: Кіраванне станам
da: Tilstandsforvaltning
de: Zustandsverwaltung
es: Gestión de Estado
fr: Gestion de l'État
id: Manajemen Keadaan
it: Gestione dello Stato
ja: 状態管理
ms: Pengurusan Negeri
no: Tilstandshåndtering
pl: Zarządzanie stanem
pt: Gerenciamento de Estado
ru: Управление состоянием
sv: Tillståndshantering
th: การจัดการสถานะ
tr: Durum Yönetimi
uk: Управління станом
vi: Quản lý trạng thái

source: Step 1
ar: الخطوة 1
be: Крок 1
da: Trin 1
de: Schritt 1
es: Paso 1
fr: Étape 1
id: Langkah 1
it: Passo 1
ja: ステップ1
ms: Langkah 1
no: Trinn 1
pl: Krok 1
pt: Passo 1
ru: Шаг 1
sv: Steg 1
th: ขั้นตอนที่ 1
tr: Adım 1
uk: Крок 1
vi: Bước 1

source: Step 2
ar: الخطوة 2
be: Крок 2
da: Trin 2
de: Schritt 2
es: Paso 2
fr: Étape 2
id: Langkah 2
it: Passaggio 2
ja: ステップ2
ms: Langkah 2
no: Trinn 2
pl: Krok 2
pt: Passo 2
ru: Шаг 2
sv: Steg 2
th: ขั้นตอนที่ 2
tr: Adım 2
uk: Крок 2
vi: Bước 2

source: Step 3
ar: الخطوة 3
be: Крок 3
da: Trin 3
de: Schritt 3
es: Paso 3
fr: Étape 3
id: Langkah 3
it: Passaggio 3
ja: ステップ3
ms: Langkah 3
no: Trinn 3
pl: Krok 3
pt: Etapa 3
ru: Шаг 3
sv: Steg 3
th: ขั้นตอนที่ 3
tr: Adım 3
uk: Крок 3
vi: Bước 3

source: Step into a realistic interview environment and practice showcasing your professional strengths. This role-play helps you handle common interview questions, discuss your experience, and demonstrate why you’re the right candidate.
ar: خطو إلى بيئة مقابلة واقعية ومارس إظهار نقاط قوتك المهنية. يساعدك هذا الدور التمثيلي على التعامل مع أسئلة المقابلة الشائعة، ومناقشة تجربتك، وإظهار سبب كونك المرشح المناسب.
be: Уступіце ў рэалістычнае інтэрв'ю-сераду і практыкуйце паказ вашых прафесійных моцных бакоў. Гэты ролевы сцэнар дапаможа вам справіцца з агульнымі пытаннямі на інтэрв'ю, абмеркаваць ваш вопыт і прадэманстраваць, чаму вы з'яўляецеся правільным кандыдатам.
da: Træd ind i et realistisk interviewmiljø og øv dig i at fremvise dine professionelle styrker. Denne rollespil hjælper dig med at håndtere almindelige interviewspørgsmål, diskutere din erfaring og demonstrere, hvorfor du er den rette kandidat.
de: Treten Sie in eine realistische Vorstellungsgesprächsumgebung ein und üben Sie, Ihre beruflichen Stärken zu präsentieren. Dieses Rollenspiel hilft Ihnen, mit häufigen Interviewfragen umzugehen, über Ihre Erfahrungen zu sprechen und zu zeigen, warum Sie der richtige Kandidat sind.
es: Adéntrate en un entorno de entrevista realista y practica la presentación de tus fortalezas profesionales. Este juego de roles te ayuda a manejar preguntas comunes de entrevistas, discutir tu experiencia y demostrar por qué eres el candidato adecuado.
fr: Plongez dans un environnement d'entretien réaliste et entraînez-vous à mettre en avant vos forces professionnelles. Ce jeu de rôle vous aide à traiter les questions d'entretien courantes, à discuter de votre expérience et à démontrer pourquoi vous êtes le candidat idéal.
id: Masuki lingkungan wawancara yang realistis dan latihlah menampilkan kekuatan profesional Anda. Permainan peran ini membantu Anda menangani pertanyaan wawancara umum, mendiskusikan pengalaman Anda, dan menunjukkan mengapa Anda adalah kandidat yang tepat.
it: Entra in un ambiente di colloquio realistico e pratica nel mettere in mostra i tuoi punti di forza professionali. Questo gioco di ruolo ti aiuta a gestire le domande comuni del colloquio, a discutere della tua esperienza e a dimostrare perché sei il candidato giusto.
ja: 現実的な面接環境に一歩踏み出し、あなたのプロフェッショナルな強みを披露する練習をしましょう。このロールプレイでは、一般的な面接質問に対処し、あなたの経験を語り、なぜあなたが適任であるかを示す手助けをします。
ms: Masuk ke dalam persekitaran temu duga yang realistik dan berlatih menonjolkan kekuatan profesional anda. Main peranan ini membantu anda mengendalikan soalan temu duga yang biasa, membincangkan pengalaman anda, dan menunjukkan mengapa anda calon yang tepat.
no: Stig inn i et realistisk intervjumiljø og øv på å vise frem dine profesjonelle styrker. Denne rollespilløvelsen hjelper deg med å håndtere vanlige intervjuspørsmål, diskutere din erfaring og demonstrere hvorfor du er den rette kandidaten.
pl: Wejdź do realistycznego środowiska rozmowy kwalifikacyjnej i ćwicz prezentowanie swoich profesjonalnych mocnych stron. Ta symulacja pomaga radzić sobie z typowymi pytaniami na rozmowie, omawiać swoje doświadczenie i pokazać, dlaczego jesteś odpowiednim kandydatem.
pt: Entre em um ambiente de entrevista realista e pratique a exibição de seus pontos fortes profissionais. Esta simulação ajuda você a lidar com perguntas comuns de entrevistas, discutir sua experiência e demonstrar por que você é o candidato certo.
ru: Погрузитесь в реалистичную атмосферу собеседования и отработайте навыки демонстрации своих профессиональных сильных сторон. Этот ролевой сценарий поможет вам справляться с распространенными вопросами на собеседовании, обсудить ваш опыт и показать, почему вы являетесь подходящим кандидатом.
sv: Stig in i en realistisk intervjumiljö och öva på att visa upp dina professionella styrkor. Denna rollspelssession hjälper dig att hantera vanliga intervjufrågor, diskutera din erfarenhet och visa varför du är den rätta kandidaten.
th: ก้าวเข้าสู่สภาพแวดล้อมการสัมภาษณ์ที่เหมือนจริงและฝึกฝนการนำเสนอจุดแข็งทางวิชาชีพของคุณ การสวมบทบาทนี้ช่วยให้คุณจัดการกับคำถามสัมภาษณ์ทั่วไป พูดคุยเกี่ยวกับประสบการณ์ของคุณ และแสดงให้เห็นว่าทำไมคุณถึงเป็นผู้สมัครที่เหมาะสม
tr: Gerçekçi bir mülakat ortamına adım atın ve profesyonel güçlü yönlerinizi sergileme pratiği yapın. Bu rol yapma egzersizi, yaygın mülakat sorularını ele almanıza, deneyiminizi tartışmanıza ve neden doğru aday olduğunuzu göstermenize yardımcı olur.
uk: Вступайте у реалістичне середовище для інтерв'ю та практикуйтесь у демонстрації своїх професійних сильних сторін. Ця рольова гра допоможе вам впоратися зі стандартними питаннями на співбесіді, обговорити ваш досвід та продемонструвати, чому саме ви є правильним кандидатом.
vi: Bước vào một môi trường phỏng vấn thực tế và luyện tập trình bày các điểm mạnh chuyên nghiệp của bạn. Cuộc nhập vai này giúp bạn xử lý những câu hỏi phỏng vấn thường gặp, thảo luận về kinh nghiệm của bạn, và thể hiện lý do tại sao bạn là ứng viên phù hợp.
