Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Brain connection failed.
ar: فشل في الاتصال بالدماغ.
be: З'яўляецца памылкай злучэння з мозгам.
da: Hjerneforbindelsen fejlede.
de: Die Verbindung zum Gehirn ist fehlgeschlagen.
es: La conexión cerebral ha fallado.
fr: La connexion cerveau a échoué.
id: Koneksi otak gagal.
it: Connessione cerebrale fallita.
ja: 脳の接続に失敗しました。
ms: Sambungan otak gagal.
no: Hjernetilkobling mislyktes.
pl: Połączenie z mózgiem nie powiodło się.
pt: Falha na conexão cerebral.
ru: Сбой подключения к мозгу.
sv: Hjärnans anslutning misslyckades.
th: การเชื่อมต่อสมองล้มเหลว.
tr: Beyin bağlantısı başarısız oldu.
uk: Помилка з'єднання з мозком.
vi: Kết nối não bị lỗi.

source: Brain connection successful!
ar: تم الاتصال بالدماغ بنجاح!
be: Паспяховае падлучэнне да мозгу!
da: Forbindelse til hjernen lykkedes!
de: Verbindung zum Gehirn erfolgreich!
es: ¡Conexión cerebral exitosa!
fr: Connexion au cerveau réussie !
id: Koneksi otak berhasil!
it: Connessione cerebrale riuscita!
ja: 脳との接続に成功しました！
ms: Sambungan otak berjaya!
no: Tilkobling til hjernen vellykket!
pl: Połączenie z mózgiem udane!
pt: Conexão cerebral bem-sucedida!
ru: Успешное подключение к мозгу!
sv: Hjärnans anslutning lyckad!
th: การเชื่อมต่อสมองสำเร็จ!
tr: Beyin bağlantısı başarılı!
uk: Підключення до мозку успішне!
vi: Kết nối não thành công!

source: Briefly describe your experience with C#, .NET, and designing APIs.
ar: بإيجاز، صِف تجربتك مع C# و .NET وتصميم واجهات برمجة التطبيقات (APIs).
be: Каротка апішыце свой досвед з C#, .NET і распрацоўкай API.
da: Beskriv kort din erfaring med C#, .NET og design af API'er.
de: Beschreiben Sie kurz Ihre Erfahrung mit C#, .NET und dem Entwerfen von APIs.
es: Describa brevemente su experiencia con C#, .NET y el diseño de API.
fr: Décrivez brièvement votre expérience avec C#, .NET et la conception d'APIs.
id: Jelaskan secara singkat pengalaman Anda dengan C#, .NET, dan merancang API.
it: Descrivi brevemente la tua esperienza con C#, .NET e la progettazione di API.
ja: C#、.NET、APIの設計に関するあなたの経験を簡単に説明してください。
ms: Huraikan secara ringkas pengalaman anda dengan C#, .NET, dan mereka bentuk API.
no: Beskriv kort din erfaring med C#, .NET, og utforming av API-er.
pl: Krótko opisz swoje doświadczenie z C#, .NET i projektowaniem interfejsów API.
pt: Descreva brevemente sua experiência com C#, .NET e design de APIs.
ru: Кратко опишите ваш опыт работы с C#, .NET и проектированием API.
sv: Beskriv kortfattat din erfarenhet av C#, .NET och att utforma API:er.
th: โปรดอธิบายประสบการณ์ของคุณเกี่ยวกับ C#, .NET และการออกแบบ API อย่างสั้น ๆ
tr: C#, .NET ve API tasarımı konusundaki deneyiminizi kısaca açıklayınız.
uk: Коротко опишіть свій досвід роботи з C#, .NET та проектуванням API.
vi: Mô tả ngắn gọn kinh nghiệm của bạn với C#, .NET và thiết kế API.

source: Build confidence in interviews
ar: ابنِ الثقة في المقابلات
be: Пабудуйце ўпэўненасць на інтэрв'ю
da: Opbyg selvtillid i interviews
de: Bauen Sie Vertrauen in Vorstellungsgesprächen auf
es: Construya confianza en las entrevistas
fr: Construisez la confiance lors des entretiens
id: Bangun kepercayaan diri dalam wawancara
it: Costruisci fiducia nei colloqui
ja: インタビューで自信をつける
no: Bygg selvtillit i intervjuer
pl: Zbuduj pewność siebie na rozmowach kwalifikacyjnych
pt: Construa confiança em entrevistas
ru: Развивайте уверенность на собеседованиях
sv: Bygg självförtroende i intervjuer
th: สร้างความมั่นใจในการสัมภาษณ์
tr: Mülakatlarda güven inşa et
uk: Побудуйте впевненість на співбесідах
vi: Xây dựng sự tự tin trong các buổi phỏng vấn

source: Build confidence through real practice
ar: بناء الثقة من خلال ممارسة حقيقية
be: Пабудуйце ўпэўненасць праз сапраўдную практыку
da: Byg selvtillid gennem reel praksis
de: Stärken Sie das Selbstvertrauen durch praxisnahe Übungen
es: Gana confianza a través de la práctica real
fr: Construisez votre confiance grâce à une pratique réelle
id: Bangun kepercayaan diri melalui latihan nyata
it: Costruisci fiducia attraverso la pratica reale
ja: 実践を通じて自信を築く
no: Bygg selvtillit gjennom ekte praksis
pl: Buduj pewność siebie poprzez praktyczne ćwiczenia
pt: Construa confiança através da prática real
ru: Постройте уверенность через реальную практику
sv: Bygg självförtroende genom verklig praktik
th: สร้างความมั่นใจผ่านการฝึกปฏิบัติจริง
tr: Gerçek pratikle güven inşa edin
uk: Будуйте впевненість через реальну практику
vi: Xây dựng sự tự tin thông qua thực hành thực tế

source: Build confidence to discuss equity, benefits, and salary packages that match your experience.
ar: ابني الثقة لمناقشة الاستثمار في الحصص والفوائد وحزم الرواتب التي تتناسب مع خبرتك.
be: Пабудуйце давер, каб абмяркоўваць ураўнаважанасць, льготы і пакеты зарплаты, якія адпавядаюць вашаму досведу.
da: Opbyg selvtillid til at diskutere aktiver, fordele og lønpakker, der matcher din erfaring.
de: Gewinnen Sie Selbstvertrauen, um über Gerechtigkeit, Vorteile und Gehaltspakete zu sprechen, die Ihrer Erfahrung entsprechen.
es: Construye confianza para discutir sobre equidad, beneficios y paquetes salariales que correspondan con tu experiencia.
fr: Renforcez votre confiance pour discuter de l'équité, des avantages sociaux et des packages salariaux qui correspondent à votre expérience.
id: Bangun kepercayaan diri untuk membahas ekuitas, manfaat, dan paket gaji yang sesuai dengan pengalaman Anda.
it: Costruisci la fiducia per discutere di equità, benefici e pacchetti salariali che corrispondono alla tua esperienza.
ja: 経験に見合った株式、福利厚生、給与パッケージを議論する自信を構築しましょう。
ms: Bina keyakinan untuk membincangkan ekuiti, faedah, dan pakej gaji yang sepadan dengan pengalaman anda.
no: Bygg selvtillit til å diskutere egenkapital, fordeler og lønnspakker som matcher din erfaring.
pl: Zbuduj pewność, aby rozmawiać o równości, korzyściach i pakietach wynagrodzeń, które odpowiadają Twojemu doświadczeniu.
pt: Construa confiança para discutir equidade, benefícios e pacotes salariais que correspondam à sua experiência.
ru: Развивайте уверенность в обсуждении справедливости, преимуществ и пакетов заработной платы, соответствующих вашему опыту.
sv: Bygg självförtroende för att diskutera rättvisa, förmåner och lönepaket som motsvarar din erfarenhet.
th: สร้างความมั่นใจในการพูดคุยเกี่ยวกับความเท่าเทียมกัน สวัสดิการ และแพ็คเกจเงินเดือนที่สอดคล้องกับประสบการณ์ของคุณ
tr: Deneyiminizle eşleşen eşitlik, faydalar ve maaş paketlerini tartışma konusunda kendinize güven kazanın.
uk: Побудуйте впевненість для обговорення справедливості, пільг і пакетів заробітної плати, які відповідають вашому досвіду.
vi: Xây dựng sự tự tin để thảo luận về công bằng, lợi ích và các gói lương phù hợp với kinh nghiệm của bạn.

source: Build fluency and confidence with daily speaking practice.
ar: بناء الطلاقة والثقة من خلال ممارسة التحدث اليومية.
be: Пабудуйце свабоднае валоданне і ўпэўненасць з дапамогай штодзённай практыкі маўлення.
da: Opbyg flydende sprogbrug og selvtillid med daglig taletræning.
de: Entwickeln Sie Flüssigkeit und Selbstvertrauen durch tägliche Sprechübungen.
es: Desarrolla tu fluidez y confianza con la práctica diaria de conversación.
fr: Développez votre aisance et votre confiance avec une pratique quotidienne de la parole.
id: Bangun kefasihan dan kepercayaan diri dengan latihan berbicara harian.
it: Costruisci fluidità e fiducia con la pratica quotidiana del parlato.
ja: 日々のスピーキング練習で流暢さと自信を築きましょう。
no: Bygg flyt og selvtillit med daglig taletrening.
pl: Zbuduj płynność i pewność siebie dzięki codziennej praktyce mówienia.
pt: Construa fluência e confiança com prática diária de conversação.
ru: Развивайте беглость и уверенность с ежедневной практикой устной речи.
sv: Bygg upp flyt och självförtroende med daglig talövning.
th: ฝึกพูดทุกวันเพื่อสร้างความคล่องตัวและความมั่นใจ
tr: Günlük konuşma pratiği ile akıcılık ve kendinize güveni artırın.
uk: Розвивайте вільність і впевненість за допомогою щоденних тренувань з говоріння.
vi: Xây dựng sự trôi chảy và tự tin với việc luyện nói hàng ngày.

source: Bundling & Code Splitting
ar: حزمة وتجزيء الكود
be: Аб'яднанне і падзел кода
da: Pakning & Kodeopdeling
de: Bündelung & Code-Splitting
es: Agrupación y División de Código
fr: Regroupement & Fractionnement du Code
id: Pembundelan & Pemecahan Kode
it: Raggruppamento & Suddivisione del Codice
ja: バンドリング & コード分割
ms: Penggabungan & Pemisahan Kod
no: Pakking & Kodesplitting
pl: Pakowanie i Dzielenie Kodu
pt: Agrupamento & Divisão de Código
ru: Упаковка и Разделение Кода
sv: Buntning & Kodsplittring
th: การรวมกลุ่ม & การแยกโค้ด
tr: Paketleme ve Kod Ayrıştırma
uk: Об'єднання та Розподіл Коду
vi: Bó & Tách Mã

source: Business English
ar: الإنجليزية التجارية
be: Бізнес-англійская
da: Erhvervsengelsk
de: Geschäftsenglisch
es: Inglés de Negocios
fr: Anglais des affaires
id: Bahasa Inggris Bisnis
it: Inglese Commerciale
ja: ビジネス英語
ms: Bahasa Inggeris Perniagaan
no: Forretningsengelsk
pl: Biznesowy angielski
pt: Inglês para Negócios
ru: Деловой английский
sv: Affärsengelska
th: ภาษาอังกฤษทางธุรกิจ
tr: İş İngilizcesi
uk: Бізнес-англійська
vi: Tiếng Anh Thương mại

source: business English
ar: الإنجليزية التجارية
be: бізнес-англійская
da: forretningsengelsk
de: Geschäftsenglisch
es: inglés de negocios
fr: anglais des affaires
id: bahasa Inggris bisnis
it: inglese commerciale
ja: ビジネス英語
ms: bahasa Inggeris perniagaan
no: forretningsengelsk
pl: biznesowy angielski
pt: inglês para negócios
ru: деловой английский
sv: företagsengelska
th: ภาษาอังกฤษทางธุรกิจ
tr: iş İngilizcesi
uk: бізнес-англійська
vi: tiếng Anh thương mại

source: Business English interview preparation
ar: تحضير لمقابلة اللغة الإنجليزية التجارية
be: Падрыхтоўка да інтэрв'ю па бізнес-англійскай
da: Forberedelse til business engelsk interview
de: Vorbereitung auf das Business-Englisch-Interview
es: Preparación para entrevistas de inglés de negocios
fr: Préparation à l'entretien en anglais des affaires
id: Persiapan wawancara Bisnis Bahasa Inggris
it: Preparazione per intervista in Business English
ja: ビジネス英語の面接準備
ms: Persediaan temuduga Bahasa Inggeris Perniagaan
no: Forberedelse til jobbintervju på engelsk
pl: Przygotowanie do rozmowy kwalifikacyjnej w języku angielskim dla biznesu
pt: Preparação para entrevista em inglês de negócios
ru: Подготовка к собеседованию на английском языке для бизнеса
sv: Förberedelse för affärsengelsk intervju
th: การเตรียมตัวสำหรับสัมภาษณ์ภาษาอังกฤษทางธุรกิจ
tr: İş İngilizcesi mülakat hazırlığı
uk: Підготовка до інтерв'ю з бізнес-англійської
vi: Chuẩn bị phỏng vấn tiếng Anh thương mại

source: busy professionals
ar: محترفون مشغولون
be: занятыя прафесіяналы
da: travle professionelle
de: beschäftigte Berufstätige
es: profesionales ocupados
fr: professionnels occupés
id: profesional yang sibuk
it: professionisti impegnati
ja: 忙しい専門家たち
ms: profesional yang sibuk
no: travle profesjonelle
pl: zajęci profesjonaliści
pt: profissionais ocupados
ru: занятые профессионалы
sv: upptagna yrkesverksamma
th: ผู้มีอาชีพที่ยุ่งยาก
tr: meşgul profesyoneller
uk: зайняті професіонали
vi: người làm việc bận rộn

source: Buy a subscription
ar: اشتر اشتراك
be: Купіць падпіску
da: Køb et abonnement
de: Abonnieren Sie
es: Compra una suscripción
fr: Achetez un abonnement
id: Beli langganan
it: Acquista un abbonamento
ja: サブスクリプションを購入する
ms: Beli langganan
no: Kjøp et abonnement
pl: Kup subskrypcję
pt: Compre uma assinatura
ru: Купить подписку
sv: Köp en prenumeration
th: ซื้อสมาชิก
tr: Abonelik Satın Al
uk: Купити підписку
vi: Mua gói đăng ký

source: Buy More
ar: اشترِ المزيد
be: Купіць больш
da: Køb Mere
de: Kaufe Mehr
es: Comprar Más
fr: Acheter Plus
id: Beli Lebih Banyak
it: Compra di più
ja: もっと買う
ms: Beli Lebih Banyak
no: Kjøp Mer
pl: Kup Więcej
pt: Compre Mais
ru: Купить Больше
sv: Köp Mer
th: ซื้อเพิ่มเติม
tr: Daha Fazla Satın Al
uk: Купити Більше
vi: Mua Thêm

source: Buying a Train Ticket
ar: شراء تذكرة قطار
be: Купля квітка на поезд
da: Køb af en Togbillet
de: Kauf eines Zugtickets
es: Compra de un Billete de Tren
fr: Acheter un billet de train
id: Membeli Tiket Kereta
it: Acquistare un biglietto del treno
ja: 列車の切符を購入する
ms: Membeli Tiket Kereta
no: Kjøpe en Togbillett
pl: Kupowanie biletu na pociąg
pt: Comprando um Bilhete de Trem
ru: Покупка билета на поезд
sv: Köpa en tågbiljett
th: การซื้อบัตรรถไฟ
tr: Tren Bileti Satın Alma
uk: Придбання квитка на поїзд
vi: Mua Vé Tàu

source: Buying {hours} hour(s) of AI usage
uk: Купівля {hours} години(годин) використання ІІ

source: By continuing, you agree to our
ar: بالاستمرار، فإنك توافق على شروطنا
be: Працягваючы, вы згаджаецеся з нашымі
da: Ved at fortsætte, accepterer du vores
de: Indem Sie fortfahren, stimmen Sie unseren
es: Al continuar, aceptas nuestros
fr: En continuant, vous acceptez nos
id: Dengan melanjutkan, Anda setuju dengan kami
it: Continuando, accetti i nostri
ja: 続行することにより、あなたは当社のに同意したことになります
ms: Dengan meneruskan, anda bersetuju dengan
no: Ved å fortsette, godtar du våre
pl: Kontynuując, zgadzasz się na nasze
pt: Ao continuar, você concorda com nossos
ru: Продолжая, вы соглашаетесь с нашими
sv: Genom att fortsätta godkänner du vår
th: ต่อไป คุณยอมรับข้อกำหนดและเงื่อนไขของเรา
tr: Devam ederek, şunlara katıldığınızı kabul ediyorsunuz:
uk: Продовжуючи, ви погоджуєтеся з нашими
vi: Bằng cách tiếp tục, bạn đồng ý với việc của chúng tôi

source: By practicing, you will get personal grammar rules from AI
ar: من خلال التدريب، ستحصل على قواعد النحو الشخصية من الذكاء الصناعي
be: Праз практыку, вы атрымаеце асабістыя граматычныя правілы ад AI
da: Ved at øve, vil du få personlige grammatikregler fra AI
de: Durch Üben erhalten Sie persönliche Grammatikregeln von AI
es: Al practicar, obtendrás reglas de gramática personalizadas de la IA
fr: En pratiquant, vous obtiendrez des règles de grammaire personnelles de l'IA
id: Dengan berlatih, Anda akan mendapatkan aturan tata bahasa pribadi dari AI
it: Praticando, otterrai regole grammaticali personalizzate dall'IA
ja: 練習することで、AIから個人的な文法のルールを得ることができます
ms: Dengan berlatih, anda akan mendapatkan peraturan tatabahasa peribadi dari AI
no: Ved å øve, vil du få personlige grammatikkregler fra AI
pl: Poprzez ćwiczenie, otrzymasz osobiste zasady gramatyki od AI
pt: Ao praticar, você receberá regras de gramática pessoais da IA
ru: Практикуясь, вы получите персональные грамматические правила от AI
sv: Genom att öva kommer du att få personliga grammatikregler från AI
th: โดยการฝึกฝน, คุณจะได้รับกฎการใช้ไวยากรณ์ส่วนบุคคลจาก AI
tr: Pratik yaparak, AI'den kişisel dil bilgisi kuralları alacaksınız.
uk: Практикуючись, ви отримаєте персоналізовані граматичні правила від AI
vi: Bằng cách thực hành, bạn sẽ nhận được quy tắc ngữ pháp cá nhân từ AI

source: C# Backend Developer
ar: مطور خلفية C#
da: C# Backend-udvikler
de: C# Backend-Entwickler
es: Desarrollador Backend C#
fr: Développeur Backend C#
id: Pengembang Backend C#
it: Sviluppatore Backend C#
ja: C# バックエンド開発者
ms: Pemaju Backend C#
no: C# Backend Utvikler
pl: Programista Backend C#
pt: Desenvolvedor Backend C#
ru: Разработчик на C# для серверной части
sv: C# Backend-utvecklare
th: นักพัฒนาแบ็กเอนด์ C#
tr: C# Backend Geliştirici
uk: Розробник Backend на C#
vi: Nhà Phát Triển Backend C#

source: C# Backend Developer Interview
ar: مقابلة مطور خلفية C#
be: Суразмова з C# Backend распрацоўнікам
da: C# Backend-udvikler Interview
de: C# Backend-Entwickler Interview
es: Entrevista para Desarrollador Backend C#
fr: Entretien de Développeur Backend C#
id: Wawancara Pengembang Backend C#
it: Colloquio per Sviluppatore Backend C#
ja: C# バックエンド開発者インタビュー
ms: Wawancara Pembangun Backend C#
no: C# Backend Utvikler Intervju
pl: Wywiad z Programistą Backend C#
pt: C# Desenvolvedor Backend Entrevista
ru: Интервью C# Backend Developer
sv: C# Backend Utvecklare Intervju
th: การสัมภาษณ์สำหรับนักพัฒนาซีชาร์ปแบ็คเอนด์
tr: C# Backend Geliştirici Mülakatı
uk: Співбесіда з C# Backend Розробником
vi: Buổi Phỏng Vấn Lập Trình Viên Backend C#

source: C# Backend Developers preparing for new roles or promotions
ar: مطورين C# Backend الذين يستعدون لأدوار جديدة أو ترقيات
be: Распрацоўшчыкі C# Backend, якія рыхтуюцца да новых роляў або павышэнняў
da: C# Backend-udviklere forbereder sig på nye roller eller forfremmelser
de: C# Backend-Entwickler, die sich auf neue Rollen oder Beförderungen vorbereiten
es: Desarrolladores Backend de C# preparándose para nuevos roles o promociones
fr: Développeurs Backend C# se préparant pour de nouveaux rôles ou des promotions
id: Pengembang Backend C# yang mempersiapkan diri untuk peran baru atau promosi
it: Sviluppatori Backend C# che si preparano per nuovi ruoli o promozioni
ja: 新しい役割や昇進の準備をしているC#バックエンド開発者
ms: Pembangun Backend C# yang sedang bersiap untuk peranan baru atau kenaikan pangkat
no: C# Backend-utviklere som forbereder seg på nye roller eller opprykk
pl: Programiści backendowi C# przygotowujący się do nowych ról lub awansów
pt: Desenvolvedores Backend C# se preparando para novos cargos ou promoções
ru: Разработчики C# Backend, готовящиеся к новым ролям или повышениям
sv: C# backendutvecklare som förbereder sig för nya roller eller befordringar
th: นักพัฒนา Backend C# ที่กำลังเตรียมตัวสำหรับบทบาทใหม่หรือการเลื่อนตำแหน่ง
tr: C# Backend Geliştiricileri yeni rollere veya terfilere hazırlıyor
uk: Розробники бекенду на C#, які готуються до нових ролей або підвищень
vi: Các Nhà Phát Triển Backend C# đang chuẩn bị cho vai trò mới hoặc thăng chức

source: c# backend interview
ar: مقابلة خلفية C#
be: c# бэкэнд-інтэрв'ю
es: entrevista de backend c#
fr: entretien sur le backend c#
id: wawancara backend c#
it: colloquio backend c#
ja: c# バックエンド面接
ms: temuduga backend c#
no: c# backend intervju
pl: rozmowa kwalifikacyjna na backend C#
pt: entrevista de backend em c#
ru: с# интервью на должность бэкенд-разработчика
sv: intervju för backend med C#
th: c# สัมภาษณ์เบื้องหลัง
tr: c# backend görüşmesi
uk: c# співбесіда на бекенд
vi: phỏng vấn c# backend

source: C# Backend Interview Readiness Test
ar: اختبار جاهزية المقابلة للجهة الخلفية بلغة #C
be: Тэст гатоўнасці да сумоўя на Backend-распрацоўшчыка C#
de: C# Backend Interview Bereitschaftstest
es: Prueba de Preparación para la Entrevista de Backend en C#
fr: Test de Prêt pour l'Entretien Backend en C#
id: Tes Kesiapan Wawancara Backend C#
it: Test di Prontezza per Colloqui Backend in C#
ja: C# バックエンド面接準備テスト
ms: Ujian Kesiapsiagaan Temuduga Backend C#
no: C# Backend Intervju Forberedelsestest
pl: Test gotowości do rozmowy kwalifikacyjnej na stanowisko Backend Developer z C#
pt: Teste de Preparação para Entrevista de Backend C#
ru: Тест на готовность к собеседованию на позицию C# Backend разработчика
sv: C# Backend-intervjutest för beredskap
th: การทดสอบความพร้อมสัมภาษณ์ตำแหน่ง Backend ด้วยภาษา C#
tr: C# Backend Mülakat Hazırlık Testi
uk: Тест на готовність до співбесіди для C# бекенд розробника
vi: Bài Kiểm Tra Sẵn Sàng Phỏng Vấn Backend C#

source: Caching Strategies
ar: استراتيجيات التخزين المؤقت
be: Стратэгіі кэшавання
da: Caching-strategier
de: Caching-Strategien
es: Estrategias de Caché
fr: Stratégies de mise en cache
id: Strategi Pencachean
it: Strategie di Caching
ja: キャッシング戦略
ms: Strategi Cache
no: Bufringsstrategier
pl: Strategie buforowania
pt: Estratégias de Cache
ru: Стратегии кеширования
sv: Caching-strategier
th: นโยบายการแคช
tr: Önbellekleme Stratejileri
uk: Стратегії кешування
vi: Chiến Lược Lưu Bộ Nhớ Đệm

source: Call
id: Panggilan
it: Chiama
ja: コール
no: Ring
pl: Zadzwoń
ru: Вызов
sv: Ring
uk: Виклик

source: Call mode
ar: وضع المكالمة
be: Рэжым выкліку
da: Opkaldstilstand
de: Anrufmodus
es: Modo de llamada
fr: Mode d'appel
id: Mode panggilan
it: Modalità chiamata
ja: 通話モード
no: Anropsmodus
pl: Tryb rozmowy
pt: Modo de chamada
ru: Режим звонка
sv: Samtalsläge
th: โหมดโทร
tr: Çağrı modu
uk: Режим дзвінка
vi: Chế độ gọi

source: Calling Customer Support
ar: استدعاء دعم العملاء
be: Выклік Службы падтрымкі кліентаў
da: Ringer til kundesupport
de: Kundensupport anrufen
es: Llamando al Soporte al Cliente
fr: Appel au Service Client
id: Memanggil Dukungan Pelanggan
it: Chiamare il Servizio Clienti
ja: カスタマーサポートへの連絡
ms: Menghubungi Sokongan Pelanggan
no: Kundestøtte\n
pl: Zadzwonić do obsługi klienta
pt: Chamando o Suporte ao Cliente
ru: Вызывая службу поддержки клиентов
sv: Kontakta kundsupport
th: การติดต่อฝ่ายสนับสนุนลูกค้า
tr: Müşteri Desteğini Arama
uk: Виклик до служби підтримки клієнтів
vi: Gọi Hỗ Trợ Khách Hàng

source: Can FluencyPal create a personal practice plan for me?
ar: هل يمكن لـ FluencyPal إنشاء خطة ممارسة شخصية لي؟
be: Ці можа FluencyPal стварыць персанальны план практыкаванняў для мяне?
da: Kan FluencyPal oprette en personlig træningsplan for mig?
de: Kann FluencyPal einen persönlichen Übungsplan für mich erstellen?
es: ¿Puede FluencyPal crear un plan de práctica personal para mí?
fr: FluencyPal peut-il créer un plan de pratique personnalisé pour moi ?
id: Dapatkah FluencyPal membuat rencana latihan pribadi untuk saya?
it: FluencyPal può creare un piano di pratica personalizzato per me?
ja: FluencyPal は私のために個別の練習計画を作成できますか？
no: Kan FluencyPal lage en personlig øvingsplan for meg?
pl: Czy FluencyPal może stworzyć dla mnie osobisty plan ćwiczeń?
pt: O FluencyPal pode criar um plano de prática pessoal para mim?
ru: Может ли FluencyPal создать для меня персональный план практики?
sv: Kan FluencyPal skapa en personlig träningsplan för mig?
th: FluencyPal สามารถสร้างแผนฝึกซ้อมส่วนตัวสำหรับฉันได้หรือไม่?
tr: FluencyPal benim için kişisel bir pratik planı oluşturabilir mi?
uk: Чи може FluencyPal створити для мене персональний план практики?
vi: FluencyPal có thể tạo một kế hoạch luyện tập cá nhân cho tôi không?

source: Can I customize my practice sessions?
ar: plaintext هل يمكنني تخصيص جلسات التدريب الخاصة بي؟
be: Ці магу я наладзіць мае трэнінгі?
da: Kan jeg tilpasse mine øvelsessessioner?
de: Kann ich meine Übungseinheiten anpassen?
es: ¿Puedo personalizar mis sesiones de práctica?
fr: Puis-je personnaliser mes sessions d'entraînement ?
id: Bisakah saya menyesuaikan sesi latihan saya?
it: Posso personalizzare le mie sessioni di pratica?
ja: 練習セッションをカスタマイズできますか？
ms: Bolehkah saya menyesuaikan sesi latihan saya?
no: Kan jeg tilpasse øvingsøktene mine?
pl: Czy mogę dostosować swoje sesje ćwiczeniowe?
pt: Posso personalizar minhas sessões de prática?
ru: Могу ли я настроить свои тренировочные занятия?
sv: Kan jag anpassa mina övningssessioner?
th: ฉันสามารถปรับแต่งเซสชันการฝึกฝนของฉันได้หรือไม่?
tr: Uygulama oturumlarımı özelleştirebilir miyim?
uk: Чи можу я налаштувати свої заняття?
vi: Tôi có thể tùy chỉnh các buổi luyện tập của mình không?

source: Can I do a refund after purchase?
de: Kann ich nach dem Kauf eine Rückerstattung beantragen?
es: ¿Puedo hacer un reembolso después de la compra?
id: Bisakah saya melakukan pengembalian dana setelah pembelian?
it: Posso ottenere un rimborso dopo l'acquisto?
ja: 購入後に返金はできますか？
no: Kan jeg få refusjon etter kjøp?
pl: Czy mogę dokonać zwrotu po zakupie?
pt: Posso obter um reembolso após a compra?
ru: Могу ли я оформить возврат после покупки?
sv: Kan jag få en återbetalning efter köp?
th: ฉันสามารถขอคืนเงินหลังจากซื้อได้หรือไม่?
tr: Satın aldıktan sonra para iadesi yapabilir miyim?
uk: Чи можу я зробити повернення коштів після покупки?
vi: Tôi có thể hoàn tiền sau khi mua không?

source: Can I get full access for free?
de: Kann ich vollen Zugang kostenlos erhalten?
es: ¿Puedo obtener acceso completo gratis?
id: Bisakah saya mendapatkan akses penuh secara gratis?
it: Posso ottenere l'accesso completo gratuitamente?
ja: 無料でフルアクセスを利用できますか？
no: Kan jeg få full tilgang gratis?
pl: Czy mogę uzyskać pełny dostęp za darmo?
pt: Posso obter acesso completo gratuitamente?
ru: Могу ли я получить полный доступ бесплатно?
sv: Kan jag få full tillgång gratis?
th: ฉันสามารถเข้าถึงได้เต็มที่ฟรีหรือไม่?
tr: Tam erişime ücretsiz bir şekilde sahip olabilir miyim?
uk: Чи можу я отримати повний доступ безкоштовно?
vi: Tôi có thể nhận quyền truy cập đầy đủ miễn phí không?
