Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Real Senior Frontend Developer interview questions you're likely to be asked
ar: أسئلة مقابلة مطور الواجهة الأمامية (FrontEnd) المتقدّم التي من المحتمل أن تُطرح عليك
be: Рэальныя пытанні на інтэрв'ю для старшага фронтэнд-распрацоўшчыка, якія вам, верагодна, зададуць
da: Reelle interviewspørgsmål til Senior Frontend Udvikler, som du sandsynligvis vil blive stillet
de: Echte Interviewfragen für einen Senior Frontend-Entwickler, die Ihnen wahrscheinlich gestellt werden
es: Preguntas reales de entrevista para un Desarrollador Frontend Senior que es probable que te hagan
fr: Vraies questions d'entretien pour développeur frontend senior auxquelles vous êtes susceptible d'être confronté
id: Pertanyaan wawancara Pengembang Frontend Senior yang sebenarnya kemungkinan akan ditanyakan kepada Anda
it: Vere domande da colloquio per sviluppatore frontend senior che probabilmente ti verranno poste
ja: 実際のシニアフロントエンド開発者面接で尋ねられる可能性のある質問
ms: Soalan temu duga Pembina Hadapan Kanan yang sebenar yang kemungkinan akan anda ditanya
no: Intervjuspørsmål for virkelig erfarne frontendutviklere som du sannsynligvis vil bli spurt
pl: Pytania na rozmowę kwalifikacyjną dla doświadczonego programisty frontendowego, które prawdopodobnie zostaną Ci zadane
pt: Perguntas reais de entrevista para desenvolvedor frontend sênior que provavelmente serão feitas
ru: Вопросы на собеседовании для настоящего старшего фронтенд-разработчика, которые вам, вероятно, зададут
sv: Riktiga frågor vid intervjuer för Senior Frontend Developer som du troligtvis kommer att få.
th: คำถามสัมภาษณ์จริงสำหรับนักพัฒนาส่วนหน้ารุ่นพี่ที่คุณอาจจะพบ
tr: Gerçek Kıdemli Frontend Geliştirici mülakat soruları, muhtemelen size sorulacaklar.
uk: Питання, які вам, ймовірно, зададуть на співбесіді на посаду досвідченого фронтенд-розробника
vi: Những câu hỏi phỏng vấn Lập trình viên Frontend cao cấp thực sự mà bạn có thể được hỏi

source: Real senior-level frontend questions
ar: أسئلة حقيقية لمستوى كبير من المطورين في الواجهة الأمامية
be: Рэальныя пытанні для сеньёрскага ўзроўню фронтэнда
da: Reelle frontend-spørgsmål på seniorniveau
de: Echte Frontend-Fragen auf Senioren-Niveau
es: Preguntas reales de front-end de nivel sénior
fr: Questions réelles de niveau senior pour le frontend
id: Pertanyaan frontend tingkat senior yang nyata
it: Domande reali di livello senior per frontend
ja: シニアレベルのフロントエンドに関する本格的な質問
ms: Soalan peringkat tinggi front-end sebenar
no: Reelle spørsmål på seniornivå innen frontend
pl: Prawdziwe pytania związane z frontendem na poziomie seniora
pt: Perguntas de frontend em nível sênior reais
ru: Реальные вопросы для фронтенд-разработчиков старшего уровня
sv: Riktiga frågor på seniornivå för frontend-utvecklare
th: คำถามส่วนหน้าระดับอาวุโสจริง
tr: Gerçek üst düzey frontend soruları
uk: Реальні питання фронтенду рівня senior
vi: Câu hỏi về frontend cấp cao thực thụ

source: Real time conversation with AI
id: Percakapan waktu nyata dengan AI
it: Conversazione in tempo reale con AI
ja: リアルタイムでAIと会話
no: Sanntidssamtale med AI
pl: Rozmowa w czasie rzeczywistym z AI
ru: Разговор в реальном времени с ИИ
sv: Realtidssamtal med AI
uk: Розмова в реальному часі з ШІ

source: Real-Life English Role-Play Scenarios
ar: سيناريوهات تمثيل الأدوار باللغة الإنجليزية في الحياة الواقعية
be: Сцэнарыі ролеўай гульні па англійскай мове ў рэчаісных умовах
da: Virkelige engelske rollespilsscenarier
de: Echte Englisch-Rollenspiel-Szenarien
es: Escenarios de Juego de Rol en Inglés de la Vida Real
fr: Scénarios de jeux de rôle en anglais de la vie réelle
id: Skenario Peran Bahasa Inggris Dalam Kehidupan Nyata
it: Scenari di Ruolo in Inglese della Vita Reale
ja: リアルライフ英会話ロールプレイシナリオ
ms: Skenario Peranan Bahasa Inggeris Dalam Kehidupan Sebenar
no: Virkelige engelske rollespillscenarier
pl: Scenariusze odgrywania ról w prawdziwym życiu w języku angielskim
pt: Cenários de Interpretação em Inglês do Mundo Real
ru: Сценарии Ролевых Игров на Английском в Реальной Жизни
sv: Verkliga engelska rollspelscenarier
th: สถานการณ์การเล่นบทบาทภาษาอังกฤษในชีวิตจริง
tr: Gerçek Hayat İngilizce Rol Oynama Senaryoları
uk: Сценарії рольових ігор з англійської мови у реальному житті
vi: Kịch bản Đóng Vai Tiếng Anh Thực Tế

source: Real-Life English Scenarios
ar: سيناريوهات اللغة الإنجليزية في العالم الحقيقي
be: Рэальныя англійскія сцэнары
da: Virkelige engelskscenarier
de: Echtzeit-Englisch-Szenarien
es: Escenarios de Inglés en la Vida Real
fr: Scénarios en anglais de la vie réelle
id: Skenario Bahasa Inggris Dalam Kehidupan Nyata
it: Situazioni Reali in Inglese
ja: リアルライフ英会話シナリオ
ms: Situasi Bahasa Inggeris dalam Kehidupan Sebenar
no: Virkelige engelske scenarier
pl: Prawdziwe Sytuacje w Języku Angielskim
pt: Cenários de Inglês da Vida Real
ru: Сценарии из реальной жизни на английском
sv: Verkliga Engelska Scenarier
th: สถานการณ์ภาษาอังกฤษในชีวิตจริง
tr: Gerçek Hayat İngilizce Senaryoları
uk: Справжні англійські сценарії
vi: Cảnh Hàng Ngày Trong Tiếng Anh

source: Real-Life Role-Play for Advanced English Practice
ar: لعبة الأدوار الحقيقية لممارسة اللغة الإنجليزية المتقدمة
be: Рэальная рольгульня для практыкі адмыслованага англійскага
da: Real-Life Rollespil for Avanceret Engelsk Øvelse
de: Echte Rollenspiele für fortgeschrittene Englischübungen
es: Realidad Interactiva para Práctica Avanzada de Inglés
fr: Jeu de rôle dans la vie réelle pour une pratique avancée de l'anglais
id: Peran Peran Kehidupan Nyata untuk Latihan Bahasa Inggris Tingkat Lanjut
it: Real-Life Role-Play per Pratiche Avanzate di Inglese
ja: 実際の役割演技による上級英語練習
ms: Real-Life Role-Play untuk Latihan Bahasa Inggeris Lanjutan
no: Virkelighetsnær Rollespill for Avansert Engelskøvelse
pt: Role-Play da Vida Real para Prática Avançada de Inglês
ru: Ролевая игра в реальной жизни для углубленной практики английского языка
sv: Realistisk rollspel för avancerad engelskträning
th: การเล่นบทบาทจริงสำหรับการฝึกภาษาอังกฤษขั้นสูง
tr: Gerçek Hayat Rol Oynama ile İleri Düzey İngilizce Pratiği
uk: Рольові ігри в реальному житті для поглибленої практики англійської мови
vi: Thực Hành Đóng Vai Thực Tế Để Nâng Cao Kỹ Năng Tiếng Anh

source: Real-time conversation
de: Echtzeitgespräch
es: Conversación en tiempo real
fr: Conversation en temps réel
id: Percakapan waktu nyata
it: Conversazione in tempo reale
ja: リアルタイム会話
no: Sanntidssamtale
pl: Rozmowa w czasie rzeczywistym
pt: Conversa em tempo real
ru: Разговор в реальном времени
sv: Konversation i realtid
th: การสนทนาแบบเรียลไทม์
tr: Gerçek zamanlı konuşma
uk: Розмова в режимі реального часу
vi: Hội thoại theo thời gian thực

source: Real-time conversations with AI using voice
ar: محادثات في الوقت الفعلي مع الذكاء الاصطناعي باستخدام الصوت
be: Рэальныя размовы з AI з выкарыстаннем голасу
da: Realtids-samtaler med AI ved hjælp af stemme
de: Echtzeitgespräche mit KI mittels Sprachsteuerung
es: Conversaciones en tiempo real con IA usando voz
fr: Conversations en temps réel avec l'IA en utilisant la voix
id: Percakapan waktu nyata dengan AI menggunakan suara
it: Conversazioni in tempo reale con AI utilizzando la voce
ja: リアルタイムの会話を音声でAIと行う
no: Sanntidssamtaler med AI ved bruk av stemme
pl: Rozmowy w czasie rzeczywistym z AI za pomocą głosu
pt: Conversas em tempo real com IA usando voz
ru: Разговоры в реальном времени с ИИ с использованием голосовых сообщений
sv: Realtidskonversationer med AI med röst
th: การสนทนาแบบเรียลไทม์กับ AI โดยใช้เสียง
tr: Sesli AI ile gerçek zamanlı sohbetler
uk: Реальні розмови з AI за допомогою голосу
vi: Đàm thoại thời gian thực với AI bằng giọng nói

source: Real-world API and data scenarios
ar: سيناريوهات واجهات برمجة التطبيقات والبيانات في العالم الواقعي
be: Рэальныя сцэнарыі API і дадзеных
da: Reelle API- og datascenarier
de: Reale API- und Datenszenarien
es: Escenarios del mundo real de API y datos
fr: Scénarios réels d'API et de données
id: Skenario API dan data dunia nyata
it: Scenari API e dati del mondo reale
ja: 現実世界のAPIとデータのシナリオ
ms: Senario API dan data dalam dunia sebenar
no: Reelle API- og datascenarioer
pl: Scenariusze API i danych w rzeczywistym świecie
pt: Cenários de API e dados do mundo real
ru: Реальные сценарии работы с API и данными
sv: Verkliga API- och datasituationer
th: กรณีศึกษาของ API และข้อมูลในโลกจริง
tr: Gerçek dünya API'si ve veri senaryoları
uk: Реальні сценарії використання API та даних
vi: Tình huống API và dữ liệu trong thế giới thực

source: Real-world scenarios, not just theory
ar: سيناريوهات حقيقية، وليست مجرد نظريات
be: Рэальныя сітуацыі, а не проста тэорыя
da: Virkelige scenarier, ikke kun teori
de: Reale Welt-Szenarien, nicht nur Theorie
es: Escenarios del mundo real, no solo teoría
fr: Des scénarios réels, pas seulement de la théorie
id: Skenario dunia nyata, bukan hanya teori
it: Scenari del mondo reale, non solo teoria
ja: 現実世界のシナリオ、理論だけではありません
ms: Senario sebenar, bukan sekadar teori
no: Reelle situasjoner, ikke bare teori
pl: Scenariusze z życia wzięte, nie tylko teoria
pt: Cenários do mundo real, não apenas teoria
ru: Реальные сценарии, а не только теория
sv: Verkliga scenarier, inte bara teori
th: สถานการณ์จริง ไม่ใช่แค่ทฤษฎีเท่านั้น
tr: Gerçek dünya senaryoları, sadece teori değil
uk: Реальні сценарії, а не просто теорія
vi: Tình huống thực tế, không chỉ lý thuyết

source: Receive instant, tailored feedback from your AI partner.
ar: تلقِ استجابة فورية، مُخصصة من شريكك الذكاء الاصطناعي.
be: Атрымлівайце миттєвы, індывідуальны водгук ад вашага AI партнёра.
da: Modtag øjeblikkelig, skræddersyet feedback fra din AI partner.
de: Erhalten Sie sofortiges, maßgeschneidertes Feedback von Ihrem AI-Partner.
es: Recibe retroalimentación instantánea y personalizada de tu socio IA.
fr: Recevez des retours instantanés et personnalisés de votre partenaire IA.
id: Terima umpan balik instan dan disesuaikan dari mitra AI Anda.
it: Ricevi feedback immediato e personalizzato dal tuo partner AI.
ja: AIパートナーからの即時、カスタマイズされたフィードバックを受け取ります。
ms: Terima maklum balas segera yang disesuaikan dari rakan AI anda.
no: Motta umiddelbar, skreddersydd tilbakemelding fra din AI-partner.
pl: Otrzymaj natychmiastową, spersonalizowaną informację zwrotną od twojego partnera AI.
pt: Receba feedback instantâneo e personalizado do seu parceiro de IA.
ru: Получайте мгновенные, индивидуально подобранные отзывы от вашего AI-партнера.
sv: Få omedelbar, anpassad feedback från din AI-partner.
th: รับข้อเสนอแนะที่ปรับเปลี่ยนมาเพื่อคุณจากพาร์ทเนอร์ AI ของคุณทันที
tr: AI ortağınızdan anında, kişiye özel geri bildirim alın.
uk: Отримуйте миттєві, індивідуалізовані відгуки від вашого AI партнера.
vi: Nhận phản hồi tức thì, tùy chỉnh từ đối tác AI của bạn.

source: Receive personalized vocabulary tailored to your conversational needs. Use new words immediately to reinforce learning.
ar: استقبل مفردات شخصية مصممة لتلبية احتياجاتك في المحادثة. استخدم الكلمات الجديدة على الفور لتعزيز التعلم.
be: Атрымайце персаналізаваную лексіку, прыстасаваную пад вашыя камунікацыйныя патрэбы. Выкарыстоўвайце новыя словы негайна для пацверджэння навучання.
da: Få personligt tilpasset ordforråd efter dine samtalebehov. Brug nye ord med det samme for at styrke din læring.
de: Erhalten Sie personalisierten Wortschatz, der auf Ihre Gesprächsbedürfnisse zugeschnitten ist. Verwenden Sie neue Wörter sofort, um das Lernen zu verstärken.
es: Recibe vocabulario personalizado adaptado a tus necesidades conversacionales. Usa nuevas palabras de inmediato para reforzar el aprendizaje.
fr: Recevez un vocabulaire personnalisé adapté à vos besoins de conversation. Utilisez immédiatement les nouveaux mots pour renforcer l'apprentissage.
id: Terima kosakata yang dipersonalisasi sesuai dengan kebutuhan percakapan Anda. Gunakan kata-kata baru segera untuk memperkuat pembelajaran.
it: Ricevi un vocabolario personalizzato su misura per le tue esigenze di conversazione. Usa le nuove parole immediatamente per rafforzare l'apprendimento.
ja: あなたの会話のニーズに合わせたパーソナライズされた語彙を受け取ります。新しい単語を直ちに使って、学習を強化しましょう。
ms: Terima kosa kata yang dipersonalisasi mengikut keperluan perbualan anda. Gunakan perkataan baru segera untuk mengukuhkan pembelajaran.
no: Motta personlig tilpasset ordforråd som er skreddersydd for dine samtale behov. Bruk nye ord umiddelbart for å forsterke læringen.
pl: Otrzymaj spersonalizowany słownictwo dostosowane do Twoich potrzeb konwersacyjnych. Używaj nowych słów od razu, aby wzmocnić naukę.
pt: Receba vocabulário personalizado adaptado às suas necessidades de conversação. Use novas palavras imediatamente para reforçar o aprendizado.
ru: Получайте персонализированный словарный запас, адаптированный к вашим разговорным потребностям. Используйте новые слова сразу, чтобы укрепить обучение.
sv: Ta emot personlig vokabulär anpassad efter dina konversationsbehov. Använd nya ord omedelbart för att förstärka inlärningen.
th: รับคำศัพท์ที่ปรับให้เหมาะกับความต้องการในการสนทนาของคุณ ใช้คำใหม่ทันทีเพื่อเสริมสร้างการเรียนรู้
tr: Konuşturma ihtiyaçlarınıza göre kişiselleştirilmiş kelime dağarcığı alın. Öğrenimi pekiştirmek için yeni kelimeleri hemen kullanın.
uk: Отримуйте персоналізований словниковий запас, налаштований під ваші розмовні потреби. Використовуйте нові слова негайно, щоб закріпити навчання.
vi: Nhận từ vựng cá nhân hóa phù hợp với nhu cầu giao tiếp của bạn. Sử dụng từ mới ngay lập tức để củng cố việc học.

source: Recent graduates or bootcamp alumni entering frontend development
ar: الخريجين الجدد أو خريجي المعسكرات التدريبية الذين يبدؤون في تطوير الواجهة الأمامية
be: Выпускнікі нядаўніх гадоў або выпускнікі курсаў, якія ўступаюць у распрацоўку фронтэнда
da: Nyuddannede eller bootcamp-alumner, der går ind i frontend-udvikling
de: Neue Absolventen oder Bootcamp-Alumni, die in die Frontend-Entwicklung einsteigen
es: Recientes graduados o exalumnos de bootcamp entrando en el desarrollo frontend
fr: Des diplômés récents ou des anciens d'un bootcamp entrant dans le développement frontend
id: Lulusan baru atau alumni bootcamp yang memasuki pengembangan frontend
it: Laureati recenti o ex studenti di bootcamp che entrano nello sviluppo frontend
ja: フロントエンド開発に参入する最近の卒業生やブートキャンプの卒業生
no: Nyutdannede eller bootcamp-alumni som går inn i frontend-utvikling
pl: Niedawni absolwenci lub alumni bootcampów rozpoczynający pracę w frontend development
pt: Recém-graduados ou ex-alunos de bootcamp entrando no desenvolvimento frontend
ru: Недавние выпускники или выпускники буткемпов, начинающие работать в разработке интерфейсов
sv: Nyligen utexaminerade eller bootcamp-alumner som börjar inom frontend-utveckling
th: บัณฑิตจบใหม่หรือศิษย์เก่า bootcamp ที่เข้าสู่วงการพัฒนาส่วนหน้าของเว็บ
tr: Yakın zamanda mezun olanlar veya frontend geliştirmeye giriş yapan bootcamp mezunları
uk: Недавні випускники або випускники буткемпів, які вступають у фронтенд-розробку
vi: Các sinh viên mới tốt nghiệp hoặc cựu học viên khóa học bootcamp bước vào phát triển frontend

source: Recommend a podcast, song, or video in your target language
uk: Рекомендувати подкаст, пісню або відео вашою цільовою мовою

source: Record
ar: سجل
be: Запіс
da: Optag
de: Aufzeichnung
es: Grabar
fr: Enregistrer
id: Rekam
it: Registra
ja: 記録
ms: Rakaman
no: Registrer
pl: Nagranie
pt: Gravar
ru: Запись
sv: Spela in
th: บันทึก
tr: Kaydet
uk: Запис
vi: Ghi lại

source: Record 2-3 minutes story. This will help me to create a personalized practice plan.
no: Spill inn en historie på 2-3 minutter. Dette vil hjelpe meg med å lage en personlig tilpasset praksisplan.
uk: Запишіть історію на 2-3 хвилини. Це допоможе мені створити персоналізований план практики.

source: Record a message
de: Nehmen Sie eine Nachricht auf
es: Graba un mensaje
id: Rekam pesan
it: Registra un messaggio
ja: メッセージを録音する
no: Ta opp en melding
pl: Nagraj wiadomość
pt: Gravar uma mensagem
ru: Записать сообщение
sv: Spela in ett meddelande
th: บันทึกข้อความ
tr: Bir mesaj kaydet
uk: Записати повідомлення
vi: Ghi âm một tin nhắn

source: Record a message in Community Feed and get {points} points in the leaderboard
uk: Запишіть повідомлення у стрічці спільноти та отримайте {points} балів у таблиці лідерів

source: Record a welcome message to our community of learners.
de: Nehmen Sie eine Willkommensnachricht für unsere Gemeinschaft von Lernenden auf.
es: Graba un mensaje de bienvenida para nuestra comunidad de estudiantes.
id: Rekam pesan sambutan untuk komunitas pembelajar kami.
it: Registra un messaggio di benvenuto alla nostra comunità di studenti.
ja: 学習者コミュニティへの歓迎メッセージを録音してください。
no: Spill inn en velkomstmelding til vårt samfunn av elever.
pl: Nagraj wiadomość powitalną dla naszej społeczności uczących się.
pt: Grave uma mensagem de boas-vindas para a nossa comunidade de alunos.
ru: Запишите приветственное сообщение для нашего сообщества учащихся.
sv: Spela in ett välkomstmeddelande till vår gemenskap av elever.
th: บันทึกข้อความต้อนรับสู่ชุมชนผู้เรียนของเรา
tr: Öğrenci topluluğumuza hoş geldiniz mesajı kaydedin.
uk: Запишіть вітальне повідомлення для нашої спільноти учнів.
vi: Ghi âm một thông điệp chào mừng đến cộng đồng người học của chúng tôi.

source: Record Answer
ar: تسجيل الإجابة
be: Запісаць адказ
da: Optag Svar
de: Antwort aufzeichnen
es: Grabar respuesta
fr: Enregistrer la réponse
id: Rekam Jawaban
it: Registrare Risposta
ja: 回答を記録する
ms: Rakaman Jawapan
no: Spill inn svar
pl: Nagraj odpowiedź
pt: Gravar Resposta
ru: Записать ответ
sv: Spela in svar
th: บันทึกคำตอบ
tr: Cevabı Kaydet
uk: Записати відповідь
vi: Ghi âm câu trả lời

source: Record answer
ar: سجل الإجابة
be: Запісаць адказ
da: Optag svar
de: Antwort aufzeichnen
es: Grabar respuesta
fr: Enregistrer la réponse
id: Rekam jawaban
it: Registra risposta
ja: 回答を記録
ms: Rekod jawapan
no: Ta opp svar
pl: Nagraj odpowiedź
pt: Gravar resposta
ru: Записать ответ
sv: Spela in svar
th: บันทึกคำตอบ
tr: Cevabı kaydet
uk: Записати відповідь
vi: Ghi âm câu trả lời

source: Record Message
ar: سجل الرسالة
be: Запісаць паведамленне
da: Optag besked
de: Nachricht aufzeichnen
es: Grabar mensaje
fr: Enregistrez le Message
id: Rekam Pesan
it: Registra Messaggio
ja: メッセージを記録
ms: Rakam Mesej
no: Ta opp melding
pl: Nagraj Wiadomość
pt: Gravar Mensagem
ru: Записать Сообщение
sv: Spela in meddelande
th: บันทึกข้อความ
tr: Mesaj Kaydet
uk: Записати повідомлення
vi: Ghi Tin Nhắn

source: Record more
ar: سجل المزيد
be: Запісаць яшчэ
da: Optag mere
de: Mehr aufnehmen
es: Grabar más
fr: Enregistrer plus
id: Rekam lebih banyak
it: Registra di più
ja: 録音を続ける
ms: Rekod lebih banyak
no: Opptak mer
pl: Nagraj więcej
pt: Gravar mais
ru: Записать больше
sv: Spela in mer
th: บันทึกเพิ่มเติม
tr: Daha fazla kaydet
uk: Записати більше
vi: Ghi âm thêm

source: Record your description
ar: سجل وصفك
be: Запішыце свой апісанне
da: Optag din beskrivelse
de: Nehmen Sie Ihre Beschreibung auf
es: Graba tu descripción
fr: Enregistrez votre description
id: Rekam deskripsi Anda
it: Registra la tua descrizione
ja: あなたの説明を録音してください
ms: Rakamkan deskripsi anda
no: Registrer din beskrivelse
pl: Nagraj swój opis
pt: Grave a sua descrição
ru: Запишите свое описание
sv: Spela in din beskrivning
th: บันทึกคำอธิบายของคุณ
tr: Açıklamanızı kaydedin
uk: Запишіть свій опис
vi: Ghi lại mô tả của bạn

source: Record your message
no: Ta opp meldingen din
uk: Запишіть ваше повідомлення
