Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Work through a technical issue while speaking with a helpful support agent. Perfect for practicing how to explain a problem clearly and follow troubleshooting steps. #### Why You Should Play *Calling Technical Support* 1. Learn to describe device or software issues in a concise way. 2. Build confidence when interacting with customer support agents. 3. Master troubleshooting terminology and instructions. 4. Understand how to ask relevant questions and confirm details. 5. Develop problem-solving skills in a technical context. #### How the Scenario Works You’ll act as a caller seeking help with a technical issue, while the AI plays the support agent. The agent will ask for details, guide you through possible solutions, and offer next steps. This scenario helps you get comfortable navigating tech problems and communicating solutions.
ar: اعمل من خلال مشكلة تقنية أثناء التحدث مع وكيل دعم مفيد. مثالي لممارسة كيفية شرح المشكلة بوضوح واتباع خطوات استكشاف الأخطاء وإصلاحها. #### لماذا يجب عليك لعب *الاتصال بالدعم الفني* 1. تعلم كيفية وصف مشاكل الأجهزة أو البرامج بشكل مختصر. 2. بناء الثقة عند التفاعل مع وكلاء دعم العملاء. 3. إتقان مصطلحات وتعليمات استكشاف الأخطاء وإصلاحها. 4. فهم كيفية طرح أسئلة ذات صلة وتأكيد التفاصيل. 5. تطوير مهارات حل المشكلات في سياق تقني. #### كيف تعمل السيناريوهات ستعمل كمتصل يبحث عن مساعدة بشأن مشكلة تقنية، بينما تلعب الذكاء الاصطناعي دور وكيل الدعم. سوف يطلب الوكيل تفاصيل، ويوجهك خلال الحلول المحتملة، ويعرض خطوات التالية. يساعدك هذا السيناريو على الشعور بالراحة في التنقل بين مشكلات التقنية والتواصل حول الحلول.
be: Працуйце над тэхнічнай праблемай, размаўляючы з карысным агентам падтрымкі. Выдатнае цвічэнне для вправы ў дакладным пастаўленні праблем і следаванні парадам па выліку праблем. #### Чаму варта гуляць *У дзяржаўе з тэхнічнай падтрымкай* 1. Вывучайце, як каротка апісваць праблемы з прыборам або праграмным забеспячэннем. 2. Пабудуйце ўпэўненасць падчас узаемадзеяння з агентамі падтрымкі кліентаў. 3. Апануйце тэрміналогію і інструкціі па выліку праблем. 4. Зразумейце, як ставіць адпаведныя пытанні і пацвярджваць дэталі. 5. Развівайце навыкі рашэння праблем у тэхнічным кантэксце. #### Як працуе сцэнар Вы будзеце выступаць у ролі абанента, які шукае дапамогу ў рашэнні тэхнічнай праблемы, а штучны інтэлект будзе выступаць у ролі агента падтрымкі. Агент будзе запытваць дэталі, кіраваць вас праз магчымыя рашэнні, і прапануе наступныя крокі. Гэты сцэнар дапамагае вам адчуваць сябе камфортна, навігуючы па тэхнічных праблемах і камунікацыі рашэнняў.
da: Arbejd gennem et teknisk problem, mens du taler med en hjælpsom supportmedarbejder. Perfekt til at øve, hvordan man klart forklarer et problem og følger fejlfindingstrin. #### Derfor bør du spille *Ringer Teknisk Support* 1. Lær at beskrive enheds- eller softwareproblemer på en præcis måde. 2. Opbyg selvtillid når du interagerer med kundesupport medarbejdere. 3. Mester terminologi og instruktioner til fejlfinding. 4. Forstå hvordan man stiller relevante spørgsmål og bekræfter detaljer. 5. Udvikl problemløsningsevner i en teknisk kontekst. #### Sådan fungerer scenariet Du vil agere som en opkalder, der søger hjælp med et teknisk problem, mens AI spiller supportmedarbejderen. Medarbejderen vil bede om detaljer, guide dig gennem mulige løsninger og tilbyde næste skridt. Dette scenarie hjælper dig med at blive komfortabel med at navigere i tekniske problemer og kommunikere løsninger.
de: Arbeite an einem technischen Problem, während du mit einem hilfsbereiten Support-Agenten sprichst. Perfekt zum Üben, wie man ein Problem klar erklärt und die Schritte zur Fehlersuche befolgt. #### Warum du *Technischen Support Anrufen* spielen solltest 1. Lerne, Geräte- oder Softwareprobleme prägnant zu beschreiben. 2. Baue Vertrauen auf, wenn du mit Kundenservicemitarbeitern interagierst. 3. Meistere die Terminologie und Anweisungen zur Fehlersuche. 4. Verstehe, wie man relevante Fragen stellt und Details bestätigt. 5. Entwickle Problemlösungsfähigkeiten in einem technischen Kontext. #### Wie das Szenario funktioniert Du wirst als Anrufer agieren, der Hilfe bei einem technischen Problem sucht, während die KI den Support-Agenten spielt. Der Agent wird um Details bitten, dich durch mögliche Lösungen führen und nächste Schritte anbieten. Dieses Szenario hilft dir, dich im Umgang mit technischen Problemen und der Kommunikation von Lösungen wohler zu fühlen.
fr: Travaillez sur un problème technique tout en parlant avec un agent de support serviable. Parfait pour s'exercer à expliquer un problème clairement et à suivre des étapes de dépannage. #### Pourquoi vous devriez jouer à *Appeler le support technique* 1. Apprenez à décrire les problèmes de dispositifs ou de logiciels de manière concise. 2. Renforcez votre confiance lors des interactions avec des agents du support client. 3. Maîtrisez la terminologie et les instructions de dépannage. 4. Comprenez comment poser des questions pertinentes et confirmer les détails. 5. Développez des compétences en résolution de problèmes dans un contexte technique. #### Comment fonctionne le scénario Vous agirez en tant qu'appelant cherchant de l'aide pour un problème technique, tandis que l'IA jouera le rôle de l'agent de support. L'agent demandera des détails, vous guidera à travers des solutions possibles et proposera les prochaines étapes. Ce scénario vous aide à vous sentir à l'aise pour naviguer dans les problèmes techniques et communiquer des solutions.
id: Kerjakan masalah teknis sambil berbicara dengan agen dukungan yang membantu. Sempurna untuk berlatih menjelaskan masalah dengan jelas dan mengikuti langkah-langkah pemecahan masalah. #### Mengapa Anda Harus Bermain *Memanggil Dukungan Teknis* 1. Pelajari cara menggambarkan masalah perangkat atau perangkat lunak dengan cara yang ringkas. 2. Tingkatkan kepercayaan diri saat berinteraksi dengan agen dukungan pelanggan. 3. Kuasai terminologi dan instruksi pemecahan masalah. 4. Pahami cara mengajukan pertanyaan yang relevan dan mengonfirmasi detail. 5. Kembangkan keterampilan memecahkan masalah dalam konteks teknis. #### Cara Kerja Skenario Anda akan bertindak sebagai penelepon yang mencari bantuan dengan masalah teknis, sementara AI berperan sebagai agen dukungan. Agen akan meminta detail, membimbing Anda melalui solusi yang mungkin, dan menawarkan langkah-langkah selanjutnya. Skenario ini membantu Anda merasa nyaman dalam menghadapi masalah teknologi dan mengkomunikasikan solusi.
it: Lavora su un problema tecnico mentre parli con un agente di supporto disponibile. Perfetto per esercitarsi a spiegare un problema in modo chiaro e seguire i passaggi di risoluzione dei problemi. #### Perché dovresti giocare a *Chiamare il Supporto Tecnico* 1. Impara a descrivere problemi di dispositivi o software in modo conciso. 2. Costruisci fiducia nell'interazione con gli agenti del supporto clienti. 3. Padroneggia la terminologia e le istruzioni per la risoluzione dei problemi. 4. Comprendi come porre domande pertinenti e confermare i dettagli. 5. Sviluppa abilità di problem-solving in un contesto tecnico. #### Come funziona lo scenario Agirai come un chiamante che cerca aiuto per un problema tecnico, mentre l'IA interpreta l'agente di supporto. L'agente chiederà dettagli, ti guiderà attraverso possibili soluzioni e offrirà i prossimi passi. Questo scenario ti aiuta a sentirti a tuo agio nell'affrontare problemi tecnologici e nel comunicare soluzioni.
ja: 技術的な問題を解決するために、役立つサポートエージェントと話し合います。問題を明確に説明し、トラブルシューティングの手順に従う練習に最適です。 #### *テクニカルサポートへの電話*をプレイすべき理由 1. デバイスやソフトウェアの問題を簡潔に説明する方法を学ぶ。 2. カスタマーサポートエージェントとのやり取りで自信をつける。 3. トラブルシューティング用語と指示を習得する。 4. 関連する質問を行い、詳細を確認する方法を理解する。 5. 技術的な文脈で問題解決能力を育成する。 #### シナリオの進行方法 あなたは技術的な問題の助けを求める電話の caller 役を演じ、AI がサポートエージェントを演じます。エージェントは詳細を尋ね、可能な解決策を案内し、次のステップを提案します。このシナリオは、技術的な問題に対処し、解決策をコミュニケーションするのに慣れる手助けをします。
ms: Bekerja melalui isu teknikal sambil bercakap dengan ejen sokongan yang membantu. Sesuai untuk berlatih cara menerangkan masalah dengan jelas dan mengikuti langkah-langkah penyelesaian masalah. #### Mengapa Anda Perlu Bermain *Memanggil Sokongan Teknikal* 1. Belajar untuk menerangkan isu peranti atau perisian dengan cara yang ringkas. 2. Membangunkan keyakinan ketika berinteraksi dengan ejen sokongan pelanggan. 3. Menguasai istilah dan arahan penyelesaian masalah. 4. Memahami cara mengajukan soalan yang relevan dan mengesahkan butiran. 5. Membangunkan kemahiran menyelesaikan masalah dalam konteks teknikal. #### Cara Senario Bekerja Anda akan bertindak sebagai pemanggil yang mencari bantuan dengan isu teknikal, sementara AI berperanan sebagai ejen sokongan. Ejen akan meminta butiran, membimbing anda melalui penyelesaian yang mungkin, dan menawarkan langkah seterusnya. Senario ini membantu anda berasa selesa mengatasi masalah teknologi dan komunikasi penyelesaian.
no: Arbeid med et teknisk problem mens du snakker med en hjelpsom supportagent. Perfekt for å øve på hvordan du forklarer et problem klart og følger feilsøkingstrinn. #### Hvorfor du bør spille *Ringe Teknisk Support* 1. Lær å beskrive enhets- eller programvareproblemer på en konsis måte. 2. Bygg selvtillit når du interagerer med kundestøtteagenter. 3. Mestre feilsøkingsterminologi og instruksjoner. 4. Forstå hvordan du stiller relevante spørsmål og bekrefter detaljer. 5. Utvikle problemløsningsevner i en teknisk kontekst. #### Hvordan scenariet fungerer Du vil opptre som en innringer som søker hjelp med et teknisk problem, mens AI spiller supportagenten. Agenten vil be om detaljer, veilede deg gjennom mulige løsninger og tilby neste trinn. Dette scenariet hjelper deg å føle deg komfortabel med å navigere i tekniske problemer og kommunisere løsninger.
pl: Pracuj nad technicznym problemem, rozmawiając z pomocnym agentem wsparcia. Idealne do ćwiczenia, jak jasno wyjaśnić problem i przejść przez kroki rozwiązywania problemów. #### Dlaczego warto grać w *Zadzwonić do wsparcia technicznego* 1. Naucz się opisywać problemy z urządzeniem lub oprogramowaniem w zwięzły sposób. 2. Zbuduj pewność siebie podczas interakcji z agentami wsparcia klienta. 3. Opanuj terminologię i instrukcje dotyczące rozwiązywania problemów. 4. Zrozum, jak zadawać odpowiednie pytania i potwierdzać szczegóły. 5. Rozwiń umiejętności rozwiązywania problemów w kontekście technicznym. #### Jak działa ten scenariusz Będziesz działać jako osoba dzwoniąca po pomoc w sprawie problemu technicznego, podczas gdy AI odegra rolę agenta wsparcia. Agent poprosi o szczegóły, poprowadzi cię przez możliwe rozwiązania i zaproponuje następne kroki. Ten scenariusz pomoże ci poczuć się komfortowo w nawigacji po problemach technologicznych i komunikowaniu rozwiązań.
pt: Trabalhe em um problema técnico enquanto fala com um agente de suporte prestativo. Perfeito para praticar como explicar um problema de forma clara e seguir passos de solução de problemas. #### Por que você deve jogar *Chamando o Suporte Técnico* 1. Aprenda a descrever problemas de dispositivo ou software de maneira concisa. 2. Aumente a confiança ao interagir com agentes de suporte ao cliente. 3. Domine a terminologia e as instruções de solução de problemas. 4. Entenda como fazer perguntas relevantes e confirmar detalhes. 5. Desenvolva habilidades de resolução de problemas em um contexto técnico. #### Como o Cenário Funciona Você atuará como um chamador em busca de ajuda com um problema técnico, enquanto a IA desempenha o papel de agente de suporte. O agente pedirá detalhes, orientará você através de possíveis soluções e oferecerá os próximos passos. Este cenário ajuda você a se sentir confortável navegando por problemas de tecnologia e comunicando soluções.
ru: Работайте над технической проблемой, общаясь с полезным агентом поддержки. Отлично подходит для практики объяснения проблемы четко и следования шагам по устранению неполадок. #### Почему стоит играть в *Вызов технической поддержки* 1. Научитесь описывать проблемы с устройствами или программным обеспечением лаконично. 2. Увеличьте уверенность при взаимодействии с агентами службы поддержки. 3. Освойте терминологию и инструкции по устранению неполадок. 4. Поймите, как задавать релевантные вопросы и подтверждать детали. 5. Развивайте навыки решения проблем в техническом контексте. #### Как работает сценарий Вы будете выступать в роли звонящего, обращающегося за помощью по техническому вопросу, в то время как ИИ играет роль агента поддержки. Агент будет запрашивать детали, направлять вас через возможные решения и предлагать следующие шаги. Этот сценарий помогает вам стать более уверенным в навигации по техническим проблемам и в общении о решениях.
th: ทำงานผ่านปัญหาทางเทคนิคในขณะที่พูดคุยกับตัวแทนสนับสนุนที่เป็นประโยชน์ เหมาะสำหรับการฝึกฝนวิธีอธิบายปัญหาให้ชัดเจน และปฏิบัติตามขั้นตอนการแก้ไข #### เหตุผลที่คุณควรเล่น *Calling Technical Support* 1. เรียนรู้การอธิบายปัญหาของอุปกรณ์หรือซอฟต์แวร์ในลักษณะที่กระชับ 2. สร้างความมั่นใจเมื่อมีปฏิสัมพันธ์กับตัวแทนฝ่ายสนับสนุนลูกค้า 3. เชี่ยวชาญในคำศัพท์และคำแนะนำการแก้ไขปัญหา 4. เข้าใจวิธีการตั้งคำถามที่เกี่ยวข้องและยืนยันรายละเอียด 5. พัฒนาทักษะการแก้ปัญหาในบริบททางเทคนิค #### วิธีการทำงานของสถานการณ์ คุณจะทำตัวเป็นผู้โทรที่กำลังขอความช่วยเหลือเกี่ยวกับปัญหาทางเทคนิค ขณะที่ AI จะทำหน้าที่เป็นตัวแทนสนับสนุน ตัวแทนจะขอรายละเอียด นำคุณผ่านทางเลือกที่เป็นไปได้ และเสนอขั้นตอนถัดไป สถานการณ์นี้ช่วยให้คุณรู้สึกสบายใจในการจัดการปัญหาทางเทคโนโลยีและการสื่อสารวิธีแก้ไข
tr: Bir destek temsilcisi ile konuşurken bir teknik sorunu çözün. Sorunu net bir şekilde açıklamayı ve sorun giderme adımlarını takip etmeyi pratik yapmak için mükemmel. #### *Teknik Destek Aramak* Oynamanız İçin Nedenler 1. Cihaz veya yazılım sorunlarını kısaca tanımlamayı öğrenin. 2. Müşteri destek temsilcileriyle etkileşimde güven inşa edin. 3. Sorun giderme terimlerini ve talimatlarını ustalıkla öğrenin. 4. İlgili sorular sormayı ve detayları doğrulamayı anlayın. 5. Teknik bir bağlamda problem çözme becerileri geliştirin. #### Senaryonun Nasıl Çalıştığı Bir teknik sorunla ilgili yardım arayan bir çağrı yapan kişi olarak hareket edeceksiniz, AI ise destek temsilcisini oynayacak. Temsilci detaylar isteyecek, olası çözümler üzerinden sizi yönlendirecek ve sonraki adımları sunacak. Bu senaryo, teknoloji problemlerinde gezinmeyi ve çözümleri iletmeyi rahatça yapmanıza yardımcı olur.
uk: Work through a technical issue while speaking with a helpful support agent. Perfect for practicing how to explain a problem clearly and follow troubleshooting steps. #### Чому варто грати в *Виклик технічної підтримки* 1. Навчіться описувати проблеми з пристроями або програмним забезпеченням стисло. 2. Набудьте впевненості у спілкуванні з агентами служби підтримки клієнтів. 3. Опануйте термінологію та інструкції з усунення неполадок. 4. Зрозумійте, як ставити відповідні запитання та підтверджувати деталі. 5. Розвивайте навички вирішення проблем у технічному контексті. #### Як працює сценарій Ви будете діяти як абонент, що шукає допомогу з технічною проблемою, у той час як ШІ буде грати роль агента підтримки. Агент буде запитувати деталі, направляти вас через можливі рішення та пропонувати подальші кроки. Цей сценарій допоможе вам звикнути до навігації технічних проблем і спілкування рішень.
vi: Làm việc qua một vấn đề kỹ thuật trong khi nói chuyện với một đại diện hỗ trợ hữu ích. Hoàn hảo để thực hành cách giải thích một vấn đề rõ ràng và theo dõi các bước xử lý sự cố. #### Tại sao bạn nên chơi *Gọi Hỗ Trợ Kỹ Thuật* 1. Học cách mô tả các vấn đề về thiết bị hoặc phần mềm một cách ngắn gọn. 2. Xây dựng sự tự tin khi tương tác với các đại diện hỗ trợ khách hàng. 3. Làm chủ thuật ngữ và hướng dẫn xử lý sự cố. 4. Hiểu cách đặt câu hỏi liên quan và xác nhận chi tiết. 5. Phát triển kỹ năng giải quyết vấn đề trong bối cảnh kỹ thuật. #### Cách hoạt động của kịch bản Bạn sẽ đóng vai người gọi seeking trợ giúp với một vấn đề kỹ thuật, trong khi AI đóng vai đại diện hỗ trợ. Đại diện sẽ yêu cầu chi tiết, hướng dẫn bạn qua các giải pháp khả thi và đưa ra các bước tiếp theo. Kịch bản này giúp bạn cảm thấy thoải mái hơn khi điều hướng các vấn đề công nghệ và giao tiếp về các giải pháp.

source: Wrap up the interview with gratitude and confidence. Use these phrases to end on a positive note:
ar: أنهِ المقابلة بالامتنان والثقة. استخدم هذه العبارات لتنتهي على ملاحظة إيجابية:
be: Завяршыце інтэрвію з падзякаваннем і упэўненасцю. Выкарыстоўвайце гэтыя фразы для пазітыўнага заканчэння:
da: Afslut interviewet med taknemmelighed og selvtillid. Brug disse sætninger til at slutte på en positiv note:
de: Beenden Sie das Interview mit Dankbarkeit und Selbstvertrauen. Verwenden Sie diese Ausdrücke, um auf einer positiven Note zu enden:
es: Finaliza la entrevista con gratitud y confianza. Usa estas frases para terminar con una nota positiva:
fr: Terminez l'entretien avec gratitude et confiance. Utilisez ces phrases pour finir sur une note positive:
id: Akhiri wawancara dengan rasa syukur dan percaya diri. Gunakan frasa-frasa ini untuk berakhir dengan catatan positif:
it: Concludi l'intervista con gratitudine e fiducia. Usa queste frasi per finire su una nota positiva:
ja: インタビューを感謝と自信を持って締めくくりましょう。次のフレーズを使用して、ポジティブな印象で終わりましょう:
ms: Ketepikan temu bual dengan rasa syukur dan keyakinan. Gunakan frasa ini untuk mengakhiri dengan nada positif:
no: Avslutt intervjuet med takknemlighet og selvsikkerhet. Bruk disse frasene for å avslutte på en positiv måte:
pl: Zakończ rozmowę z wdzięcznością i pewnością siebie. Użyj tych zwrotów, aby zakończyć na pozytywnej nucie:
pt: Encerre a entrevista com gratidão e confiança. Use estas frases para terminar com uma nota positiva:
ru: Завершите интервью с благодарностью и уверенностью. Используйте эти фразы, чтобы закончить на позитивной ноте:
sv: Avsluta intervjun med tacksamhet och självförtroende. Använd dessa fraser för att avsluta på en positiv anteckning:
th: สรุปการสัมภาษณ์ด้วยความขอบคุณและความมั่นใจ ใช้วลีเหล่านี้เพื่อที่จะสิ้นสุดอย่างมีแง่บวก:
tr: Mülakatı minnettarlık ve güvenle tamamlayın. Olumlu bir notla sonlandırmak için bu ifadeleri kullanın:
uk: Завершіть інтерв'ю з вдячністю та впевненістю. Використовуйте ці фрази, щоб закінчити на позитивній ноті:
vi: Kết thúc cuộc phỏng vấn với lòng biết ơn và tự tin. Sử dụng những cụm từ sau để kết thúc một cách tích cực:

source: Wrong Link
ar: رابط خاطئ
be: Няправільная спасылка
da: Forkert link
de: Falscher Link
es: Enlace Incorrecto
fr: Lien incorrect
id: Tautan Salah
it: Link errato
ja: リンクが間違っています
ms: Pautan Yang Salah
no: Feil lenke
pl: Zły link
pt: Link incorreto
ru: Неправильная ссылка
sv: Fel länk
th: ลิงก์ผิด
tr: Yanlış Bağlantı
uk: Неправильне посилання
vi: Liên kết sai

source: Year
id: Tahun
it: Anno
ja: 年
no: År
pl: Rok
ru: Год
sv: År
uk: Рік

source: year
id: tahun
it: anno
ja: 年
no: år
pl: rok
ru: год
sv: år
uk: рік

source: Yes, Delete account
ar: نعم، احذف الحساب
be: Так, выдаліць уліковы запіс
da: Ja, Slet konto
de: Ja, Konto löschen
es: Sí, Eliminar cuenta
fr: Oui, Supprimer le compte
id: Ya, Hapus akun
it: Sì, Elimina account
ja: はい、アカウントを削除します
ms: Ya, Padam akaun
no: Ja, slett konto
pl: Tak, Usuń konto
pt: Sim, Excluir conta
ru: Да, удалить аккаунт
sv: Ja, Radera konto
th: ใช่, ลบบัญชี
tr: Evet, Hesabı Sil
uk: Так, видалити аккаунт
vi: Có, Xóa tài khoản
