Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Your job interview preparation partner
ar: شريكك في التحضير لمقابلات العمل
be: Ваш партнёр па падрыхтоўцы да сумоўя на працу
da: Din jobsamtale forberedelsespartner
de: Ihr Partner für die Vorbereitung auf das Vorstellungsgespräch
es: Tu socio de preparación para entrevistas de trabajo
fr: Votre partenaire de préparation aux entretiens d'embauche
id: Rekan persiapan wawancara kerja Anda
it: Il tuo partner per la preparazione ai colloqui di lavoro
ja: 就職面接準備パートナー
ms: Rakan persediaan temu duga kerja anda
no: Din partner for forberedelse til jobbintervju
pl: Twój partner w przygotowaniu do rozmowy kwalifikacyjnej
pt: Seu parceiro de preparação para entrevistas de emprego
ru: Ваш партнёр по подготовке к собеседованию
sv: Din partner för förberedelse inför jobbintervjun
th: คู่หูสำหรับการเตรียมตัวสัมภาษณ์งานของคุณ
tr: İş görüşmesi hazırlık ortağınız
uk: Ваш партнер з підготовки до співбесіди на роботу
vi: Người bạn đồng hành chuẩn bị phỏng vấn xin việc của bạn

source: Your Language Level
ar: مستوى لغتك
be: Ваш узровень валоды
da: Din Sprog Niveau
de: Ihr Sprachniveau
es: Tu Nivel de Idioma
fr: Votre niveau de langue
id: Tingkat Bahasa Anda
it: Il tuo livello di lingua
ja: あなたの言語レベル
ms: Tahap Bahasa Anda
no: Ditt Språknivå
pl: Twój poziom językowy
pt: Seu Nível de Língua
ru: Ваш уровень языка
sv: Ditt Språknivå
th: ระดับภาษาของคุณ
tr: Dil Seviyeniz
uk: Ваш рівень мови
vi: Mức độ ngôn ngữ của bạn

source: Your Message
ar: رسالتك
be: Ваша паведамленне
da: Din besked
de: Ihre Nachricht
es: Tu mensaje
fr: Votre Message
id: Pesan Anda
it: Il tuo messaggio
ja: あなたのメッセージ
ms: Mesej Anda
no: Din Melding
pl: Twoja wiadomość
pt: A sua mensagem
ru: Ваше сообщение
sv: Ditt meddelande
th: ข้อความของคุณ
tr: Mesajınız
uk: Ваше Повідомлення
vi: Tin nhắn của bạn

source: Your message...
ar: رسالتك...
be: Ваша паведамленне...
da: Din besked...
de: Ihre Nachricht...
es: Tu mensaje...
fr: Votre message...
id: Pesan Anda...
it: Il tuo messaggio...
ja: あなたのメッセージ...
ms: Mesej anda...
no: Din melding...
pl: Twoja wiadomość...
pt: A sua mensagem...
ru: Ваше сообщение...
sv: Ditt meddelande...
th: ข้อความของคุณ...
tr: Mesajınız...
uk: Ваше повідомлення...
vi: Tin nhắn của bạn...

source: Your Native Language:
ar: لغتك الأم:
be: Ваша Родная Мова:
da: Dit modersmål:
de: Ihre Muttersprache:
es: Tu lengua nativa:
fr: Votre langue maternelle :
id: Bahasa Ibu Anda:
it: La tua lingua madre:
ja: あなたの母国語:
ms: Bahasa Ibu Anda:
no: Ditt morsmål:
pl: Twój język ojczysty:
pt: O seu idioma nativo:
ru: Ваш родной язык:
sv: Ditt modersmål:
th: ภาษาแม่ของคุณ:
tr: Ana Diliniz:
uk: Ваша рідна мова:
vi: Ngôn ngữ của bạn:

source: Your practice plan
de: Ihr Übungsplan
es: Su plan de práctica
id: Rencana latihan Anda
it: Il tuo piano di pratica
ja: あなたの練習計画
no: Din treningsplan
pl: Twój plan praktyki
pt: Seu plano de prática
ru: Ваш план практики
sv: Din träningsplan
th: แผนการฝึกฝนของคุณ
tr: Uygulama planınız
uk: Ваш план практики
vi: Kế hoạch luyện tập của bạn

source: Your questions answered
ar: أسئلتك تم الإجابة عليها
be: Вашы пытанні адказаны
da: Dine spørgsmål besvaret
de: Ihre Fragen beantwortet
es: Tu preguntas contestadas
fr: Vos questions répondues
id: Pertanyaan Anda dijawab
it: Le tue domande ricevono risposta
ja: あなたの質問にお答えします
ms: Soalan anda dijawab
no: Dine spørsmål besvart
pl: Twoje pytania zostały odpowiedziane
pt: Suas perguntas respondidas
ru: Ваши вопросы отвечены
sv: Dina frågor besvarade
th: คำถามของคุณได้รับการตอบแล้ว
tr: Sorularınız yanıtlandı
uk: Ваші запитання отримали відповіді
vi: Câu hỏi của bạn đã được giải đáp

source: Your refund request has been submitted. We will get back to you soon.
de: Ihr Rückerstattungsantrag wurde eingereicht. Wir werden uns in Kürze bei Ihnen melden.
es: Su solicitud de reembolso ha sido enviada. Nos pondremos en contacto con usted pronto.
id: Permintaan pengembalian dana Anda telah diajukan. Kami akan segera menghubungi Anda kembali.
it: La tua richiesta di rimborso è stata inviata. Ti ricontatteremo a breve.
ja: あなたの返金リクエストが提出されました。すぐにご連絡いたします。
no: Forespørselen din om refusjon har blitt sendt inn. Vi vil ta kontakt med deg snart.
pl: Twoje żądanie zwrotu zostało złożone. Wkrótce się z Tobą skontaktujemy.
pt: Sua solicitação de reembolso foi enviada. Entraremos em contato em breve.
ru: Ваш запрос на возврат средств был отправлен. Мы свяжемся с вами в ближайшее время.
sv: Din återbetalningsbegäran har skickats in. Vi kommer att återkomma till dig snart.
th: คำขอคืนเงินของคุณได้ถูกส่งแล้ว เราจะติดต่อกลับหาคุณเร็ว ๆ นี้
tr: İade talebiniz gönderildi. En kısa sürede size geri dönüş yapacağız.
uk: Ваш запит на відшкодування було подано. Ми зв'яжемося з вами найближчим часом.
vi: Yêu cầu hoàn tiền của bạn đã được gửi đi. Chúng tôi sẽ sớm liên hệ lại với bạn.

source: Your Streak
ja: あなたの連続学習日数
no: Din Rekke
uk: Ваш Стрік

source: Your subscription has been successfully changed.
ar: لقد تم تغيير اشتراكك بنجاح.
be: Ваш падпісак быў паспяхова зменены.
da: Dit abonnement er blevet ændret med succes.
de: Ihr Abonnement wurde erfolgreich geändert.
es: Su suscripción se ha cambiado con éxito.
fr: Votre abonnement a été modifié avec succès.
id: plaintext Langganan Anda telah berhasil diubah.
it: Il tuo abbonamento è stato modificato con successo.
ja: サブスクリプションが正常に変更されました。
ms: Langganan anda telah berjaya diubah.
no: Abonnementet ditt har blitt endret vellykket.
pl: Twoja subskrypcja została pomyślnie zmieniona.
pt: Sua assinatura foi alterada com sucesso.
ru: Ваш подписка была успешно изменена.
sv: Din prenumeration har ändrats framgångsrikt.
th: การสมัครของคุณได้ถูกเปลี่ยนแปลงเรียบร้อยแล้ว
tr: Aboneliğiniz başarıyla değiştirildi.
uk: Вашу підписку успішно змінено.
vi: Gói đăng ký của bạn đã được thay đổi thành công.

source: Your transcripts are securely stored in our service
ar: plaintext يتم تخزين النصوص الخاصة بك بشكل آمن في خدمتنا
be: Вашы транскрыпцыі надзейна захоўваюцца ў нашым сэрвісе
da: Dine udskrifter er sikkert gemt i vores tjeneste
de: Ihre Transkripte werden sicher in unserem Dienst aufbewahrt
es: Tus expedientes están almacenados de forma segura en nuestro servicio
fr: Vos transcriptions sont stockées en toute sécurité dans notre service
id: Transkrip Anda disimpan dengan aman di layanan kami
it: I tuoi trascrizioni sono conservati in modo sicuro nel nostro servizio
ja: あなたの成績証明書は、当サービスで安全に保存されています。
ms: Transkrip anda disimpan dengan selamat dalam perkhidmatan kami
no: Dine utskrifter lagres trygt i vår tjeneste
pl: Twoje transkrypcje są bezpiecznie przechowywane w naszej usłudze
pt: Seus históricos estão armazenados de forma segura em nosso serviço
ru: Ваши стенограммы надежно хранятся в нашем сервисе
sv: Dina utskrifter lagras säkert i vår tjänst
th: บันทึกการสนทนาของคุณถูกจัดเก็บอย่างปลอดภัยในบริการของเรา
tr: Transkriptleriniz hizmetimizde güvenli bir şekilde saklanmaktadır
uk: Ваші транскрипти надійно зберігаються в нашому сервісі
vi: Bảng điểm của bạn được lưu trữ an toàn trong dịch vụ của chúng tôi

source: Your unlimited access is about to expire soon.
id: Akses tak terbatas Anda akan segera berakhir.
it: Il tuo accesso illimitato sta per scadere.
ja: あなたの無制限アクセスはまもなく期限切れになります。
no: Din ubegrensede tilgang er i ferd med å utløpe snart.
pl: Twój nieograniczony dostęp wkrótce wygaśnie.
ru: Ваш неограниченный доступ скоро истечет.
sv: Din obegränsade åtkomst kommer snart att upphöra.
uk: Ваш необмежений доступ скоро закінчиться.

source: Your unlimited access is active until {date}
id: Akses tak terbatas Anda aktif hingga {date}
it: Il tuo accesso illimitato è attivo fino al {date}
ja: あなたの無制限アクセスは{date}までアクティブです
no: Din ubegrensede tilgang er aktiv til {dato}
pl: Twój nieograniczony dostęp jest aktywny do {date}
ru: Ваш неограниченный доступ активен до {date}
sv: Ditt obegränsade tillträde är aktivt till {date}
uk: Ваш необмежений доступ активний до {date}

source: You’re asked to **design systems on the spot**, but no one tells you what “good” looks like
ar: أنت مطالب بـ **تصميم الأنظمة بشكل فوري**، لكن لا أحد يخبرك كيف يبدو "الجيد"
be: Вас просяць **распрацаваць сістэмы на месцы**, але ніхто не кажа вам, як выглядае «добра»
da: Du bliver bedt om at **designe systemer på stedet**, men ingen fortæller dig, hvordan "godt" ser ud.
de: Du wirst gebeten, **Systeme spontan zu entwerfen**, aber niemand sagt dir, wie "gut" aussieht
es: Se te pide que **diseñes sistemas en el momento**, pero nadie te dice cómo es un diseño "bueno".
fr: Vous êtes invité à **concevoir des systèmes sur-le-champ**, mais personne ne vous dit à quoi ressemble le "bien".
id: Anda diminta untuk **merancang sistem secara spontan**, tetapi tidak ada yang memberi tahu seperti apa rupa "baik".
it: Ti viene chiesto di **progettare sistemi sul momento**, ma nessuno ti dice come dovrebbe essere il risultato "buono"
ja: その場で**システムを設計する**よう求められますが、「良い」ものが何であるかは誰も教えてくれません
no: Du blir bedt om å **designe systemer på stedet**, men ingen forteller deg hvordan et "godt" system ser ut.
pl: Proszeni jesteście o **projektowanie systemów na miejscu**, ale nikt nie mówi wam, jak wygląda „dobro”
pt: Você é solicitado a **desenhar sistemas imediatamente**, mas ninguém lhe diz como é o “bom”.
ru: Вас просят **разрабатывать системы на месте**, но никто не говорит вам, как выглядит «хорошо»
sv: Du ombeds att **designa system på plats**, men ingen talar om för dig hur ett "bra" system ser ut
th: คุณถูกขอให้ **ออกแบบระบบในทันที** แต่ไม่มีใครบอกคุณเลยว่า "ดี" มันควรจะเป็นอย่างไร
tr: Sizden **anında sistem tasarlamanız** isteniyor, ancak kimse size "iyi"nin nasıl göründüğünü söylemiyor
uk: Вам пропонують **розробляти системи на місці**, але ніхто не пояснює, як виглядає "добре"
vi: Bạn được yêu cầu **thiết kế hệ thống ngay lập tức**, nhưng không ai nói cho bạn biết “tốt” trông như thế nào

source: {count} words
id: {count} kata
it: {count} parole
ja: {count} 語
no: {count} ord
ru: {count} слов
uk: {count} слів

source: {durationInSecond}s per turn
id: {durationInSecond} detik per giliran
it: {durationInSecond}s per turno
ja: {durationInSecond}秒ごとに順番
no: {durationInSecond}s per tur
uk: {durationInSecond}с за хід

source: {duration}s
id: {duration} d
ja: {duration}秒
no: {varighet}s
ru: {duration}с
uk: {duration}с

source: {numberOfRounds} rounds
id: {numberOfRounds} putaran
it: {numberOfRounds} round
ja: {numberOfRounds} ラウンド
no: {numberOfRounds} runder
uk: {numberOfRounds} раунди

source: {seconds}s
id: {seconds}d
it: {secondi}s
ja: {seconds}秒
ru: {seconds}с
uk: {seconds}с

source: {userName} challenges you to a debate!
ar: {userName} يتحداك في مناظرة!
be: {userName} кідае вам выклік на дэбаты!
da: {userName} udfordrer dig til en debat!
de: {userName} fordert Sie zu einer Debatte heraus!
es: {userName} ¡te reta a un debate!
fr: {userName} vous met au défi pour un débat !
id: {userName} menantang Anda untuk berdebat!
it: {userName} ti sfida a un dibattito!
ja: {userName} があなたにディベートを挑んでいます！
no: {userName} utfordrer deg til en debatt!
pl: {userName} wyzwał cię na debatę!
pt: {userName} desafia você para um debate!
ru: {userName} бросает вам вызов на дебаты!
sv: {userName} utmanar dig på en debatt!
th: {userName} ท้าให้คุณเข้าร่วมการดีเบต!
tr: {userName} sizi bir tartışmaya davet ediyor!
uk: {userName} кидає вам виклик на дебати!
vi: {userName} thách thức bạn tham gia một cuộc tranh luận!

source: {winnerName} wins!
id: {winnerName} menang!
it: {winnerName} vince!
ja: {winnerName} が勝ちました！
no: {winnerName} vinner!
ru: {winnerName} победил!
uk: {winnerName} перемагає!

source: — it’s important to engage in this short conversation before jumping into professional topics. Here are some useful English phrases to start off the interview:
ar: — من الأهمية القيام بهذه المحادثة القصيرة قبل الدخول في الموضوعات المهنية. هنا بعض العبارات الإنجليزية المفيدة لبدء المقابلة:
be: — важна заняцца гэтай кароткай размовай, перш чым прыступіць да прафесійных тэм. Вось некаторыя карысныя англійскія фразы для пачатку інтэрв'ю:
da: — det er vigtigt at deltage i denne korte samtale, før man hopper ind i professionelle emner. Her er nogle nyttige engelske vendinger til at starte interviewet:
de: — es ist wichtig, sich in dieses kurze Gespräch zu vertiefen, bevor man professionelle Themen anspricht. Hier sind einige nützliche englische Redewendungen, um das Interview zu beginnen:
es: — es importante participar en esta breve conversación antes de abordar temas profesionales. Aquí tienes algunas frases en inglés útiles para comenzar la entrevista:
fr: — il est important de s'engager dans cette courte conversation avant de plonger dans des sujets professionnels. Voici quelques expressions anglaises utiles pour commencer l'entretien :
id: — penting untuk melakukan percakapan singkat ini sebelum melompat ke topik profesional. Berikut adalah beberapa frasa bahasa Inggris yang berguna untuk memulai wawancara:
it: — è importante impegnarsi in questa breve conversazione prima di tuffarsi nei temi professionali. Ecco alcune frasi inglesi utili per iniziare l'intervista:
ja: — この短い会話に参加することは、専門的な話題に飛び込む前に重要です。ここに面接を始めるための便利な英語のフレーズをいくつか紹介します：
ms: — sangat penting untuk melibatkan diri dalam perbualan pendek ini sebelum melompat ke topik profesional. Berikut adalah beberapa frasa Inggeris yang berguna untuk memulakan temuduga:
no: — det er viktig å delta i denne korte samtalen før du hopper inn i profesjonelle emner. Her er noen nyttige engelske uttrykk for å starte intervjuet:
pl: — ważne jest, aby zaangażować się w tę krótką rozmowę przed poruszeniem tematów zawodowych. Oto kilka przydatnych angielskich zwrotów, które pomogą rozpocząć wywiad:
pt: — é importante participar desta breve conversa antes de mergulhar nos tópicos profissionais. Aqui estão algumas frases úteis em inglês para começar a entrevista:
ru: — важно провести этот короткий разговор перед тем, как переходить к профессиональным темам. Вот несколько полезных английских фраз для начала интервью:
sv: — det är viktigt att delta i denna korta konversation innan vi hoppar in i yrkesmässiga ämnen. Här är några användbara engelska fraser för att starta intervjun:
th: — มันสำคัญที่จะเริ่มการสนทนาสั้น ๆ นี้ก่อนที่จะข้ามไปสู่หัวข้อทางวิชาชีพ นี่คือคำพูดภาษาอังกฤษที่มีประโยชน์สำหรับการเริ่มต้นสัมภาษณ์:
tr: — Profesyonel konulara geçmeden önce bu kısa sohbete katılmak önemlidir. İşte röportajı başlatmak için kullanışlı bazı İngilizce ifadeler:
uk: — важливо задіяти цю коротку розмову, перш ніж приступати до професійних тем. Ось деякі корисні англійські фрази для початку інтерв'ю:
vi: — quan trọng là tham gia vào cuộc trò chuyện ngắn này trước khi nhảy vào các chủ đề chuyên nghiệp. Dưới đây là một số cụm từ tiếng Anh hữu ích để bắt đầu cuộc phỏng vấn:

source: .NET & ASP.NET Core
ar: .NET و ASP.NET Core
be: .NET і ASP.NET Core
es: .NET y ASP.NET Core
ja: .NET と ASP.NET Core
pl: .NET i ASP.NET Core
ru: .NET и ASP.NET Core

source: Access to all functionalities on app where AI is present: speaking, analyzing, role-plays, new words and runles creator.
ar: الوصول إلى جميع الوظائف في التطبيق حيث يتواجد الذكاء الاصطناعي: الكلام، التحليل، المحاكاة، كلمات جديدة ومبتكر القواعد والتعليمات.
be: Доступ да ўсіх функцыяў у дадатку, дзе прысутнічае ШІ: размова, аналіз, ролевыя гульні, стваральнік новых слоў і правілаў.
da: Adgang til alle funktioner på appen, hvor AI er til stede: tale, analyse, rollespil, nye ord og skabelse af regler.
de: Zugriff auf alle Funktionen in der App, in der KI vorhanden ist: sprechen, analysieren, Rollenspiele, neue Wörter und Runles-Ersteller.
es: Acceso a todas las funcionalidades en la aplicación donde está presente la IA: hablar, analizar, juegos de roles, creador de nuevas palabras y reglas.
fr: Accès à toutes les fonctionnalités de l'application où l'IA est présente : conversation, analyse, jeux de rôles, créateur de nouveaux mots et règles.
id: Akses ke semua fungsi di aplikasi di mana AI hadir: berbicara, menganalisis, peran-peran, kata-kata baru dan pembuat runles.
it: Accesso a tutte le funzionalità sull'app dove l'IA è presente: parlare, analizzare, giochi di ruolo, creatore di nuove parole e regole.
ja: AIが搭載されているアプリの全機能にアクセス：話す、分析する、ロールプレイ、新しい単語とルールの作成。
ms: Akses kepada semua fungsi dalam aplikasi di mana AI hadir: berbicara, menganalisis, peranan bermain, kata-kata baru dan pencipta runles.
no: Tilgang til alle funksjonaliteter i appen der AI er tilstede: tale, analyse, rollespill, nye ord og skaper av runler.
pl: Dostęp do wszystkich funkcji w aplikacji, w której obecna jest sztuczna inteligencja: mówienie, analiza, role-play'e, tworzenie nowych słów i zasad.
pt: Acesso a todas as funcionalidades do aplicativo onde a IA está presente: falando, analisando, encenando, criando novas palavras e regras.
ru: Доступ ко всем функциям в приложении, где присутствует ИИ: говорение, анализ, ролевые игры, создатель новых слов и правил.
sv: Åtkomst till alla funktioner i app där AI är närvarande: tala, analysera, rollspel, nya ord och runles skapare.
th: เข้าถึงฟังก์ชันทั้งหมดในแอปที่ AI อยู่: การพูด, การวิเคราะห์, การแสดงบทบาท, คำใหม่และการสร้างรันเลส
tr: AI'nın bulunduğu uygulamadaki tüm işlevlere erişim: konuşma, analiz, rol oyunları, yeni kelimeler ve kurallar oluşturucu.
vi: Truy cập vào tất cả các chức năng trên ứng dụng nơi AI hiện diện: nói chuyện, phân tích, hóa thân, tạo từ vựng mới và quy tắc.

source: Amount hours to buy
ar: عدد الساعات للشراء
be: Колькасць гадзін для набыцця
da: Antal timer til køb
de: Anzahl Stunden zu kaufen
es: Cantidad de horas para comprar
fr: Nombre d'heures à acheter
id: Jumlah jam untuk dibeli
it: Quantità di ore da acquistare
ja: 購入する時間の量
ms: Jumlah jam untuk dibeli
no: Antall timer å kjøpe
pl: Ilość godzin do zakupu
pt: Quantidade de horas para comprar
ru: Количество часов для покупки
sv: Antal timmar att köpa
th: จำนวนชั่วโมงที่จะซื้อ
tr: Satın alınacak saat miktarı
vi: Số giờ cần mua

source: Amount is too large. I appreciate your support, but let's keep it under $400
ar: المبلغ كبير جداً. أقدر دعمك، ولكن دعنا نحافظ عليه أقل من 400 دولار
be: Сума занадта вялікая. Я вельмі цаню вашу падтрымку, але давайце захаваем яе менш за 400 долараў.
da: Beløbet er for stort. Jeg værdsætter din støtte, men lad os holde det under $400
de: Der Betrag ist zu groß. Ich schätze Ihre Unterstützung, aber lassen Sie uns es unter $400 halten.
es: El monto es demasiado grande. Aprecio tu apoyo, pero mantengámoslo por debajo de los $400
fr: Le montant est trop élevé. J'apprécie votre soutien, mais gardons-le en dessous de 400 $
id: Jumlah terlalu besar. Saya menghargai dukungan Anda, tetapi mari kita tetap di bawah $400
it: L'importo è troppo grande. Apprezzo il tuo sostegno, ma cerchiamo di mantenerlo sotto i $400
ja: 金額が大きすぎます。あなたのサポートに感謝しますが、$400以下にしましょう。
ms: Jumlah adalah terlalu besar. Saya menghargai sokongan anda, tetapi mari kita kekalkan di bawah $400
no: Beløpet er for stort. Jeg setter pris på støtten din, men la oss holde det under $400
pl: Kwota jest zbyt duża. Doceniam Twoje wsparcie, ale utrzymajmy to poniżej 400$
pt: O valor é muito grande. Agradeço o seu apoio, mas vamos mantê-lo abaixo de $400
ru: Сумма слишком велика. Я ценю вашу поддержку, но давайте ограничимся $400
sv: Beloppet är för stort. Jag uppskattar ditt stöd, men låt oss hålla det under 400 dollar
th: จำนวนเงินมากเกินไป ฉันขอขอบคุณการสนับสนุนของคุณ แต่มาทำให้มันอยู่ใต้ 400 ดอลลาร์
tr: Miktar çok büyük. Desteğinizi takdir ediyorum, ancak bunu 400 doların altında tutalım.
vi: Số tiền quá lớn. Tôi đánh giá cao sự hỗ trợ của bạn, nhưng hãy giữ nó dưới $400

source: Buy more hours
ar: اشتر المزيد من الساعات
be: Купіць больш гадзін
da: Køb flere timer
de: Kaufe mehr Stunden
es: Compra más horas
fr: Acheter plus d'heures
id: Beli lebih banyak jam
it: Acquista più ore
ja: もっと時間を購入する
ms: Beli lebih banyak jam
no: Kjøp flere timer
pl: Kup więcej godzin
pt: Compre mais horas
ru: Купить больше часов
sv: Köp fler timmar
th: ซื้อชั่วโมงเพิ่มเติม
tr: Daha fazla saat satın al
vi: Mua thêm giờ
