Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: FluencyPal is best suited for learners who can hold basic conversations and want to improve fluency, accuracy, and confidence. It works well for pre-intermediate, intermediate, and advanced speakers and adapts to your level over time.
ar: FluencyPal هو الأنسب للمتعلمين الذين يمكنهم إجراء محادثات أساسية ويرغبون في تحسين الطلاقة، والدقة، والثقة. إنه يعمل بشكل جيد للمتحدثين ما قبل المتوسط، والمستوى المتوسط، والمتقدم ويتكيف مع مستواك بمرور الوقت.
be: FluencyPal найлепш падыходзіць для вучняў, якія могуць весці базавыя размовы і хочуць палепшыць бегласць, дакладнасць і ўпэўненасць. Ён добра падыходзіць для вучняў з узроўнем pre-intermediate, intermediate і advanced і адаптуецца да вашага ўзроўню з цягам часу.
da: FluencyPal er bedst egnet til elever, der kan føre grundlæggende samtaler og ønsker at forbedre flydende tale, præcision og selvtillid. Det fungerer godt for præ-intermediate, intermediate og avancerede talere og tilpasser sig dit niveau over tid.
de: FluencyPal ist am besten für Lernende geeignet, die einfache Gespräche führen können und ihre Sprachflüssigkeit, Genauigkeit und ihr Selbstvertrauen verbessern möchten. Es eignet sich gut für Sprecher auf vor-intermediate, intermediate und fortgeschrittenem Niveau und passt sich im Laufe der Zeit Ihrem Niveau an.
es: FluencyPal es más adecuado para estudiantes que pueden mantener conversaciones básicas y desean mejorar su fluidez, precisión y confianza. Funciona bien para hablantes de nivel pre-intermedio, intermedio y avanzado, y se adapta a tu nivel con el tiempo.
fr: FluencyPal convient le mieux aux apprenants qui peuvent tenir des conversations de base et souhaitent améliorer leur fluidité, leur précision et leur confiance. Il fonctionne bien pour les locuteurs de niveau pré-intermédiaire, intermédiaire et avancé et s'adapte à votre niveau au fil du temps.
id: FluencyPal paling cocok untuk pelajar yang dapat mengadakan percakapan dasar dan ingin meningkatkan kelancaran, ketepatan, dan kepercayaan diri. Ini bekerja dengan baik untuk penutur pra-menengah, menengah, dan mahir serta menyesuaikan dengan tingkat Anda seiring waktu.
it: FluencyPal è ideale per studenti che possono sostenere conversazioni di base e desiderano migliorare in scioltezza, accuratezza e sicurezza. Funziona bene per parlanti a livello pre-intermedio, intermedio e avanzato e si adatta al tuo livello col passare del tempo.
ja: FluencyPalは、基本的な会話を保ち、流暢さ、正確さ、自信を向上させたい学習者に最適です。初中級、中級、上級のスピーカーに対して効果的に機能し、時間をかけてあなたのレベルに適応します。
no: FluencyPal er best egnet for elever som kan holde grunnleggende samtaler og ønsker å forbedre flyt, nøyaktighet, og selvtillit. Det fungerer bra for personer på lavere middels, middels, og avansert nivå og tilpasser seg ditt nivå over tid.
pl: FluencyPal jest najlepiej dostosowany dla uczniów, którzy potrafią prowadzić podstawowe rozmowy i chcą poprawić płynność, dokładność oraz pewność siebie. Działa dobrze dla użytkowników na poziomie niższym średnio zaawansowanym, średnio zaawansowanym i zaawansowanym, a z biegiem czasu dostosowuje się do twojego poziomu.
pt: FluencyPal é mais adequado para alunos que conseguem manter conversas básicas e desejam melhorar a fluência, precisão e confiança. Funciona bem para falantes de nível pré-intermediário, intermediário e avançado e se adapta ao seu nível ao longo do tempo.
ru: FluencyPal лучше всего подходит для учащихся, которые могут поддерживать базовые разговоры и хотят улучшить беглость, точность и уверенность. Это хорошо работает для уровней ниже среднего, среднего и продвинутого, и со временем адаптируется к вашему уровню.
sv: FluencyPal är bäst lämpad för elever som kan hålla grundläggande samtal och vill förbättra flyt, noggrannhet och självförtroende. Den fungerar bra för pre-intermediära, intermediära och avancerade talare och anpassar sig till din nivå över tid.
th: FluencyPal เหมาะที่สุดสำหรับผู้เรียนที่สามารถสนทนาพื้นฐานได้และต้องการพัฒนาความคล่องแคล่ว ความแม่นยำ และความมั่นใจ มันทำงานได้ดีสำหรับผู้พูดในระดับก่อนกลาง ระดับกลาง และระดับสูง และสามารถปรับให้เข้ากับระดับของคุณเมื่อเวลาผ่านไป
tr: FluencyPal, temel düzeyde konuşmalar yapabilen ve akıcılık, doğruluk ile özgüvenlerini geliştirmek isteyen öğrenciler için en uygunudur. Ön-orta, orta ve ileri düzey konuşmacılar için iyi çalışır ve zamanla seviyenize uyum sağlar.
uk: FluencyPal найкраще підходить для тих учнів, які можуть вести базові розмови і хочуть покращити свою плавність, точність та впевненість. Це добре працює для користувачів з передсереднім, середнім та просунутим рівнем і з часом адаптується до вашого рівня.
vi: FluencyPal phù hợp nhất cho những người học có thể tham gia các cuộc trò chuyện cơ bản và muốn cải thiện độ trôi chảy, độ chính xác, và sự tự tin. Nó rất thích hợp cho những người nói ở mức độ trung cấp sơ cấp, trung cấp, và nâng cao và thích ứng với trình độ của bạn theo thời gian.

source: FluencyPal is designed to help you practice speaking and build confidence, not to replace a human teacher. It works best as a daily speaking companion that helps you practice more often, get instant feedback, and prepare for real conversations.
ar: FluencyPal مصمم لمساعدتك في ممارسة التحدث وبناء الثقة، وليس ليحل محل المعلم البشري. إنه يعمل بشكل أفضل كمرافق يومي للتحدث يساعدك على ممارسة التحدث بشكل أكثر تكرارًا، والحصول على ملاحظات فورية، والاستعداد للمحادثات الواقعية.
be: FluencyPal распрацаваны, каб дапамагчы вам практыкаваць маўленне і развіваць упэўненасць, а не замяніць настаўніка-чалавека. Ён лепш за ўсё працуе як штодзённы спадарожнік для практыкі маўлення, які дазваляе часцей практыкавацца, атрымліваць імгненную зваротную сувязь і падрыхтоўвацца да рэальных размоў.
da: FluencyPal er designet til at hjælpe dig med at øve dig i at tale og opbygge selvtillid, ikke til at erstatte en menneskelig lærer. Det fungerer bedst som en daglig samtalepartner, der hjælper dig med at øve dig oftere, få øjeblikkelig feedback og forberede dig til rigtige samtaler.
de: FluencyPal ist darauf ausgelegt, Ihnen beim Sprechenüben und dem Aufbau von Vertrauen zu helfen, nicht einen menschlichen Lehrer zu ersetzen. Es funktioniert am besten als täglicher Sprachbegleiter, der Ihnen hilft, häufiger zu üben, sofortiges Feedback zu erhalten und sich auf echte Gespräche vorzubereiten.
es: FluencyPal está diseñado para ayudarte a practicar el habla y construir confianza, no para reemplazar a un profesor humano. Funciona mejor como un compañero diario de conversación que te ayuda a practicar con más frecuencia, obtener retroalimentación instantánea y prepararte para conversaciones reales.
fr: FluencyPal est conçu pour vous aider à pratiquer la parole et à renforcer votre confiance, et non à remplacer un professeur humain. Il fonctionne mieux comme un compagnon de conversation quotidien qui vous aide à pratiquer plus souvent, à obtenir un retour instantané, et à vous préparer pour de vraies conversations.
id: FluencyPal dirancang untuk membantu Anda berlatih berbicara dan membangun kepercayaan diri, bukan untuk menggantikan guru manusia. Ini bekerja paling baik sebagai pendamping berbicara harian yang membantu Anda berlatih lebih sering, mendapatkan umpan balik instan, dan mempersiapkan diri untuk percakapan nyata.
it: FluencyPal è progettato per aiutarti a praticare il parlato e a costruire fiducia, non per sostituire un insegnante umano. Funziona al meglio come un compagno di conversazione quotidiano che ti aiuta a praticare più spesso, ricevere feedback immediati e prepararti per conversazioni reali.
ja: FluencyPalは、会話の練習や自信を育むために設計されており、人間の教師を代替するものではありません。日常の会話パートナーとして最適であり、より頻繁に練習し、即時のフィードバックを得て、実際の会話に備えるのに役立ちます。
no: FluencyPal er designet for å hjelpe deg med å øve på å snakke og bygge selvtillit, ikke for å erstatte en menneskelig lærer. Det fungerer best som en daglig talekompanjong som hjelper deg med å praktisere oftere, få umiddelbare tilbakemeldinger og forberede deg på ekte samtaler.
pl: FluencyPal został zaprojektowany, aby pomóc Ci w ćwiczeniu mówienia i budowaniu pewności siebie, a nie zastąpić ludzkiego nauczyciela. Działa najlepiej jako codzienny towarzysz do rozmowy, który pomaga częściej ćwiczyć, uzyskiwać natychmiastowe opinie i przygotowywać się do prawdziwych rozmów.
pt: FluencyPal é projetado para ajudá-lo a praticar a fala e ganhar confiança, não para substituir um professor humano. Ele funciona melhor como um companheiro de fala diário que ajuda você a praticar com mais frequência, obter feedback instantâneo e se preparar para conversas reais.
ru: FluencyPal предназначен для того, чтобы помочь вам практиковать устную речь и развивать уверенность, а не заменить учителя-человека. Лучше всего он работает как ежедневный собеседник, который помогает вам чаще практиковаться, получать мгновенную обратную связь и готовиться к реальным разговорам.
sv: FluencyPal är utformad för att hjälpa dig att öva på att tala och bygga självförtroende, inte för att ersätta en mänsklig lärare. Det fungerar bäst som en daglig samtalsvän som hjälper dig att öva oftare, få omedelbar feedback och förbereda dig för verkliga samtal.
th: FluencyPal ถูกออกแบบมาเพื่อช่วยให้คุณฝึกพูดและสร้างความมั่นใจ ไม่ใช่เพื่อแทนที่ครูคนจริง มันทำงานได้ดีที่สุดในฐานะผู้ช่วยการพูดรายวันที่ช่วยให้คุณฝึกฝนบ่อยขึ้น ได้รับคำติชมทันที และเตรียมตัวสำหรับการสนทนาจริง
tr: FluencyPal, konuşma pratiği yapmanıza ve güveninizi artırmanıza yardımcı olmak için tasarlanmıştır, bir insan öğretmenin yerini almak için değil. Günlük konuşma arkadaşı olarak en iyi şekilde çalışır; daha sık pratiğe yardımcı olur, anında geri bildirim almanızı sağlar ve gerçek konuşmalara hazırlanmanıza destek olur.
uk: FluencyPal розроблений, щоб допомогти вам практикувати розмовну мову та будувати впевненість, а не заміняти вчителя-людину. Він найкраще працює як щоденний супутник для розмови, який допомагає вам частіше практикуватися, отримувати миттєвий зворотний зв'язок та готуватися до реальних розмов.
vi: FluencyPal được thiết kế để giúp bạn luyện nói và xây dựng sự tự tin, chứ không phải để thay thế giáo viên là con người. Nó hoạt động tốt nhất như một người bạn đồng hành hàng ngày giúp bạn luyện tập thường xuyên hơn, nhận phản hồi tức thì và chuẩn bị cho các cuộc hội thoại thực tế.

source: FluencyPal is focused on speaking practice. You can use voice mode and optionally enable webcam feedback with an AI avatar to make conversations feel more realistic and engaging, while receiving feedback on your speaking performance.
ar: فلوينسي بال يركز على ممارسة التحدث. يمكنك استخدام وضع الصوت ويمكنك اختيار تمكين ملاحظات كاميرا الويب مع صورة رمزية للذكاء الاصطناعي لجعل المحادثات تبدو أكثر واقعية وجاذبية، بينما تتلقى ملاحظات حول أدائك في التحدث.
be: FluencyPal сканцэнтраваны на практыцы гутарковага маўлення. Вы можаце выкарыстоўваць галасавы рэжым і па жаданні ўключыць зваротную сувязь з вэб-камеры з AI-аватарам, каб зрабіць размовы больш рэалістычнымі і захапляльнымі, атрымліваючы зваротную сувязь аб вашай выканаўчасці маўлення.
da: FluencyPal er fokuseret på taletræning. Du kan bruge talefunktion og eventuelt aktivere webcam-feedback med en AI-avatar for at gøre samtalerne mere realistiske og engagerende, mens du modtager feedback på din taleydelse.
de: FluencyPal konzentriert sich auf Sprechübungen. Sie können den Sprachmodus verwenden und optional Webcam-Feedback mit einem KI-Avatar aktivieren, um Gespräche realistischer und ansprechender zu gestalten, während Sie gleichzeitig Feedback zu Ihrer Sprechleistung erhalten.
es: FluencyPal está enfocado en la práctica del habla. Puedes usar el modo de voz y, opcionalmente, activar la retroalimentación de la cámara web con un avatar de IA para que las conversaciones se sientan más realistas y atractivas, mientras recibes comentarios sobre tu rendimiento al hablar.
fr: FluencyPal est axé sur la pratique de l'expression orale. Vous pouvez utiliser le mode vocal et activer, si vous le souhaitez, le retour de la webcam avec un avatar IA pour rendre les conversations plus réalistes et engageantes, tout en recevant des commentaires sur votre performance orale.
id: FluencyPal berfokus pada latihan berbicara. Anda dapat menggunakan mode suara dan secara opsional mengaktifkan umpan balik webcam dengan avatar AI untuk membuat percakapan terasa lebih realistis dan menarik, sambil menerima umpan balik tentang kinerja berbicara Anda.
it: FluencyPal è focalizzato sulla pratica della conversazione. Puoi utilizzare la modalità vocale e, facoltativamente, attivare il feedback tramite webcam con un avatar AI per rendere le conversazioni più realistiche e coinvolgenti, ricevendo allo stesso tempo un feedback sulla tua performance di conversazione.
ja: FluencyPalはスピーキングの練習に焦点を当てています。音声モードを使用し、オプションでAIアバターによるウェブカメラのフィードバックを有効にすることで、会話をよりリアルで魅力的に感じられ、スピーキングのパフォーマンスに関するフィードバックを受けることができます。
no: FluencyPal er fokusert på taletrening. Du kan bruke stemmemodus og valgfritt aktivere webkamera tilbakemelding med en AI-avatar for å gjøre samtaler mer realistiske og engasjerende, samtidig som du mottar tilbakemelding på din taleprestasjon.
pl: FluencyPal koncentruje się na praktyce mówienia. Możesz użyć trybu głosowego i opcjonalnie włączyć informacje zwrotne z kamery internetowej z awatarem AI, aby rozmowy były bardziej realistyczne i angażujące, a jednocześnie otrzymywać informacje zwrotne na temat swojego wystąpienia.
pt: FluencyPal é focado na prática de fala. Você pode usar o modo de voz e, opcionalmente, ativar o feedback da webcam com um avatar de IA para tornar as conversas mais realistas e envolventes, enquanto recebe feedback sobre seu desempenho na fala.
ru: FluencyPal сосредоточен на практике разговорной речи. Вы можете использовать голосовой режим и при желании включить обратную связь с веб-камеры с аватаром ИИ, чтобы сделать разговоры более реалистичными и увлекательными, получая при этом обратную связь о вашем выступлении в устной речи.
sv: FluencyPal är fokuserat på talövning. Du kan använda röstläge och valfritt aktivera webbkamerafeedback med en AI-avatar för att göra samtalen mer realistiska och engagerande, samtidigt som du får feedback på din talprestation.
th: FluencyPal มุ่งเน้นที่การฝึกฝนการพูด คุณสามารถใช้โหมดเสียงและเปิดใช้คำติชมจากกล้องเว็บพร้อมด้วยอวตาร AI ได้ตามความต้องการ เพื่อทำให้การสนทนารู้สึกสมจริงและน่าสนใจยิ่งขึ้น พร้อมกับได้รับคำติชมเกี่ยวกับประสิทธิภาพการพูดของคุณ
tr: FluencyPal konuşma pratiğine odaklanmıştır. Ses modunu kullanabilir ve isteğe bağlı olarak bir AI avatar ile webcam geri bildirimini etkinleştirerek konuşmaları daha gerçekçi ve ilgi çekici hale getirebilir, aynı zamanda konuşma performansınız hakkında geri bildirim alabilirsiniz.
uk: FluencyPal зосереджений на практиці розмовної мови. Ви можете використовувати голосовий режим і за бажанням увімкнути зворотний зв’язок через вебкамеру із штучним аватаром, щоб зробити розмови більш реалістичними та захоплюючими, отримуючи при цьому зворотний зв'язок щодо вашої мовленнєвої продуктивності.
vi: FluencyPal tập trung vào việc luyện nói. Bạn có thể sử dụng chế độ giọng nói và tùy chọn kích hoạt phản hồi từ webcam với một avatar AI để làm cho các cuộc trò chuyện trở nên thực tế và hấp dẫn hơn, đồng thời nhận được phản hồi về hiệu suất nói của bạn.

source: FluencyPal is still relatively new, and your feedback is very important to us. Please share your feature requests via the chat above, and we will consider them for future updates to improve the service.
id: FluencyPal masih tergolong baru, dan masukan Anda sangat penting bagi kami. Silakan bagikan permintaan fitur Anda melalui obrolan di atas, dan kami akan mempertimbangkannya untuk pembaruan mendatang guna meningkatkan layanan.
it: FluencyPal è ancora relativamente nuovo e i tuoi feedback sono molto importanti per noi. Ti preghiamo di inviare le tue richieste di funzionalità tramite la chat sopra, e le considereremo per futuri aggiornamenti per migliorare il servizio.
ja: FluencyPalはまだ比較的新しく、あなたのフィードバックは私たちにとって非常に重要です。上記のチャットを通じて機能リクエストを共有してください。私たちはサービスを改善するために、今後のアップデートでそれらを検討します。
no: FluencyPal er fortsatt relativt nytt, og din tilbakemelding er veldig viktig for oss. Vennligst del dine funksjonsforespørsler via chatten ovenfor, så vil vi vurdere dem for fremtidige oppdateringer for å forbedre tjenesten.
pl: FluencyPal jest nadal stosunkowo nowy, a Twoja opinia jest dla nas bardzo ważna. Podziel się swoimi propozycjami ulepszeń za pośrednictwem powyższego czatu, a my rozważymy je w przyszłych aktualizacjach w celu ulepszenia usługi.
ru: FluencyPal всё ещё относительно новый, и ваше мнение очень важно для нас. Пожалуйста, поделитесь вашими пожеланиями относительно функционала через чат выше, и мы рассмотрим их для будущих обновлений, чтобы улучшить сервис.
sv: FluencyPal är fortfarande relativt nytt, och din feedback är mycket viktig för oss. Vänligen dela dina förfrågningar om funktioner via chatten ovan, och vi kommer att överväga dem för framtida uppdateringar för att förbättra tjänsten.
uk: FluencyPal все ще відносно новий, і ваші відгуки дуже важливі для нас. Будь ласка, діліться своїми запитами на функції через чат вище, і ми розглянемо їх для майбутніх оновлень, щоб покращити сервіс.

source: FluencyPal offers Free and monthly plans that give you full access to all features. There is no automatic recurring payment. Each month, you decide whether you want to continue and pay again manually. This way, you are never charged when you are not using the app.
ar: يقدم FluencyPal خططاً مجانية وشهرية تمنحك وصولاً كاملاً إلى جميع الميزات. لا توجد دفعات تلقائية متكررة. كل شهر، تقرر ما إذا كنت ترغب في الاستمرار والدفع مرة أخرى يدوياً. بهذه الطريقة، لن تُفرض أي رسوم عليك عندما لا تكون تستخدم التطبيق.
be: FluencyPal прапануе бясплатныя і штомесячныя планы, якія даюць вам поўны доступ да ўсіх магчымасцяў. Аўтаматычнае паўторнае спісанне сродкаў адсутнічае. Кожны месяц вы самі вырашаеце, ці жадаеце вы працягваць і аплачваць зноў уручную. Такім чынам, вы ніколі не будзеце плаціць, калі не карыстаецеся дадаткам.
da: FluencyPal tilbyder gratis og månedlige planer, der giver dig fuld adgang til alle funktioner. Der er ingen automatisk tilbagevendende betaling. Hver måned beslutter du, om du vil fortsætte og betale igen manuelt. På denne måde bliver du aldrig opkrævet, når du ikke bruger appen.
de: FluencyPal bietet kostenlose und monatliche Pläne an, die Ihnen vollen Zugriff auf alle Funktionen geben. Es gibt keine automatische wiederkehrende Zahlung. Jeden Monat entscheiden Sie, ob Sie fortfahren und erneut manuell bezahlen möchten. Auf diese Weise werden Sie nie belastet, wenn Sie die App nicht nutzen.
es: FluencyPal ofrece planes Gratuitos y mensuales que te dan acceso completo a todas las funciones. No hay pagos automáticos recurrentes. Cada mes, decides si deseas continuar y pagas nuevamente de forma manual. De esta manera, nunca se te cobra cuando no estás usando la aplicación.
fr: FluencyPal propose des plans gratuits et mensuels qui vous donnent un accès complet à toutes les fonctionnalités. Il n'y a pas de paiement récurrent automatique. Chaque mois, vous décidez si vous voulez continuer et payer à nouveau manuellement. De cette façon, vous n'êtes jamais facturé lorsque vous n'utilisez pas l'application.
id: FluencyPal menawarkan paket Gratis dan bulanan yang memberikan Anda akses penuh ke semua fitur. Tidak ada pembayaran berulang otomatis. Setiap bulan, Anda memutuskan apakah Anda ingin melanjutkan dan membayar lagi secara manual. Dengan cara ini, Anda tidak akan dikenakan biaya saat Anda tidak menggunakan aplikasi.
it: FluencyPal offre piani Gratuiti e mensili che ti danno pieno accesso a tutte le funzionalità. Non c'è alcun pagamento ricorrente automatico. Ogni mese, decidi se vuoi continuare e pagare di nuovo manualmente. In questo modo, non ti viene mai addebitato alcun importo quando non stai usando l'app.
ja: FluencyPalは、すべての機能に完全にアクセスできる無料および月額プランを提供しています。自動的な定期支払いはありません。毎月、続けたいかどうかを決めて、再度手動で支払うことができます。この方法なら、アプリを使用していないときに課金されることはありません。
no: FluencyPal tilbyr gratis og månedlige planer som gir deg full tilgang til alle funksjoner. Det er ingen automatisk gjentakende betaling. Hver måned bestemmer du om du vil fortsette og betale på nytt manuelt. På denne måten blir du aldri belastet når du ikke bruker appen.
pl: FluencyPal oferuje darmowe i miesięczne plany, które dają pełny dostęp do wszystkich funkcji. Nie ma automatycznych płatności cyklicznych. Każdego miesiąca decydujesz, czy chcesz kontynuować i ponownie zapłacić ręcznie. W ten sposób nigdy nie ponosisz opłat, gdy nie korzystasz z aplikacji.
pt: O FluencyPal oferece planos Gratuitos e Mensais que dão acesso total a todos os recursos. Não há cobrança automática recorrente. A cada mês, você decide se quer continuar e pagar novamente manualmente. Desta forma, você nunca é cobrado quando não está usando o aplicativo.
ru: FluencyPal предлагает бесплатные и ежемесячные планы, которые дают полный доступ ко всем функциям. Автоматического повторяющегося платежа нет. Каждый месяц вы решаете, хотите ли вы продолжить и оплатить снова вручную. Таким образом, с вас никогда не взимается плата, когда вы не пользуетесь приложением.
sv: FluencyPal erbjuder gratis- och månadsabonnemang som ger dig full tillgång till alla funktioner. Det finns ingen automatisk återkommande betalning. Varje månad bestämmer du själv om du vill fortsätta och betalar manuellt igen. På så sätt debiteras du aldrig när du inte använder appen.
th: FluencyPal มีแผนบริการฟรีและรายเดือนที่ให้คุณเข้าถึงฟีเจอร์ทั้งหมดได้โดยเต็มที่ ไม่มีการหักเงินอัตโนมัติ คุณสามารถเลือกได้ในแต่ละเดือนว่าต้องการใช้บริการต่อหรือไม่และชำระเงินด้วยตนเอง ด้วยวิธีนี้ คุณจะไม่ถูกเรียกเก็บเงินเมื่อคุณไม่ได้ใช้แอป
tr: FluencyPal, tüm özelliklere tam erişim sağlayan Ücretsiz ve aylık planlar sunar. Otomatik tekrar eden ödeme yoktur. Her ay devam etmek isteyip istemediğinize karar verir ve tekrar manuel olarak ödeme yaparsınız. Bu şekilde, uygulamayı kullanmadığınızda asla ücretlendirilmezsiniz.
uk: FluencyPal пропонує безкоштовні та щомісячні плани, які надають вам повний доступ до всіх функцій. Немає автоматичного повторюваного платежу. Щомісяця ви вирішуєте, чи хочете ви продовжити, і сплачуєте знову вручну. Таким чином, ви ніколи не будете стягнуті кошти, коли не використовуєте додаток.
vi: FluencyPal cung cấp các gói miễn phí và hàng tháng cho phép bạn truy cập đầy đủ vào tất cả các tính năng. Không có thanh toán tự động định kỳ. Mỗi tháng, bạn quyết định có tiếp tục và tự thanh toán lại hay không. Bằng cách này, bạn sẽ không bao giờ bị tính phí khi không sử dụng ứng dụng.
