Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Improve your impact, structure, clarity, and delivery.
ar: حسّن تأثيرك وبنيتك ووضوحك وتقديمك.
be: Паляпшайце ваш уплыў, структуру, яснасць і падачу.
da: Forbedr din indflydelse, struktur, klarhed og levering.
de: Verbessern Sie Ihre Wirkung, Struktur, Klarheit und Darbietung.
es: Mejora tu impacto, estructura, claridad y entrega.
fr: Améliorez votre impact, structure, clarté et élocution.
id: Tingkatkan dampak, struktur, kejelasan, dan penyampaian Anda.
it: Migliora il tuo impatto, struttura, chiarezza e presentazione.
ja: インパクト、構造、明確さ、そして伝達を向上させてください。
ms: Tingkatkan impak, struktur, kejelasan, dan penyampaian anda.
no: Forbedre din innvirkning, struktur, klarhet og fremføring.
pl: Popraw swój wpływ, strukturę, klarowność i sposób przekazu.
pt: Melhore seu impacto, estrutura, clareza e entrega.
ru: Улучшите ваше влияние, структуру, ясность и подачу.
sv: Förbättra din påverkan, struktur, klarhet och leverans.
th: ปรับปรุงผลกระทบ โครงสร้าง ความชัดเจน และการนำเสนอของคุณ
tr: Etkisini, yapıyı, netliği ve sunumu geliştirin.
uk: Покращте свій вплив, структуру, ясність і подачу.
vi: Cải thiện tác động, cấu trúc, sự rõ ràng và cách truyền đạt của bạn.

source: Improve your vocabulary and speaking skills while having fun! Alias is a dynamic word-guessing game where you'll practice explaining and guessing words creatively, expanding your linguistic confidence.
ar: تحسين مفرداتك ومهارات التحدث لديك بينما تستمتع! Alias هي لعبة ديناميكية لتخمين الكلمات حيث ستقوم بممارسة شرح وتخمين الكلمات بطرق إبداعية، مما سيزيد من ثقتك اللغوية.
be: Палепшыце свой слоўнік і навыкі маўлення, атрымліваючы задавальненне! Alias - гэта дынамічная гульня ў адгадванні слоў, дзе вы будзеце практыкавацца ў тлумачэнні і крэатыўным адгадванні слоў, павялічваючы сваю лінгвістычную ўпэўненасць.
da: Forbedr dit ordforråd og dine talefærdigheder, mens du har det sjovt! Alias er et dynamisk ordgætningsspil, hvor du vil øve dig på at forklare og gætte ord kreativt, hvilket udvider din sproglige selvtillid.
de: Verbessern Sie Ihren Wortschatz und Ihre Sprechfähigkeiten, während Sie Spaß haben! Alias ist ein dynamisches Ratespiel, bei dem Sie üben, kreativ Wörter zu erklären und zu erraten, und so Ihr sprachliches Selbstvertrauen stärken.
es: ¡Mejora tu vocabulario y habilidades de expresión oral mientras te diviertes! Alias es un juego dinámico de adivinanza de palabras donde practicarás explicando y adivinando palabras de manera creativa, ampliando tu confianza lingüística.
fr: Améliorez votre vocabulaire et vos compétences en expression orale tout en vous amusant ! Alias est un jeu de devinettes dynamique où vous pratiquerez l'art d'expliquer et de deviner des mots de manière créative, renforçant ainsi votre confiance linguistique.
id: Tingkatkan kosakata dan kemampuan berbicara Anda sambil bersenang-senang! Alias adalah permainan menebak kata yang dinamis di mana Anda akan berlatih menjelaskan dan menebak kata-kata secara kreatif, memperluas kepercayaan diri linguistik Anda.
it: Migliora il tuo vocabolario e le tue abilità di conversazione divertendoti! Alias è un gioco dinamico di indovinelli sulle parole in cui praticherai l'arte di spiegare e indovinare parole in maniera creativa, aumentando la tua sicurezza linguistica.
ja: 楽しく語彙力とスピーキングスキルを向上させましょう！エイリアスは、言葉を創造的に説明したり推測したりする練習をする、ダイナミックな単語クイズゲームです。言語的な自信を高めることができます。
ms: Tingkatkan perbendaharaan kata dan kemahiran bertutur anda sambil berseronok! Alias ialah permainan meneka perkataan yang dinamik di mana anda akan berlatih menjelaskan dan meneka perkataan secara kreatif, memperluas keyakinan linguistik anda.
no: Forbedre ordforrådet og taleferdighetene dine mens du har det gøy! Alias er et dynamisk ordgjettingsspill der du vil øve på å forklare og gjette ord på en kreativ måte, og utvide din språklige selvtillit.
pl: Poprawiaj swoje słownictwo i umiejętności mówienia, świetnie się bawiąc! Alias to dynamiczna gra w odgadywanie słów, w której będziesz ćwiczyć kreatywne wyjaśnianie i odgadywanie słów, rozwijając swoją pewność siebie w posługiwaniu się językiem.
pt: Melhore seu vocabulário e habilidades de fala enquanto se diverte! Alias é um jogo dinâmico de adivinhação de palavras onde você praticará explicar e adivinhar palavras de maneira criativa, expandindo sua confiança linguística.
ru: Улучшайте словарный запас и навыки устной речи, развлекаясь! Alias — это динамичная игра на угадывание слов, где вы будете практиковать объяснение и угадывание слов творчески, расширяя свою языковую уверенность.
sv: Förbättra ditt ordförråd och dina talfärdigheter samtidigt som du har roligt! Alias är ett dynamiskt ordgissningsspel där du får öva på att förklara och gissa ord på ett kreativt sätt, vilket stärker ditt språkliga självförtroende.
th: ปรับปรุงคำศัพท์และทักษะการพูดของคุณด้วยความสนุกสนาน! Alias เป็นเกมทายคำที่เต็มไปด้วยชีวิตชีวาซึ่งคุณจะได้ฝึกฝนการอธิบายและคาดเดาคำต่าง ๆ อย่างสร้างสรรค์ เพิ่มความมั่นใจทางภาษาของคุณให้มากขึ้น
tr: Kelime bilginizi ve konuşma becerilerinizi eğlenerek geliştirin! Alias, kelime tahmin etme üzerine dinamik bir oyundur ve kelimeleri yaratıcı biçimde açıklayıp tahmin ederek dilsel güveninizi artırmanıza yardımcı olur.
uk: Покращуйте словниковий запас та навички спілкування, отримуючи задоволення! Alias — це динамічна гра на відгадування слів, де ви практикуватимете пояснення та вгадування слів творчо, розширюючи свою мовну впевненість.
vi: Cải thiện vốn từ vựng và kỹ năng nói của bạn trong khi vẫn có niềm vui! Alias là một trò chơi đoán từ sôi nổi nơi bạn sẽ thực hành việc giải thích và đoán từ một cách sáng tạo, mở rộng sự tự tin trong giao tiếp ngôn ngữ của bạn.
