Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Thinking about which languages might be good to install...
ar: يفكر في أي اللغات قد تكون جيدة للتثبيت...
be: Разважаючы, якія мовы маглі б выкарыстоўвацца добра для ўсталявання...
da: Tænker på, hvilke sprog der måske ville være gode at installere...
de: Nachdenken darüber, welche Sprachen vielleicht gut zu installieren wären...
es: Pensando en qué idiomas podrían ser buenos para instalar...
fr: Réfléchir à quelles langues pourraient être bonnes à installer...
id: Sedang memikirkan bahasa apa yang mungkin bagus untuk diinstal...
it: Pensando a quali lingue potrebbero essere buone da installare...
ja: どの言語をインストールすると良いか考えています...
ms: Sedang memikirkan bahasa apa yang mungkin baik untuk dipasang...
no: Tenker på hvilke språk som kan være gode å installere...
pl: Zastanawianie się, które języki mogłyby być dobre do zainstalowania...
pt: Pensando em quais idiomas podem ser bons para instalar...
ru: Думаете о том, какие языки могут быть полезно установить...
sv: Funderar på vilka språk som kan vara bra att installera...
th: กำลังคิดว่าภาษาไหนน่าจะดีที่จะติดตั้ง...
tr: Hangi dillerin yüklenmesinin iyi olabileceğini düşünüyorum...
uk: Розмірковую, які мови можуть бути корисними для встановлення...
vi: Đang suy nghĩ về những ngôn ngữ nào có thể sẽ tốt để cài đặt...

source: This action is irreversible.
ar: هذا الإجراء لا يمكن التراجع عنه.
be: Гэта дзеянне незваротнае.
da: Denne handling kan ikke omgøres.
de: Diese Aktion ist unumkehrbar.
es: Esta acción es irreversible.
fr: Cette action est irréversible.
id: Tindakan ini tidak dapat dibalikkan.
it: Questa azione è irreversibile.
ja: この操作は元に戻せません。
ms: Tindakan ini tidak boleh dipulihkan.
no: Denne handlingen er irreversibel.
pl: To działanie jest nieodwracalne.
pt: Esta ação é irreversível.
ru: Это действие необратимо.
sv: Denna åtgärd är irreversibel.
th: การดำเนินการนี้ไม่สามารถย้อนกลับได้.
tr: Bu eylem geri alınamaz.
uk: Ця дія є незворотньою.
vi: Hành động này không thể đảo ngược.

source: This approach shows self-awareness and growth.
ar: هذا الأسلوب يظهر الوعي الذاتي والنمو.
be: Гэты падыход паказвае самасвядомасць і рост.
da: Denne tilgang viser selvbevidsthed og vækst.
de: Dieser Ansatz zeigt Selbstbewusstsein und Wachstum.
es: Este enfoque muestra autoconciencia y crecimiento.
fr: Cette approche démontre une auto-conscience et une croissance.
id: Pendekatan ini menunjukkan kesadaran diri dan pertumbuhan.
it: Questo approccio dimostra autoconsapevolezza e crescita.
ja: このアプローチは自己認識と成長を示しています。
ms: Pendekatan ini menunjukkan kesedaran diri dan pertumbuhan.
no: Denne tilnærmingen viser selvbevissthet og vekst.
pl: To podejście pokazuje samoświadomość i rozwój.
pt: Esta abordagem demonstra autoconhecimento e crescimento.
ru: Этот подход демонстрирует самосознание и рост.
sv: Denna strategi visar självmedvetenhet och tillväxt.
th: วิธีนี้แสดงถึงการรู้ตัวและการเติบโต
tr: Bu yaklaşım, öz-farkındalığı ve gelişimi gösterir.
uk: Цей підхід демонструє самоусвідомлення та розвиток.
vi: Phương pháp này cho thấy sự tự nhận thức và phát triển.

source: This is text you see on buttons and menus
ar: هذا هو النص الذي تراه على الأزرار والقوائم
be: Гэта тэкст, які вы бачыце на кнопках і меню
da: Dette er tekst, du ser på knapper og menuer
de: Dies ist der Text, den Sie auf Schaltflächen und Menüs sehen
es: Este es el texto que ves en los botones y menús
fr: Ceci est le texte que vous voyez sur les boutons et les menus
id: Ini adalah teks yang Anda lihat pada tombol dan menu
it: Questo è il testo che vedi su pulsanti e menu
ja: これはボタンやメニューに表示されるテキストです
ms: Ini adalah teks yang anda lihat pada butang dan menu
no: Dette er tekst du ser på knapper og menyer
pl: To jest tekst widoczny na przyciskach i w menu
pt: Este é o texto que você vê em botões e menus
ru: Это текст, который вы видите на кнопках и в меню
sv: Det här är text du ser på knappar och menyer
th: นี่คือข้อความที่คุณเห็นบนปุ่มและเมนู
tr: Bu, butonlarda ve menülerde gördüğünüz metindir.
uk: Це текст, який ви бачите на кнопках та в меню
vi: Đây là văn bản bạn thấy trên các nút và menu

source: This is your answer
ar: هذا هو جوابك
be: Гэта ваш адказ
da: Dette er dit svar
de: Dies ist Ihre Antwort
es: Esta es tu respuesta
fr: Voici votre réponse
id: Ini jawaban Anda
it: Questa è la tua risposta
ja: これはあなたの答えです
ms: Ini jawapan anda
no: Dette er ditt svar
pl: To jest Twoja odpowiedź
pt: Esta é a sua resposta
ru: Это ваш ответ
sv: Det här är ditt svar
th: นี่คือคำตอบของคุณ
tr: Bu sizin cevabınız
uk: Це ваша відповідь
vi: Đây là câu trả lời của bạn

source: This is your chance to introduce your experience and skills. Don’t list your full biography — focus on the highlights of your professional background. A good answer structure in English might look like this:
ar: هذه فرصتك لتقديم خبرتك ومهاراتك. لا تذكر سيرتك الذاتية كاملة - ركز على أبرز ما في خلفيتك المهنية. قد يبدو الجواب الجيد باللغة الإنجليزية كالتالي:
be: Гэта ваша магчымасць прадставіць свой досвед і навыкі. Не прадставляйце сваю поўную біяграфію - засяродзецеся на ўзнагародах вашага прафесійнага фону. Добрая структура адказу на англійскай можа выглядаць так:
da: Dette er din chance for at introducere din erfaring og færdigheder. Du behøver ikke at opliste hele din biografi — fokuser på højdepunkterne i din professionelle baggrund. En god svarstruktur på engelsk kunne se sådan ud:
de: Dies ist Ihre Chance, Ihre Erfahrungen und Fähigkeiten vorzustellen. Listen Sie nicht Ihre gesamte Biografie auf - konzentrieren Sie sich auf die Highlights Ihrer beruflichen Laufbahn. Eine gute Antwortstruktur auf Englisch könnte so aussehen:
es: Esta es tu oportunidad para presentar tu experiencia y habilidades. No enumeres toda tu biografía, céntrate en los aspectos más destacados de tu trayectoria profesional. Una buena estructura de respuesta en inglés podría ser esta:
fr: Voici votre chance de présenter votre expérience et vos compétences. Ne listez pas toute votre biographie - concentrez-vous sur les points forts de votre parcours professionnel. Une bonne structure de réponse en anglais pourrait ressembler à ceci :
id: Ini adalah kesempatan Anda untuk memperkenalkan pengalaman dan keterampilan Anda. Jangan daftarkan biografi lengkap Anda — fokus pada sorotan latar belakang profesional Anda. Struktur jawaban yang baik dalam bahasa Inggris mungkin terlihat seperti ini:
it: Questa è la tua opportunità per presentare la tua esperienza e le tue competenze. Non elencare la tua biografia completa - concentra l'attenzione sui punti salienti del tuo background professionale. Una buona struttura di risposta in inglese potrebbe sembrare così:
ja: これはあなたの経験とスキルを紹介する機会です。詳細な経歴を列挙するのではなく、あなたの専門的なバックグラウンドのハイライトに焦点を当ててください。良い英語での回答構造は以下のようになるかもしれません:
ms: Ini adalah peluang anda untuk memperkenalkan pengalaman dan kemahiran anda. Jangan senaraikan biografi penuh anda — fokus pada sorotan latar belakang profesional anda. Struktur jawapan yang baik dalam Bahasa Inggeris mungkin kelihatan seperti ini:
no: Dette er sjansen din til å introdusere din erfaring og ferdigheter. Ikke list opp hele biografien din - fokuser på høydepunktene i din profesjonelle bakgrunn. En god svarstruktur på engelsk kan se slik ut:
pl: To jest Twoja szansa, aby przedstawić swoje doświadczenie i umiejętności. Nie wymieniaj całej swojej biografii — skup się na najważniejszych elementach Twojego profesjonalnego tła. Dobra struktura odpowiedzi po angielsku może wyglądać tak:
pt: Esta é a sua chance de apresentar sua experiência e habilidades. Não liste toda a sua biografia — concentre-se nos destaques do seu histórico profissional. Uma boa estrutura de resposta em inglês pode parecer com esta:
ru: Это ваш шанс представить ваш опыт и навыки. Не перечисляйте всю свою биографию — сосредоточьтесь на основных моментах вашего профессионального опыта. Хорошая структура ответа на английском может выглядеть так:
sv: Det här är din chans att presentera din erfarenhet och dina färdigheter. Lista inte din fullständiga biografi - fokusera på höjdpunkterna i din professionella bakgrund. En bra svarstruktur på engelska kan se ut så här:
th: นี่คือโอกาสของคุณในการแนะนำประสบการณ์และทักษะของคุณ ไม่ต้องระบุประวัติชีวิตของคุณเต็มๆ —โฟกัสเฉพาะจุดเด่นของประวัติการทำงานเท่านั้น การตอบที่ดีในภาษาอังกฤษอาจมีโครงสร้างดังนี้:
tr: Bu, deneyimlerinizi ve yeteneklerinizi tanıtma şansınızdır. Tam biyografinizi listelemeyin - profesyonel geçmişinizin öne çıkan noktalarına odaklanın. İngilizce'de iyi bir cevap yapısı şöyle görünebilir:
uk: Це ваш шанс представити ваш досвід та навички. Не перераховуйте всю свою біографію - сфокусуйтеся на найважливіших моментах вашого професійного досвіду. Гарна структура відповіді англійською може виглядати так:
vi: Đây là cơ hội để bạn giới thiệu về kinh nghiệm và kỹ năng của mình. Đừng liệt kê toàn bộ lịch sử công việc của bạn - hãy tập trung vào những điểm nổi bật trong lý lịch làm việc của bạn. Một cấu trúc trả lời tốt bằng tiếng Anh có thể như sau:

source: This shows results and makes you stand out.
ar: هذا يعرض النتائج ويجعلك تبرز.
be: Гэта паказвае вынікі і робіць вас улічным.
da: Dette viser resultater og får dig til at skille dig ud.
de: Dies zeigt Ergebnisse und lässt Sie hervorstechen.
es: Esto muestra resultados y te hace destacar.
fr: Cela montre des résultats et vous démarque.
id: Ini menunjukkan hasil dan membuat Anda menonjol.
it: Questo mostra i risultati e ti fa distinguere.
ja: これは結果を示し、あなたを目立たせます。
ms: Ini menunjukkan hasil dan membuat anda menonjol.
no: Dette viser resultater og får deg til å skille deg ut.
pl: To pokazuje wyniki i wyróżnia Cię.
pt: Isso mostra resultados e faz com que você se destaque.
ru: Это показывает результаты и выделяет вас на фоне других.
sv: Detta visar resultat och får dig att sticka ut.
th: นี่แสดงผลลัพธ์และทำให้คุณโดดเด่น
tr: Bu sonuçları gösterir ve sizi öne çıkarır.
uk: Це показує результати та виокремлює вас.
vi: Điều này hiển thị kết quả và giúp bạn nổi bật.

source: Ticket
ar: تذكرة
be: Квіток
da: Billet
es: Boleto
fr: Billet
id: Tiket
it: Biglietto
ja: チケット
ms: Tiket
no: Billett
pl: Bilet
pt: Bilhete
ru: Билет
sv: Biljett
th: ตั๋ว
tr: Bilet
uk: Квиток
vi: Vé

source: Time left
id: Waktu tersisa
it: Tempo rimasto
ja: 残り時間
no: Tid igjen
ru: Оставшееся время
uk: Час, що залишився

source: Timed
id: Waktu Terbatas
it: Temporizzato
ja: 時間制限付き
no: Tidfestet
ru: Время зафиксировано
uk: У часі

source: To use FluencyPal, you need a modern internet browser and a microphone. A webcam is optional and only used if you enable webcam feedback. No installation is required.
ar: plaintext لاستخدام FluencyPal، تحتاج إلى متصفح إنترنت حديث وميكروفون. كاميرا الويب اختيارية وتستخدم فقط إذا قمت بتمكين تعليقات كاميرا الويب. لا يتطلب أي تثبيت.
be: Каб выкарыстоўваць FluencyPal, вам спатрэбіцца сучасны інтэрнэт-браўзер і мікрафон. Вэб-камера не з'яўляецца абавязковай і выкарыстоўваецца толькі ў тым выпадку, калі вы ўключыце зваротную сувязь праз вэб-камеру. Устаноўка не патрабуецца.
da: For at bruge FluencyPal skal du have en moderne internetbrowser og en mikrofon. Et webcam er valgfrit og bruges kun, hvis du aktiverer webcam-feedback. Ingen installation er påkrævet.
de: Um FluencyPal zu verwenden, benötigen Sie einen modernen Internetbrowser und ein Mikrofon. Eine Webcam ist optional und wird nur verwendet, wenn Sie das Webcam-Feedback aktivieren. Es ist keine Installation erforderlich.
es: Para utilizar FluencyPal, necesitas un navegador de internet moderno y un micrófono. Una cámara web es opcional y solo se utiliza si activas la retroalimentación de la cámara web. No se requiere instalación.
fr: Pour utiliser FluencyPal, vous avez besoin d'un navigateur Internet moderne et d'un microphone. Une webcam est facultative et n'est utilisée que si vous activez le retour vidéo de webcam. Aucune installation n'est requise.
id: Untuk menggunakan FluencyPal, Anda memerlukan browser internet modern dan mikrofon. Webcam bersifat opsional dan hanya digunakan jika Anda mengaktifkan umpan balik webcam. Tidak diperlukan instalasi.
it: Per utilizzare FluencyPal, è necessario un browser internet moderno e un microfono. Una webcam è facoltativa ed è utilizzata solo se si abilita il feedback tramite webcam. Non è richiesta alcuna installazione.
ja: FluencyPalを使用するには、最新のインターネットブラウザとマイクが必要です。ウェブカメラはオプションで、ウェブカメラフィードバックを有効にした場合のみ使用されます。インストールは不要です。
no: For å bruke FluencyPal trenger du en moderne nettleser og en mikrofon. Et webkamera er valgfritt og brukes kun hvis du aktiverer webkameraforhåndsvisninger. Ingen installasjon er nødvendig.
pl: Aby korzystać z FluencyPal, potrzebujesz nowoczesnej przeglądarki internetowej i mikrofonu. Kamera internetowa jest opcjonalna i używana tylko wtedy, gdy włączysz sprzężenie zwrotne z kamery internetowej. Instalacja nie jest wymagana.
pt: Para usar o FluencyPal, você precisa de um navegador de internet moderno e um microfone. Uma webcam é opcional e só é usada se você ativar o feedback de webcam. Não é necessária instalação.
ru: Чтобы использовать FluencyPal, вам нужны современный интернет-браузер и микрофон. Веб-камера не обязательна и используется только если вы включите обратную связь через веб-камеру. Установка не требуется.
sv: För att använda FluencyPal behöver du en modern internetbrowser och en mikrofon. En webbkamera är valfri och används endast om du aktiverar webbkamerafeedback. Ingen installation krävs.
th: ในการใช้ FluencyPal คุณจำเป็นต้องมีเบราว์เซอร์อินเทอร์เน็ตสมัยใหม่และไมโครโฟน กล้องเว็บแคมเป็นอุปกรณ์เสริมที่ใช้เฉพาะเมื่อคุณเปิดใช้งานการตอบกลับด้วยเว็บแคม ไม่จำเป็นต้องติดตั้ง
tr: FluencyPal kullanmak için modern bir internet tarayıcısına ve bir mikrofona ihtiyacınız var. Web kamerası isteğe bağlıdır ve sadece web kamerası geri bildirimini etkinleştirirseniz kullanılır. Kurulum gerekmez.
uk: Щоб використовувати FluencyPal, вам потрібен сучасний інтернет-браузер і мікрофон. Вебкамера є необов’язковою і використовується лише якщо ви ввімкнете зворотний зв’язок з вебкамери. Інсталяція не потрібна.
vi: Để sử dụng FluencyPal, bạn cần một trình duyệt internet hiện đại và một micro. Webcam là tùy chọn và chỉ được sử dụng nếu bạn kích hoạt phản hồi webcam. Không cần cài đặt.

source: Today's Question
id: Pertanyaan Hari Ini
it: Domanda di oggi
ja: 本日の質問
no: Dagens spørsmål
pl: Dzisiejsze Pytanie
ru: Сегодняшний вопрос
sv: Dagens Fråga
uk: Сьогоднішнє Запитання

source: Today's Tasks
ja: 本日のタスク
no: Dagens Oppgaver
uk: Завдання на сьогодні

source: TOEFL Speaking Tasks
ar: مهام الكلام في TOEFL
be: Заданні па размове TOEFL
da: TOEFL Taleopgaver
de: TOEFL Sprechübungen
es: Tareas de Habla TOEFL
fr: Tâches de Parole TOEFL
id: Tugas Berbicara TOEFL
it: Compiti di Speaking per il TOEFL
ja: TOEFLスピーキングタスク
ms: Tugas-tugas Bertutur TOEFL
no: TOEFL Taleoppgaver
pl: Zadania z mówienia TOEFL
pt: Tarefas de Fala do TOEFL
ru: Задания по говорению TOEFL
sv: TOEFL Talauppgifter
th: งานพูดในส่วนของ TOEFL
tr: TOEFL Konuşma Görevleri
uk: Завдання зі спілкування TOEFL
vi: Nhiệm vụ Nói trong TOEFL

source: Total
ar: المجموع
be: Агулам
da: I alt
de: Gesamt
it: Totale
ja: 合計
ms: Jumlah
no: Totalt
pl: Razem
ru: Всего
sv: Totalt
th: ทั้งหมด
tr: Toplam
uk: Всього
vi: Tổng cộng

source: Total Scores
it: Punteggi Totali
ja: 総合スコア
no: Totalpoeng
ru: Общий счет
uk: Загальні Бали

source: Total Turns
id: Total Giliran
it: Totale Turni
ja: 総ターン数
no: Totalt Antall Omganger
ru: Общее количество ходов
uk: Загальна кількість ходів

source: Total:
ar: المجموع:
be: Агулам:
da: I alt:
de: Gesamt:
it: Totale:
ja: 合計：
ms: Jumlah:
no: Totalt:
pl: Razem:
ru: Всего:
sv: Totalt:
th: ทั้งหมด:
tr: Toplam:
uk: Всього:
vi: Tổng cộng:

source: Track Your Fluency Progress
ar: تتبع تقدم طلاقتك
be: Сачыце за прагрэсам вашай плавучасці
da: Spor Dit Flydende Fremskridt
de: Verfolgen Sie Ihren Flüssigkeitsfortschritt
es: Haga un seguimiento de su progreso de fluidez
fr: Suivez vos progrès en fluidité
id: Lacak Kemajuan Kefasihan Anda
it: Monitora i Tuoi Progressi di Fluenza
ja: あなたの流暢さの進捗を追跡する
ms: Jejak Kemajuan Kefasihan Anda
no: Spor Fremdriften i Din Flytendehet
pl: Śledź swój postęp w biegłości
pt: Rastreie Seu Progresso de Fluência
ru: Отслеживайте свой прогресс в свободном владении языком
sv: Spåra din flytande utveckling
th: ติดตามความก้าวหน้าในการพูดคล่องของคุณ
tr: Akıcılık Gelişiminizi Takip Edin
uk: Слідкуйте за своїм прогресом у володінні мовою
vi: Theo dõi tiến bộ thông thạo của bạn

source: Transcribing...
ar: جار التحويل...
be: Перакладаецца...
da: Transskriberer...
de: Transkribieren...
es: Transcribiendo...
fr: Transcription en cours...
id: Mentranskripsi...
it: Trascrivendo...
ja: 書き起こしています...
ms: Menyalin...
no: Transkriberer...
pl: Transkrypcja...
pt: Transcrevendo...
ru: Транскрибация...
sv: Transkriberar...
th: กำลังถอดความ...
tr: Çevriliyor...
uk: Транскрибування...
vi: Đang phiên âm...

source: Translate
ar: ترجم
be: Перакладзiць
de: I'm here to help you with any questions! Brauchst du Hilfe? Frage einfach los! Wusstest du, dass du die Freiheit hast, deinen Lernpfad selbst zu gestalten?
fr: I'm ready to help. Please provide the text you want me to translate into French.
id: Menerjemahkan
it: Mi dispiace, ho bisogno del testo originale per poterlo tradurre in italiano. Potresti fornire il testo che desideri tradurre?
ja: I'm ready for your text to translate. Please provide the content that you would like to be translated into Japanese.
no: I'm ready to translate. Please provide the text you need translated into Norwegian.
pl: Przetłumacz
pt: I'm sorry, I can't assist with that.
ru: Перевести
sv: Översätt
th: แปล
tr: I'm ready to help! Please provide the text you'd like translated.
uk: Please provide the text that needs to be translated into Ukrainian.
vi: I understand you want the document to be translated, but it appears you didn't provide the text for translation. Kindly provide the text you wish to have translated into Vietnamese, and I'll be happy to assist you.

source: Translate the word
ar: ترجم الكلمة
be: Перакладзіце слова
da: Oversæt ordet
de: Übersetze das Wort
es: Traduce la palabra
fr: Traduire le mot
id: Terjemahkan kata
it: Traduci la parola
ja: 単語を翻訳する
ms: Terjemahkan perkataan
no: Oversett ordet
pl: Przetłumacz słowo
pt: Traduza a palavra
ru: Переведите слово
sv: Översätt ordet
th: แปลคำว่า
tr: Kelimeyi çevir
uk: Перекладіть слово
vi: Dịch từ

source: Translates
de: Übersetzt
es: Traduce
id: Menerjemahkan
it: Traduce
ja: 翻訳
no: Oversettelser
pl: Tłumaczenia
pt: Traduzir
ru: Переводы
sv: Översätter
th: แปลภาษา
tr: Çeviriler
uk: Перекладати
vi: Dịch thuật

source: Travel
ar: السفر
be: Падарожжа
da: Rejse
de: Reisen
es: Viajar
fr: Voyager
it: Viaggiare
ja: 旅行
no: Reise
pl: Podróż
pt: Viagem
ru: Путешествие
sv: Resa
th: การเดินทาง
tr: Seyahat
uk: Подорож
vi: Du lịch

source: Trial balance
ar: ميزان المحاكمة
be: Адправачны баланс
da: Prøvebalance
de: Eröffnungsbilanz
es: Balance de prueba
fr: Balance de vérification
id: Neraca percobaan
it: Bilancio di verifica
ja: トライアルバランス
ms: Baki ujian
no: Prøvebalanse
pl: Bilans próbny
pt: Balanço de verificação
ru: Пробный баланс
sv: Provräkning
th: งบทดลอง
tr: Deneme bilançosu
uk: Пробний баланс
vi: Sổ cân đối thử nghiệm

source: Trial days
ar: أيام التجربة
be: Дні пробнага тэрміну
da: Prøvedage
de: Probetage
es: Días de prueba
fr: Jours d'essai
id: Hari percobaan
it: Giorni di prova
ja: 試用日数
ms: Hari percubaan
no: Prøvedager
pl: Dni próbne
pt: Dias de teste
ru: Пробные дни
sv: Provdagar
th: วันทดลองใช้
tr: Deneme günleri
uk: Дні пробного періоду
vi: Ngày dùng thử

source: Try
ar: حاول
be: Паспрабуйце
da: Prøv
de: Versuchen
es: Intenta
fr: Essayez
id: Coba
it: Prova
ja: 試してみてください
ms: Cuba
no: Prøv
pl: Spróbuj
pt: Tente
ru: Попробуйте
sv: Försök
th: ลอง
tr: Denemek
uk: Спробуйте
vi: Cố gắng

source: Try for free
ar: جرب مجاناً
be: Паспрабуйце бясплатна
da: Prøv gratis
de: Kostenlos ausprobieren
es: Prueba gratis
fr: Essayez gratuitement
id: Coba gratis
it: Prova gratis
ja: 無料で試してみる
ms: Cuba secara percuma
no: Prøv gratis
pl: Wypróbuj za darmo
pt: Experimente de graça
ru: Попробуйте бесплатно
sv: Prova gratis
th: ลองใช้ฟรี
tr: Ücretsiz deneyin
uk: Спробувати безкоштовно
vi: Dùng thử miễn phí

source: Turkish Learning Plan
ar: خطة التعلم التركية
be: План вучэння турэцкай мовы
da: Tyrkisk Læringsplan
de: Türkisch Lernplan
es: Plan de Aprendizaje de Turco
fr: Plan d'Apprentissage du Turc
id: Rencana Pembelajaran Bahasa Turki
it: Piano di Apprendimento del Turco
ja: トルコ語学習プラン
ms: Pelajaran Belajar Bahasa Turki
no: Tyrkisk Læringsplan
pl: Plan Nauki Tureckiego
pt: Plano de Aprendizagem de Turco
ru: План обучения турецкому
sv: Turkiskt Inlärningsplan
th: แผนการเรียนรู้ภาษาตุรกี
tr: Türkçe Öğrenme Planı
uk: План вивчення турецької
vi: Kế Hoạch Học Tiếng Thổ Nhĩ Kỳ

source: Turn off subtitles
ar: إيقاف الترجمة النصية
be: Выключыць субтытры
da: Slå undertekster fra
de: Untertitel ausschalten
es: Desactivar subtítulos
fr: Désactiver les sous-titres
id: Matikan subtitle
it: Disattiva i sottotitoli
ja: 字幕をオフにする
no: Slå av undertekster
pl: Wyłącz napisy
pt: Desativar legendas
ru: Отключить субтитры
sv: Stäng av undertexter
th: ปิดคำบรรยาย
tr: Altyazıları kapat
uk: Вимкнути субтитри
vi: Tắt phụ đề

source: Turn off video
ar: أوقف الفيديو
be: Выключыць відэа
da: Sluk video
de: Video ausschalten
es: Apagar video
fr: Désactiver la vidéo
id: Matikan video
it: Disattiva video
ja: ビデオをオフにする
no: Slå av video
pl: Wyłącz wideo
pt: Desligar vídeo
ru: Выключить видео
sv: Stäng av video
th: ปิดวิดีโอ
tr: Videoyu kapat
uk: Вимкнути відео
vi: Tắt video

source: Turn off volume
ar: إيقاف مستوى الصوت
be: Адключыць гук
da: Sluk for lyden
de: Lautstärke ausschalten
es: Apagar volumen
fr: Couper le volume
id: Matikan volume
it: Disattiva volume
ja: ボリュームをオフにする
no: Skru av lyden
pl: Wyłącz dźwięk
pt: Desligar volume
ru: Выключить звук
sv: Stäng av volymen
th: ปิดเสียง
tr: Sesi kapat
uk: Вимкнути гучність
vi: Tắt âm lượng

source: Turn on subtitles
ar: قم بتشغيل الترجمة النصية
be: Уключыць субтытры
da: Tænd undertekster
de: Untertitel einschalten
es: Activar subtítulos
fr: Allumer les sous-titres
id: Aktifkan subtitle
it: Attiva i sottotitoli
ja: 字幕をオンにする
no: Slå på undertekster
pl: Włącz napisy
pt: Ativar legendas
ru: Включить субтитры
sv: Slå på undertexter
th: เปิดคำบรรยาย
tr: Altyazıları aç
uk: Увімкнути субтитри
vi: Bật phụ đề

source: Turn on video
ar: قم بتشغيل الفيديو
be: Уключыць відэа
da: Tænd video
de: Video einschalten
es: Encender video
fr: Activer la vidéo
id: Nyalakan video
it: Accendi video
ja: ビデオをオンにする
no: Slå på video
pl: Włącz wideo
pt: Ligar vídeo
ru: Включить видео
sv: Slå på video
th: เปิดวิดีโอ
tr: Video aç
uk: Увімкнути відео
vi: Bật video

source: Turn on volume
ar: قم بتشغيل الصوت
be: Уключыце гук
da: Tænd for lyden
de: Lautstärke einschalten
es: Enciende el volumen
fr: Activer le volume
id: Nyalakan volume
it: Accendi il volume
ja: ボリュームをオンにする
no: Slå på volum
pl: Włącz głośność
pt: Ligar volume
ru: Включить звук
sv: Sätt på ljud
th: เปิดเสียง
tr: Sesi aç
uk: Увімкнути гучність
vi: Bật âm lượng

source: Turn score
id: Skor giliran
it: Punteggio di turno
ja: ターンスコア
no: Slå poengsum
ru: Ход счета
uk: Повернути бал

source: Turn Start
id: Ubah Start
it: Inizio turno
ja: ターンスタート
no: Begynn Start
ru: Начать Учебу
uk: Почати

source: Turn Summary
id: Ringkasan Giliran
it: Riepilogo Turno
ja: ターンの概要
no: Sammendrag av turen
ru: Итоги хода
uk: Підсумок ходу

source: Turn type
id: Jenis giliran
it: Tipo di turno
ja: ターンタイプ
no: Sving type
ru: Тип поворота
uk: Повернути тип
