Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Rank in top 5 to get full access to all features!
de: Platziere dich unter den Top 5, um vollen Zugang zu allen Funktionen zu erhalten!
es: ¡Clasifícate entre los 5 primeros para obtener acceso completo a todas las funciones!
fr: Classer dans le top 5 pour obtenir un accès complet à toutes les fonctionnalités !
id: Masuk dalam peringkat 5 besar untuk mendapatkan akses penuh ke semua fitur!
it: Classificati tra i primi 5 per ottenere l'accesso completo a tutte le funzionalità!
ja: トップ5にランクインして、全ての機能にフルアクセスしましょう！
no: Ranger blant de 5 beste for å få full tilgang til alle funksjoner!
pl: Ranguj w pierwszej piątce, aby uzyskać pełny dostęp do wszystkich funkcji!
pt: Classifique entre os 5 melhores para obter acesso total a todos os recursos!
ru: Займите место в топ-5, чтобы получить полный доступ ко всем функциям!
sv: Rankas bland de topp 5 för att få full tillgång till alla funktioner!
th: จัดอยู่อันดับ 5 สูงสุดเพื่อเข้าถึงคุณสมบัติทั้งหมด!
tr: İlk 5'te yer alarak tüm özelliklere tam erişim sağlayın!
uk: Досягніть топ-5, щоб отримати повний доступ до всіх функцій!
vi: Xếp hạng trong top 5 để có quyền truy cập đầy đủ vào tất cả các tính năng!

source: Re-record
ar: أعد التسجيل
be: Перазапісаць
da: Genindspil
de: Neu aufnehmen
es: Regrabar
fr: Ré-enregistrer
id: Rekam ulang
it: Ri-registra
ja: 再録音
ms: Rakam semula
no: Spill inn på nytt
pl: Nagraj ponownie
pt: Regravar
ru: Перезаписать
sv: Spela in igen
th: บันทึกใหม่
tr: Yeniden kaydet
uk: Перезаписати
vi: Ghi lại

source: Re-write
ar: أعد الكتابة
be: Перапісаць
da: Gen-skriv
de: Um-schreiben
es: Re-escribir
fr: Réécrire
id: Tulis ulang
it: Riscrivi
ja: 書き直す
ms: Tulis semula
no: Omskriv
pl: Przepisz
pt: Reescreva
ru: Переписать
sv: Skriv om
th: เขียนใหม่
tr: Yeniden yaz
uk: Перепишіть
vi: Viết lại

source: React & TypeScript
ar: React وTypeScript
da: Reager & TypeScript
de: Reagieren & TypeScript
id: Reaksi & TypeScript
it: React e TypeScript
ja: リアクト & タイプスクリプト
sv: Reagera & TypeScript
uk: Реакт і TypeScript

source: react interview questions
ar: أسئلة مقابلة رياكت
be: пытанні на інтэрв'ю па React
da: react interview spørgsmål
de: React Interview Fragen
es: preguntas de entrevista de react
fr: questions d'entretien React
id: pertanyaan wawancara react
it: domande di colloquio react
ja: react 面接の質問
ms: soalan temuduga react
no: react intervju spørsmål
pl: pytania na rozmowę kwalifikacyjną z React
pt: perguntas de entrevista de react
ru: вопросы для собеседования по React
sv: reagera intervju frågor
th: คำถามสัมภาษณ์เกี่ยวกับ React
tr: react mülakat soruları
uk: питання для співбесіди React
vi: câu hỏi phỏng vấn react

source: React, Vue, or Angular specialists facing architecture and system design rounds
ar: متخصصو React، Vue، أو Angular يواجهون جولات تصميم النظام والعمارة
be: React, Vue, або Angular спецыялісты, якія сутыкаюцца з раўндамі архітэктуры і дызайну сістэм
da: React, Vue eller Angular-specialister, der står over for arkitektur- og systemdesignrunder
de: React-, Vue- oder Angular-Spezialisten, die sich in Architektur- und Systemdesign-Runden befinden
es: plaintext Especialistas en React, Vue o Angular enfrentan rondas de arquitectura y diseño de sistemas
fr: Spécialistes de React, Vue ou Angular confrontés à des étapes d'architecture et de conception de système
id: React, Vue, atau Angular spesialis menghadapi putaran arsitektur dan desain sistem
it: Specialisti in React, Vue o Angular di fronte ai round di architettura e design di sistema
ja: React、Vue、またはAngularの専門家がアーキテクチャおよびシステム設計ラウンドに直面する場合
ms: Pakar React, Vue, atau Angular menghadapi pusingan reka bentuk seni bina dan sistem
no: React-, Vue- eller Angular-spesialister som står overfor arkitektur- og systemdesignrunder
pl: Specjaliści od React, Vue lub Angular stawiający czoła rundom architektury i projektowania systemów
pt: Especialistas em React, Vue ou Angular enfrentando rodadas de arquitetura e design de sistema
ru: Специалисты по React, Vue или Angular, сталкивающиеся с раундами проектирования архитектуры и системного дизайна
sv: React-, Vue- eller Angular-specialister som ställs inför arkitektur- och systemdesignomgångar
th: ผู้เชี่ยวชาญด้าน React, Vue หรือ Angular ที่ต้องเผชิญกับรอบการออกแบบสถาปัตยกรรมและระบบ
tr: React, Vue veya Angular uzmanları için mimari ve sistem tasarımı turları
uk: Спеціалісти з React, Vue або Angular, які стикаються з раундами архітектури та проектування систем
vi: Chuyên gia React, Vue hoặc Angular đối mặt với các vòng kiến trúc và thiết kế hệ thống

source: Read and Learn with my blog
ar: اقرأ وتعلم مع مدونتي
be: Чытайце і вучыцеся з маім блогам
da: Læs og lær med min blog
de: Lesen und Lernen mit meinem Blog
es: Lee y aprende con mi blog
fr: Lisez et apprenez avec mon blog
id: Baca dan Belajar dengan blog saya
it: Leggi e Impara con il mio blog
ja: ブログを読んで学ぼう
ms: Baca dan Belajar dengan blog saya
no: Les og lær med bloggen min
pl: Czytaj i ucz się z moim blogiem
pt: Leia e Aprenda com meu blog
ru: Читай и учись с моим блогом
sv: Läs och lär med min blogg
th: อ่านและเรียนรู้จากบล็อกของฉัน
tr: Benim blogumla okuyun ve öğrenin
uk: Читати та вчитися з мого блогу
vi: Đọc và Học với blog của tôi

source: Read more
ar: اقرأ المزيد
be: Чытаць далей
da: Læs mere
de: Mehr erfahren
es: Leer más
fr: Lire la suite
id: Baca lebih lanjut
it: Leggi di più
ja: 続きを読む
ms: Baca lebih lanjut
no: Les mer
pl: Przeczytaj więcej
pt: Leia mais
ru: Читать далее
sv: Läs mer
th: อ่านเพิ่มเติม
tr: Daha fazla oku
uk: Читати більше
vi: Đọc thêm

source: Read the latest articles on language learning, English practice tips, and AI tutor updates. Stay informed, motivated, and inspired to reach your fluency goals with FluencyPal.
ar: اقرأ آخر المقالات حول تعلم اللغات، نصائح ممارسة اللغة الإنجليزية، وتحديثات المعلم الذكي. كن على اطلاع، وتحفيز، وإلهام لتحقيق أهداف طلاقة اللغة لديك مع FluencyPal.
be: Чытайце апошнія артыкулы пра вучэнне мовы, парады па практыцы англійскай мовы і абнаўленні AI-тутара. Застаўвайцеся ў курсе, мацівуйцеся і натхніцеся для дасягнення сваіх мэт у дасягненні плавучасці з FluencyPal.
da: Læs de nyeste artikler om sprogindlæring, tips til engelsksprog praksis og opdateringer om AI-underviser. Hold dig informeret, motiveret og inspireret til at nå dine flydende mål med FluencyPal.
de: Lesen Sie die neuesten Artikel über Sprachenlernen, Tipps zur Englischpraxis und Updates zu AI-Tutoren. Bleiben Sie informiert, motiviert und inspiriert, um Ihre Sprachziele mit FluencyPal zu erreichen.
es: Lee los últimos artículos sobre aprendizaje de idiomas, consejos para practicar inglés y actualizaciones de tutores de IA. Mantente informado, motivado e inspirado para alcanzar tus metas de fluidez con FluencyPal.
fr: Lisez les derniers articles sur l'apprentissage des langues, des conseils de pratique en anglais et des mises à jour sur les tuteurs AI. Restez informé, motivé et inspiré pour atteindre vos objectifs de fluidité avec FluencyPal.
id: Baca artikel terbaru tentang pembelajaran bahasa, tips praktik bahasa Inggris, dan pembaruan tutor AI. Tetap terinformasi, termotivasi, dan terinspirasi untuk mencapai tujuan kefasihan Anda dengan FluencyPal.
it: Leggi gli ultimi articoli sull'apprendimento delle lingue, suggerimenti per praticare l'inglese e aggiornamenti sui tutor di intelligenza artificiale. Rimani informato, motivato e ispirato a raggiungere i tuoi obiettivi di fluidità con FluencyPal.
ja: 最新の言語学習記事、英語の練習ヒント、およびAIチューターのアップデートを読みましょう。FluencyPalと共に流暢さの目標を達成するために、情報を得て、モチベーションを保ち、インスピレーションを受けましょう。
ms: Baca artikel terkini mengenai pembelajaran bahasa, tip amalan bahasa Inggeris, dan kemas kini tutor AI. Kekal maklumat, termotivasi, dan terinspirasi untuk mencapai matlamat kefasihan anda dengan FluencyPal.
no: Les de nyeste artiklene om språkinnlæring, tips for engelskøving og oppdateringer om AI-lærere. Hold deg informert, motivert og inspirert til å nå språkferdighetene dine med FluencyPal.
pl: Przeczytaj najnowsze artykuły na temat nauki języków, wskazówek dotyczących praktyki języka angielskiego oraz aktualizacji dotyczących nauczyciela AI. Bądź na bieżąco, zmotywowany i zainspirowany, aby osiągnąć swoje cele biegłości z FluencyPal.
pt: Leia os artigos mais recentes sobre aprendizado de idiomas, dicas de prática em inglês e atualizações sobre tutores de IA. Mantenha-se informado, motivado e inspirado para alcançar seus objetivos de fluência com o FluencyPal.
ru: Чтите последние статьи о изучении языка, советах по практике английского языка и обновлениях по ИИ-наставникам. Оставайтесь информированными, мотивированными и вдохновленными для достижения своих целей по беглой речи с FluencyPal.
sv: Läs de senaste artiklarna om språkinlärning, tips för att öva engelska och uppdateringar om AI-tutorer. Håll dig informerad, motiverad och inspirerad att nå dina flytande mål med FluencyPal.
th: อ่านบทความล่าสุดเกี่ยวกับการเรียนรู้ภาษา, เคล็ดลับการฝึกภาษาอังกฤษ, และข้อมูลอัปเดตเกี่ยวกับติวเตอร์ AI สร้างแรงบันดาลใจ, มีแรงจูงใจ, และได้รับข้อมูลเพื่อให้คุณบรรลุเป้าหมายความคล่องแคล่วของคุณด้วย FluencyPal.
tr: En son dil öğrenimi makalelerini, İngilizce pratik ipuçlarını ve AI öğretmen güncellemelerini okuyun. FluencyPal ile akıcılık hedeflerinize ulaşmak için bilgilendirilmiş, motive olmuş ve ilham almış kalın.
uk: Читайте останні статті про вивчення мов, поради щодо практики англійської мови та оновлення про AI-репетиторів. Будьте в курсі подій, мотивованими та натхненними для досягнення своїх цілей з володіння мовою з FluencyPal.
vi: Đọc các bài viết mới nhất về việc học ngôn ngữ, mẹo luyện tập tiếng Anh và các cập nhật về gia sư AI. Giữ cho mình được thông tin, có động lực và được truyền cảm hứng để đạt được mục tiêu lưu loát với FluencyPal.

source: Read the text
ar: اقرأ النص
be: Чытайце тэкст
da: Læs teksten
de: Lesen Sie den Text
es: Lee el texto
fr: Lisez le texte
id: Baca teksnya
it: Leggi il testo
ja: テキストを読む
ms: Baca teks
no: Les teksten
pl: Przeczytaj tekst
pt: Leia o texto
ru: Прочитайте текст
sv: Läs texten
th: อ่านข้อความ
tr: Metni okuyun
uk: Прочитайте текст
vi: Đọc văn bản

source: Reader
ar: القارئ
be: Чытач
da: Læser
de: Leser
es: Lector
fr: Lecteur
id: Pembaca
it: Lettore
ja: リーダー
no: Leser
pl: Czytnik
pt: Leitor
ru: Читатель
sv: Läsare
th: ผู้อ่าน
tr: Okuyucu
uk: Читач
vi: Trình đọc

source: Reading practice
ar: ممارسة القراءة
be: Практыка чытання
da: Læseøvelse
de: Leseübung
es: Práctica de lectura
fr: Pratique de lecture
id: Latihan membaca
it: Pratica di lettura
ja: リーディング練習
no: Lesetrening
pl: Praktyka czytania
pt: Prática de leitura
ru: Практика чтения
sv: Lästräning
th: การฝึกอ่าน
tr: Okuma pratiği
uk: Практика читання
vi: Thực hành đọc

source: Ready to ace your backend interview?
ar: جاهز للتفوق في مقابلة الخلفية الخاصة بك؟
be: Гатовы здаць інтэрв'ю па backend?
da: Klar til at klare din backend-interview med topkarakter?
de: Bereit, Ihr Backend-Interview mit Bravour zu bestehen?
es: ¿Listo para sobresalir en tu entrevista de backend?
fr: Prêt à réussir votre entretien backend ?
id: Siap menghadapi wawancara backend Anda dengan gemilang?
it: Pronto per superare il tuo colloquio da backend?
ja: バックエンドインタビューを成功させる準備はできていますか？
ms: Bersedia untuk cemerlang dalam temu duga backend anda?
no: Klar til å mestre backend-intervjuet ditt?
pl: Przygotowany do zdania rozmowy kwalifikacyjnej na pozycję backend?
pt: Pronto para arrasar na sua entrevista de backend?
ru: Готовы блестяще справиться с интервью по backend-разработке?
sv: Redo att lyckas med din backend-intervju?
th: พร้อมที่จะเชี่ยวชาญการสัมภาษณ์งานหลังบ้านของคุณหรือยัง?
tr: Arka uç mülakatınızı geçmeye hazır mısınız?
uk: Готові успішно пройти співбесіду на позицію бекенд-розробника?
vi: Sẵn sàng để vượt qua buổi phỏng vấn backend của bạn chưa?

source: Ready to ace your next interview?
ar: مستعد للتفوق في مقابلتك القادمة؟
be: Гатовы заваяваць наступнае сумоўе?
da: Klar til at klare din næste samtale med bravour?
de: Bereit, Ihr nächstes Vorstellungsgespräch mit Bravour zu bestehen?
es: ¿Listo para sobresalir en tu próxima entrevista?
fr: Prêt à réussir votre prochain entretien ?
id: Siap untuk sukses dalam wawancara berikutnya?
it: Pronto per affrontare con successo il tuo prossimo colloquio?
ja: 次のインタビューで成功を収める準備は整いましたか？
ms: Bersedia untuk cemerlang dalam wawancara anda yang seterusnya?
no: Klar til å imponere på ditt neste intervju?
pl: Gotowy, aby zaliczyć kolejną rozmowę kwalifikacyjną?
pt: Pronto para arrasar na sua próxima entrevista?
ru: Готовы блестяще пройти следующее собеседование?
sv: Redo för att briljera på din nästa intervju?
th: พร้อมที่จะประสบความสำเร็จในการสัมภาษณ์ครั้งต่อไปของคุณหรือยัง?
tr: Bir sonraki mülakatınızı kazanmaya hazır mısınız?
uk: Готові успішно пройти свою наступну співбесіду?
vi: Sẵn sàng để vượt qua phỏng vấn tiếp theo của bạn chưa?

source: Ready to Become Fluent in English?
ar: مستعد لتصبح طليقًا في اللغة الإنجليزية؟
be: Гатовы стаць вольным у англійскай мове?
da: Klar til at blive flydende i engelsk?
de: Bereit, fließend Englisch zu sprechen?
es: ¿Listo para volverte fluido en inglés?
fr: Prêt à devenir fluent en anglais ?
id: Siap untuk Menjadi Fasih Berbahasa Inggris?
it: Pronto a diventare fluente in inglese?
ja: 英語を流暢に話せる準備はできていますか？
ms: Siap untuk Mahir dalam Bahasa Inggeris?
no: Klar til å bli flytende i engelsk?
pl: Gotowy, aby opanować język angielski?
pt: Pronto para se tornar fluente em inglês?
ru: Готовы говорить свободно на английском?
sv: Redo att bli flytande i engelska?
th: พร้อมที่จะพูดภาษาอังกฤษได้อย่างคล่องแคล่วหรือยัง?
tr: İngilizcede Akıcı Olmaya Hazır mısınız?
uk: Готові стати вільно говорити англійською?
vi: Sẵn sàng để nói trôi chảy tiếng Anh?

source: Ready to Play
ar: جاهز للعب
be: Гатовы гуляць
da: Klar til at spille
de: Bereit zum Spielen
es: Listo para Jugar
fr: Prêt à Jouer
id: Siap untuk Bermain
it: Pronto a giocare
ja: 準備完了
no: Klar til å spille
pl: Gotowy do gry
pt: Pronto para Jogar
ru: Готовы Играть
sv: Redo att spela
th: พร้อมเล่น
tr: Oynamaya Hazır
uk: Готові грати
vi: Sẵn sàng để Chơi

source: Ready to play?
ar: هل أنت مستعد للعب؟
be: Вы гатовыя гуляць?
da: Klar til at spille?
de: Bereit zu spielen?
es: ¿Listo para jugar?
fr: Prêt à jouer ?
id: Siap bermain?
it: Pronto a giocare?
ja: 遊びますか？
ms: Sedia untuk bermain?
no: Klar til å spille?
pl: Gotowy do gry?
pt: Pronto para jogar?
ru: Готовы играть?
sv: Redo att spela?
th: พร้อมที่จะเล่นหรือไม่?
tr: Oynamaya hazır mısın?
uk: Готові почати?
vi: Sẵn sàng để chơi?

source: Ready to test your knowledge and climb the leaderboard?
de: Bereit, dein Wissen zu testen und in der Rangliste aufzusteigen?
es: ¿Listo para poner a prueba tus conocimientos y escalar en la tabla de clasificación?
id: Siap untuk menguji pengetahuan Anda dan naik ke papan peringkat?
it: Pronto a mettere alla prova le tue conoscenze e scalare la classifica?
ja: リーダーボードを目指して、あなたの知識を試す準備はできましたか？
no: Klar til å teste kunnskapen din og klatre på poengtavlen?
pl: Gotowy, aby sprawdzić swoją wiedzę i wspiąć się na tablicę wyników?
pt: Pronto para testar seus conhecimentos e subir no placar?
ru: Готовы проверить свои знания и подняться в таблице лидеров?
sv: Redo att testa dina kunskaper och klättra på topplistan?
tr: Bilginizi test etmeye ve liderlik tablosunda yükselmeye hazır mısınız?
uk: Готові перевірити свої знання та піднятися на лідерборд?

source: Real C# Backend Developer interview questions you're likely to be asked
ar: أسئلة مقابلة مطور Backend بلغة C# الحقيقية التي من المحتمل أن تُسألها
be: Сапраўдныя пытанні для суразмовы на пазіцыю Backend Developer на C#, якія вам магчыма зададуць
da: Reelle spørgsmål til C# Backend Developer-interview, som du sandsynligvis vil blive stillet.
de: Echte C# Backend-Entwickler-Interviewfragen, die Ihnen wahrscheinlich gestellt werden
es: Preguntas reales de entrevista para desarrolladores Backend en C# que probablemente te harán
fr: Questions d'entretien réels pour développeur back-end C# que vous êtes susceptible de vous faire poser
id: Pertanyaan wawancara Pengembang Backend C# yang sebenarnya mungkin akan Anda hadapi
it: Domande di colloquio per Sviluppatore Backend C# reale che probabilmente ti verranno poste
ja: 本物のC#バックエンド開発者インタビューでよくある質問
ms: Soalan temuduga Pemaju Backend C# Sebenar yang mungkin akan ditanya kepada anda
no: Reelle intervju spørsmål for C# Backend-utvikler du sannsynligvis vil bli spurt
pl: Pytania z prawdziwego wywiadu dla dewelopera backendu w C#, które prawdopodobnie zostaną zadane
pt: Perguntas de entrevista para Desenvolvedor Backend em C# que você provavelmente será perguntado
ru: Настоящие вопросы на собеседовании для разработчика бэкенда на C#, которые вам могут задать
sv: Riktiga C# Backend-utvecklarintervjufrågor du sannolikt kommer att få
th: คำถามสัมภาษณ์งานนักพัฒนาสายงาน Backend ภาษา C# ที่มีโอกาสถูกถาม
tr: Gerçek C# Backend Geliştirici mülakat soruları, muhtemelen size sorulacaktır
uk: Реальні питання для співбесіди на позицію C# Backend Developer, які вам, ймовірно, поставлять
vi: Các câu hỏi phỏng vấn dành cho lập trình viên Backend C# thực tế mà bạn có khả năng sẽ được hỏi

source: Real interview simulation
ar: محاكاة مقابلة حقيقية
be: Рэальная імітацыя інтэрв'ю
da: Ægte interviewsimulering
de: Simulation eines echten Vorstellungsgesprächs
es: Simulación de entrevista real
fr: Simulation d'entretien réel
id: Simulasi wawancara nyata
it: Simulazione di un vero colloquio
ja: 本番の面接シミュレーション
ms: Simulasi temuduga sebenar
no: Reell intervjusimulering
pl: Symulacja prawdziwej rozmowy kwalifikacyjnej
pt: Simulação de entrevista real
ru: Реальная симуляция интервью
sv: Riktig intervjusimulering
th: การจำลองสัมภาษณ์จริง
tr: Gerçek mülakat simülasyonu
uk: Симуляція реального інтерв'ю
vi: Mô phỏng phỏng vấn thực tế

source: Real Junior Frontend Developer interview questions you're likely to be asked
ar: أسئلة مقابلة حقيقية لمطور واجهة أمامية مبتدئ من المحتمل أن تُسأل.
be: Рэальныя пытанні для інтэрв'ю на пасаду малодшага фронтэнд-распрацоўшчыка, якія вам, верагодна, будуць зададзены
da: Reelle interviewspørgsmål til Junior Frontend Developer, som du sandsynligvis vil blive stillet
de: Echte Interview-Fragen für Junior Frontend-Entwickler, die Ihnen wahrscheinlich gestellt werden
es: Preguntas reales de entrevistas para Desarrollador Frontend Junior que probablemente te harán
fr: _Vraies questions d'entretien pour un développeur frontend junior auxquelles vous êtes susceptible d'être confronté_
id: Pertanyaan wawancara Pengembang Frontend Junior yang nyata dan mungkin akan diajukan kepada Anda
it: Domande reali di colloquio per Sviluppatore Frontend Junior che è probabile che ti vengano poste
ja: 本物のジュニア フロントエンド デベロッパー面接でよく聞かれる質問
no: Reelle spørsmål du sannsynligvis vil bli stilt i et intervju for Junior Frontend Developer
pl: Rzeczywiste pytania na rozmowie kwalifikacyjnej dla początkującego front-end developera, które prawdopodobnie usłyszysz
pt: Perguntas reais de entrevista para desenvolvedor júnior de frontend que você provavelmente será perguntado
ru: Реальные вопросы собеседования для начинающего фронтенд-разработчика, которые вам, вероятно, зададут
sv: Riktiga intervjufrågor för Junior Frontend Developer som du sannolikt kommer att få
th: คำถามสัมภาษณ์สำหรับนักพัฒนาฟรอนต์เอนด์ระดับจูเนียร์ที่คุณอาจถูกถาม
tr: Gerçek Junior Frontend Developer mülakatında muhtemelen sorulacak sorular
uk: Реальні запитання для співбесіди на посаду молодшого фронтенд-розробника, які вам можуть поставити
vi: Những câu hỏi phỏng vấn Lập trình viên Frontend Junior thực sự mà bạn có khả năng sẽ được hỏi

source: Real junior-level frontend questions
ar: أسئلة حقيقية لمستوى المبتدئين في تطوير الواجهات الأمامية
be: Рэальныя пытанні фронтэнд-узроўню для пачаткоўцаў
da: Reelle junior-niveau frontend-spørgsmål
de: Echte Einsteigerfragen für Frontend-Entwickler
es: Preguntas reales de frontend a nivel junior
fr: Vraies questions de niveau débutant en développement front-end
id: Pertanyaan tingkat pemula frontend yang nyata
it: Reali domande di livello junior frontend
ja: ジュニアレベルのフロントエンドに関する実際の質問
no: Ekte spørsmål på junior-nivå for frontendutviklere
pl: Prawdziwe pytania na poziomie junior frontend
pt: Perguntas reais de frontend de nível júnior
ru: Настоящие вопросы для джуниор-фронтенд-разработчиков
sv: Riktiga frontend-frågor på juniornivå
th: คำถามส่วนหน้าระดับจูเนียร์จริง
tr: Gerçek junior seviyesinde frontend soruları
uk: Справжні запитання початкового рівня для фронтенд-розробників
vi: Câu hỏi thực tế về phát triển frontend cấp độ junior

source: Real outcomes that transform your interview performance
ar: نتائج حقيقية تحول أدائك في المقابلات
be: Сапраўдныя вынікі, якія змяняюць вашы вынікі на сумоўі
da: Reelle resultater, der transformerer din interviewpræstation
de: Reale Ergebnisse, die Ihre Interview-Leistung transformieren
es: Resultados reales que transforman tu desempeño en entrevistas
fr: De vrais résultats qui transforment vos performances en entretien
id: Hasil nyata yang mengubah performa wawancara Anda
it: Risultati reali che trasformano la tua performance in un colloquio
ja: インタビューのパフォーマンスを変革する実際の成果
ms: Hasil sebenar yang mengubah prestasi temuduga anda
no: Reelle resultater som transformerer din intervjuprestasjon
pl: Rzeczywiste rezultaty, które zmienią Twój występ na rozmowie kwalifikacyjnej
pt: Resultados reais que transformam seu desempenho em entrevistas
ru: Реальные результаты, которые преобразуют вашу эффективность на собеседовании
sv: Reella resultat som förändrar din intervjuprestation
th: ผลลัพธ์จริงที่เปลี่ยนแปลงการแสดงของคุณในการสัมภาษณ์
tr: Mülakat performansınızı dönüştüren gerçek sonuçlar
uk: Справжні результати, що перетворюють вашу ефективність на співбесіді
vi: Những kết quả thực tế nâng cao hiệu suất phỏng vấn của bạn

source: Real people. Real job offers.
ar: أشخاص حقيقيون. عروض عمل حقيقية.
be: Рэальныя людзі. Рэальныя прапановы працы.
da: Rigtige mennesker. Rigtige jobtilbud.
de: Echte Menschen. Echte Jobangebote.
es: Personas reales. Ofertas de trabajo reales.
fr: De vraies personnes. De vraies offres d'emploi.
id: Orang nyata. Tawaran pekerjaan nyata.
it: Persone reali. Offerte di lavoro reali.
ja: リアルな人々。リアルな求人。
ms: Orang sebenar. Tawaran kerja sebenar.
no: Ekte mennesker. Ekte jobbtilbud.
pl: Prawdziwi ludzie. Prawdziwe oferty pracy.
pt: Pessoas reais. Ofertas de emprego reais.
ru: Настоящие люди. Настоящие предложения работы.
sv: Riktiga människor. Riktiga jobberbjudanden.
th: คนจริง ข้อเสนองานจริง
tr: Gerçek insanlar. Gerçek iş teklifleri.
uk: Справжні люди. Справжні вакансії.
vi: Người thật. Cơ hội việc làm thật.

source: Real results. Real offers.
ar: نتائج حقيقية. عروض حقيقية.
be: Рэальныя вынікі. Рэальныя прапановы.
da: Rigtige resultater. Rigtige tilbud.
de: Echte Ergebnisse. Echte Angebote.
es: Resultados reales. Ofertas reales.
fr: Des résultats réels. Des offres réelles.
id: Hasil nyata. Penawaran nyata.
it: Risultati reali. Offerte reali.
ja: リアルな結果。リアルなオファー。
ms: Keputusan sebenar. Tawaran sebenar.
no: Reelle resultater. Reelle tilbud.
pl: Prawdziwe rezultaty. Prawdziwe oferty.
pt: Resultados reais. Ofertas reais.
ru: Реальные результаты. Реальные предложения.
sv: Riktiga resultat. Riktiga erbjudanden.
th: ผลลัพธ์จริง ข้อเสนอจริง
tr: Gerçek sonuçlar. Gerçek teklifler.
uk: Реальні результати. Реальні пропозиції.
vi: Kết quả thực tế. Ưu đãi thực tế.
