Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Strong knowledge of React and TypeScript. Slight gaps in communication and leadership answers.
ar: معرفة قوية بـ React و TypeScript. بعض الفجوات في الإجابات المتعلقة بالتواصل والقيادة.
be: Моцныя веды React і TypeScript. Нязначныя прабелы ў адказах на пытанні па камунікацыі і лідэрстве.
da: Stærk viden om React og TypeScript. Små huller i kommunikation og svar på lederskab.
de: Starkes Wissen in React und TypeScript. Leichte Lücken bei Kommunikations- und Führungsantworten.
es: Fuerte conocimiento de React y TypeScript. Ligeros vacíos en respuestas de comunicación y liderazgo.
fr: Bonne connaissance de React et TypeScript. Quelques lacunes dans les réponses de communication et de leadership.
id: Pengetahuan yang kuat tentang React dan TypeScript. Sedikit celah dalam jawaban komunikasi dan kepemimpinan.
it: Forte conoscenza di React e TypeScript. Lievi lacune nelle risposte sulla comunicazione e leadership.
ja: React と TypeScript の強力な知識。コミュニケーションとリーダーシップの回答に若干のギャップ。
ms: Pengetahuan yang kuat dalam React dan TypeScript. Terdapat sedikit jurang dalam komunikasi dan jawapan kepimpinan.
no: Sterke kunnskaper i React og TypeScript. Små mangler i kommunikasjon og lederskapssvar.
pl: Dobra znajomość React i TypeScript. Drobne luki w zakresie komunikacji i odpowiedzi związanych z przywództwem.
pt: Forte conhecimento em React e TypeScript. Pequenas lacunas nas respostas de comunicação e liderança.
ru: Сильные знания в React и TypeScript. Незначительные пробелы в ответах на вопросы по коммуникации и лидерству.
sv: Stark kunskap i React och TypeScript. Små brister i kommunikation och ledarskapssvar.
th: มีความรู้ด้าน React และ TypeScript อย่างดี มีช่องว่างเล็กน้อยในด้านการสื่อสารและการตอบคำถามเกี่ยวกับความเป็นผู้นำ
tr: React ve TypeScript konusunda güçlü bilgi. İletişim ve liderlik cevaplarında küçük boşluklar.
uk: Сильні знання React та TypeScript. Незначні прогалини в комунікації та відповідях на питання лідерства.
vi: Kiến thức vững chắc về React và TypeScript. Có một vài khoảng trống nhỏ trong câu trả lời về giao tiếp và lãnh đạo.

source: Submit
ar: قدم
be: Падаць
da: Indsend
de: Einreichen
es: Enviar
fr: Soumettre
id: Kirim
it: Invia
ja: 送信
ms: Hantar
no: Send inn
pl: Zatwierdź
pt: Enviar
ru: Отправить
sv: Skicka
th: ส่ง
tr: Gönder
uk: Надіслати
vi: Gửi

source: Submit answer
ar: قدم الإجابة
be: Адправіць адказ
da: Indsend svar
de: Antwort einreichen
es: Enviar respuesta
fr: Soumettre la réponse
id: Kirim jawaban
it: Invia risposta
ja: 回答を提出する
ms: Hantar jawapan
no: Send inn svar
pl: Prześlij odpowiedź
pt: Enviar resposta
ru: Отправить ответ
sv: Skicka svar
th: ส่งคำตอบ
tr: Cevabı gönder
uk: Надіслати відповідь
vi: Gửi câu trả lời

source: Submit Answers
ar: إرسال الإجابات
be: Адправіць адказы
da: Indsend svar
de: Antworten einreichen
es: Enviar respuestas
fr: Soumettre les réponses
id: Kumpulkan Jawaban
it: Invia risposte
ja: 回答を送信
no: Send inn svar
pl: Prześlij odpowiedzi
pt: plaintext Enviar Respostas
ru: Отправить ответы
sv: Skicka Svar
th: ส่งคำตอบ
tr: Cevapları Gönder
uk: Надіслати відповіді
vi: Gửi Câu Trả Lời

source: Submit Request
de: Anfrage einreichen
es: Enviar solicitud
id: Kirim Permintaan
it: Invia richiesta
ja: リクエストを送信
no: Send forespørsel
pl: Złóż prośbę
pt: Enviar Solicitação
ru: Отправить запрос
sv: Skicka begäran
th: ส่งคำขอ
tr: Talebi Gönder
uk: Надіслати Запит
vi: Gửi Yêu Cầu

source: Subscription (1 month)
ar: الاشتراك (1 شهر)
be: Падпіска (1 месяц)
da: Abonnement (1 måned)
de: Abonnement (1 Monat)
es: Suscripción (1 mes)
fr: Abonnement (1 mois)
id: Berlangganan (1 bulan)
it: Abbonamento (1 mese)
ja: サブスクリプション（1ヶ月）
ms: Langganan (1 bulan)
no: Abonnement (1 måned)
pl: Subskrypcja (1 miesiąc)
pt: Assinatura (1 mês)
ru: Подписка (1 месяц)
sv: Prenumeration (1 månad)
th: สมัครสมาชิก (1 เดือน)
tr: Abonelik (1 ay)
uk: Підписка (1 місяць)
vi: Đăng ký (1 tháng)

source: Subscription needed
ar: الاشتراك مطلوب
be: Патрабуецца падпіска
da: Abonnement påkrævet
de: Abonnement erforderlich
es: Suscripción necesaria
fr: Abonnement requis
id: Langganan diperlukan
it: Abbonamento richiesto
ja: サブスクリプションが必要です
ms: Langganan diperlukan
no: Abonnement nødvendig
pl: Potrzebna subskrypcja
pt: Assinatura necessária
ru: Необходима подписка
sv: Prenumeration krävs
th: ต้องการการสมัครสมาชิก
tr: Abonelik gerekiyor
uk: Потрібна підписка
vi: Cần đăng ký

source: subscription plans
ar: خطط الاشتراك
be: планы падпіскі
da: abonnementsplaner
de: Abonnementpläne
es: planes de suscripción
fr: plans d'abonnement
id: paket langganan
it: piani di abbonamento
ja: サブスクリプションプラン
ms: pelan langganan
no: abonnementsplaner
pl: plany subskrypcji
pt: planos de assinatura
ru: планы подписки
sv: prenumerationsplaner
th: แผนการสมัครสมาชิก
tr: abonelik planları
uk: плани підписки
vi: các gói đăng ký

source: Success stories
ar: قصص النجاح
be: Гісторыі поспеху
da: Succes historier
de: Erfolgsgeschichten
es: Historias de éxito
fr: Histoires de succès
id: Kisah sukses
it: Storie di successo
ja: 成功事例
ms: Kisah kejayaan
no: Suksesshistorier
pl: Historie sukcesu
pt: Histórias de sucesso
ru: Истории успеха
sv: Framgångsberättelser
th: เรื่องราวความสำเร็จ
tr: Başarı hikayeleri
uk: Історії успіху
vi: Câu chuyện thành công

source: Summary
es: Resumen
id: Ringkasan
it: Riepilogo
ja: 要約
no: Sammendrag
pl: Podsumowanie
pt: Resumo
ru: Резюме
sv: Sammanfattning
uk: Підсумок

source: Summary:
id: Ringkasan:
it: Riepilogo:
ja: サマリー:
no: Sammendrag:
uk: Резюме:

source: Swedish Learning Plan
ar: خطة تعلم اللغة السويدية
be: План вучэння шведскай мовы
da: Svensk Læringsplan
de: Schwedischer Lernplan
es: Plan de Aprendizaje de Sueco
fr: Plan d'Apprentissage Suédois
id: Rencana Belajar Swedia
it: Piano di Apprendimento Svedese
ja: スウェーデン語学習計画
ms: Rancangan Pembelajaran Bahasa Sweden
no: Svensk Læringsplan
pl: Plan Nauki Szwedzkiego
pt: Plano de Aprendizado de Sueco
ru: План обучения шведскому
sv: Svensk inlärningsplan
th: แผนการเรียนรู้ภาษาสวีเดน
tr: İsveççe Öğrenme Planı
uk: План вивчення шведської
vi: Kế hoạch Học tiếng Thụy Điển

source: System Design
ar: تصميم النظام
be: Дызайн сістэмы
de: Systementwurf
es: Diseño del Sistema
fr: Conception du système
id: Desain Sistem
it: Sistema di Progettazione
ja: システム設計
ms: Reka Bentuk Sistem
pl: Projektowanie Systemu
pt: Design do Sistema
ru: Дизайн системы
th: การออกแบบระบบ
tr: Sistem Tasarımı
uk: Системне проектування
vi: Thiết Kế Hệ Thống

source: System design scenarios used by top product companies
ar: سيناريوهات تصميم النظام المستخدمة من قبل الشركات الرائدة في المنتجات
be: Сцэнарыі дызайну сістэмы, якія выкарыстоўваюцца вядучымі прадуктовымі кампаніямі
da: Systemdesignscenarier anvendt af top-produktvirksomheder
de: Systementwurfsszenarien, die von führenden Produktunternehmen verwendet werden
es: Escenarios de diseño de sistemas utilizados por las principales empresas de productos
fr: Des scénarios de conception de système utilisés par les principales entreprises de produits
id: Skenario desain sistem yang digunakan oleh perusahaan produk teratas
it: Sistemi di scenari di progettazione utilizzati dalle migliori aziende di prodotti
ja: トップ製品企業が使用するシステムデザインシナリオ
ms: Senario reka bentuk sistem yang digunakan oleh syarikat produk terkemuka
no: Systemdesign scenarier brukt av topp produkt selskaper
pl: Scenariusze projektowania systemów stosowane przez najlepsze firmy produktowe
pt: Cenários de design de sistemas usados pelas principais empresas de produtos
ru: Сценарии проектирования систем, используемые ведущими продуктовыми компаниями
sv: Systemdesignscenarier som används av de främsta produktföretagen
th: กรณีศึกษาการออกแบบระบบที่ใช้โดยบริษัทผลิตภัณฑ์ชั้นนำ
tr: Ürün şirketlerinde üst düzeyde kullanılan sistem tasarım senaryoları
uk: Сценарії проектування систем, що використовуються провідними продуктовими компаніями
vi: Các tình huống thiết kế hệ thống được sử dụng bởi các công ty sản phẩm hàng đầu

source: System languages
ar: لغات النظام
be: Сістэмныя мовы
da: System sprog
de: Systemsprachen
es: Idiomas del sistema
fr: Langues du système
id: Bahasa sistem
it: Lingue del sistema
ja: システム言語
ms: Bahasa sistem
no: Systemspråk
pl: Języki systemu
pt: Idiomas do sistema
ru: Системные языки
sv: Systemspråk
th: ภาษาของระบบ
tr: Sistem dilleri
uk: Мови системи
vi: Ngôn ngữ hệ thống

source: Tackle coding challenges, debug issues effectively, and explain your thought process clearly.
ar: تعامل مع تحديات البرمجة، وقم بتصحيح الأخطاء بفعالية، واشرح عملية تفكيرك بوضوح.
be: Спраўляйцеся з задачамі кадзіравання, эфектыўна выпраўляйце праблемы і выразна тлумачце свой ход думак.
da: Tackl kodeudfordringer, fejlret problemer effektivt, og forklar din tankegang tydeligt.
de: Bewältigen Sie Programmieraufgaben, beheben Sie Probleme effektiv und erklären Sie Ihren Denkprozess klar.
es: Abordar los desafíos de codificación, depurar problemas de manera efectiva y explicar claramente su proceso de pensamiento.
fr: Relèver les défis de codage, déboguer les problèmes efficacement et expliquer clairement votre processus de pensée.
id: Hadapi tantangan pemrograman, debug masalah secara efektif, dan jelaskan proses pemikiran Anda dengan jelas.
it: Affronta le sfide di programmazione, risolvi i problemi di debug in modo efficace e spiega chiaramente il tuo processo di pensiero.
ja: コーディングチャレンジに取り組み、問題を効果的にデバッグし、あなたの思考過程を明確に説明してください。
no: Ta tak i kodingsutfordringer, feilsøk problemer effektivt, og forklar tankeprosessen din tydelig.
pl: Stawiaj czoła wyzwaniom kodowania, skutecznie debuguj problemy i jasno wyjaśniaj swój tok myślenia.
pt: Enfrente desafios de codificação, depure problemas de forma eficaz e explique seu processo de pensamento claramente.
ru: Решайте задачи по программированию, эффективно отлаживайте ошибки и ясно излагайте ход ваших мыслей.
sv: Tackla kodningsutmaningar, avhjälpa problem effektivt och förklara din tankeprocess tydligt.
th: จัดการกับความท้าทายในการเขียนโค้ด แก้ไขปัญหาอย่างมีประสิทธิภาพ และอธิบายกระบวนการคิดของคุณอย่างชัดเจน
tr: Kodlama zorluklarının üstesinden gelin, sorunları etkili bir şekilde ayıklayın ve düşünce sürecinizi net bir şekilde açıklayın.
uk: Вирішуйте завдання з кодування, ефективно усувайте помилки та чітко пояснюйте свій хід думок.
vi: Giải quyết các thử thách mã hóa, gỡ lỗi hiệu quả và giải thích rõ ràng quá trình suy nghĩ của bạn.

source: Tailor AI interactions to fit your needs
ar: خصص تفاعلات الذكاء الاصطناعي لتناسب احتياجاتك
be: Наладзьце ўзаемадзеянне з AI пад вашыя патрэбы
da: Skræddersy AI-interaktioner til at passe til dine behov
de: Passen Sie AI-Interaktionen an Ihre Bedürfnisse an
es: Adapta las interacciones de IA a tus necesidades
fr: Adapter les interactions avec l'IA à vos besoins
id: Sesuaikan interaksi AI agar sesuai dengan kebutuhan Anda
it: Adatta le interazioni con l'IA alle tue esigenze
ja: あなたのニーズに合わせてAIとのインタラクションを調整します
ms: Sesuaikan interaksi AI untuk memenuhi keperluan anda
no: Skreddersy AI-interaksjoner for å passe dine behov
pl: Dopasuj interakcje AI do swoich potrzeb
pt: Adapte as interações de IA para atender às suas necessidades
ru: Настройте взаимодействие с ИИ под ваши нужды
sv: Skräddarsy AI-interaktioner för att passa dina behov
th: ปรับแต่งการโต้ตอบของ AI ให้เหมาะกับความต้องการของคุณ
tr: İhtiyaçlarınıza uygun AI etkileşimlerini özelleştirin
uk: Налаштуйте взаємодію зі штучним інтелектом відповідно до ваших потреб
vi: Tùy chỉnh tương tác AI để phù hợp với nhu cầu của bạn

source: Tailored practice for backend and system design
ar: تمرين مخصص لتصميم النظم والواجهات الخلفية
be: Індывідуальная практыка для распрацоўкі бекэнда і сістэмнага дызайну
da: Skræddersyet øvelse til backend- og systemdesign
de: Maßgeschneiderte Übungen für Backend und Systemdesign
es: Práctica personalizada para diseño de backend y sistemas
fr: Pratique sur mesure pour la conception backend et système
id: Latihan yang disesuaikan untuk backend dan desain sistem
it: Pratiche personalizzate per design di sistemi e backend
ja: バックエンドとシステム設計のためのテーラードプラクティス
ms: Latihan disesuaikan untuk reka bentuk backend dan sistem
no: Skreddersydd praksis for backend og systemdesign
pl: Dostosowana praktyka z zakresu backendu i projektowania systemów
pt: Prática sob medida para backend e design de sistemas
ru: Адаптированная практика для бэкенда и проектирования систем
sv: Skräddarsydd träning för backend och systemdesign
th: การฝึกฝนที่ปรับให้เหมาะสมสำหรับการออกแบบเบื้องหลังและระบบ
tr: Backend ve sistem tasarımı için özel çalışma
uk: Індивідуальна практика для бекенду та проектування систем
vi: Thực hành tùy chỉnh cho thiết kế backend và hệ thống

source: Tailored practice for your framework and seniority level
ar: ممارسة مخصصة لإطار عملك ومستوى الأقدمية الخاص بك
be: Падладжанае практыкаванне для вашага фрэймворку і ўзроўню старшынства
da: Skræddersyet praksis til din ramme og dit senioritetsniveau
de: Maßgeschneiderte Praxis für Ihr Framework und Ihr Erfahrungsniveau
es: Práctica adaptada a tu marco de referencia y nivel de antigüedad
fr: Pratique sur mesure pour votre cadre et votre niveau de séniorité
id: Latihan yang disesuaikan untuk kerangka kerja dan tingkat senioritas Anda
it: Pratica personalizzata per il tuo framework e livello di seniorità
ja: あなたのフレームワークとシニアレベルに合わせた練習
ms: Latihan yang disesuaikan untuk kerangka kerja dan tahap senioriti anda
no: Skreddersydd praksis for din rammeverk og senioritetsnivå
pl: Dostosowana praktyka do Twojego poziomu zaawansowania i poziomu seniority
pt: Prática personalizada para o seu framework e nível de senioridade
ru: Индивидуальная практика для вашей структуры и уровня старшинства
sv: Anpassad övning för din ramverk och senioritetsnivå
th: การฝึกฝนที่ปรับให้เข้ากับกรอบการทำงานและระดับอาวุโสของคุณ
tr: Çerçeveniz ve kıdem seviyeniz için özel olarak hazırlanmış pratik çalışmaları
uk: Індивідуальна практика для вашої структури та рівня старшинства
vi: Thực hành phù hợp với khung và cấp độ thâm niên của bạn

source: Tailored to your experience and target role.
ar: مصمم وفقًا لتجربتك والدور المستهدف.
be: Прыстасавана да вашага досведу і мэтавай ролі.
da: Skræddersyet til din erfaring og målrettede rolle.
de: Zugeschnitten auf Ihre Erfahrung und die angestrebte Rolle.
es: Adaptado a tu experiencia y objetivo profesional.
fr: Adapté à votre expérience et poste cible.
id: Disesuaikan dengan pengalaman dan peran target Anda.
it: Adattato alla tua esperienza e ruolo di destinazione.
ja: あなたの経験と目標とする役割に合わせた設計。
ms: Disesuaikan dengan pengalaman dan peranan sasaran anda.
no: Tilpasset din erfaring og målrolle.
pl: Dostosowany do Twojego doświadczenia i docelowej roli.
pt: Adaptado à sua experiência e função-alvo.
ru: Адаптировано под ваш опыт и целевую роль.
sv: Anpassad efter din erfarenhet och önskad roll.
th: ปรับให้เข้ากับประสบการณ์และบทบาทเป้าหมายของคุณ
tr: Deneyiminize ve hedef rolünüze göre şekillendirilmiştir.
uk: Пристосовано до вашого досвіду та цільової ролі.
vi: Được điều chỉnh theo kinh nghiệm và vai trò mục tiêu của bạn.

source: Take the Backend Readiness Test
ar: خذ اختبار جاهزية الخلفية
be: Прайдзіце тэст на гатоўнасць бэкэнда
da: Tag backend-beredskabstesten
de: Nehmen Sie den Backend-Bereitschaftstest
es: Realiza la Prueba de Preparación de Backend
fr: Passez le test de préparation du backend
id: Ambil Tes Kesiapan Backend
it: Sostieni il Test di Prontezza del Backend
ja: バックエンド準備テストを受ける
ms: Ambil Ujian Kesediaan Backend
no: Ta Backend Beredskapstest
pl: Przystąp do Testu Gotowości Backendowej
pt: Faça o Teste de Prontidão para o Backend
ru: Пройдите тест на готовность бэкенда
sv: Ta Backend-förberedelsestestet
th: ทำแบบทดสอบความพร้อมของระบบเบื้องหลัง
tr: Backend Hazırlık Testini Al
uk: Складіть Тест на Готовність для Заднього Плана
vi: Thực hiện Bài Kiểm Tra Sẵn Sàng Backend

source: Take the Interview Readiness Test
ar: خذ اختبار جاهزية المقابلة
be: Прайдзіце тэст гатоўнасці да інтэрв'ю
da: Tag interviewberedskabstesten
de: Machen Sie den Interviewbereitschaftstest
es: Realiza el Test de Preparación para Entrevistas
fr: Passez le test de préparation à l'entretien
id: Ikuti Tes Kesiapan Wawancara
it: Sostieni il Test di Prontezza all'Intervista
ja: インタビュー準備テストを受ける
ms: Ambil Ujian Kesiapan Temu Duga
no: Ta intervjuberedskapstesten
pl: Weź Test Gotowości do Rozmowy Kwalifikacyjnej
pt: Faça o Teste de Preparação para Entrevista
ru: Пройдите тест на готовность к собеседованию
sv: Ta intervjuredskapstest
th: ทำแบบทดสอบความพร้อมในการสัมภาษณ์
tr: Mülakat Hazırlık Testini Alın
uk: Пройдіть тест на готовність до співбесіди
vi: Làm Bài Kiểm Tra Sự Sẵn Sàng Cho Phỏng Vấn

source: Talking About Strengths and Weaknesses
ar: الحديث عن النقاط القوية والضعفاء
be: Гаворка пра сілы і слабасці
da: At Tale om Styrker og Svagheder
de: Über Stärken und Schwächen sprechen
es: Hablando Sobre Fortalezas y Debilidades
fr: Parler de ses Forces et Faiblesses
id: Membicarakan Kekuatan dan Kelemahan
it: Parlando di Punti di Forza e debolezze
ja: 長所と短所について話す
ms: Berbicara Mengenai Kelebihan dan Kelemahan
no: Å Snakke Om Styrker og Svakheter
pl: Mówienie o Mocnych i Słabych Stronach
pt: Falando Sobre Pontos Fortes e Fracos
ru: Говорим о Сильных и Слабых Сторонах
sv: Pratar om Styrkor och Svagheter
th: การพูดถึงจุดแข็งและจุดอ่อน
tr: Güçlü ve Zayıf Yönlerden Bahsetme
uk: Говоримо про сильні сторони та слабкості
vi: Nói về Điểm mạnh và Điểm yếu

source: Talking to a Doctor
ar: التحدث مع طبيب
be: Гаворка з лекарам
da: At tale med en læge
de: Gespräch mit einem Arzt
es: Hablar con un Doctor
fr: Parler à un médecin
id: Berbicara dengan Dokter
it: Parlare con un Dottore
ja: 医者との会話
ms: Bercakap dengan Doktor
no: Snakke med en lege
pl: Rozmowa z lekarzem
pt: Conversando com um Médico
ru: Разговор с врачом
sv: Att prata med en läkare
th: พูดคุยกับแพทย์
tr: Bir Doktorla Konuşmak
uk: Говорити з лікарем
vi: Nói chuyện với bác sĩ

source: Target the specific skills you need—speaking, grammar, vocabulary, and progress tracking—to achieve online English fluency faster.
ar: استهدف المهارات المحددة التي تحتاجها—المحادثة، القواعد، المفردات، وتتبع التقدم—لتحقيق الطلاقة في اللغة الإنجليزية عبر الإنترنت بشكل أسرع.
be: Скасуецца да канкрэтных навыкаў, якія вам патрэбны - гаворкі, граматыкі, слоўнікаў, і сачэння прогрэсу - каб дасягнуць плыннасці англійскай мовы ў Інтэрнете хутчэй.
da: Målret de specifikke færdigheder, du har brug for—tale, grammatik, ordforråd og fremskridtsopfølgning—for hurtigere at opnå flydende engelsk online.
de: Richten Sie sich auf die spezifischen Fähigkeiten aus, die Sie benötigen—Sprechen, Grammatik, Wortschatz und Fortschrittsverfolgung—um online schneller die Englischflüssigkeit zu erreichen.
es: Dirígete a las habilidades específicas que necesitas—hablar, gramática, vocabulario y seguimiento del progreso—para lograr la fluidez en inglés en línea más rápido.
fr: Ciblez les compétences spécifiques dont vous avez besoin—parler, grammaire, vocabulaire, et suivi des progrès—pour atteindre la fluidité en anglais en ligne plus rapidement.
id: Targetkan keterampilan spesifik yang Anda butuhkan—berbicara, tata bahasa, kosakata, dan pelacakan kemajuan—untuk mencapai kefasihan bahasa Inggris secara online lebih cepat.
it: Targetta le competenze specifiche di cui hai bisogno—parlare, grammatica, vocabolario e tracciamento dei progressi—per raggiungere la fluency in inglese online più rapidamente.
ja: 特定のスキルをターゲットにしましょう—スピーキング、文法、語彙、進捗追跡—オンラインでの英語流暢さをより早く達成するために。
ms: Sasarkan kemahiran tertentu yang anda perlukan—bercakap, tatabahasa, perbendaharaan kata, dan pemantauan kemajuan—untuk mencapai kefasihan bahasa Inggeris dalam talian dengan lebih cepat.
no: Målrett de spesifikke ferdighetene du trenger—muntlig fremstilling, grammatikk, ordforråd og fremdriftssporing—for å oppnå flyt i engelsk på nettet raskere.
pl: Skup się na konkretnych umiejętnościach, których potrzebujesz—mówieniu, gramatyce, słownictwie i śledzeniu postępów—aby szybciej osiągnąć biegłość w języku angielskim w trybie online.
pt: Aponte para as habilidades específicas que você precisa—fala, gramática, vocabulário e acompanhamento de progresso—para alcançar a fluência em inglês online mais rapidamente.
ru: Нацеливайтесь на конкретные навыки, которые вам нужны — разговорная речь, грамматика, словарный запас и отслеживание прогресса — чтобы быстрее добиться онлайн-флюентности в английском.
sv: Rikta in dig på de specifika färdigheter du behöver—talande, grammatik, ordförråd och framstegsövervakning—för att uppnå engelsk flyt online snabbare.
th: กำหนดทักษะเฉพาะที่คุณต้องการ—การพูด, ไวยากรณ์, ศัพท์, และการติดตามความก้าวหน้า—เพื่อที่จะบรรลุความคล่องแคล่วในภาษาอังกฤษออนไลน์ได้เร็วขึ้น.
tr: Hedeflediğiniz belirli becerileri - konuşma, dilbilgisi, kelime bilgisi ve ilerleme takibi - hedefleyin, çevrimiçi İngilizce akıcılığına daha hızlı ulaşın.
uk: Націлюйтеся на конкретні навички, які вам потрібні — усне мовлення, граматика, словниковий запас та відстеження прогресу — щоб досягти онлайн-флюентності в англійській мові швидше.
vi: Nhắm đến những kỹ năng cụ thể bạn cần—nói, ngữ pháp, từ vựng và theo dõi tiến độ—để đạt được khả năng nói tiếng Anh trực tuyến nhanh hơn.

source: Teacher
ar: معلم
be: Настаўнік
da: Lærer
de: Lehrer
es: Profesor
fr: Professeur
id: Guru
it: Insegnante
ja: 先生
ms: Guru
no: Lærer
pl: Nauczyciel
pt: Professor
ru: Учитель
sv: Lärare
th: ครู
tr: Öğretmen
uk: Вчитель
vi: Giáo viên

source: Teacher Instructions
es: Instrucciones del Profesor
id: Instruksi Guru
it: Istruzioni per l'Insegnante
ja: 教師への指示
no: Lærer Instruksjoner
pl: Instrukcje dla nauczyciela
pt: Instruções para o Professor
ru: Инструкции для учителя
sv: Lärarinstruktioner
uk: Інструкції для вчителя

source: Teacher:
ar: المعلم:
be: Наставнік:
da: Lærer:
de: Lehrer:
es: Profesor:
fr: Enseignant:
id: Guru:
it: Insegnante:
ja: 教師:
ms: Cikgu:
no: Lærer:
pl: Nauczyciel:
pt: Professor:
ru: Учитель:
sv: Lärare:
th: ครู:
tr: Öğretmen:
uk: Вчитель:
vi: Giáo viên:

source: Team
id: Tim
it: Squadra
ja: チーム
ru: Команда
uk: Команда

source: Team turn
id: Giliran tim
it: Turno del team
ja: チームの順番
no: Lagvending
ru: Ход команды
uk: Хід команди

source: Team up next
id: Tim berikutnya
it: Prossimamente in squadra
ja: 次にチームを組む
no: Team opp neste
ru: Команда дальше
uk: Команда в наступному раунді

source: Team {index} name
id: Nama tim {index}
it: Nome del team {index}
ja: チーム {index} の名前
no: Team {index} navn
ru: Название команды {index}
uk: Назва команди {index}

source: Teams
id: Tim
it: Squadre
ja: チーム
no: Lag
ru: Команды
uk: Команди

source: Tech Interview
ar: مقابلة تقنية
be: Тэхнічнае інтэрв'ю
de: Technisches Interview
es: Entrevista Técnica
fr: Entretien Technique
id: Wawancara Teknologi
it: Colloquio Tecnico
ja: 技術面接
no: Tech-intervju
pl: Rozmowa kwalifikacyjna w branży technologicznej
pt: Entrevista Técnica
ru: Техническое собеседование
sv: Teknisk intervju
th: การสัมภาษณ์งานด้านเทคโนโลยี
tr: Teknoloji Mülakatı
uk: Технічне інтерв'ю
vi: Phỏng vấn công nghệ

source: Tech interview with AI frontend developer
ar: مقابلة تقنية مع مطور واجهة أمامية للذكاء الاصطناعي
be: Інтэрв'ю з AI frontend распрацоўшчыкам тэхналогій
da: Tech interview med AI frontend udvikler
de: Technisches Interview mit einem KI-Frontend-Entwickler
es: Entrevista técnica con desarrollador de frontend de IA
fr: Entretien technique avec développeur frontend d'IA
id: Wawancara teknis dengan pengembang frontend AI
it: Colloquio tecnico con sviluppatore frontend AI
ja: AIフロントエンド開発者との技術面接
ms: Temuduga teknik dengan pemaju fronend AI
no: Tech-intervju med AI frontend-utvikler
pl: Rozmowa techniczna z AI frontend deweloperem
pt: Entrevista técnica com desenvolvedor frontend de IA
ru: Техническое интервью с фронтенд-разработчиком на основе ИИ
sv: Teknisk intervju med AI frontend-utvecklare
th: การสัมภาษณ์ด้านเทคโนโลยีกับนักพัฒนาฝ่ายหน้าด้วย AI
tr: Yapay Zeka ön yüz geliştirici ile teknik mülakat
uk: Технічна співбесіда з AI фронтенд-розробником
vi: Phỏng vấn công nghệ với nhà phát triển giao diện AI
