Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Here are some new words for you to learn:
es: Aquí tienes algunas palabras nuevas para aprender:
id: Berikut beberapa kata baru yang bisa Anda pelajari:
it: Ecco alcune nuove parole da imparare:
ja: ここに学ぶべき新しい単語があります:
no: Her er noen nye ord for deg å lære:
pl: Oto kilka nowych słów do nauczenia się:
pt: Aqui estão algumas novas palavras para você aprender:
ru: Вот несколько новых слов для тебя чтобы выучить:
sv: Här är några nya ord för dig att lära dig:
uk: Ось декілька нових слів для вивчення:

source: Here are the conversations you had with FluencyPal.
ar: هنا المحادثات التي أجريتها مع FluencyPal.
be: Вось размовы, якія вы мелі з FluencyPal.
da: Her er de samtaler, du havde med FluencyPal.
de: Hier sind die Gespräche, die Sie mit FluencyPal geführt haben.
es: Aquí están las conversaciones que tuviste con FluencyPal.
fr: Voici les conversations que vous avez eues avec FluencyPal.
id: Berikut adalah percakapan yang Anda miliki dengan FluencyPal.
it: Ecco le conversazioni che hai avuto con FluencyPal.
ja: これはFluencyPalとの会話履歴です。
ms: Berikut adalah perbualan yang anda telah lakukan bersama FluencyPal.
no: Her er samtalene du hadde med FluencyPal.
pl: Oto rozmowy, które prowadziłeś z FluencyPal.
pt: Aqui estão as conversas que você teve com o FluencyPal.
ru: Вот беседы, которые вы вели с FluencyPal.
sv: Här är samtalen du hade med FluencyPal.
th: นี่คือการสนทนาที่คุณมีกับ FluencyPal.
tr: İşte FluencyPal ile yaptığınız konuşmalar.
uk: Ось розмови, які ви вели з FluencyPal.
vi: Dưới đây là những cuộc trò chuyện bạn đã có với FluencyPal.

source: Here are the corrections you had in your conversations.
ar: هنا التصحيحات التي كانت في محادثاتك.
be: Вось выпраўленні, якія ў вас былі ў размовах.
da: Her er de rettelser, du havde i dine samtaler.
de: Hier sind die Korrekturen, die Sie in Ihren Unterhaltungen hatten.
es: Aquí están las correcciones que tuviste en tus conversaciones.
fr: Voici les corrections que vous aviez dans vos conversations.
id: Berikut adalah koreksi yang Anda miliki dalam percakapan Anda.
it: Ecco le correzioni che hai avuto nelle tue conversazioni.
ja: これはあなたの会話で訂正が必要だった部分です。
ms: Berikut adalah pembetulan yang anda ada dalam perbualan anda.
no: Her er korrigeringene du hadde i samtalene dine.
pl: Oto poprawki, które pojawiły się w twoich rozmowach.
pt: Aqui estão as correções que você teve nas suas conversas.
ru: Вот исправления, которые были сделаны в ваших разговорах.
sv: Här är de korrigeringar du hade i dina konversationer.
th: นี่คือการแก้ไขที่คุณมีในการสนทนาของคุณ
tr: İşte konuşmalarınızdaki düzeltmeler.
uk: Ось виправлення, які ви мали у своїх розмовах.
vi: Đây là những sửa chữa bạn đã có trong cuộc trò chuyện của mình.

source: Here are the words you used the most in your conversations.
ar: هذه هي الكلمات التي استخدمتها الأكثر في محادثاتك.
be: Вось словы, якія вы найчасцей выкарыстоўвалі ў сваіх размовах.
da: Her er de ord, du brugte mest i dine samtaler.
de: Hier sind die Wörter, die Sie am häufigsten in Ihren Unterhaltungen verwendet haben.
es: Aquí están las palabras que más utilizaste en tus conversaciones.
fr: Voici les mots que vous avez utilisés le plus souvent dans vos conversations.
id: Berikut adalah kata-kata yang paling sering Anda gunakan dalam percakapan Anda.
it: Ecco le parole che hai usato di più nelle tue conversazioni.
ja: これらは、あなたの会話で最も使用された単語です。
ms: Berikut adalah perkataan yang paling kerap anda gunakan dalam perbualan anda.
no: Her er ordene du brukte mest i samtalene dine.
pl: Oto słowa, których najczęściej używałeś w swoich rozmowach.
pt: Aqui estão as palavras que você usou mais nas suas conversas.
ru: Вот слова, которые вы используете чаще всего в своих разговорах.
sv: Här är orden du använde mest i dina konversationer.
th: นี่คือคำที่คุณใช้มากที่สุดในการสนทนาของคุณ
tr: İşte konuşmalarınızda en çok kullandığınız kelimeler.
uk: Ось слова, які ви найчастіше використовували у своїх розмовах.
vi: Đây là những từ bạn sử dụng nhiều nhất trong các cuộc trò chuyện của mình.

source: Here is the lesson plan for this session:
es: Aquí está el plan de lección para esta sesión:
id: Berikut adalah rencana pelajaran untuk sesi ini:
it: Ecco il piano della lezione per questa sessione:
ja: このセッションのレッスンプランは次のとおりです。
no: Her er leksjonsplanen for denne økten:
pl: Oto plan lekcji na tę sesję:
pt: Aqui está o plano da aula para esta sessão:
ru: Вот план урока на эту сессию:
sv: Här är lektionsplanen för denna session:
uk: Ось план уроку для цього заняття:

source: Here's a personalized training plan we'll use during your preparation. Step by step, you'll improve your answers and prepare for next-level results.
ar: إليك خطة تدريب مخصصة سنستخدمها أثناء تحضيرك. خطوة بخطوة، ستُحسن إجاباتك وتستعد لتحقيق نتائج في مستوى أعلى.
be: Вось персаналізаваны план падрыхтоўкі, які мы будзем выкарыстоўваць падчас вашай падрыхтоўкі. Крок за крокам вы палепшыце свае адказы і падрыхтуецеся да вынікаў наступнага ўзроўню.
da: Her er en personlig træningsplan, vi vil bruge under din forberedelse. Trin for trin vil du forbedre dine svar og forberede dig på næste niveau resultater.
de: Hier ist ein personalisierter Trainingsplan, den wir während Ihrer Vorbereitung verwenden werden. Schritt für Schritt werden Sie Ihre Antworten verbessern und sich auf Ergebnisse der nächsten Stufe vorbereiten.
es: Aquí tienes un plan de entrenamiento personalizado que utilizaremos durante tu preparación. Paso a paso, mejorarás tus respuestas y te prepararás para obtener resultados de nivel superior.
fr: Voici un plan de formation personnalisé que nous utiliserons lors de votre préparation. Pas à pas, vous améliorerez vos réponses et vous vous préparerez pour des résultats de niveau supérieur.
id: Berikut adalah rencana pelatihan yang dipersonalisasi yang akan kita gunakan selama persiapan Anda. Langkah demi langkah, Anda akan meningkatkan jawaban Anda dan mempersiapkan diri untuk hasil tingkat berikutnya.
it: Ecco un piano di allenamento personalizzato che utilizzeremo durante la tua preparazione. Passo dopo passo, migliorerai le tue risposte e ti preparerai per risultati di livello superiore.
ja: ここに、あなたの準備中に使用するパーソナライズされたトレーニングプランがあります。ステップ・バイ・ステップで、あなたの回答を改善し、次のレベルの結果に向けて準備を進めます。
ms: Berikut adalah pelan latihan peribadi yang akan kita gunakan semasa persediaan anda. Langkah demi langkah, anda akan memperbaiki jawapan anda dan bersedia untuk mencapai hasil yang lebih baik.
no: Her er en personlig treningsplan vi vil bruke under din forberedelse. Steg for steg, vil du forbedre svarene dine og forberede deg på resultater på neste nivå.
pl: Oto spersonalizowany plan szkoleniowy, który będziemy używać podczas Twojego przygotowania. Krok po kroku, poprawisz swoje odpowiedzi i przygotujesz się na wyniki na wyższym poziomie.
pt: Aqui está um plano de treinamento personalizado que usaremos durante sua preparação. Passo a passo, você melhorará suas respostas e se preparará para resultados de próximo nível.
ru: Вот персонализированный план тренировки, который мы будем использовать во время вашей подготовки. Шаг за шагом вы улучшите свои ответы и подготовитесь к результатам следующего уровня.
sv: Här är en personlig träningsplan som vi kommer att använda under din förberedelse. Steg för steg kommer du att förbättra dina svar och förbereda dig för resultat på nästa nivå.
th: นี่คือแผนการฝึกอบรมที่ปรับแต่งเฉพาะสำหรับคุณ ซึ่งเราจะใช้ระหว่างเตรียมตัวของคุณ ทีละขั้นตอน คุณจะพัฒนาคำตอบของคุณและเตรียมพร้อมสำหรับผลลัพธ์ที่ระดับถัดไป
tr: İşte hazırlığınız sırasında kullanacağımız kişiselleştirilmiş bir eğitim planı. Adım adım, cevaplarınızı geliştirecek ve bir sonraki seviye sonuçlar için hazırlık yapacaksınız.
uk: Ось персоналізований план підготовки, який ми будемо використовувати під час твоєї підготовки. Крок за кроком, ти покращиш свої відповіді та підготуєшся до результатів на новому рівні.
vi: Dưới đây là kế hoạch đào tạo cá nhân hóa mà chúng tôi sẽ sử dụng trong quá trình chuẩn bị của bạn. Từng bước một, bạn sẽ cải thiện câu trả lời của mình và chuẩn bị cho kết quả cấp độ tiếp theo.

source: Here's a personalized training plan you'll follow. Step by step, you'll strengthen fundamentals, improve your answers, and feel more confident in junior interviews.
ar: إليك خطة تدريب مخصصة ستتبعها. خطوة بخطوة، ستعزز الأساسيات، وتحسن إجاباتك، وتشعر بمزيد من الثقة في المقابلات الخاصة بالمستوى المبتدئ.
be: Вось персаналізаваны план навучання, якога вы будзеце прытрымлівацца. Крок за крокам, вы ўмацуеце асновы, палепшыце свае адказы і будзеце адчуваць сябе больш упэўнена на сумоўях для пачаткоўцаў.
da: Her er en personlig træningsplan, du vil følge. Trin for trin vil du styrke fundamentet, forbedre dine svar og føle dig mere selvsikker i juniorinterviews.
de: Hier ist ein personalisierter Trainingsplan, dem Sie folgen werden. Schritt für Schritt werden Sie die Grundlagen stärken, Ihre Antworten verbessern und sich bei Einstiegsinterviews sicherer fühlen.
es: Aquí tienes un plan de entrenamiento personalizado que seguirás. Paso a paso, fortalecerás los fundamentos, mejorarás tus respuestas y te sentirás más seguro en las entrevistas para puestos junior.
fr: Voici un plan de formation personnalisé que vous suivrez. Pas à pas, vous renforcerez les fondamentaux, améliorerez vos réponses et vous vous sentirez plus confiant lors des entretiens juniors.
id: Berikut adalah rencana pelatihan pribadi yang akan Anda ikuti. Langkah demi langkah, Anda akan memperkuat dasar-dasar, meningkatkan jawaban Anda, dan merasa lebih percaya diri dalam wawancara junior.
it: Ecco un piano di allenamento personalizzato che seguirai. Passo dopo passo, rafforzerai le basi, migliorerai le tue risposte e ti sentirai più sicuro nei colloqui per posizioni junior.
ja: あなたが従うパーソナライズされたトレーニングプランはこちらです。 ステップごとに基礎を強化し、回答を改善し、ジュニアレベルの面接でより自信を持てるようになります。
no: Her er en personlig treningsplan du skal følge. Trinn for trinn vil du styrke grunnleggende ferdigheter, forbedre svarene dine, og føle deg mer selvsikker i juniorintervjuer.
pl: Oto spersonalizowany plan treningowy, który będziesz realizować. Krok po kroku wzmocnisz fundamenty, poprawisz swoje odpowiedzi i poczujesz się bardziej pewnie podczas rozmów kwalifikacyjnych dla juniorów.
pt: Aqui está um plano de treinamento personalizado que você seguirá. Passo a passo, você fortalecerá os fundamentos, melhorará suas respostas e se sentirá mais confiante em entrevistas de nível júnior.
ru: Вот индивидуальный план обучения, которому вы будете следовать. Шаг за шагом вы укрепите основы, улучшите свои ответы и почувствуете себя более уверенно на собеседованиях для младших специалистов.
sv: Här är en personlig träningsplan du kommer att följa. Steg för steg kommer du att stärka dina grunder, förbättra dina svar och känna dig mer självsäker i juniorintervjuer.
th: นี่คือแผนการฝึกอบรมเฉพาะบุคคลที่คุณจะปฏิบัติตาม ทีละขั้นตอน คุณจะเสริมสร้างพื้นฐาน ปรับปรุงคำตอบของคุณ และรู้สึกมั่นใจมากขึ้นในการสัมภาษณ์ระดับจูเนียร์
tr: İşte takip edeceğiniz kişisel bir eğitim planı. Adım adım, temelleri güçlendirecek, cevaplarınızı geliştirecek ve genç düzeydeki mülakatlarda kendinizi daha güvende hissedeceksiniz.
uk: Ось персоналізований план тренувань, якого ви дотримуватиметесь. Крок за кроком ви зміцните основи, покращите свої відповіді та відчуєте більше впевненості на співбесідах для початківців.
vi: Dưới đây là kế hoạch đào tạo cá nhân mà bạn sẽ theo. Từng bước một, bạn sẽ củng cố các kiến thức cơ bản, cải thiện câu trả lời của mình, và cảm thấy tự tin hơn trong các buổi phỏng vấn dành cho người mới bắt đầu.

source: Here's the rest of your personalized feedback to help you improve.
ar: إليك بقية ملاحظاتك الشخصية لمساعدتك على التحسين.
be: Вось астатняя частка вашых персаналізаваных водгукаў, каб дапамагчы вам удасканаліцца.
da: Her er resten af din personlige feedback for at hjælpe dig med at blive bedre.
de: Hier ist der Rest Ihres personalisierten Feedbacks, um Ihnen bei der Verbesserung zu helfen.
es: Aquí tienes el resto de tus comentarios personalizados para ayudarte a mejorar.
fr: Voici le reste de vos commentaires personnalisés pour vous aider à vous améliorer.
id: Berikut adalah sisa umpan balik personalisasi Anda untuk membantu Anda meningkatkan.
it: Ecco il resto del tuo feedback personalizzato per aiutarti a migliorare.
ja: あなたの改善を助けるための個別フィードバックの続きはこちらです。
ms: Berikut adalah baki maklum balas peribadi anda untuk membantu anda meningkatkan.
no: Her er resten av din personlige tilbakemelding for å hjelpe deg med å bli bedre.
pl: Oto reszta twojej spersonalizowanej opinii, która pomoże ci się poprawić.
pt: Aqui está o restante do seu feedback personalizado para ajudá-lo a melhorar.
ru: Вот остальная часть вашего персонального отзыва, которая поможет вам улучшиться.
sv: Här är resten av din personliga feedback för att hjälpa dig att förbättras.
th: นี่คือข้อเสนอแนะเฉพาะบุคคลของคุณ เพื่อช่วยให้คุณพัฒนาขึ้น
tr: İşte gelişmenize yardımcı olacak kişiselleştirilmiş geri bildiriminizin geri kalanı.
uk: Ось решта вашого персоналізованого зворотного зв'язку, щоб допомогти вам вдосконалитися.
vi: Dưới đây là phần còn lại của phản hồi cá nhân hóa giúp bạn cải thiện.

source: Here`s you can buy extra hours of AI
uk: Тут ви можете придбати додаткові години ШІ

source: Hi. My name is Alex. I built this site so I can practice English and other languages. You can too, by the way.
ja: こんにちは。私の名前はアレックスです。私は英語やその他の言語を練習するためにこのサイトを作りました。ちなみに、あなたもできますよ。
no: Hei. Jeg heter Alex. Jeg laget denne siden slik at jeg kan øve på engelsk og andre språk. Det kan du også, forresten.
uk: Привіт. Мене звати Олексій. Я створив цей сайт, щоб практикувати англійську та інші мови. До речі, ви теж можете.

source: Hide
de: Verstecken
es: Ocultar
id: Sembunyikan
it: Nascondi
ja: 隠す
no: Skjul
pl: Ukryj
pt: Esconder
ru: Скрыть
sv: Dölj
th: ซ่อน
tr: Gizle
uk: Сховати
vi: Ẩn

source: Highlight your frontend experience
ar: سلّط الضوء على خبرتك في الواجهة الأمامية
be: Вылучыце свой вопыт работы з фронтэндам
da: Fremhæv din frontend-erfaring
de: Heben Sie Ihre Frontend-Erfahrung hervor
es: Resalta tu experiencia en frontend
fr: Mettez en avant votre expérience en frontend
id: Soroti pengalaman frontend Anda
it: Metti in evidenza la tua esperienza frontend
ja: フロントエンドの経験を強調する
ms: Serlahkan pengalaman frontend anda
no: Fremhev din frontend-erfaring
pl: Podkreśl swoje doświadczenie z frontendem
pt: Destaque sua experiência em frontend
ru: Выделите свой опыт работы с фронтендом
sv: Markera din erfarenhet inom frontend-utveckling
th: เน้นประสบการณ์ด้านส่วนติดต่อผู้ใช้ของคุณ
tr: Frontend deneyiminizi öne çıkarın
uk: Підкресліть свій досвід у фронтенді
vi: Làm nổi bật kinh nghiệm frontend của bạn

source: Highlight your leadership and problem-solving skills
ar: أبرز مهارات القيادة وحل المشكلات لديك
be: Выдзеліце свае лідэрскія навыкі і навыкі вырашэння праблем
da: Fremhæv dine ledelses- og problemløsningsfærdigheder
de: Heben Sie Ihre Führungs- und Problemlösungsfähigkeiten hervor
es: Resalta tus habilidades de liderazgo y resolución de problemas
fr: Mettez en avant vos compétences en leadership et en résolution de problèmes
id: Soroti kemampuan kepemimpinan dan pemecahan masalah Anda
it: Metti in evidenza le tue capacità di leadership e di risoluzione dei problemi
ja: あなたのリーダーシップと問題解決能力を強調する
ms: Serlahkan kemahiran kepimpinan dan penyelesaian masalah anda
no: Fremhev dine leder- og problemløsningsferdigheter
pl: Podkreśl swoje umiejętności przywódcze i rozwiązywania problemów
pt: Destaque suas habilidades de liderança e resolução de problemas
ru: Подчеркните свои лидерские качества и навыки решения проблем
sv: Framhäv dina ledarskaps- och problemlösningsförmågor
th: เน้นทักษะการเป็นผู้นำและการแก้ปัญหาของคุณ
tr: Liderlik ve problem çözme becerilerinizi vurgulayın
uk: Підкресліть свої лідерські якості та навички розв'язання проблем
vi: Làm nổi bật kỹ năng lãnh đạo và giải quyết vấn đề của bạn

source: Highlight your strengths relevant to the role:
ar: برز قوتك المرتبطة بالدور:
be: Вылучыце свае сілы, якія ўтэчныя для ролі:
da: Fremhæv dine styrker relevante for rollen:
de: Heben Sie Ihre Stärken hervor, die für die Rolle relevant sind:
es: Destaca tus fortalezas relevantes para el rol:
fr: Mettez en avant vos points forts pertinents pour le rôle :
id: Soroti kekuatan Anda yang relevan dengan peran:
it: Evidenzia le tue competenze pertinenti al ruolo:
ja: 役割に関連するあなたの強みを強調してください：
ms: Tunjukkan kelebihan anda yang relevan untuk peranan tersebut:
no: Fremhev dine styrker som er relevante for rollen:
pl: Podkreśl swoje mocne strony istotne dla roli:
pt: Destaque suas forças relevantes para o papel:
ru: Выделите свои сильные стороны, соответствующие роли:
sv: Markera dina styrkor relevanta för rollen:
th: เน้นความสามารถที่สำคัญต่อบทบาท:
tr: Rol ile ilgili güçlü yönlerinizi vurgulayın:
uk: Виділіть свої сильні сторони, які є важливими для ролі:
vi: Nêu bật những điểm mạnh liên quan đến vị trí:

source: Hint:
de: Hinweis:
es: Pista:
id: Petunjuk:
it: Suggerimento:
ja: ヒント:
pl: Wskazówka:
pt: Dica:
ru: Подсказка:
sv: Vink:
th: คำแนะนำ:
tr: İpucu:
uk: Підказка:
vi: Gợi ý:

source: Hints to boost your confidence
ar: نصائح لتعزيز ثقتك بنفسك
be: Падказкі для павышэння вашай упэўненасці
da: Tips til at styrke din selvtillid
de: Tipps, um Ihr Selbstvertrauen zu stärken
es: Consejos para aumentar tu confianza
fr: Conseils pour renforcer votre confiance
id: Petunjuk untuk meningkatkan rasa percaya diri Anda
it: Suggerimenti per aumentare la tua fiducia
ja: 自信を高めるためのヒント
ms: Petunjuk untuk meningkatkan keyakinan anda
no: Tips for å øke selvtilliten din
pl: Wskazówki, które zwiększą Twoją pewność siebie
pt: Dicas para aumentar sua confiança
ru: Подсказки для повышения уверенности в себе
sv: Ledtrådar för att stärka ditt självförtroende
th: คำแนะนำเพื่อเพิ่มความมั่นใจของคุณ
tr: Kendinize güveninizi artırmak için ipuçları
uk: Поради для підвищення вашої впевненості в собі
vi: Gợi ý để tăng sự tự tin của bạn

source: Hobbies or interests
ar: الهوايات أو الاهتمامات
be: Хобі або інтарэсы
da: Hobbyer eller interesser
de: Hobbys oder Interessen
es: Aficiones o intereses
fr: Passe-temps ou centres d'intérêt
id: Hobi atau minat
it: Hobby o interessi
ja: 趣味や関心
ms: Hobi atau minat
no: Hobbyer eller interesser
pl: Zainteresowania lub hobby
pt: Passatempos ou interesses
ru: Хобби или интересы
sv: Hobbyer eller intressen
th: งานอดิเรกหรือความสนใจ
tr: Hobiler veya ilgi alanları
uk: Хобі або інтереси
vi: Sở thích hoặc mối quan tâm

source: Home
ar: الصفحة الرئيسية
be: Дома
da: Hjem
de: Zuhause
es: Inicio
fr: Accueil
id: Beranda
ja: ホーム
ms: Rumah
no: Hjem
pl: Dom
pt: Casa
ru: Главная
sv: Hem
th: หน้าแรก
tr: Ev
uk: Додому
vi: Trang chủ

source: Hotel Check-In Conversation
ar: محادثة تسجيل الوصول في الفندق
be: Размова пры рэгістрацыі ў госцініцы
da: Hotel Check-In Samtale
de: Hotel Check-In Gespräch
es: Conversación de Registro en el Hotel
fr: Conversation d'enregistrement à l'hôtel
id: Percakapan Check-In Hotel
ja: ホテルチェックインの会話
ms: Perbualan Daftar Masuk Hotel
no: Hotel Inn-sjekk Samtale
pl: Rozmowa przy zameldowaniu w hotelu
ru: Разговор при регистрации в отеле
sv: Hotel Check-In Samtal
th: การสนทนาเช็คอินโรงแรม
tr: Otel Giriş Konuşması
uk: Готельний Check-In Розмова
vi: Cuộc trò chuyện khi nhận phòng khách sạn

source: How can I track my progress?
ar: كيف يمكنني تتبع تقدمي؟
be: Як я магу адсочваць свой прагрэс?
da: Hvordan kan jeg spore min fremgang?
de: Wie kann ich meinen Fortschritt verfolgen?
es: ¿Cómo puedo seguir mi progreso?
fr: Comment puis-je suivre mes progrès ?
id: Bagaimana saya bisa melacak kemajuan saya?
it: Come posso monitorare i miei progressi?
ja: 進捗を追跡するにはどうすればよいですか？
no: Hvordan kan jeg spore fremgangen min?
pl: Jak mogę śledzić mój postęp?
pt: Como posso rastrear meu progresso?
ru: Как я могу отслеживать свой прогресс?
sv: Hur kan jag följa min utveckling?
th: ฉันจะติดตามความก้าวหน้าของฉันได้อย่างไร?
tr: İlerlemenizi nasıl takip edebilirim?
uk: Як я можу відстежувати свій прогрес?
vi: Làm cách nào để theo dõi tiến trình của mình?

source: How do daily tasks help me improve?
ar: كيف تساعدني المهام اليومية في تحسين نفسي؟
be: Як штодзённыя заданні дапамагаюць мне паляпшыць?
da: Hvordan hjælper daglige opgaver mig med at forbedre mig?
de: Wie helfen mir tägliche Aufgaben, mich zu verbessern?
es: ¿Cómo me ayudan las tareas diarias a mejorar?
fr: Comment les tâches quotidiennes m'aident-elles à m'améliorer ?
id: Bagaimana tugas harian membantu saya meningkatkan?
it: Come mi aiutano le attività quotidiane a migliorare?
ja: 日常のタスクはどのように私の成長を助けるのか？
ms: Bagaimana tugas harian membantu saya memperbaiki diri?
no: Hvordan hjelper daglige oppgaver meg med å forbedre?
pl: Jak codzienne zadania pomagają mi się poprawić?
pt: Como as tarefas diárias me ajudam a melhorar?
ru: Как повседневные задачи помогают мне улучшаться?
sv: Hur hjälper dagliga uppgifter mig att förbättras?
th: การทำงานประจำวันช่วยให้ฉันพัฒนาตนเองได้อย่างไร?
tr: Günlük görevler bana nasıl yardımcı olur?
uk: Як щоденні завдання допомагають мені покращити?
vi: Những nhiệm vụ hàng ngày giúp tôi cải thiện như thế nào?

source: How do you center a div both horizontally and vertically using CSS?
ar: كيف يمكنك توسيط div أفقياً وعمودياً باستخدام CSS؟
be: Як усё ж такі выраўнаваць div па цэнтры як гарызантальна, так і вертыкальна, выкарыстоўваючы CSS?
da: Hvordan centrerer man en div både horisontalt og vertikalt ved hjælp af CSS?
de: Wie zentriert man ein div sowohl horizontal als auch vertikal mit CSS?
es: ¿Cómo centras un div tanto horizontal como verticalmente usando CSS?
fr: Comment centrer une div à la fois horizontalement et verticalement en utilisant CSS ?
id: Bagaimana cara memusatkan sebuah div baik secara horizontal maupun vertikal menggunakan CSS?
it: Come centrare un div sia orizzontalmente che verticalmente usando CSS?
ja: CSSを使用してdivを水平および垂直に中央揃えする方法は？
no: Hvordan sentrerer du en div både horisontalt og vertikalt ved hjelp av CSS?
pl: Jak wycentrować div zarówno poziomo, jak i pionowo za pomocą CSS?
pt: Como centralizar uma div horizontal e verticalmente usando CSS?
ru: Как центрировать div как по горизонтали, так и по вертикали с помощью CSS?
sv: Hur centrerar man en div både horisontellt och vertikalt med CSS?
th: วิธีจัดกึ่งกลาง div ทั้งในแนวนอนและแนวตั้งด้วย CSS คืออย่างไร?
tr: Bir div'i hem yatay hem de dikey olarak CSS kullanarak nasıl ortalarsınız?
uk: Як централізувати div по горизонталі і вертикалі за допомогою CSS?
vi: Làm thế nào để căn giữa một div cả theo chiều ngang và chiều dọc bằng CSS?
