Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Discuss scaling, observability, failure modes, and operational readiness.
ar: ناقش القياس، المراقبة، أوضاع الفشل، والاستعداد التشغيلي.
be: Абмяркуйце маштабаванне, назіральнасць, спосабы адмовы і аперацыйную гатоўнасць.
da: Diskuter skalering, observabilitet, fejlkilder og operationel parathed.
de: Erörtern Sie Skalierung, Beobachtbarkeit, Ausfallmodi und Betriebsbereitschaft.
es: Discuta el escalado, la observabilidad, los modos de falla y la preparación operativa.
fr: Discuter de la mise à l'échelle, de l'observabilité, des modes de défaillance et de la préparation opérationnelle.
id: Diskusikan skala, observabilitas, mode kegagalan, dan kesiapan operasional.
it: Discutere il dimensionamento, l'osservabilità, le modalità di fallimento e la prontezza operativa.
ja: スケーリング、可観測性、故障モード、運用準備について議論する。
ms: Bincangkan penskalaan, pemerhatian, mod kegagalan, dan kesediaan operasi.
no: Diskuter skalering, observerbarhet, feiltyper og driftsberedskap.
pl: Omów skalowanie, obserwowalność, tryby awarii i gotowość operacyjną.
pt: Discuta dimensionamento, observabilidade, modos de falha e prontidão operacional.
ru: Обсудите масштабирование, наблюдаемость, режимы отказа и готовность к эксплуатации.
sv: Diskutera skalning, observerbarhet, felmoder och operativ beredskap.
th: อภิปรายเรื่องการขยายระบบ, การสังเกตและติดตามผล, รูปแบบของความล้มเหลว, และความพร้อมเชิงปฏิบัติการ
tr: Ölçeklenebilirlik, gözlemlenebilirlik, arıza modları ve operasyonel hazır olma durumunu tartışın.
uk: Обговорення масштабованості, спостережуваності, режимів відмов і готовності до експлуатації.
vi: Thảo luận về khả năng mở rộng, khả năng quan sát, các chế độ lỗi, và sự sẵn sàng hoạt động.

source: Discuss the topic
ar: ناقش الموضوع
be: Абмеркаваць тэму
da: Diskuter emnet
de: Diskutiere das Thema
es: Discute el tema
fr: Discutez du sujet
id: Diskusikan topik tersebut
it: Discuti l'argomento
ja: トピックを議論する
ms: Bincangkan topik
no: Diskuter emnet
pl: Omów temat
pt: Discuta o tópico
ru: Обсудить тему
sv: Diskutera ämnet
th: สนทนาเรื่อง
tr: Konuyu tartışın
uk: Обговорити тему
vi: Thảo luận về chủ đề

source: Discuss your health concerns in a realistic doctor’s office setting and practice explaining symptoms clearly. Perfect for gaining confidence in describing medical issues and understanding potential treatment options. ## Why You Should Play *Talking to a Doctor* 1. Learn to describe aches, pains, or concerns in a way that a healthcare professional can understand. 2. Build confidence asking follow-up questions about tests, prescriptions, or alternative treatments. 3. Gain exposure to medical vocabulary and common phrases used during consultations. 4. Develop an awareness of how to communicate effectively about personal well-being. 5. Strengthen your ability to clarify symptoms, ensuring you can advocate for your health in real-life situations. ## How the Scenario Works You’ll take on the role of a patient visiting a doctor, played by the AI. The doctor will ask about your symptoms, provide advice, and suggest possible treatments. By conversing naturally, you’ll hone your communication skills in a professional healthcare context.
ar: ناقش مخاوفك الصحية في بيئة مكتب طبي واقعي وتمرن على توضيح الأعراض بوضوح. مثالي لكسب الثقة في وصف القضايا الطبية وفهم خيارات العلاج المحتملة. ## لماذا يجب أن تلعب *التحدث إلى طبيب* 1. تعلم كيفية وصف الآلام أو الأوجاع أو المخاوف بطريقة يفهمها محترف الرعاية الصحية. 2. بناء الثقة في طرح أسئلة متابعة حول الفحوصات أو الوصفات الطبية أو العلاجات البديلة. 3. اكتساب Exposure لمفردات طبية وعبارات شائعة تستخدم أثناء الاستشارات. 4. تطوير الوعي بكيفية التواصل بفاعلية حول الرفاهية الشخصية. 5. تقوية قدرتك على توضيح الأعراض، مما يضمن أنك تستطيع الدفاع عن صحتك في المواقف الواقعية. ## كيف تعمل الحالة ستتولى دور مريض يزور طبيبًا، تلعبه الذكاء الاصطناعي. سيطرح الطبيب أسئلة حول أعراضك، ويقدم نصائح، ويقترح علاجات ممكنة. من خلال المحادثة بشكل طبيعي، ستقوم بتطوير مهارات التواصل الخاصة بك في سياق الرعاية الصحية الاحترافية.
be: Абмеркавайце свае праблемы здароўя ў рэалістычных умовах кабінету лекара і практыкуйцеся ў чыстым апісанні сімптомаў. Ідэальна для таго, каб узбайнитаваць уверанасць у апісанні медыцынскіх праблем і разуменні патэнцыяльных варыянтаў лячэння. ## Чаму вам варта гуляць у *Размова з лекарам* 1. Навучыцеся апісваць боль, боль, або праблемы так, каб медыцынскі спецыяліст мог зразумець. 2. Пабудуйце ўпэўненасць у ставленні да застаўлення пытанняў пра тэсты, рэцэпты, або альтэрнатыўныя метады лячэння. 3. Атрымайце доступ да медыцынскай тэрміналогіі і агульных фразаў, якія выкарыстоўваюцца падчас кансультацыяў. 4. Развіце усведамленне аб тым, як эфектыўна камунікаваць пра асабістае здароўе. 5. Пасіліце сваю здольнасць удакладнювання сімптомаў, забяспечваючы можнасць заяўляць на сваё здароўе ў рэальных сітуацыях. ## Як працуе сцэнарый Вы займеце ролю пацыента, які наведвае лекара, які грае AI. Лекар заспытае пра вашыя сімптомы, дасць парады і прапануе магчымыя метады лячэння. Спілкуючыся натуральна, вы адшліфоўваеце свае навыкі камунікацыі ў прафесійным медыцынскім асяроддзі.
da: Diskuter dine sundhedsmæssige bekymringer i en realistisk lægekontorindstilling og øv dig i at forklare symptomer klart. Perfekt til at opnå selvtillid i at beskrive medicinske problemer og forstå potentielle behandlingsmuligheder. ## Hvorfor du skal spille *At Tale med en Læge* 1. Lær at beskrive smerter, ubehag eller bekymringer på en måde, som en sundhedsprofessionel kan forstå. 2. Opbyg selvtillid til at stille opfølgende spørgsmål om testen, receptpligtige medicin eller alternative behandlinger. 3. Få erfaring med medicinsk ordforråd og almindelige fraser, der bruges under konsultationer. 4. Udvikl en bevidsthed om, hvordan man effektivt kommunikerer om personlig velvære. 5. Styrk din evne til at præcisere symptomer, så du kan tale for dit helbred i virkelige situationer. ## Hvordan scenariet fungerer Du vil påtage dig rollen som en patient, der besøger en læge, spillet af AI'en. Lægen vil spørge om dine symptomer, give råd og foreslå mulige behandlinger. Ved at samtale naturligt, vil du forfine dine kommunikationsevner i en professionel sundhedskontekst.
de: Diskutieren Sie Ihre Gesundheitsbedenken in einer realistischen Praxisumgebung und üben Sie, Symptome klar zu erklären. Perfekt, um Selbstvertrauen beim Beschreiben medizinischer Probleme zu gewinnen und potenzielle Behandlungsmöglichkeiten zu verstehen. ## Warum Sie *Mit einem Arzt sprechen* spielen sollten 1. Lernen Sie, Schmerzen, Beschwerden oder Bedenken so zu beschreiben, dass ein Gesundheitsdienstleister sie verstehen kann. 2. Stärken Sie Ihr Selbstvertrauen, Folgefragen zu Tests, Rezepten oder alternativen Behandlungen zu stellen. 3. Gewinnen Sie Einblicke in medizinisches Vokabular und gebräuchliche Phrasen, die während Konsultationen verwendet werden. 4. Entwickeln Sie ein Bewusstsein dafür, wie Sie effektiv über Ihr persönliches Wohlbefinden kommunizieren können. 5. Stärken Sie Ihre Fähigkeit, Symptome zu präzisieren, damit Sie in realen Situationen für Ihre Gesundheit eintreten können. ## So funktioniert das Szenario Sie übernehmen die Rolle eines Patienten, der einen Arzt besucht, gespielt von der KI. Der Arzt wird nach Ihren Symptomen fragen, Ratschläge geben und mögliche Behandlungen vorschlagen. Durch natürliche Gespräche werden Sie Ihre Kommunikationsfähigkeiten in einem professionellen Gesundheitskontext verfeinern.
es: Discute tus preocupaciones de salud en un entorno realista de consultorio médico y practica explicar los síntomas de manera clara. Perfecto para ganar confianza al describir problemas médicos y entender las posibles opciones de tratamiento. ## Por qué deberías jugar *Conversando con un Doctor* 1. Aprende a describir dolores, molestias o preocupaciones de una manera que un profesional de salud pueda entender. 2. Gana confianza al hacer preguntas adicionales sobre pruebas, recetas o tratamientos alternativos. 3. Obtén exposición al vocabulario médico y frases comunes utilizadas durante las consultas. 4. Desarrolla una conciencia de cómo comunicarte efectivamente sobre tu bienestar personal. 5. Fortalece tu capacidad para clarificar síntomas, asegurando que puedas abogar por tu salud en situaciones de la vida real. ## Cómo funciona el escenario Asumirás el papel de un paciente que visita a un médico, interpretado por la IA. El médico te preguntará sobre tus síntomas, te dará consejos y sugerirá posibles tratamientos. Al conversar de manera natural, mejorarás tus habilidades de comunicación en un contexto profesional de atención médica.
fr: Discutez de vos préoccupations de santé dans un cadre réaliste de cabinet médical et entraînez-vous à expliquer clairement les symptômes. Parfait pour gagner en confiance dans la description des problèmes médicaux et comprendre les options de traitement potentielles. ## Pourquoi vous devriez jouer à *Parler à un Médecin* 1. Apprenez à décrire les douleurs, les malaises ou les préoccupations d'une manière que les professionnels de la santé peuvent comprendre. 2. Gagnez en confiance en posant des questions de suivi sur les tests, les prescriptions ou les traitements alternatifs. 3. Gain d'exposition au vocabulaire médical et aux phrases courantes utilisées lors des consultations. 4. Développez une conscience de l'importance de communiquer efficacement sur votre bien-être personnel. 5. Renforcez votre capacité à clarifier les symptômes, vous assurant ainsi de pouvoir défendre votre santé dans des situations réelles. ## Comment fonctionne le scénario Vous endosserez le rôle d'un patient visitant un médecin, joué par l'IA. Le médecin posera des questions sur vos symptômes, donnera des conseils et proposera des traitements possibles. En conversant naturellement, vous perfectionnerez vos compétences en communication dans un contexte de santé professionnel.
id: Diskusikan kekhawatiran kesehatan Anda dalam pengaturan kantor dokter yang realistis dan latih menjelaskan gejala dengan jelas. Sempurna untuk mendapatkan kepercayaan diri dalam mendeskripsikan masalah medis dan memahami opsi perawatan yang potensial. ## Mengapa Anda Harus Bermain *Berbicara dengan Dokter* 1. Pelajari cara menggambarkan nyeri, rasa tidak nyaman, atau kekhawatiran dengan cara yang dapat dipahami oleh tenaga medis. 2. Bangun kepercayaan diri untuk mengajukan pertanyaan lanjutan tentang tes, resep, atau perawatan alternatif. 3. Dapatkan pengalaman dengan kosakata medis dan frasa umum yang digunakan selama konsultasi. 4. Kembangkan kesadaran tentang bagaimana berkomunikasi secara efektif mengenai kesejahteraan pribadi. 5. Perkuat kemampuan Anda untuk menjelaskan gejala, memastikan Anda dapat memperjuangkan kesehatan Anda dalam situasi kehidupan nyata. ## Cara Kerja Skenario Anda akan berperan sebagai pasien yang mengunjungi dokter, yang dimainkan oleh AI. Dokter akan menanyakan tentang gejala Anda, memberikan saran, dan menyarankan kemungkinan perawatan. Dengan berbincang secara alami, Anda akan mengasah keterampilan komunikasi Anda dalam konteks layanan kesehatan profesional.
it: Discussa le tue preoccupazioni per la salute in un ambiente realistico di studio medico e pratica a spiegare i sintomi in modo chiaro. Perfetto per acquisire fiducia nel descrivere problemi medici e comprendere le potenziali opzioni di trattamento. ## Perché dovresti giocare a *Parlare con un Dottore* 1. Impara a descrivere dolori, fastidi o preoccupazioni in un modo che un professionista sanitario possa comprendere. 2. Costruisci fiducia nel fare domande di follow-up su esami, prescrizioni o trattamenti alternativi. 3. Ottieni esposizione al vocabolario medico e alle frasi comuni utilizzate durante le consultazioni. 4. Sviluppa una consapevolezza su come comunicare in modo efficace riguardo al benessere personale. 5. Rafforza la tua capacità di chiarire i sintomi, assicurandoti di poter sostenere la tua salute in situazioni reali. ## Come funziona lo scenario Assumerai il ruolo di un paziente che visita un dottore, interpretato dall'IA. Il dottore chiederà dei tuoi sintomi, fornirà consigli e suggerirà possibili trattamenti. Conversando in modo naturale, affinerai le tue abilità di comunicazione in un contesto sanitario professionale.
ja: 健康上の懸念についてリアルな医師の診療室で話し、症状を明確に説明する練習をしましょう。医療問題を説明する自信を高め、治療の選択肢を理解するのに最適です。 ## *医者に話す* をプレイすべき理由 1. 医療専門家が理解できる方法で痛みや不安を説明する方法を学ぶ。 2. 検査、処方、代替治療についてのフォローアップ質問をする自信を築く。 3. 診察中に使用される医療用語や一般的なフレーズに触れる。 4. 自分の健康について効果的にコミュニケーションを取る方法を認識する。 5. 症状を明確にする能力を強化し、現実の状況で自分の健康を主張できるようにする。 ## シナリオの進行方法 あなたは、AIが演じる医者を訪れる患者の役を担当します。医者はあなたの症状について質問し、アドバイスを提供し、可能な治療法を提案します。自然な会話を通じて、専門的な医療環境でのコミュニケーションスキルを磨いていきます。
ms: Bincangkan kebimbangan kesihatan anda dalam suasana pejabat doktor yang realistik dan latih cara menerangkan simptom dengan jelas. Sesuai untuk meningkatkan keyakinan dalam menerangkan isu perubatan dan memahami pilihan rawatan yang mungkin. ## Mengapa Anda Perlu Bermain *Bercakap dengan Doktor* 1. Belajar menerangkan rasa sakit, ketidakselesaan, atau kebimbangan dengan cara yang dapat difahami oleh profesional kesihatan. 2. Membangunkan keyakinan untuk bertanya soalan susulan mengenai ujian, preskripsi, atau rawatan alternatif. 3. Mendapat pendedahan kepada perbendaharaan kata perubatan dan frasa biasa yang digunakan semasa konsultasi. 4. Mengembangkan kesedaran tentang cara berkomunikasi secara berkesan mengenai kesejahteraan peribadi. 5. Mengukuhkan kemampuan anda untuk menjelaskan simptom, memastikan anda dapat memperjuangkan kesihatan anda dalam situasi kehidupan sebenar. ## Bagaimana Senario Ini Berfungsi Anda akan mengambil peranan sebagai pesakit yang melawat doktor, yang dimainkan oleh AI. Doktor akan bertanya tentang simptom anda, memberikan nasihat, dan mencadangkan kemungkinan rawatan. Dengan bercakap secara semula jadi, anda akan mengasah kemahiran komunikasi anda dalam konteks perkhidmatan kesihatan yang profesional.
no: Diskuter helsebekymringene dine i et realistisk legeset-up og øv deg på å forklare symptomer klart. Perfekt for å få selvtillit i å beskrive medisinske problemer og forstå potensielle behandlingsalternativer. ## Hvorfor du bør spille *Snakke med en lege* 1. Lær å beskrive smerter, plager eller bekymringer på en måte som helsepersonell kan forstå. 2. Bygg selvtillit til å stille oppfølgingsspørsmål om tester, resepter eller alternative behandlinger. 3. Få kjennskap til medisinsk vokabular og vanlige uttrykk som brukes under konsultasjoner. 4. Utvikle en bevissthet om hvordan man effektivt kan kommunisere om personlig velvære. 5. Styrk evnen din til å klargjøre symptomer, slik at du kan ivareta helsen din i virkelige situasjoner. ## Hvordan scenariet fungerer Du vil ta på deg rollen som en pasient som besøker en lege, spilt av AI-en. Legen vil spørre om symptomene dine, gi råd og foreslå mulige behandlinger. Gjennom naturlig samtale vil du utvikle kommunikasjonsevner i en profesjonell helsesammenheng.
pl: Omów swoje problemy zdrowotne w realistycznym otoczeniu gabinetu lekarskiego i ćwicz jasne wyjaśnianie objawów. Idealne do zdobywania pewności siebie w opisywaniu problemów medycznych i rozumieniu potencjalnych opcji leczenia. ## Dlaczego warto grać w *Rozmowa z lekarzem* 1. Naucz się opisywać bóle, dolegliwości lub obawy w sposób zrozumiały dla pracownika ochrony zdrowia. 2. Zbuduj pewność siebie w zadawaniu pytań uzupełniających na temat badań, recept lub alternatywnych form leczenia. 3. Zdobądź wiedzę na temat medycznego słownictwa i powszechnych fraz używanych podczas konsultacji. 4. Rozwiń świadomość, jak skutecznie komunikować się na temat własnego dobrostanu. 5. Wzmocnij swoją zdolność do klarownego wyjaśniania objawów, co pozwoli ci zadbać o zdrowie w rzeczywistych sytuacjach. ## Jak działa scenariusz Przyjmiesz rolę pacjenta odwiedzającego lekarza, którego zagra AI. Lekarz zapyta o twoje objawy, udzieli porad i zasugeruje możliwe leczenie. Prowadząc naturalną rozmowę, udoskonalisz swoje umiejętności komunikacyjne w profesjonalnym kontekście opieki zdrowotnej.
pt: Discuta suas preocupações de saúde em um ambiente realista de consultório médico e pratique explicar sintomas de forma clara. Perfeito para ganhar confiança na descrição de questões médicas e entender possíveis opções de tratamento. ## Por que você deve jogar *Conversando com um Médico* 1. Aprenda a descrever dores, desconfortos ou preocupações de uma maneira que um profissional de saúde possa entender. 2. Construa confiança ao fazer perguntas de acompanhamento sobre exames, prescrições ou tratamentos alternativos. 3. Ganhe familiaridade com o vocabulário médico e frases comuns usadas durante consultas. 4. Desenvolva a consciência de como se comunicar efetivamente sobre o bem-estar pessoal. 5. Fortaleça sua capacidade de esclarecer sintomas, garantindo que você possa advogar por sua saúde em situações da vida real. ## Como o Cenário Funciona Você assumirá o papel de um paciente visitando um médico, interpretado pela IA. O médico fará perguntas sobre seus sintomas, fornecerá conselhos e sugerirá possíveis tratamentos. Ao conversar naturalmente, você aprimorará suas habilidades de comunicação em um contexto profissional de saúde.
ru: Обсудите свои проблемы со здоровьем в реалистичной обстановке кабинета врача и научитесь четко объяснять симптомы. Отлично подходит для повышения уверенности в описании медицинских проблем и понимания возможных вариантов лечения. ## Почему вам стоит играть в *Разговор с врачом* 1. Научитесь описывать боль, недомогание или беспокойства так, чтобы медицинский работник мог понять. 2. Повышайте уверенность, задавая уточняющие вопросы о тестах, назначениях или альтернативных методах лечения. 3. Приобретите опыт в медицинской терминологии и распространенных фразах, используемых во время консультаций. 4. Развивайте осознание того, как эффективно общаться о своем благополучии. 5. Укрепляйте способность уточнять симптомы, чтобы вы могли защитить свое здоровье в реальных ситуациях. ## Как работает сценарий Вы возьмете на себя роль пациента, который посещает врача, которого играет ИИ. Врач будет спрашивать о ваших симптомах, давать советы и предлагать возможные методы лечения. Ведя естественный разговор, вы отточите свои навыки общения в профессиональной медицинской обстановке.
sv: Diskutera dina hälsoproblem i en realistisk läkarbesöksmiljö och öva på att förklara symtom tydligt. Perfekt för att få självförtroende i att beskriva medicinska problem och förstå möjliga behandlingsalternativ. ## Varför du bör spela *Prata med en Läkare* 1. Lär dig att beskriva värk, smärtor eller oro på ett sätt som en vårdpersonal kan förstå. 2. Bygg självförtroende för att ställa följdfrågor om tester, recept eller alternativa behandlingar. 3. Skapa en grund för medicinsk ordförråd och vanliga fraser som används under konsultationer. 4. Utveckla en medvetenhet om hur man kommunicerar effektivt om sitt personliga välbefinnande. 5. Stärk din förmåga att förtydliga symtom, vilket säkerställer att du kan förespråka för din hälsa i verkliga situationer. ## Hur scenariot fungerar Du kommer att ta rollen som en patient som besöker en läkare, spelad av AI:n. Läkaren kommer att fråga om dina symtom, ge råd och föreslå möjliga behandlingar. Genom att samtala naturligt kommer du att finslipa dina kommunikationsfärdigheter i en professionell vårdkontext.
tr: Sağlık endişelerinizi gerçekçi bir doktor muayenehanesi ortamında tartışın ve semptomları net bir şekilde açıklama pratiği yapın. Tıbbi konuları tanımlamada kendinize güven kazanmak ve potansiyel tedavi seçeneklerini anlamak için mükemmel. ## Neden *Doktora Konuşmalısınız* Oynamalısınız 1. Sağlık uzmanının anlayabileceği şekilde ağrı, acı veya endişeleri tanımlamayı öğrenin. 2. Testler, reçeteler veya alternatif tedaviler hakkında takip soruları sormada güven inşa edin. 3. Muayene sırasında kullanılan tıbbi kelime dağarcığına ve yaygın ifadelere maruz kalın. 4. Kişisel sağlık durumu hakkında etkili bir şekilde nasıl iletişim kuracağınıza yönelik bir farkındalık geliştirin. 5. Semptomları netleştirme becerinizi güçlendirin, böylece gerçek hayatta sağlığınızı savunabilirsiniz. ## Senaryo Nasıl İşliyor Bir hastanın rolünü üstleneceksiniz ve doktoru yapay zeka oynayacak. Doktor semptomlarınızı soracak, tavsiye verecek ve olası tedavileri önerecek. Doğal bir şekilde konuşarak, profesyonel bir sağlık hizmeti bağlamında iletişim becerilerinizi geliştireceksiniz.
uk: Обговоріть свої проблеми зі здоров'ям у реалістичному кабінеті лікаря та практикуйте чітке пояснення симптомів. Ідеально для здобуття впевненості у описі медичних питань та розумінні можливих варіантів лікування. ## Чому варто грати в *Розмова з лікарем* 1. Навчіться описувати болі, скарги або проблеми так, щоб медичний працівник міг зрозуміти. 2. Набувайте впевненості у ставленні додаткових запитань про аналізи, рецепти або альтернативні методи лікування. 3. Отримайте досвід у медичній термінології та поширених фразах, що використовуються під час консультацій. 4. Розвивайте усвідомлення того, як ефективно спілкуватися про особисте самопочуття. 5. Підсилюйте свою здатність уточнювати симптоми, щоб мати можливість відстоювати своє здоров'я в реальних ситуаціях. ## Як працює сценарій Ви займатимете роль пацієнта, який відвідує лікаря, роль якого грає ШІ. Лікар запитає про ваші симптоми, надасть поради та запропонує можливі варіанти лікування. Під час природної бесіди ви вдосконалите свої комунікаційні навички в професійному медичному контексті.
vi: Thảo luận về những mối quan tâm về sức khỏe của bạn trong một bối cảnh văn phòng bác sĩ thực tế và thực hành giải thích các triệu chứng một cách rõ ràng. Rất thích hợp để tăng cường sự tự tin trong việc mô tả các vấn đề y tế và hiểu các lựa chọn điều trị tiềm năng. ## Tại sao bạn nên chơi *Gặp bác sĩ* 1. Học cách mô tả các cơn đau, khó chịu hoặc mối quan tâm bằng cách mà các chuyên gia y tế có thể hiểu. 2. Xây dựng sự tự tin khi đặt các câu hỏi tiếp theo về xét nghiệm, đơn thuốc, hoặc các phương pháp điều trị thay thế. 3. Tăng cường kiến thức về từ vựng y tế và các cụm từ phổ biến được sử dụng trong các cuộc tư vấn. 4. Phát triển nhận thức về cách giao tiếp hiệu quả về sức khỏe cá nhân. 5. Củng cố khả năng làm rõ triệu chứng, đảm bảo bạn có thể bảo vệ sức khỏe của mình trong các tình huống thực tế. ## Cách mà bối cảnh hoạt động Bạn sẽ đảm nhận vai trò của một bệnh nhân đến thăm bác sĩ, do AI đảm nhận. Bác sĩ sẽ hỏi về các triệu chứng của bạn, đưa ra lời khuyên và đề xuất các phương pháp điều trị có thể. Bằng cách trò chuyện tự nhiên, bạn sẽ rèn luyện kỹ năng giao tiếp của mình trong bối cảnh chăm sóc sức khỏe chuyên nghiệp.

source: Discussions
de: Diskussionen
es: Discusiones
id: Diskusi-diskusi
it: Discussioni
ja: ディスカッション
no: Diskusjoner
pl: Dyskusje
pt: Discussões
ru: Обсуждения
sv: Diskussioner
th: การอภิปราย
tr: Tartışmalar
uk: Обговорення
vi: Thảo luận

source: Do I need to enter a credit card to start?
ar: هل أحتاج إلى إدخال بطاقة ائتمان للبدء؟
be: Ці трэба мне ўводзіць крэдытную карту, каб пачаць?
da: Skal jeg indtaste et kreditkort for at starte?
de: Muss ich eine Kreditkarte eingeben, um zu starten?
es: ¿Necesito ingresar una tarjeta de crédito para comenzar?
fr: Dois-je entrer une carte de crédit pour commencer ?
id: Apakah saya harus memasukkan kartu kredit untuk memulai?
it: Devo inserire una carta di credito per iniziare?
ja: 最初にクレジットカードを入力する必要がありますか？
no: Må jeg oppgi et kredittkort for å starte?
pl: Czy muszę podać kartę kredytową, aby rozpocząć?
pt: Preciso inserir um cartão de crédito para começar?
ru: Нужно ли вводить кредитную карту, чтобы начать?
sv: Behöver jag ange ett kreditkort för att börja?
th: ฉันจำเป็นต้องใส่บัตรเครดิตเพื่อเริ่มต้นหรือไม่?
tr: Başlamak için kredi kartı girmem gerekmiyor mu?
uk: Чи потрібно вводити кредитну картку, щоб почати?
vi: Tôi có cần nhập thẻ tín dụng để bắt đầu không?
