Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Stop
ar: توقف
be: Стоп
de: Stopp
es: Detener
fr: Arrêtez
id: Berhenti
it: Fermati
ja: ストップ
ms: Berhenti
no: Stopp
pl: Zatrzymaj
pt: Pare
ru: Стоп
sv: Stopp
th: หยุด
tr: Dur
uk: Стоп
vi: Dừng

source: Strategic action plan to address gaps in frontend architecture knowledge
ar: خطة عمل استراتيجية لمعالجة الفجوات في معرفة هندسة الواجهة الأمامية
be: Стратэгічны план дзеянняў для ліквідацыі прабелаў у ведах па архітэктуры фронтэнду
da: Strategisk handlingsplan for at tackle mangler i viden om frontend-arkitektur
de: Strategischer Aktionsplan zur Schließung von Lücken im Wissen über Frontend-Architektur
es: Plan de acción estratégico para abordar las brechas en el conocimiento de la arquitectura frontend
fr: Plan d'action stratégique pour combler les lacunes dans la connaissance de l'architecture frontend
id: Rencana aksi strategis untuk menangani kesenjangan dalam pengetahuan arsitektur frontend
it: Piano d'azione strategico per affrontare le lacune nella conoscenza dell'architettura front-end
ja: フロントエンドアーキテクチャの知識のギャップに対処するための戦略的アクションプラン
ms: Pelan tindakan strategik untuk menangani jurang dalam pengetahuan seni bina frontend
no: Strategisk handlingsplan for å adressere hull i kunnskap om frontend-arkitektur
pl: Strategiczny plan działania w celu wypełnienia luk w wiedzy o architekturze frontendowej
pt: Plano de ação estratégico para abordar lacunas no conhecimento de arquitetura frontend
ru: Стратегический план действий по устранению пробелов в знании архитектуры фронтенда
sv: Strategisk handlingsplan för att åtgärda kunskapsluckor inom frontend-arkitektur
th: แผนปฏิบัติการเชิงกลยุทธ์เพื่อจัดการช่องว่างในความรู้ด้านสถาปัตยกรรมส่วนหน้า
tr: Önyüz mimarisi bilgisindeki boşlukları ele almak için stratejik eylem planı
uk: Стратегічний план дій для усунення прогалин у знаннях архітектури фронтенду
vi: Kế hoạch hành động chiến lược để giải quyết khoảng trống trong kiến thức kiến trúc frontend

source: Strengths:
ar: القوى:
be: Сілы:
da: Styrker:
de: Stärken:
es: Fortalezas:
fr: Forces:
id: Kekuatan:
it: Punti di forza:
ja: 強み:
ms: Kelebihan:
no: Styrker:
pl: Mocne strony:
pt: Pontos fortes:
ru: Сильные стороны:
sv: Styrkor:
th: ความแข็งแกร่ง:
tr: Güçlü Yönler:
uk: Сильні сторони:
vi: Ưu điểm:
