Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Demonstrate expertise in architecture decisions, code reviews, and mentoring junior developers.
ar: أظهر الخبرة في اتخاذ قرارات العمارة، ومراجعات الشيفرات، وتوجيه المطورين المبتدئين.
be: Пакажыце майстэрства ў прыняцці архітэктурных рашэнняў, праверцы кода і настаўніцтве маладых распрацоўшчыкаў.
da: Demonstrer ekspertise i arkitekturbeslutninger, kodereviews og mentoring af juniorudviklere.
de: Demonstrieren Sie Fachwissen in Architekturentscheidungen, Code-Reviews und der Betreuung von Junior-Entwicklern.
es: Demuestre experiencia en decisiones de arquitectura, revisiones de código y mentoría a desarrolladores junior.
fr: Démontrez une expertise dans les décisions d'architecture, les revues de code et le mentorat de développeurs juniors.
id: Demonstrasikan keahlian dalam keputusan arsitektur, tinjauan kode, dan membimbing pengembang junior.
it: Dimostrare competenza nelle decisioni architettoniche, revisioni del codice e tutoraggio di sviluppatori junior.
ja: アーキテクチャの決定、コードレビュー、ジュニア開発者のメンタリングにおける専門知識を示す。
ms: Tunjukkan kepakaran dalam keputusan seni bina, semakan kod, dan membimbing pembangun junior.
no: Demonstrere ekspertise i arkitekturavgjørelser, kodegjennomganger og veiledning av juniorutviklere.
pl: Demonstruj wiedzę ekspercką w podejmowaniu decyzji architektonicznych, przeglądach kodu oraz mentoringu młodszych programistów.
pt: Demonstre expertise em decisões de arquitetura, revisões de código e mentoria de desenvolvedores juniores.
ru: Демонстрируйте экспертизу в принятии архитектурных решений, просмотре кода и наставничестве младших разработчиков.
sv: Demonstrera expertis inom arkitekturval, kodgranskningar och mentorskap för juniora utvecklare.
th: แสดงความเชี่ยวชาญในด้านการตัดสินใจด้านสถาปัตยกรรม การตรวจสอบโค้ด และการให้คำปรึกษาแก่ผู้พัฒนาระดับจูเนียร์
tr: Mimari kararlar, kod incelemeleri ve kıdemsiz geliştiricilere mentorluk yapma konusunda uzmanlık sergileyin.
uk: Демонструйте свій досвід у прийнятті архітектурних рішень, оглядах коду та наставництві молодших розробників.
vi: Thể hiện sự thành thạo trong việc đưa ra các quyết định kiến trúc, đánh giá mã nguồn và hướng dẫn các lập trình viên trẻ.

source: Demonstrate solid understanding of HTML, CSS, JavaScript, and modern frameworks like React or Vue.
ar: أظهر فهمًا قويًا لـ HTML وCSS وJavaScript والأطر الحديثة مثل React أو Vue.
be: Дэманструйце добрае разуменне HTML, CSS, JavaScript і сучасных фреймворкаў, як React або Vue.
da: Demonstrer solid forståelse af HTML, CSS, JavaScript og moderne frameworks som React eller Vue.
de: Demonstriere fundiertes Verständnis von HTML, CSS, JavaScript und modernen Frameworks wie React oder Vue.
es: Demuestre un sólido entendimiento de HTML, CSS, JavaScript y frameworks modernos como React o Vue.
fr: Démontrez une solide compréhension de HTML, CSS, JavaScript et des frameworks modernes comme React ou Vue.
id: Demonstrasikan pemahaman yang kuat tentang HTML, CSS, JavaScript, dan kerangka kerja modern seperti React atau Vue.
it: Dimostrare una solida comprensione di HTML, CSS, JavaScript e dei moderni framework come React o Vue.
ja: HTML、CSS、JavaScript、およびReactやVueのような現代のフレームワークに関する確かな理解を示します。
no: Demonstrer solid forståelse av HTML, CSS, JavaScript, og moderne rammeverk som React eller Vue.
pl: Demonstracja solidnego zrozumienia HTML, CSS, JavaScript oraz nowoczesnych frameworków, takich jak React lub Vue.
pt: Demonstre sólido conhecimento de HTML, CSS, JavaScript e frameworks modernos como React ou Vue.
ru: Демонстрируйте уверенное понимание HTML, CSS, JavaScript и современных фреймворков, таких как React или Vue.
sv: Demonstrera gedigen förståelse för HTML, CSS, JavaScript, och moderna ramverk som React eller Vue.
th: แสดงความเข้าใจที่แน่นหนาเกี่ยวกับ HTML, CSS, JavaScript และเฟรมเวิร์คสมัยใหม่เช่น React หรือ Vue.
tr: HTML, CSS, JavaScript ve React veya Vue gibi modern framework'lere sağlam bir anlayış gösterin.
uk: Продемонструйте ґрунтовне розуміння HTML, CSS, JavaScript та сучасних фреймворків, таких як React або Vue.
vi: Thể hiện sự hiểu biết vững chắc về HTML, CSS, JavaScript và các khung công tác hiện đại như React hoặc Vue.

source: Describe 1–2 small projects you've built
ar: اشرح 1-2 مشاريع صغيرة قمت ببنائها
be: Апішыце 1–2 невялікія праекты, якія вы зрабілі
da: Beskriv 1–2 små projekter, du har bygget
de: Beschreiben Sie 1–2 kleine Projekte, die Sie gebaut haben
es: Describe 1–2 pequeños proyectos que has desarrollado
fr: Décrivez 1 à 2 petits projets que vous avez réalisés
id: Jelaskan 1–2 proyek kecil yang telah Anda buat
it: Descrivi 1–2 piccoli progetti che hai realizzato
ja: 1〜2 の小規模なプロジェクトを説明してください
no: Beskriv 1–2 små prosjekter du har bygget
pl: Opisz 1–2 małe projekty, które zbudowałeś
pt: Descreva 1–2 pequenos projetos que você construiu
ru: Опишите 1–2 небольших проекта, которые вы реализовали
sv: Beskriv 1–2 små projekt du har byggt
th: อธิบาย 1–2 โปรเจ็กต์เล็ก ๆ ที่คุณได้สร้าง
tr: Yaptığınız 1-2 küçük projeyi tanımlayın
uk: Опишіть 1–2 невеликі проекти, які ви створили
vi: Mô tả 1–2 dự án nhỏ bạn đã xây dựng

source: Describe a time you led a frontend refactor or migration (e.g., from class components to hooks or from a legacy stack to a modern framework).
ar: صِف وقتًا قمت فيه بقيادة إعادة هيكلة أو ترحيل للواجهة الأمامية (مثل التحول من مكونات الصفوف إلى الخطافات أو من حزمة تكنولوجيا قديمة إلى إطار عمل حديث).
be: Апішыце выпадак, калі вы кіравалі рэфактарызацыяй або міграцыяй франтэнда (напрыклад, пераход ад класаў кампанентаў да хукоў або ад старой тэхналагічнай стэкі да сучаснага фреймворка).
da: Beskriv en gang, du ledte en frontend-refaktorering eller migration (fx fra klassekomponenter til hooks eller fra en legacy-stack til et moderne framework).
de: Beschreiben Sie eine Zeit, in der Sie eine Frontend-Refaktorisierung oder -Migration geleitet haben (z.B. von Klassenkomponenten zu Hooks oder von einem Legacy-Stack zu einem modernen Framework).
es: Describe un momento en que lideraste un refactor o migración de frontend (por ejemplo, de componentes de clase a hooks o de una pila heredada a un marco moderno).
fr: Décrivez un moment où vous avez dirigé une refonte ou une migration de frontend (par exemple, de composants de classe à des hooks ou d'une pile héritée à un framework moderne).
id: Jelaskan waktu ketika Anda memimpin refaktor atau migrasi frontend (misalnya, dari komponen kelas ke hooks atau dari stack warisan ke kerangka kerja modern).
it: Descrivi un'occasione in cui hai guidato un refactoring o una migrazione del frontend (ad es., da componenti a classi a hooks o da una infrastruttura legacy a un framework moderno).
ja: フロントエンドのリファクタリングまたは移行を主導した経験を説明してください（例：クラスコンポーネントからフックへの移行、またはレガシースタックからモダンフレームワークへの移行）。
ms: Jelaskan masa anda memimpin pemindahan atau pengubahsuaian frontend (contohnya, dari komponen kelas kepada hooks atau dari tumpukan lama kepada kerangka kerja moden).
no: Beskriv en gang du ledet en frontend refaktorering eller migrering (f.eks. fra klassekomponenter til hooks eller fra en eldre stack til et moderne rammeverk).
pl: Opisz moment, w którym przewodziłeś refaktoryzacji lub migracji frontendu (np. z komponentów klasowych na hooki lub z przestarzałego stosu na nowoczesny framework).
pt: Descreva uma vez em que você liderou uma refatoração ou migração de front-end (por exemplo, de componentes de classe para hooks ou de uma stack legada para um framework moderno).
ru: Опишите время, когда вы руководили рефакторингом или миграцией фронтенда (например, от классовых компонентов к хукам или от устаревшего стека к современному фреймворку).
sv: Beskriv en tid då du ledde en frontend-refaktorering eller migrering (t.ex. från klasskomponenter till hooks eller från en äldre stack till ett modernt ramverk).
th: บรรยายถึงเวลาที่คุณนำการเปลี่ยนแปลงหน้าบ้านใหม่หรือการย้ายข้อมูล (เช่น จากองค์ประกอบคลาสไปสู่ฮุกหรือตั้งแต่ชุดเทคโนโลยีเก่าไปจนถึงกรอบงานที่ทันสมัย)
tr: Bir ön uç yeniden düzenlemesi veya göçünü yönettiğiniz bir zamanı anlatın (örneğin, sınıf bileşenlerinden kancalara veya eski bir yığınından modern bir çerçeveye geçiş).
uk: Опишіть випадок, коли ви очолювали рефакторинг або міграцію фронтенду (наприклад, від класових компонентів до хуків або від застарілого стека до сучасного фреймворку).
vi: Mô tả một thời gian bạn đã dẫn dắt một dự án refactor hoặc migration frontend (ví dụ: từ các thành phần class sang hooks hoặc từ ngăn xếp cũ sang framework hiện đại).

source: Describe a time you led a frontend refactor or migration. What challenges did you face and how did you overcome them?
ar: صِف وقتًا قُدت فيه عملية إعادة هيكلة أو ترحيل للواجهة الأمامية. ما التحديات التي واجهتها وكيف تغلبت عليها؟
be: Апішыце час, калі вы кіравалі фронтэнд-рэфактарынгам або міграцыяй. З якімі праблемамі вы сутыкнуліся і як вы іх пераадолелі?
da: Beskriv en tid, hvor du ledede en frontend refaktorering eller migration. Hvilke udfordringer stod du overfor, og hvordan overvandt du dem?
de: Beschreiben Sie eine Situation, in der Sie eine Frontend-Umstrukturierung oder -Migration geleitet haben. Welche Herausforderungen sind Ihnen begegnet und wie haben Sie sie gemeistert?
es: Describe una ocasión en la que lideraste una refactorización o migración del frontend. ¿Qué desafíos enfrentaste y cómo los superaste?
fr: Décrivez un moment où vous avez dirigé une refonte ou une migration frontend. Quels défis avez-vous rencontrés et comment les avez-vous surmontés ?
id: Jelaskan waktu ketika Anda memimpin perombakan atau migrasi frontend. Tantangan apa yang Anda hadapi dan bagaimana cara Anda mengatasinya?
it: Descrivi un momento in cui hai guidato un refactoring o una migrazione del frontend. Quali sfide hai affrontato e come le hai superate?
ja: あなたがフロントエンドのリファクタリングまたは移行を主導した時のことを説明してください。どのような課題に直面し、それをどのように克服しましたか？
ms: Huraikan masa anda memimpin refaktor atau migrasi frontend. Apakah cabaran yang anda hadapi dan bagaimana anda menanganinya?
no: Beskriv en gang du ledet en frontend-omstrukturering eller -migrering. Hvilke utfordringer møtte du, og hvordan overvant du dem?
pl: Opisz czas, kiedy prowadziłeś refaktoryzację lub migrację frontendową. Jakie wyzwania napotkałeś i jak je pokonałeś?
pt: Descreva uma vez em que você liderou uma refatoração ou migração de frontend. Que desafios você enfrentou e como os superou?
ru: Опишите случай, когда вы вели рефакторинг или миграцию frontend. С какими трудностями вы столкнулись и как вы их преодолели?
sv: Beskriv en tid då du ledde en frontend-omstrukturering eller -migrering. Vilka utmaningar stötte du på och hur övervann du dem?
th: อธิบายช่วงเวลาที่คุณเป็นผู้นำในการปรับโครงสร้างหรือการโยกย้าย Frontend คุณประสบความท้าทายอะไรบ้างและคุณแก้ปัญหาเหล่านั้นอย่างไร?
tr: Ön uç yeniden yapılandırma veya geçişini yönettiğiniz bir zamanı anlatın. Karşılaştığınız zorluklar nelerdi ve bunları nasıl aştınız?
uk: Опишіть випадок, коли ви керували рефакторингом або міграцією фронтенду. З якими викликами ви стикнулися і як їх подолали?
vi: Mô tả một thời điểm bạn đã dẫn dắt một dự án tái cấu trúc hoặc di dời frontend. Bạn đã đối mặt với những thách thức nào và bạn đã vượt qua chúng như thế nào?

source: Describe how you would diagnose and fix a performance regression caused by excessive re-renders.
ar: وصف كيف ستقوم بتشخيص وإصلاح تراجع في الأداء ناجم عن عمليات إعادة تصيير مفرطة.
be: Апішыце, як вы будзеце дыягнаставаць і выпраўляць рэгрэсію прадукцыйнасці, выкліканую празмернымі перамалёўкамі.
da: Beskriv, hvordan du ville diagnosticere og løse en ydeevne-regression forårsaget af overdreven genrendring.
de: Beschreiben Sie, wie Sie eine Leistungsregression, die durch übermäßiges Neu-Rendern verursacht wird, diagnostizieren und beheben würden.
es: Describe cómo diagnosticaría y solucionaría una regresión de rendimiento causada por renderizados excesivos.
fr: Décrivez comment vous diagnostiqueriez et répareriez une régression de performance causée par des re-rendus excessifs.
id: Deskripsikan bagaimana Anda akan mendiagnosis dan memperbaiki penurunan kinerja yang disebabkan oleh render ulang yang berlebihan.
it: Descrivi come individueresti e risolveresti una regressione delle prestazioni causata da renderizzazioni eccessive.
ja: パフォーマンスの低下が過剰な再レンダリングによって引き起こされた場合、どのように診断し修正するかを説明します。
ms: Huraikan bagaimana anda akan mendiagnosis dan membetulkan kemerosotan prestasi yang disebabkan oleh pengulangan semula berlebihan.
no: Beskriv hvordan du vil diagnostisere og fikse en ytelsesmisking forårsaket av overdreven re-rendring.
pl: Opisz, jak zdiagnozować i naprawić regresję wydajności spowodowaną nadmiernymi ponownymi renderowaniami.
pt: Descreva como você diagnosticaria e corrigiria uma regressão de desempenho causada por re-renderizações excessivas.
ru: Опишите, как вы бы диагностировали и устранили регрессию производительности, вызванную чрезмерными повторными отрисовками.
sv: Beskriv hur du skulle diagnostisera och åtgärda en prestandaregression orsakad av överdrivna omrenderingar.
th: อธิบายวิธีการวินิจฉัยและแก้ไขการลดประสิทธิภาพที่เกิดจากการ re-render ที่มากเกินไป.
tr: Bir performans gerilemesini aşırı yeniden çizimler nedeniyle teşhis etme ve düzeltme yöntemlerini açıklayın.
uk: Опишіть, як ви б діагностували та виправили регресію продуктивності, викликану надмірними повторними рендерами.
vi: Mô tả cách bạn sẽ chẩn đoán và khắc phục sự suy giảm hiệu suất do quá nhiều lần render lại gây ra.

source: Describe images, craft sentences, and translate words
ar: صف الصور، صياغة الجمل، وترجمة الكلمات
be: Апісвайце выявы, стварайце пропазіцыі і перакладайце словы
da: Beskriv billeder, formuler sætninger og oversæt ord
de: Bilder beschreiben, Sätze formulieren und Wörter übersetzen
es: Describe imágenes, elabora oraciones y traduce palabras
fr: Décrivez des images, créez des phrases et traduisez des mots
id: Jelaskan gambar, buat kalimat, dan terjemahkan kata-kata
it: Descrivi immagini, crea frasi e traduci parole
ja: 画像を説明し、文章を作成し、単語を翻訳する
ms: Huraikan imej, buat ayat, dan terjemah perkataan
no: Beskriv bilder, lag setninger og oversett ord
pl: Opisuj obrazy, twórz zdania i tłumacz słowa
pt: Descreva imagens, formule frases e traduza palavras
ru: Описывайте изображения, составляйте предложения и переводите слова
sv: Beskriv bilder, formulera meningar och översätt ord
th: อธิบายภาพ, สร้างประโยค, และแปลคำ
tr: Görüntüleri tanımla, cümleler oluştur ve kelimeleri çevir
uk: Описуйте зображення, формулюйте речення та перекладайте слова
vi: Mô tả hình ảnh, tạo câu và dịch từ

source: Describe strategies to handle concurrency in .NET when processing background jobs (queues, batching, throttling).
ar: صف استراتيجيات التعامل مع التزامن في .NET عند معالجة الوظائف الخلفية (طوابير، تجميع، تحديد السرعة).
be: Апішыце стратэгіі апрацоўкі канкурэнтнасці ў .NET пры апрацоўцы фонавых заданняў (чэкі, партыяванне, дроселіраванне).
da: Beskriv strategier til at håndtere samtidighed i .NET ved behandling af baggrundsjob (køer, batching, throttling).
de: Beschreiben Sie Strategien zum Umgang mit Nebenläufigkeit in .NET bei der Verarbeitung von Hintergrundaufträgen (Warteschlangen, Batch-Verarbeitung, Drosselung).
es: Describe estrategias para manejar la concurrencia en .NET al procesar trabajos en segundo plano (colas, lotificación, limitación).
fr: Décrivez des stratégies pour gérer la concurrence dans .NET lors du traitement des travaux en arrière-plan (files d'attente, regroupement, limitation).
id: Jelaskan strategi untuk menangani konkurensi di .NET saat memproses pekerjaan latar belakang (antrian, batching, pembatasan).
it: Descrivi strategie per gestire la concorrenza in .NET durante l'elaborazione di lavori in background (code, batching, throttling).
ja: .NETでバックグラウンドジョブを処理する際の同時実行性を管理するための戦略について説明します（キュー、バッチ処理、スロットリング）。
ms: Huraikan strategi untuk menangani concurrency dalam .NET semasa memproses tugasan latar belakang (queue, batch, throttling).
no: Beskriv strategier for å håndtere samtidighet i .NET når du behandler bakgrunnsjobber (køer, batching, struping).
pl: Opisz strategie obsługi współbieżności w .NET podczas przetwarzania zadań w tle (kolejki, wsadowanie, dławienie).
pt: Descreva estratégias para lidar com concorrência em .NET ao processar trabalhos em segundo plano (filas, agrupamento, limitação).
ru: Опишите стратегии управления параллелизмом в .NET при обработке фоновых заданий (очереди, пакетирование, ограничение).
sv: Beskriv strategier för att hantera samtidighet i .NET vid bearbetning av bakgrundsjobb (köer, batchning, strypning).
th: อธิบายกลยุทธ์ในการจัดการความพร้อมกันใน .NET เมื่อประมวลผลงานพื้นหลัง (คิว, การจัดกลุ่ม, การควบคุมปริมาณ)
tr: .NET'te arka plan işleri işlenirken eşzamanlılığı yönetmek için stratejileri açıklayın (kuyruklar, toplama, sınırlama).
uk: Опис стратегій управління паралельністю в .NET при обробці фонових завдань (черги, групування, обмеження).
vi: Mô tả các chiến lược xử lý đồng thời trong .NET khi xử lý các công việc nền (hàng đợi, xử lý theo nhóm, hạn chế tốc độ).

source: Describe the image
ar: صف الصورة
be: Апішыце малюнак
da: Beskriv billedet
de: Beschreibe das Bild
es: Describe la imagen
fr: Décrivez l'image
id: Jelaskan gambar
it: Descrivi l'immagine
ja: 画像を説明する
ms: Huraikan imej
no: Beskriv bildet
pl: Opisz obraz
pt: Descreva a imagem
ru: Опишите изображение
sv: Beskriv bilden
th: อธิบายภาพ
tr: Görüntüyü açıkla
uk: Опишіть зображення
vi: Mô tả hình ảnh

source: Describe the topic in your own words...
ar: صف الموضوع بكلماتك الخاصة...
be: Апішыце тэму сваімі словамі...
da: Beskriv emnet med dine egne ord...
de: Beschreiben Sie das Thema mit Ihren eigenen Worten...
es: Describe el tema con tus propias palabras...
fr: Décrivez le sujet avec vos propres mots...
id: Jelaskan topik dengan kata-kata Anda sendiri...
it: Descrivi l'argomento con le tue parole...
ja: あなた自身の言葉で話題を説明してください...
ms: Huraikan topik dengan kata-kata anda sendiri...
no: Beskriv emnet med dine egne ord...
pl: Opisz temat swoimi własnymi słowami...
pt: Descreva o tópico com suas próprias palavras...
ru: Опишите тему своими собственными словами...
sv: Beskriv ämnet med dina egna ord...
th: อธิบายเรื่องในคำพูดของคุณเอง...
tr: Konuyu kendi kelimelerinizle anlatın...
uk: Опишіть тему своїми власними словами...
vi: Mô tả chủ đề bằng lời của bạn...

source: Describe the word you see on the screen without using the word itself!
ar: صف الكلمة التي تراها على الشاشة بدون استخدام الكلمة نفسها!
be: Апішыце слова, якое вы бачыце на экране, не выкарыстоўваючы самого слова!
da: Beskriv ordet du ser på skærmen uden at bruge selve ordet!
de: Beschreiben Sie das Wort, das Sie auf dem Bildschirm sehen, ohne das Wort selbst zu verwenden!
es: ¡Describe la palabra que ves en la pantalla sin usar la palabra misma!
fr: Décrivez le mot que vous voyez à l'écran sans utiliser le mot lui-même !
id: Jelaskan kata yang Anda lihat di layar tanpa menggunakan kata itu sendiri!
it: Descrivi la parola che vedi sullo schermo senza utilizzare la parola stessa!
ja: 画面に表示されている単語を、その単語自体を使わずに説明してみてください！
ms: Huraikan perkataan yang anda lihat pada skrin tanpa menggunakan perkataan itu sendiri!
no: Beskriv ordet du ser på skjermen uten å bruke selve ordet!
pl: Opisz słowo, które widzisz na ekranie, nie używając tego słowa!
pt: Descreva a palavra que você vê na tela sem usar a própria palavra!
ru: Опишите слово, которое вы видите на экране, не используя само слово!
sv: Beskriv ordet du ser på skärmen utan att använda själva ordet!
th: อธิบายคำที่คุณเห็นบนหน้าจอโดยไม่ใช้คำนั้นเอง!
tr: Ekranda gördüğünüz kelimeyi, kelimeyi kendini kullanmadan tarif edin!
uk: Опишіть слово, яке ви бачите на екрані, не використовуючи саме це слово!
vi: Mô tả từ bạn thấy trên màn hình mà không sử dụng chính từ đó!

source: Describe these words:
ar: صف هذه الكلمات:
be: Апішыце гэтыя словы:
da: Beskriv disse ord:
de: Beschreiben Sie diese Wörter:
es: Describe estas palabras:
fr: Décrivez ces mots :
id: Jelaskan kata-kata ini:
it: Descrivi queste parole:
ja: これらの言葉を説明してください：
ms: Huraikan perkataan-perkataan ini:
no: Beskriv disse ordene:
pl: Opisz te słowa:
pt: Descreva estas palavras:
ru: Опишите эти слова:
sv: Beskriv dessa ord:
th: อธิบายคำเหล่านี้:
tr: Bu kelimeleri tanımlayın:
uk: Опишіть ці слова:
vi: Mô tả những từ này:

source: Describe your custom scenario here...
ar: صف سيناريوك المخصص هنا...
be: Апішыце свой карыстацкі сцэнарый тут...
da: Beskriv dit tilpassede scenarie her...
de: Beschreiben Sie hier Ihr benutzerdefiniertes Szenario...
es: Describe tu escenario personalizado aquí...
fr: Décrivez votre scénario personnalisé ici...
id: Deskripsikan skenario kustom Anda di sini...
it: Descrivi il tuo scenario personalizzato qui...
ja: あなたのカスタムシナリオをここに説明してください...
ms: Huraikan senario khas anda di sini...
no: Beskriv ditt tilpassede scenario her...
pl: Opisz swój niestandardowy scenariusz tutaj...
pt: Descreva seu cenário personalizado aqui...
ru: Опишите свой собственный сценарий здесь...
sv: Beskriv ditt anpassade scenario här...
th: อธิบายสถานการณ์ที่กำหนดเองของคุณที่นี่...
tr: Kendi senaryonuzu buraya tanımlayın...
uk: Описуйте свій власний сценарій тут...
vi: Mô tả kịch bản tùy chỉnh của bạn ở đây...

source: Description:
ar: الوصف:
be: Апісанне:
da: Beskrivelse:
de: Beschreibung:
es: Descripción:
id: Deskripsi:
it: Descrizione:
ja: 説明:
ms: Penerangan:
no: Beskrivelse:
pl: Opis:
pt: Descrição:
ru: Описание:
sv: Beskrivning:
th: คำอธิบาย:
tr: Açıklama:
uk: Опис:
vi: Mô tả:

source: Deselect all
id: Batalkan semua pilihan
it: Deseleziona tutto
ja: すべての選択を解除
no: Fjern alle valg
ru: Снять выделение со всех
uk: Зняти виділення з усього
