Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: You can practice for senior frontend, lead, and staff-level interviews including technical rounds, frontend system design, live coding, and behavioral interviews focused on React, Vue, Angular, TypeScript, and modern web architecture.
ar: يمكنك ممارسة مقابلات كبار المبرمجين الواجهة الأمامية، القادة، ومستويات الموظفين بما في ذلك الجولات التقنية، تصميم أنظمة الواجهة الأمامية، البرمجة الحية، والمقابلات السلوكية التي تركز على React، Vue، Angular، TypeScript، وهندسة الويب الحديثة.
be: Вы можаце практыкавацца для сумоўяў на пазіцыі старэйшага фронтэнд-спецыяліста, лідара і супрацоўніка ўключна з тэхнічнымі раўндамі, распрацоўкай сістэм фронтэнда, жывым кадаваннем і паводзінамі на сумоўях з акцэнтам на React, Vue, Angular, TypeScript і сучасную вэб-архітэктуру.
da: Du kan øve dig til senior frontend-, lead- og staff-niveau interviews, inklusiv tekniske runder, frontend systemdesign, live kodning og adfærdsinterviews fokuseret på React, Vue, Angular, TypeScript og moderne webarkitektur.
de: Du kannst für Interviews auf Senior-Frontend-, Lead- und Mitarbeiterebene üben, einschließlich technischer Runden, Frontend-Systemdesign, Live-Coding und Verhaltensinterviews, die auf React, Vue, Angular, TypeScript und moderne Webarchitektur fokussiert sind.
es: Puede practicar para entrevistas de nivel senior de frontend, lead y staff, incluidas rondas técnicas, diseño de sistemas frontend, programación en vivo y entrevistas de comportamiento centradas en React, Vue, Angular, TypeScript y arquitectura web moderna.
fr: Vous pouvez vous entraîner pour des entretiens au niveau avancé de développeur frontend, chef d'équipe et exécutif, y compris les phases techniques, la conception de systèmes frontend, le codage en direct et les entretiens comportementaux axés sur React, Vue, Angular, TypeScript et l'architecture web moderne.
id: Anda dapat berlatih untuk wawancara tingkat senior frontend, lead, dan staf termasuk putaran teknis, desain sistem frontend, live coding, dan wawancara perilaku yang berfokus pada React, Vue, Angular, TypeScript, dan arsitektur web modern.
it: Puoi esercitarti per colloqui di livello senior frontend, lead e staff, inclusi round tecnici, progettazione di sistemi frontend, live coding e colloqui comportamentali focalizzati su React, Vue, Angular, TypeScript e architettura web moderna.
ja: シニアフロントエンド、リード、およびスタッフレベルのインタビューの練習ができます。技術的ラウンド、フロントエンドシステムデザイン、ライブコーディング、React、Vue、Angular、TypeScript、モダンなウェブアーキテクチャに焦点を当てた行動インタビューを含みます。
ms: Anda boleh berlatih untuk wawancara tahap kanan frontend, ketua, dan kakitangan termasuk pusingan teknikal, reka bentuk sistem frontend, pengekodan secara langsung, dan wawancara tingkah laku yang memberi tumpuan kepada React, Vue, Angular, TypeScript, dan seni bina web moden.
no: Du kan øve deg til senior frontend, lead, og staff-nivå intervjuer inkludert tekniske runder, frontend systemdesign, live koding, og adferdsintervjuer med fokus på React, Vue, Angular, TypeScript, og moderne webarkitektur.
pl: Możesz ćwiczyć do rozmów kwalifikacyjnych na poziomie senior frontend, lead i staff, w tym rund technicznych, projektowania systemu frontend, kodowania na żywo i rozmów behawioralnych skoncentrowanych na React, Vue, Angular, TypeScript i nowoczesnej architekturze webowej.
pt: Você pode praticar para entrevistas de nível sênior em frontend, líder e staff, incluindo rodadas técnicas, design de sistema frontend, codificação ao vivo e entrevistas comportamentais com foco em React, Vue, Angular, TypeScript e arquitetura web moderna.
ru: Вы можете практиковаться для собеседований на позицию старшего фронтенд-разработчика, лида и специалиста высшего уровня, включая технические этапы, проектирование фронтенд-систем, живое кодирование и поведенческие собеседования, ориентируясь на React, Vue, Angular, TypeScript и современную веб-архитектуру.
sv: Du kan öva inför seniorfrontend-, lead- och staff-nivåintervjuer inklusive tekniska omgångar, frontend systemdesign, livekodning och beteendeintervjuer med fokus på React, Vue, Angular, TypeScript och modern webbarkitektur.
th: คุณสามารถฝึกฝนสำหรับการสัมภาษณ์ระดับอาวุโสด้าน frontend, หัวหน้างาน, และระดับเจ้าหน้าที่ รวมถึงรอบเทคนิค, การออกแบบระบบ frontend, การเขียนโค้ดสด และการสัมภาษณ์ทางพฤติกรรมที่เน้น React, Vue, Angular, TypeScript และสถาปัตยกรรมเว็บสมัยใหม่
tr: Kıdemli frontend, lider ve personel düzeyindeki mülakatlar için teknik turlar, frontend sistem tasarımı, canlı kodlama ve React, Vue, Angular, TypeScript ve modern web mimarisine odaklanmış davranışsal mülakatlar dahilinde pratik yapabilirsiniz.
uk: Ви можете практикуватися для старших фронтенд, провідних та рівнів співробітників інтерв'ю, включаючи технічні раунди, дизайни фронтенд системи, живе кодування та поведінкові інтерв'ю, сфокусовані на React, Vue, Angular, TypeScript та сучасній веб-архітектурі.
vi: Bạn có thể luyện tập cho các buổi phỏng vấn cấp cao cấp về frontend, lead và staff bao gồm các vòng kỹ thuật, thiết kế hệ thống frontend, mã hóa trực tiếp và phỏng vấn hành vi tập trung vào React, Vue, Angular, TypeScript và kiến trúc web hiện đại.

source: You can renew your full access any time before it expires to avoid interruption of service.
de: Sie können Ihren vollen Zugriff jederzeit vor dem Ablaufen verlängern, um Unterbrechungen des Dienstes zu vermeiden.
es: Puedes renovar tu acceso completo en cualquier momento antes de que expire para evitar la interrupción del servicio.
id: Anda dapat memperbarui akses penuh Anda kapan saja sebelum kedaluwarsa untuk menghindari gangguan layanan.
it: Puoi rinnovare il tuo pieno accesso in qualsiasi momento prima che scada per evitare interruzioni del servizio.
ja: フルアクセスの有効期限が切れる前にいつでも更新することで、サービスの中断を避けることができます。
no: Du kan fornye din fullstendige tilgang når som helst før den utløper for å unngå avbrudd i tjenesten.
pl: Możesz odnowić pełny dostęp w dowolnym momencie przed jego wygaśnięciem, aby uniknąć przerwy w dostępie do usługi.
pt: Você pode renovar seu acesso completo a qualquer momento antes que ele expire para evitar a interrupção do serviço.
ru: Вы можете продлить полный доступ в любое время до его истечения, чтобы избежать прерывания обслуживания.
sv: Du kan förnya din fullständiga åtkomst när som helst innan den upphör för att undvika avbrott i tjänsten.
th: คุณสามารถต่ออายุการเข้าถึงเต็มรูปแบบของคุณได้ตลอดเวลาก่อนที่จะหมดอายุเพื่อหลีกเลี่ยง การหยุดชะงักของบริการ
tr: Hizmetin kesintiye uğramasını önlemek için tam erişiminizi sona ermeden önce herhangi bir zamanda yenileyebilirsiniz.
uk: Ви можете поновити свій повний доступ у будь-який час до того, як він закінчиться, щоб уникнути переривання обслуговування.
vi: Bạn có thể gia hạn quyền truy cập đầy đủ của mình bất kỳ lúc nào trước khi hết hạn để tránh gián đoạn dịch vụ.

source: You can track the progress on the main page.
ar: يمكنك تتبع التقدم في الصفحة الرئيسية.
be: Вы можаце адсочваць прагрэс на галоўнай старонцы.
da: Du kan følge fremskridtene på hovedsiden.
de: Sie können den Fortschritt auf der Hauptseite verfolgen.
es: Puede realizar un seguimiento del progreso en la página principal.
fr: Vous pouvez suivre les progrès sur la page principale.
id: Anda dapat melacak kemajuan di halaman utama.
it: Puoi monitorare il progresso sulla pagina principale.
ja: メインページで進捗を追跡できます。
no: Du kan spore fremgangen på hovedsiden.
pl: Możesz śledzić postępy na stronie głównej.
pt: Você pode acompanhar o progresso na página principal.
ru: Вы можете отслеживать прогресс на главной странице.
sv: Du kan följa framstegen på huvudsidan.
th: คุณสามารถติดตามความคืบหน้าได้ที่หน้าหลัก
tr: Ana sayfadan ilerlemeyi takip edebilirsiniz.
uk: Ви можете відстежувати прогрес на головній сторінці.
vi: Bạn có thể theo dõi tiến độ trên trang chính.

source: You can try AI in action now
ar: يمكنك تجربة الذكاء الصناعي في العمل الآن
be: Вы можаце паспрабаваць AI ў дзеянні зараз
da: Du kan prøve AI i aktion nu
de: Sie können AI jetzt ausprobieren
es: Puedes probar la IA en acción ahora
fr: Vous pouvez essayer l'IA en action maintenant
id: Anda bisa mencoba AI dalam aksi sekarang
it: Puoi provare l'IA in azione ora
ja: あなたは今すぐAIを試すことができます
ms: Anda boleh mencuba AI dalam tindakan sekarang
no: Du kan prøve AI i handling nå
pl: Możesz teraz wypróbować AI w akcji
pt: Você pode experimentar a IA em ação agora
ru: Вы можете протестировать AI прямо сейчас
sv: Du kan testa AI i aktion nu
th: คุณสามารถลองใช้ AI ในภาคปฏิบัติได้เลยตอนนี้
tr: Şimdi AI'yi deneyebilirsiniz
uk: Ви можете спробувати AI в дії зараз
vi: Bạn có thể thử AI hoạt động ngay bây giờ

source: You can use any language you like
es: Puedes usar cualquier idioma que desees
id: Anda dapat menggunakan bahasa apa pun yang Anda suka
it: Puoi usare qualsiasi lingua tu preferisca
ja: あなたは好きな言語を使用できます
no: Du kan bruke hvilket som helst språk du vil
pl: Możesz użyć dowolnego języka, który lubisz
pt: Você pode usar qualquer idioma que desejar
ru: Вы можете использовать любой язык, который вам нравится
sv: Du kan använda vilket språk du vill
uk: Ви можете використовувати будь-яку мову, яку вам подобається

source: You can use text to answer if you prefer.
ar: يمكنك استخدام النص للإجابة إذا كنت تفضل ذلك.
be: Вы можаце выкарыстоўваць тэкст для адказу, калі вам так зручней.
da: Du kan bruge tekst til at svare, hvis du foretrækker det.
de: Sie können Text verwenden, um zu antworten, wenn Sie dies bevorzugen.
es: Puedes usar texto para responder si lo prefieres.
fr: Vous pouvez utiliser le texte pour répondre si vous préférez.
id: Anda dapat menggunakan teks untuk menjawab jika Anda mau.
it: Puoi usare il testo per rispondere se preferisci.
ja: テキストを使用して答えることができる場合、その方法を選んでください。
no: Du kan bruke tekst for å svare hvis du foretrekker det.
pl: Możesz użyć tekstu, aby odpowiedzieć, jeśli wolisz.
pt: Você pode usar texto para responder, se preferir.
ru: Вы можете использовать текст для ответа, если предпочитаете.
sv: Du kan använda text för att svara om du föredrar det.
th: คุณสามารถใช้ข้อความตอบกลับได้ถ้าคุณต้องการ
tr: İsterseniz metni yanıtlamak için kullanabilirsiniz.
uk: Ви можете використовувати текст для відповіді, якщо вам зручно.
vi: Bạn có thể sử dụng văn bản để trả lời nếu bạn thích.

source: You do not have full access.
de: Sie haben keinen vollständigen Zugriff.
es: No tienes acceso completo.
id: Anda tidak memiliki akses penuh.
it: Non hai accesso completo.
ja: 完全なアクセス権がありません。
no: Du har ikke full tilgang.
pl: Nie masz pełnego dostępu.
pt: Você não tem acesso total.
ru: У вас нет полного доступа.
sv: Du har inte fullständig åtkomst.
th: คุณยังไม่ได้รับสิทธิ์การเข้าถึงทั้งหมด
tr: Tam erişiminiz yok.
uk: Ви не маєте повного доступу.
vi: Bạn không có quyền truy cập đầy đủ.

source: You get feedback like “strong technically, but not **senior enough**” — with no specifics
ar: plaintext تحصل على تعليقات مثل "قوي تقنياً، ولكنه ليس **كبار بما يكفي**" — بدون تفاصيل محددة
be: Вы атрымліваеце водгук накшталт "мацнейшы ў тэхнічным плане, але недастаткова **старэйшы**" — без ніякіх канкрэтных звестак
da: Du får feedback som “stærk teknisk, men ikke **senior nok**” — uden specifikationer
de: Sie erhalten Feedback wie „technisch stark, aber nicht **erfahren genug**“ – ohne weitere Einzelheiten
es: Recibes comentarios como “técnicamente fuerte, pero no **lo suficientemente senior**” — sin especificaciones
fr: Vous recevez des retours tels que "fort techniquement, mais pas **suffisamment senior**" — sans précisions
id: Anda mendapatkan umpan balik seperti "kuat secara teknis, tetapi tidak **cukup senior**" — tanpa rincian
it: Ricevi un feedback come "forte tecnicamente, ma non **abbastanza senior**" — senza dettagli specifici
ja: 「技術的には強いが、**シニアレベルには達していない**」といったフィードバックを受けることがありますが、具体的な内容はありません。
no: Du får tilbakemelding som "sterk teknisk, men ikke **erfaren nok**" — uten spesifikasjoner
pl: Otrzymujesz opinię typu „silny technicznie, ale nie **wystarczająco senior**” — bez szczegółów
pt: Você recebe feedback como "tecnicamente forte, mas não **suficientemente sênior**" — sem especificidades
ru: Ты получаешь отзывы типа «технически сильный, но недостаточно **высокого уровня**» — без каких-либо конкретных деталей
sv: Du får feedback som "stark tekniskt, men inte **tillräckligt senior**" — utan några specifika detaljer
th: คุณได้รับข้อเสนอแนะที่ว่า "เก่งทางเทคนิค แต่ยังไม่ **อาวุโสพอ**" — โดยไม่มีรายละเอียดเฉพาะเจาะจง
tr: Geri bildirim alıyorsunuz: "teknik açıdan güçlü, ancak **yeterince kıdemli değil**" — ayrıntı yok
uk: Вам надають відгуки на кшталт: «технічно сильний, але **не достатньо сеньйор**» — без конкретики
vi: Bạn nhận được phản hồi như “có kỹ năng kỹ thuật tốt, nhưng chưa **đủ kinh nghiệm**” — mà không có chi tiết cụ thể

source: You get scenarios on retries, circuit breakers, timeouts, fallbacks, logging, tracing, and metrics to keep services reliable.
ar: تحصل على سيناريوهات لإعادة المحاولة، قواطع الدوائر، انتهاء الوقت، البدائل، التسجيل، التتبع، والقياسات للحفاظ على موثوقية الخدمات.
be: Вы атрымліваеце сцэнары на перазапускі, перамыкачы ланцугаў, таймауты, рэзервы, лагіраванне, сачэнне і метрыкі для падтрымання надзейнасці паслуг.
da: Du får scenarier om gentagelsesforsøg, strømafbrydere, timeouts, tilbageslag, logning, sporing og metrics for at holde tjenester pålidelige.
de: Sie erhalten Szenarien zu Wiederholungen, Sicherungen, Timeouts, Fallbacks, Protokollierung, Nachverfolgung und Metriken, um Dienste zuverlässig zu halten.
es: Obtienes escenarios sobre reintentos, interruptores automáticos, tiempos de espera, reservas, registros, trazabilidad y métricas para mantener los servicios fiables.
fr: Vous obtenez des scénarios sur les nouvelles tentatives, les disjoncteurs, les délais d'attente, les solutions de repli, la journalisation, le traçage et les métriques pour maintenir les services fiables.
id: Anda mendapatkan skenario pada pengulangan, pemutus sirkuit, batas waktu, fallback, pencatatan, penelusuran, dan metrik untuk menjaga keandalan layanan.
it: Ottieni scenari su ritentativi, circuit breaker, timeout, fallback, logging, tracing e metriche per mantenere i servizi affidabili.
ja: リトライ、サーキットブレーカー、タイムアウト、フォールバック、ロギング、トレーシング、メトリクスについてのシナリオを取得し、サービスを信頼性の高いものとして維持します。
ms: Anda mendapat senario tentang pemulangan semula, pencegah litar, tamat masa, penggantian, pencatatan log, pelacakan, dan metrik untuk memastikan perkhidmatan boleh dipercayai.
no: Du får scenarier på gjentatte forsøk, kretsbrytere, tidsavbrudd, reservefunksjoner, logging, sporing, og metrikker for å holde tjenestene pålitelige.
pl: Otrzymujesz scenariusze na ponowne próby, wyłączniki obwodów, limity czasu, zapasowe rozwiązania, logowanie, śledzenie i metryki, aby utrzymać niezawodność usług.
pt: Você obtém cenários de tentativas, circuit breakers, timeouts, fallbacks, registro de logs, rastreamento e métricas para manter os serviços confiáveis.
ru: Вы получите сценарии для повторных попыток, автоматических выключателей, тайм-аутов, резервных механизмов, ведения журналов, трассировки и метрик для обеспечения надежности сервисов.
sv: Du får scenarier om omförsök, strömbrytare, timeout, reservsystem, loggning, spårning och mätvärden för att hålla tjänster tillförlitliga.
th: คุณจะได้รับสถานการณ์เกี่ยวกับการลองใหม่, circuit breakers, timeouts, fallbacks, การบันทึก, การติดตาม, และตัวชี้วัดเพื่อคงความน่าเชื่อถือของบริการ
tr: Hizmetleri güvenilir tutmak için yeniden denemeler, devre kesiciler, zaman aşım süreleri, geri dönüşler, günlük kaydı, izleme ve metrikler hakkında senaryolar elde edersiniz.
uk: Ви отримуєте сценарії для повторних спроб, вимикачів, таймаутів, резервних варіантів, ведення журналу, трасування та показників, щоб підтримувати надійність сервісів.
vi: Bạn sẽ có các kịch bản về thử lại, cầu dao, thời gian chờ, biện pháp dự phòng, ghi nhật ký, theo dấu, và chỉ số để giữ cho dịch vụ đáng tin cậy.

source: You have
ar: لديك
be: Вы маеце
da: Du har
de: Sie haben
es: Usted tiene
fr: Vous avez
id: Anda memiliki
it: Hai
ja: あなたは
ms: Anda mempunyai
no: Du har
pl: Masz
pt: Você tem
ru: У вас есть
sv: Du har
th: คุณมี
tr: Sahipsin
uk: У вас є
vi: Bạn đã

source: You have answered all the questions. Submitting your answers now... Don't close this window.
ar: لقد أجبت على جميع الأسئلة. جارٍ تقديم إجاباتك الآن... لا تقم بإغلاق هذه النافذة.
be: Вы адказалі на ўсе пытанні. Адпраўка вашых адказаў зараз... Не зачыняйце гэта акно.
da: Du har besvaret alle spørgsmålene. Indsender dine svar nu... Luk ikke dette vindue.
de: Sie haben alle Fragen beantwortet. Ihre Antworten werden jetzt übermittelt... Schließen Sie dieses Fenster nicht.
es: Has respondido a todas las preguntas. Enviando tus respuestas ahora... No cierres esta ventana.
fr: Vous avez répondu à toutes les questions. Soumission de vos réponses en cours... Ne fermez pas cette fenêtre.
id: Anda telah menjawab semua pertanyaan. Mengirimkan jawaban Anda sekarang... Jangan tutup jendela ini.
it: Hai risposto a tutte le domande. Invio delle tue risposte in corso... Non chiudere questa finestra.
ja: すべての質問に回答しました。今、あなたの回答を送信しています... このウィンドウを閉じないでください。
no: Du har besvart alle spørsmålene. Sender inn svarene dine nå... Ikke lukk dette vinduet.
pl: Odpowiedziałeś na wszystkie pytania. Przesyłam teraz Twoje odpowiedzi... Nie zamykaj tego okna.
pt: Você respondeu a todas as perguntas. Enviando suas respostas agora... Não feche esta janela.
ru: Вы ответили на все вопросы. Отправка ваших ответов... Не закрывайте это окно.
sv: Du har besvarat alla frågor. Skickar in dina svar nu... Stäng inte detta fönster.
th: คุณได้ตอบคำถามทั้งหมดแล้ว กำลังส่งคำตอบของคุณ... อย่าปิดหน้าต่างนี้
tr: Tüm soruları cevapladınız. Cevaplarınızı şimdi gönderiyoruz... Bu pencereyi kapatmayın.
uk: Ви відповіли на всі запитання. Надсилаємо ваші відповіді... Не закривайте це вікно.
vi: Bạn đã trả lời tất cả các câu hỏi. Đang gửi câu trả lời của bạn... Đừng đóng cửa sổ này.

source: You have completed all the questions. Submit your answers now and wait for the results.
ar: لقد أكملت جميع الأسئلة. قم بإرسال إجاباتك الآن وانتظر النتائج.
be: Вы завяршылі ўсе пытанні. Адпраўце свае адказы цяпер і чакайце вынікаў.
da: Du har besvaret alle spørgsmålene. Indsend dine svar nu, og vent på resultaterne.
de: Sie haben alle Fragen beantwortet. Senden Sie jetzt Ihre Antworten ab und warten Sie auf die Ergebnisse.
es: Has completado todas las preguntas. Envía tus respuestas ahora y espera los resultados.
fr: Vous avez terminé toutes les questions. Soumettez vos réponses maintenant et attendez les résultats.
id: Anda telah menyelesaikan semua pertanyaan. Kirimkan jawaban Anda sekarang dan tunggu hasilnya.
it: Hai completato tutte le domande. Invii ora le tue risposte e attendi i risultati.
ja: すべての質問に回答しました。今すぐ回答を提出し、結果をお待ちください。
no: Du har fullført alle spørsmålene. Send inn svarene dine nå og vent på resultatene.
pl: Ukończyłeś wszystkie pytania. Prześlij teraz swoje odpowiedzi i poczekaj na wyniki.
pt: Você concluiu todas as perguntas. Envie suas respostas agora e aguarde os resultados.
ru: Вы завершили все вопросы. Отправьте свои ответы сейчас и ждите результатов.
sv: Du har besvarat alla frågor. Skicka in dina svar nu och vänta på resultaten.
th: คุณได้ทำคำถามทั้งหมดเสร็จสิ้นแล้ว ส่งคำตอบของคุณตอนนี้และรอผลลัพธ์
tr: Tüm soruları tamamladınız. Cevaplarınızı şimdi gönderin ve sonuçları bekleyin.
uk: Ви відповіли на всі запитання. Надішліть свої відповіді зараз і чекайте на результати.
vi: Bạn đã hoàn thành tất cả các câu hỏi. Gửi câu trả lời của bạn ngay bây giờ và chờ đợi kết quả.

source: You have no chats yet.
de: Du hast noch keine Chats.
es: Todavía no tienes chats.
id: Anda belum memiliki obrolan.
it: Non hai ancora chat.
ja: チャットはまだありません。
no: Du har ingen samtaler ennå.
pl: Nie masz jeszcze żadnych rozmów.
pt: Você ainda não tem conversas.
ru: У вас еще нет чатов.
sv: Du har inga chattar ännu.
th: คุณยังไม่มีการแชท
tr: Henüz bir sohbetiniz yok.
uk: У вас ще немає чатів.
vi: Bạn chưa có cuộc trò chuyện nào.

source: You have submitted your answers. Waiting for others...
ar: لقد قمت بتقديم إجاباتك. في انتظار الآخرين...
be: Вы адправілі свае адказы. Чаканне іншых...
da: Du har indsendt dine svar. Venter på andre...
de: Sie haben Ihre Antworten eingereicht. Warten auf andere...
es: Has enviado tus respuestas. Esperando a los demás...
fr: Vous avez soumis vos réponses. En attente des autres...
id: Anda telah mengirimkan jawaban Anda. Menunggu yang lain...
it: Hai inviato le tue risposte. In attesa degli altri...
ja: 回答を提出しました。他の人を待っています...
no: Du har sendt inn svarene dine. Venter på andre...
pl: Przesłałeś swoje odpowiedzi. Czekanie na innych...
pt: Você enviou suas respostas. Aguardando os outros...
ru: Вы отправили свои ответы. Ожидание других...
sv: Du har skickat in dina svar. Väntar på andra...
th: คุณได้ส่งคำตอบเรียบร้อยแล้ว กำลังรอผู้อื่น...
tr: Cevaplarınızı gönderdiniz. Diğerlerini bekliyoruz...
uk: Ви подали свої відповіді. Очікуємо на інших...
vi: Bạn đã gửi câu trả lời của mình. Đang đợi người khác...

source: You know the tech, but **struggle to explain decisions clearly under pressure**
ar: أنت تعرف التكنولوجيا، ولكن **تجد صعوبة في شرح القرارات بوضوح تحت الضغط**
be: Вы ведаеце тэхналогіі, але **з цяжкасцю тлумачыце рашэнні ясна пад ціскам**
da: Du kender teknologien, men **har svært ved at forklare beslutninger klart under pres**
de: Du kennst die Technik, aber **hast Schwierigkeiten, Entscheidungen unter Druck klar zu erklären**
es: Sabes de tecnología, pero **tienes dificultades para explicar decisiones claramente bajo presión**
fr: Vous connaissez la technologie, mais **avez du mal à expliquer clairement les décisions sous pression**
id: Anda mengetahui teknologi tersebut, tetapi **kesulitan menjelaskan keputusan dengan jelas di bawah tekanan**
it: Conosci la tecnologia, ma **hai difficoltà a spiegare chiaramente le decisioni sotto pressione**
ja: あなたは技術を理解していますが、**プレッシャーの中で決定を明確に説明するのに苦労しています**
no: Du kjenner teknologien, men **sliter med å forklare beslutninger tydelig under press**
pl: Znasz technologię, ale **masz trudności z jasnym wyjaśnieniem decyzji pod presją**
pt: Você conhece a tecnologia, mas **tem dificuldade para explicar decisões claramente sob pressão**
ru: Вы разбираетесь в технологиях, но **затрудняетесь четко объяснить решения под давлением**
sv: Du känner till tekniken, men **har svårt att förklara beslut tydligt under press**
th: คุณรู้จักกับเทคโนโลยีนี้ แต่**พบว่าลำบากในการอธิบายการตัดสินใจอย่างชัดเจนเมื่อต้องอยู่ภายใต้ความกดดัน**
tr: Teknolojiyi biliyorsunuz, ancak **baskı altında kararları açıkça açıklamakta zorlanıyorsunuz**
uk: Ви знаєте технології, але **вам важко чітко пояснити рішення під тиском**
vi: Bạn biết về công nghệ, nhưng **gặp khó khăn trong việc giải thích quyết định một cách rõ ràng dưới áp lực**

source: You need between {min} and {max} players.
id: Anda membutuhkan antara {min} dan {max} pemain.
it: Hai bisogno di un numero di giocatori compreso tra {min} e {max}.
ja: {min}人から{max}人までのプレイヤーが必要です。
no: Du trenger mellom {min} og {max} spillere.
ru: Вам необходимо от {min} до {max} игроков.
uk: plaintext Вам потрібно від {min} до {max} гравців.
