Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Visualize your daily progress with intuitive tracking. Stay motivated by clearly seeing your improvements.
ar: ت visualize تقدمك اليومي من خلال تتبع سهل الاستخدام. ابقَ متحفزًا من خلال رؤية تحسيناتك بوضوح.
be: Візуалізуйце свой шкодны прагрэс з дапамогай інтуітыўнага сачэння. Заставайцеся маціваваным, ясна бачачы свае паляпшэнні.
da: Visualiser din daglige fremgang med intuitiv sporing. Forbliv motiveret ved klart at se dine forbedringer.
de: Visualisieren Sie Ihren täglichen Fortschritt mit intuitiver Verfolgung. Bleiben Sie motiviert, indem Sie Ihre Verbesserungen klar sehen.
es: Visualiza tu progreso diario con un seguimiento intuitivo. Mantente motivado al ver claramente tus mejoras.
fr: Visualisez vos progrès quotidiens avec un suivi intuitif. Restez motivé en voyant clairement vos améliorations.
id: Visualisasikan kemajuan harian Anda dengan pelacakan yang intuitif. Tetap termotivasi dengan melihat perbaikan Anda secara jelas.
it: Visualizza i tuoi progressi quotidiani con un tracciamento intuitivo. Rimani motivato vedendo chiaramente i tuoi miglioramenti.
ja: あなたの毎日の進捗を直感的なトラッキングで可視化します。自分の改善を明確に見ることで、モチベーションを維持しましょう。
ms: Visualisasikan kemajuan harian anda dengan pemantauan yang intuitif. Kekalkan motivasi anda dengan melihat peningkatan anda dengan jelas.
no: Visualiser din daglige fremgang med intuitiv sporing. Hold deg motivert ved å tydelig se forbedringene dine.
pl: Wizualizuj swoje codzienne postępy z intuicyjnym śledzeniem. Pozostań zmotywowany, wyraźnie widząc swoje poprawy.
pt: Visualize seu progresso diário com um acompanhamento intuitivo. Mantenha-se motivado ao ver claramente suas melhorias.
ru: Визуализируйте свой ежедневный прогресс с помощью интуитивного отслеживания. Оставайтесь мотивированными, четко видя свои улучшения.
sv: Visualisera din dagliga framsteg med intuitiv spårning. Håll motivationen uppe genom att tydligt se dina förbättringar.
th: มองเห็นความก้าวหน้าของคุณในแต่ละวันด้วยการติดตามที่เข้าใจง่าย รักษาแรงบันดาลใจโดยการมองเห็นการพัฒนาของคุณอย่างชัดเจน
tr: Günlük ilerlemenizi sezgisel izleme ile görselleştirin. İyileşmelerinizi net bir şekilde görerek motive olun.
uk: Візуалізуйте свій щоденний прогрес з інтуїтивним відстеженням. Залишайтеся мотивованими, чітко бачачи свої покращення.
vi: Hãy hình dung sự tiến bộ hàng ngày của bạn với việc theo dõi trực quan. Giữ động lực bằng cách thấy rõ những cải thiện của bạn.

source: Vocabulary
ar: المفردات
be: Слоўнік
da: Ordforråd
de: Wortschatz
es: Vocabulario
fr: Vocabulaire
id: Kosa Kata
it: Vocabolario
ja: 語彙
ms: Kosa kata
no: Ordforråd
pl: Słownictwo
pt: Vocabulário
ru: Словарь
sv: Ordförråd
th: คำศัพท์
tr: Kelime Dağarcığı
uk: Словниковий запас
vi: Từ vựng

source: Vocabulary challenges
ar: تحديات المفردات
be: Выклікі слоўнікавага запасу
da: Ordforråd udfordringer
de: Wortschatz-Herausforderungen
es: Desafíos de vocabulario
fr: Défis de vocabulaire
id: Tantangan kosa kata
it: Sfide di vocabolario
ja: ボキャブラリーチャレンジ
no: Ordforrådsutfordringer
pl: Wyzwania słownikowe
pt: Desafios de vocabulário
ru: Словарные задачи
sv: Ordförrådsutmaningar
th: ท้าทายคำศัพท์
tr: Kelime dağarcığı zorlukları
uk: Виклики словникового запасу
vi: Thử thách từ vựng

source: Vocabulary Practice
id: Latihan Kosa Kata
it: Pratica del vocabolario
ja: ボキャブラリー練習
no: Ordforrådstrening
ru: Практика словарного запаса
uk: Практика словникового запасу

source: Voice conversations
id: Percakapan suara
it: Conversazioni vocali
ja: ボイス会話
no: Samtaler med stemme
pl: Rozmowy głosowe
ru: Голосовые разговоры
sv: Röstsamtal
uk: Розмови голосом

source: Voice records
id: Rekaman suara
it: Registrazioni vocali
ja: ボイスレコード
no: Stemmeanalyseringer
pl: Nagrania głosowe
ru: Голосовые записи
sv: Röstinspelningar
uk: Голосові записи

source: Voice speed
id: Kecepatan suara
it: Velocità della voce
ja: 音声速度
no: Talefart
ru: Скорость голоса
uk: Швидкість голосу

source: Waiting for other players to accept...
ar: انتظار قبول اللاعبين الآخرين...
be: Чаканне пацверджання ад іншых гульцоў...
da: Venter på at andre spillere accepterer...
de: Warten, bis andere Spieler akzeptieren...
es: Esperando que otros jugadores acepten...
fr: En attente que d'autres joueurs acceptent...
id: Menunggu pemain lain untuk menerima...
it: In attesa che gli altri giocatori accettino...
ja: 他のプレイヤーが承認するのを待っています...
no: Venter på at andre spillere skal akseptere...
pl: Czekanie na zaakceptowanie przez innych graczy...
pt: Aguardando outros jogadores aceitarem...
ru: Ожидание принятия другими игроками...
sv: Väntar på att andra spelare ska acceptera...
th: กำลังรอผู้เล่นคนอื่นยอมรับ...
tr: Diğer oyuncuların kabul etmesi bekleniyor...
uk: Очікування підтвердження від інших гравців...
vi: Chờ người chơi khác chấp nhận...

source: Waiting for payment...
ar: في انتظار الدفع...
be: Чаканне аплаты...
da: Venter på betaling...
de: Warten auf Zahlung...
es: Esperando el pago...
fr: En attente de paiement...
id: Menunggu pembayaran...
it: In attesa del pagamento...
ja: 支払いを待っています...
ms: Menunggu pembayaran...
no: Venter på betaling...
pl: Oczekiwanie na płatność...
pt: Aguardando pagamento...
ru: Ожидание оплаты...
sv: Väntar på betalning...
th: รอการชำระเงิน...
tr: Ödeme bekleniyor...
uk: Очікування платежу...
vi: Đang chờ thanh toán...

source: Waiting for {userName} to respond.
ar: في انتظار رد {userName}.
be: Чаканне адказу ад {userName}.
da: Venter på, at {userName} svarer.
de: Warte auf die Antwort von {userName}.
es: Esperando a que {userName} responda.
fr: En attente de la réponse de {userName}.
id: Menunggu tanggapan dari {userName}.
it: Attesa di una risposta da parte di {userName}.
ja: {userName} が応答するのを待っています。
no: Venter på at {userName} skal svare.
pl: Oczekiwanie na odpowiedź użytkownika {userName}.
pt: Aguardando {userName} responder.
ru: Ожидание ответа от {userName}.
sv: Väntar på att {userName} ska svara.
th: กำลังรอการตอบกลับจาก {userName}
tr: {userName}'nin yanıtını bekliyor.
uk: Очікування відповіді від {userName}.
vi: Đang chờ {userName} trả lời.

source: Walk me through how you would improve Core Web Vitals for a slow single-page application.
ar: ارشدني في كيفية تحسين المقاييس الأساسية للويب لتطبيق صفحة واحدة بطيء.
be: Раскажыце, як вы палепшыце асноўныя вэб-віктарына для павольнага аднастаронкавага прыкладання.
da: Gennemgå med mig, hvordan du ville forbedre Core Web Vitals for en langsom single-page applikation.
de: Erklären Sie mir, wie Sie die Core Web Vitals für eine langsame Single-Page-Anwendung verbessern würden.
es: Guíame sobre cómo mejorarías los Core Web Vitals para una aplicación de una sola página que es lenta.
fr: Guidez-moi sur la manière dont vous amélioreriez les Core Web Vitals pour une application monopage lente.
id: Bantu saya memahami bagaimana Anda akan meningkatkan Core Web Vitals untuk aplikasi halaman tunggal yang lambat.
it: Guidami su come miglioreresti i Core Web Vitals per un'applicazione a pagina singola lenta.
ja: 遅いシングルページアプリケーションのコアウェブバイタルを改善する方法を教えてください。
ms: Bimbing saya melalui bagaimana anda akan meningkatkan Core Web Vitals untuk aplikasi halaman tunggal yang perlahan.
no: Gå meg gjennom hvordan du ville forbedret Core Web Vitals for en treg enkeltsideapplikasjon.
pl: Przeprowadź mnie krok po kroku, jak poprawiłbyś Kluczowe Wskaźniki Internetowe (Core Web Vitals) dla wolno działającej aplikacji jednostronicowej.
pt: Guie-me através de como você melhoraria os Core Web Vitals para uma aplicação de página única lenta.
ru: Проведите меня через улучшение Core Web Vitals для медленного одностраничного приложения.
sv: Visa mig steg för steg hur du skulle förbättra Core Web Vitals för en långsam enkelsidesapplikation.
th: ช่วยอธิบายขั้นตอนที่คุณจะใช้ปรับปรุง Core Web Vitals สำหรับแอปพลิเคชันหน้าเดียวที่ทำงานช้าให้หน่อยครับ
tr: Beni yavaş bir tek sayfa uygulaması için Core Web Vitals'i nasıl geliştireceğiniz konusunda bilgilendirin.
uk: Розкажіть, як ви покращите показники Core Web Vitals для повільного односторінкового додатка.
vi: Hướng dẫn tôi cách bạn cải thiện Core Web Vitals cho một ứng dụng một trang chậm.

source: Walk through middleware ordering (Authentication → Authorization → Routing → Endpoint) and why it matters.
ar: التسلسل الصحيح لتدفق الوسيطات (التوثيق → التفويض → التوجيه → نقطة النهاية) ولماذا هو مهم.
be: Прагулка па парадку middleware (Аўтэнтыфікацыя → Аўтарызацыя → Маршрутызацыя → Канчатковая кропка) і чаму гэта важна.
da: Gennemgå middleware-ordning (Autentifikation → Autorisation → Routing → Endpoint) og hvorfor det er vigtigt.
de: Führen Sie die Reihenfolge der Middleware (Authentifizierung → Autorisierung → Routing → Endpunkt) durch und warum sie wichtig ist.
es: Recorrido por el orden de los middleware (Autenticación → Autorización → Enrutamiento → Punto final) y por qué es importante.
fr: Parcours de l'ordre du middleware (Authentification → Autorisation → Routage → Point de terminaison) et pourquoi cela est important.
id: Jelaskan urutan middleware (Otentikasi → Otorisasi → Pengarahan → Endpoint) dan mengapa itu penting.
it: Esamina l'ordinamento del middleware (Autenticazione → Autorizzazione → Instradamento → Endpoint) e perché è importante.
ja: ミドルウェアの順序とその重要性を解説します（認証 → 認可 → ルーティング → エンドポイント）。
ms: Jelaskan susunan perantaraan (Authentication → Authorization → Routing → Endpoint) dan mengapa ia penting.
no: Gå gjennom rekkefølgen for mellomvare (Autentisering → Autorisasjon → Ruting → Endepunkt) og hvorfor det er viktig.
pl: Przejdź przez kolejność pośredników (Uwierzytelnianie → Autoryzacja → Routing → Punkt końcowy) i dlaczego to ma znaczenie.
pt: Passe pelo pedido de middleware (Autenticação → Autorização → Roteamento → Endpoint) e por que isso importa.
ru: Пошаговое объяснение порядка промежуточного программного обеспечения (Аутентификация → Авторизация → Маршрутизация → Конечная точка) и почему это важно.
sv: Gå igenom middleware-ordning (Autentisering → Auktorisering → Routing → Slutpunkt) och varför det är viktigt.
th: เดินผ่านลำดับการทำงานของมิดเดิลแวร์ (การยืนยันตัวตน → การอนุญาต → การกำหนดเส้นทาง → จุดสิ้นสุด) และเหตุผลที่สำคัญ
tr: Kimlik Doğrulama → Yetkilendirme → Yönlendirme → Uç Nokta sıralamasında ara yazılım işlemine göz atın ve bunun neden önemli olduğunu öğrenin.
uk: Розгляньте порядок проміжного програмного забезпечення (Аутентифікація → Авторизація → Маршрутизація → Кінцева точка) і чому це важливо.
vi: Đi qua thứ tự của middleware (Xác thực → Ủy quyền → Định tuyến → Điểm kết) và tại sao nó quan trọng.
