Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Re-record if needed
ms: Rakam semula jika perlu

source: Real senior interview simulations
ms: Simulasi temu duga senior yang sebenar

source: Real senior-level interview questions
ms: Soalan temuduga tahap senior sebenar

source: Real-time AI speaking practice, scenario role-plays, listening drills, grammar and vocabulary exercises, personalized feedback, and progress analytics.
ms: Amalan bercakap AI secara real-time, permainan peranan senario, latihan mendengar, latihan tatabahasa dan perkataan, maklum balas yang disesuaikan, dan analisis kemajuan.

source: Receive detailed feedback on grammar and pronunciation instantly.
ms: Dapatkan maklum balas terperinci tentang tatabahasa dan sebutan dengan serta-merta.

source: Record an answer
ms: Rakam jawapan

source: Reflect before answering
ms: Fikir sebelum menjawab

source: Return to Dashboard
ms: Kembali ke Papan Pemuka

source: Role-specific answer templates
ms: Templat jawapan khusus peranan

source: Role-specific scripts for .NET roles
ms: Skrip khusus peranan untuk peranan .NET

source: Role-specific templates for .NET
ms: Templat tertentu untuk peranan .NET

source: Rules
ms: Peraturan

source: Rules:
ms: Peraturan:

source: Russian
ms: Rusia

source: Salary & senior-level negotiations
ms: Gaji & rundingan peringkat kanan

source: Score tracking and improvement plan
ms: Penjejakan skor dan pelan penambahbaikan

source: Scripts for behavioral and architecture questions
ms: Skrip untuk soalan tingkah laku dan seni bina

source: See Results
ms: Lihat Keputusan

source: Senior Frontend Developer interview prep that gets you more offers
ms: Persediaan temuduga Pembangun Frontend Senior yang membawa anda lebih banyak tawaran

source: Serious
ms: Serius

source: Set the goal to start
ms: Tetapkan matlamat untuk memulakan

source: Show all
ms: Tunjukkan semua

source: Slower conversations with guided support.
ms: Perbualan yang lebih perlahan dengan sokongan panduan.

source: So, in the first week you will learn:
ms: Jadi, dalam minggu pertama anda akan belajar:

source: Something went wrong. Please try again
ms: Sesuatu yang tidak kena. Sila cuba lagi

source: Spanish
ms: Sepanyol

source: Start 1-Week Sprint — $30
ms: Mula 1-Minggu Pecut — $30

source: Start 4-Month Plan — $90
ms: Mulakan Pelan 4-Bulan — $90

source: Start a conversation to get one.
ms: Mulakan perbualan untuk mendapatkannya.

source: Start Free Trial
ms: Mulakan Percubaan Percuma

source: Start lesson
ms: Mula pelajaran

source: Start Monthly Plan — $60
ms: Mula Pelan Bulanan — $60

source: Start Talking
ms: Mula Berbicara

source: Start Trial
ms: Mulakan Percubaan

source: Stop recording
ms: Hentikan rakaman

source: Submitted
ms: Dihantar

source: Subscribe
ms: Langgan

source: Swedish
ms: Swedia

source: System design questions
ms: Soalan reka bentuk sistem

source: Talk & Correct:
ms: Bercakap & Betulkan:

source: Talk to the AI and it will respond to you
ms: Bercakap dengan AI dan ia akan memberi maklum balas kepada anda

source: Thank you for completing the C# Backend interview prep. We will review your answers and get back to you with full access to the platform. You will be notified via email once your trial is activated. For now, you can return to the first step and practice again. It's free forever!
ms: Terima kasih kerana melengkapkan persediaan temu duga C# Backend. Kami akan menyemak jawapan anda dan menghubungi anda semula dengan akses penuh ke platform. Anda akan diberitahu melalui email sebaik sahaja percubaan anda diaktifkan. Buat masa ini, anda boleh kembali ke langkah pertama dan berlatih semula. Ia percuma selama-lamanya!

source: Thank you for completing the Senior Frontend Developer interview prep. You will be notified via email once your trial is activated. It may take some time.
ms: Terima kasih kerana melengkapkan persiapan temu duga Pembangun Antara Muka Pengguna Senior. Anda akan diberitahu melalui emel sebaik sahaja percubaan anda diaktifkan. Ia mungkin mengambil sedikit masa.

source: This helps us calibrate interview expectations.
ms: Ini membantu kami untuk menyesuaikan jangkaan temu duga.

source: This is what you can achieve in 3 months!
ms: Inilah yang boleh anda capai dalam 3 bulan!

source: Tighten core backend answers fast: API design, EF Core, concurrency, and resiliency basics.
ms: Perketat jawapan backend teras dengan cepat: Reka bentuk API, EF Core, persamaan serentak, dan asas ketahanan.

source: Turkish
ms: Turki

source: Turn Volume Off
ms: Matikan Bunyi

source: Turn Volume On
ms: Hidupkan Volume

source: Ukrainian
ms: Ukraine

source: Unlock full analysis and tailored preparation
ms: Buka analisis penuh dan persediaan yang disesuaikan

source: Unlock Your Trial and Get Full Feedback
ms: Buka Percubaan Anda dan Dapatkan Maklum Balas Penuh

source: Vietnamese
ms: Vietnam

source: We don’t issue partial refunds for unused time. After canceling, your subscription remains active until the period ends.
ms: Kami tidak mengeluarkan bayaran balik sebahagian untuk masa yang tidak digunakan. Selepas membatalkan, langganan anda tetap aktif sehingga tempoh berakhir.

source: We’ll adjust preparation intensity.
ms: Kami akan menyesuaikan intensiti persiapan.

source: What best describes your current level?
ms: Apakah yang paling sesuai menggambarkan tahap semasa anda?

source: What is our daily goal?
ms: Apakah matlamat harian kita?

source: What usually hurts you most in interviews?
ms: Apa yang biasanya paling menyakitkan anda dalam temu duga?

source: What we need from you?
ms: Apa yang kami perlukan daripada anda?

source: What's Next?
ms: Apa Seterusnya?

source: What’s included in my subscription?
ms: Apa yang termasuk dalam langganan saya?

source: When asked an open-ended question, you usually…
ms: Apabila ditanya soalan terbuka, anda biasanya…

source: When is your next important interview?
ms: Bilakah wawancara penting anda seterusnya?

source: Which frontend stack do you mainly work with?
ms: Apakah tumpukan frontend yang anda kebanyakannya bekerja dengan?

source: Which payment plan is right for you?
ms: Pelan pembayaran mana yang sesuai untuk anda?

source: Which plan is right for you?
ms: Pelan mana yang sesuai untuk anda?

source: Will my learning progress be saved if I cancel?
ms: Adakah kemajuan pembelajaran saya akan disimpan jika saya batalkan?

source: Within 7 days
ms: Dalam masa 7 hari

source: Within a month
ms: Dalam sebulan

source: Write at least 100 characters for a sharper plan
ms: Tulis sekurang-kurangnya 100 aksara untuk rancangan yang lebih tajam

source: Yes! We offer discounts when purchasing larger credit packages. Just contact me before you buy and I'll give you a discount.
ms: Ya! Kami menawarkan diskaun apabila membeli pakej kredit yang lebih besar. Hubungi saya sebelum anda membeli dan saya akan memberikan anda diskaun.

source: Yes. You can cancel from your account settings at any time. You’ll keep access until the end of the current billing period.
ms: Ya. Anda boleh batalkan dari tetapan akaun anda pada bila-bila masa. Anda akan terus mendapat akses sehingga akhir tempoh bil semasa.

source: Yes. Your history, achievements, and personalized settings are tied to your account and remain available when you return.
ms: Ya. Sejarah, pencapaian, dan tetapan peribadi anda dikaitkan dengan akaun anda dan tetap tersedia bila anda kembali.

source: You are <0>the Leader</0> of {playersCount} players.
ms: Anda adalah <0>Pemimpin</0> bagi {playersCount} pemain.

source: You are on the right track!
ms: Anda berada di landasan yang betul!

source: You can pause and think
ms: Anda boleh berhenti seketika dan berfikir

source: You have a chance
ms: Anda mempunyai peluang

source: You will get 3 days of full access for free
ms: Anda akan mendapat akses penuh selama 3 hari secara percuma

source: You're set!
ms: Anda sudah bersedia!

source: Your answers will be evaluated against this stack.
ms: Jawapan anda akan dinilai mengikut susunan ini.

source: Your plan is being processed with AI
ms: Rancangan anda sedang diproses dengan AI

source: Your senior frontend interview profile
ms: Profil temu duga bahagian depan kanan anda

source: Your trial ended until
ms: Ujian anda berakhir sehingga

source: {hoursLeft}h left
ms: {hoursLeft}j lagi

source: {peopleAnswered} people answered already — see what they said & share yours
ms: {peopleAnswered} orang sudah menjawab — lihat apa yang mereka katakan & kongsi jawapan anda
