Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: +{increasePoints} points
ar: +{increasePoints} نقاط
be: +{increasePoints} балаў
da: +{increasePoints} point
de: +{increasePoints} Punkte
es: +{increasePoints} puntos
id: +{increasePoints} poin
it: +{increasePoints} punti
ja: +{increasePoints} ポイント
no: +{increasePoints} poeng
pl: +{increasePoints} punktów
pt: +{increasePoints} pontos
ru: +{increasePoints} очков
sv: +{increasePoints} poäng
th: +{increasePoints} คะแนน
tr: +{increasePoints} puanlar
uk: +{increasePoints} очок
vi: +{increasePoints} điểm

source: +{points} points
de: +{punkte} Punkte
es: +{puntos} puntos
id: +{poin} poin
it: +{punti} punti
ja: +{points} ポイント
no: +{poeng} poeng
pl: +{points} punktów
pt: +{pontos} pontos
ru: +{points} очков
sv: +{points} poäng
th: +{points} คะแนน
tr: +{points} puan
uk: +{points} балів
vi: +{points} điểm

source: .NET & Frameworks
ar: .NET & الأطر
be: .NET і фрэймворкі
es: .NET y Frameworks
fr: .NET & Cadres
it: .NET e Frameworks
ja: .NETおよびフレームワーク
ms: .NET & Rangka Kerja
no: .NET & Rammeverk
pl: .NET i Frameworki
ru: .NET и фреймворки
sv: .NET & Ramverk
th: .NET และเฟรมเวิร์ก
tr: .NET & Çerçeveler
uk: .NET і фреймворки
vi: .NET & Khung làm việc

source: .net interview questions
ar: أسئلة مقابلة .net
be: .пытанні для інтэрв'ю на .net
da: .net interview spørgsmål
de: .net-Interviewfragen
es: preguntas de entrevista de .net
fr: questions d'entretien .net
id: pertanyaan wawancara .net
it: .domande di colloquio .net
ja: .net インタビュー質問
ms: soalan temu duga .net
no: .net intervju spørsmål
pl: pytania na rozmowę kwalifikacyjną .net
pt: .perguntas de entrevista .net
ru: .нет вопросы для интервью
sv: .net intervju frågor
th: คำถามสัมภาษณ์ .net
tr: .net mülakat soruları
uk: запитання для співбесіди на .net
vi: câu hỏi phỏng vấn .net

source: .NET specialists facing API, data, and system design rounds
ar: متخصصو .NET يواجهون جولات تصميم API والبيانات والنظام
be: .NET спецыялісты, якія сутыкаюцца з раундамі па API, даных і праектаванні сістэм
da: .NET-specialister står over for API-, data- og systemdesign-runder
de: .NET-Spezialisten stehen vor Runden zu API, Daten und Systemdesign
es: Especialistas en .NET enfrentándose a rondas de diseño de API, datos, y sistemas
fr: Spécialistes .NET confrontés aux tours de conception d'API, de données et de systèmes
id: Spesialis .NET menghadapi putaran API, data, dan desain sistem
it: Specialisti .NET che affrontano turni di progettazione di API, dati e sistemi
ja: .NETの専門家がAPI、データ、システム設計のラウンドに直面
ms: Pakar .NET menghadapi pusingan API, data, dan reka bentuk sistem
no: .NET-spesialister som står overfor API-, data-, og systemdesignrunder
pl: .NET specjaliści mierzący się z rundami projektowania API, danych i systemów
pt: Especialistas em .NET enfrentando rodadas de design de API, dados e sistema
ru: .NET специалисты, сталкивающиеся с этапами проектирования API, данных и систем
sv: .NET-specialister som ställs inför API-, data- och systemdesignrundor
th: ผู้เชี่ยวชาญ .NET เผชิญกับรอบการออกแบบ API, ข้อมูล, และระบบ
tr: .NET Uzmanları API, veri ve sistem tasarımı aşamaları ile karşı karşıya
uk: .NET фахівці, які стикаються з раундами API, даних та проектування систем
vi: Các chuyên gia .NET đang đối mặt với các vòng thiết kế hệ thống, dữ liệu và API

source: / month
ar: / الشهر
be: / месяц
da: / måned
de: / Monat
es: / mes
fr: / mois
id: / bulan
it: / mese
ja: /月
no: / måned
pl: / miesiąc
pt: / mês
ru: / месяц
sv: / månad
th: / เดือน
tr: / ay
uk: / місяць
vi: / tháng

source: 1 hour
uk: 1 година

source: 1 round
id: 1 putaran
it: 1 turno
ja: 1回
no: 1 runde
uk: 1 раунд

source: 1. Confirm your credit card details
ar: 1. أكد تفاصيل بطاقة الائتمان الخاصة بك
be: 1. Пацвердзіце дэталі вашай крэдытнай карты
da: 1. Bekræft dine kreditkortoplysninger
de: 1. Bestätigen Sie Ihre Kreditkartendaten
es: 1. Confirma los detalles de tu tarjeta de crédito
fr: 1. Confirmez les détails de votre carte de crédit
id: 1. Konfirmasikan detail kartu kredit Anda
it: 1. Conferma i dettagli della tua carta di credito
ja: 1. クレジットカードの詳細を確認する
no: 1. Bekreft kredittkortdetaljene dine
pl: 1. Potwierdź swoje dane karty kredytowej
pt: 1. Confirme os detalhes do seu cartão de crédito
ru: 1. Подтвердите данные вашей кредитной карты
sv: 1. Bekräfta dina kreditkortsuppgifter
th: 1. ยืนยันรายละเอียดบัตรเครดิตของคุณ
tr: 1. Kredi kartı bilgilerinizi onaylayın
uk: 1. Підтвердьте дані вашої кредитної картки
vi: 1. Xác nhận thông tin thẻ tín dụng của bạn

source: 15 Must-Know Business English Phrases to Ace Your Next Job Interview
ar: 15 عبارة من الإنجليزية الأعمال يجب أن تعرفها لتتألق في مقابلة عملك التالية
be: 15 Абавязковых фразаў бізнес-англійскай, каб паспяхова пройсці наступнае працоўнае спатканне
da: 15 Must-Know Business English Phrases for at Klare Dit Næste Jobinterview
de: 15 unverzichtbare Business-Englisch Redewendungen, um Ihr nächstes Vorstellungsgespräch zu meistern
es: 15 Frases de Inglés de Negocios que Debes Conocer para Destacar en Tu Próxima Entrevista de Trabajo
fr: 15 expressions en anglais des affaires à connaître absolument pour réussir votre prochain entretien d'embauche
id: 15 Frasa Bisnis Bahasa Inggris yang Harus Diketahui untuk Menyelesaikan Wawancara Kerja Berikutnya dengan Baik
it: 15 Frasi di Business English da Conoscere per Eccellere nel Tuo Prossimo Colloquio di Lavoro
ja: 次の就職面接で活躍するための15の必須ビジネス英語フレーズ
ms: 15 Frasa Bahasa Inggeris Perniagaan yang Mesti Anda Tahu untuk Berjaya dalam Temuduga Kerja Anda Seterusnya
no: 15 Må-Vite Forretningsengelske Uttrykk for å Mestre Ditt Neste Jobbintervju
pl: 15 niezbędnych zwrotów z języka angielskiego biznesowego, które pozwolą Ci zaliczyć następne rozmowy kwalifikacyjne na piątkę
pt: 15 Frases de Inglês Comercial que Você Precisa Saber para Mandar Bem na Sua Próxima Entrevista de Emprego
ru: 15 обязательных фраз на деловом английском, чтобы успешно пройти ваше следующее собеседование на работу
sv: 15 Måste-Känna Till Affärsengelska Fraser för att Klarar Din Nästa Jobbintervju
th: 15 วลีภาษาอังกฤษทางธุรกิจที่ควรรู้เพื่อประสบความสำเร็จในการสัมภาษณ์งานครั้งถัดไป
tr: Bir Sonraki İş Görüşmenizde Sizi Öne Çıkaracak 15 Zorunlu Bilinmesi Gereken İş İngilizcesi İfadesi
uk: 15 обов'язкових фраз англійської мови для бізнесу, щоб впоратись з наступним співбесідою на роботу
vi: 15 Cụm từ tiếng Anh thương mại bạn phải biết để thành công trong cuộc phỏng vấn công việc tiếp theo

source: 16 languages to practice
ar: 16 لغات للتدرب عليها
be: 16 моў для практыкі
da: 16 sprog at øve sig på
de: 16 Sprachen zum Üben
es: 16 idiomas para practicar
fr: 16 langues à pratiquer
id: 16 bahasa untuk dipraktikkan
it: 16 lingue da praticare
ja: 練習するための16の言語
ms: 16 bahasa untuk berlatih
no: 16 språk å øve på
pl: 16 języków do ćwiczenia
pt: 16 idiomas para praticar
ru: 16 языков для практики
sv: 16 språk att öva på
th: 16 ภาษาให้ฝึกฝน
tr: 16 dili pratik yapabileceğiniz
uk: 16 мов для практики
vi: 16 ngôn ngữ để luyện tập

source: 2. Complete the trial period
ar: 2. أكمل فترة التجربة
be: 2. Завяршыць пробны перыяд
da: 2. Fuldfør prøveperioden
de: 2. Beende die Testphase
es: 2. Completa el período de prueba
fr: 2. Terminez la période d'essai
id: 2. Selesaikan masa percobaan
it: 2. Completa il periodo di prova
ja: 2. 試用期間を完了する
no: 2. Fullfør prøveperioden
pl: 2. Zakończ okres próbny
pt: 2. Complete o período de teste
ru: 2. Завершите пробный период
sv: 2. Slutför provperioden
th: 2. เสร็จสิ้นช่วงทดลองใช้
tr: 2. Deneme süresini tamamlayın
uk: 2. Завершити пробний період
vi: 2. Hoàn thành thời gian dùng thử

source: 3 hours
uk: 3 години

source: 3. Don't pay anything
ar: 3. لا تدفع أي شيء
be: 3. Нічога не плаціце
da: 3. Betal ikke noget
de: 3. Bezahle nichts
es: 3. No pagues nada
fr: 3. Ne payez rien
id: 3. Jangan bayar apa pun
it: 3. Non pagare niente
ja: 3. 支払い不要
no: 3. Ikke betal noe
pl: 3. Nie płac niczego
pt: 3. Não pague nada
ru: 3. Ничего не платите
sv: 3. Betala inget
th: 3. ไม่ต้องจ่ายอะไรทั้งสิ้น
tr: 3. Hiçbir şey ödemeyin
uk: 3. Не платіть нічого
vi: 3. Đừng trả bất cứ khoản nào

source: 4 participants
ar: 4 مشاركين
be: 4 удзельнікі
da: 4 deltagere
de: 4 Teilnehmer
es: 4 participantes
id: 4 peserta
it: 4 partecipanti
ja: 4人の参加者
no: 4 deltakere
pl: 4 uczestników
pt: 4 participantes
ru: 4 участника
sv: 4 deltagare
th: 4 ผู้เข้าร่วม
tr: 4 katılımcı
uk: 4 учасники
vi: 4 người tham gia

source: 4. Play the game and become one of the top 5 players
ar: ٤. العب اللعبة وأصبح أحد أفضل ٥ لاعبين
be: 4. Гуляйце ў гульню і станьце адным з топ-5 гульцоў
da: 4. Spil spillet og bliv en af de top 5 spillere
de: 4. Spiele das Spiel und werde einer der Top 5 Spieler
es: 4. Juega el juego y conviértete en uno de los 5 mejores jugadores
fr: 4. Joue au jeu et deviens l'un des 5 meilleurs joueurs
id: 4. Mainkan permainan dan jadilah salah satu dari 5 pemain teratas
it: 4. Gioca al gioco e diventa uno dei primi 5 giocatori
ja: 4. ゲームをプレイし、トップ5のプレイヤーの一人になりましょう
no: 4. Spill spillet og bli en av de 5 beste spillerne
pl: 4. Zagraj w grę i zostań jednym z 5 najlepszych graczy
pt: 4. Jogue o jogo e torne-se um dos 5 melhores jogadores
ru: 4. Играй в игру и стань одним из лучших 5 игроков
sv: 4. Spela spelet och bli en av de 5 bästa spelarna
th: 4. เล่นเกมและกลายเป็นหนึ่งใน 5 ผู้เล่นอันดับสูงสุด
tr: 4. Oyunu oynayın ve ilk 5 oyuncudan biri olun
uk: 4. Грайте у гру та станьте одним із топ-5 гравців
vi: 4. Chơi trò chơi và trở thành một trong 5 người chơi hàng đầu

source: 5 Common English Job Interview Mistakes (and How to Fix Them)
ar: 5 أخطاء شائعة في مقابلات العمل باللغة الإنجليزية (وكيفية إصلاحها)
be: 5 Звычайных памылак на англійскай працоўным інтэрв'ю (і як іх выпраўленне)
da: 5 Almindelige Fejl i Engelske Jobsamtaler (og Hvordan man Retter Dem)
de: 5 häufige Fehler bei englischen Vorstellungsgesprächen (und wie man sie behebt)
es: 5 Errores Comunes en Entrevistas de Trabajo en Inglés (y Cómo Corregirlos)
fr: 5 erreurs courantes en anglais lors d'un entretien d'embauche (et comment les corriger)
id: 5 Kesalahan Umum dalam Wawancara Kerja Bahasa Inggris (dan Cara Memperbaikinya)
it: 5 Errori Comuni negli Colloqui di Lavoro in Inglese (e Come Correggerli)
ja: 5つの一般的な英語面接の失敗（そしてそれらをどのように修正するか）
ms: 5 Kesilapan Temuduga Kerja Bahasa Inggeris Yang Biasa (dan Cara Memperbaikinya)
no: 5 Vanlige Feil ved Engelske Jobbintervjuer (og Hvordan Rette dem)
pl: 5 Powszechne Błędy na Angielskich Różmowach Kwalifikacyjnych (i Jak Je Naprawić)
pt: 5 Erros Comuns em Entrevistas de Emprego em Inglês (e Como Corrigi-los)
ru: 5 распространенных ошибок на английском собеседовании (и как их исправить)
sv: 5 Vanliga misstag på engelska jobbintervjuer (och hur man rättar till dem)
th: 5 ข้อผิดพลาดทั่วไปในการสัมภาษณ์งานภาษาอังกฤษ (และวิธีการแก้ไข)
tr: 5 Yaygın İngilizce İş Mülakatı Hatası (ve Bunları Nasıl Düzeltiriz)
uk: 5 поширених помилок англійської мови під час співбесіди (та як їх виправити)
vi: 5 Lỗi phổ biến trong phỏng vấn xin việc bằng tiếng Anh (và cách khắc phục chúng)

source: 5 hours
uk: 5 годин

source: 5. Winners get full access for free
ar: 5. يحصل الفائزون على وصول كامل مجانًا
be: 5. Пераможцы атрымліваюць поўны доступ бясплатна
da: 5. Vindere får fuld adgang gratis
de: 5. Gewinner erhalten vollen Zugriff kostenlos
es: 5. Los ganadores obtienen acceso completo de forma gratuita
fr: 5. Les gagnants obtiennent un accès complet gratuitement
id: 5. Pemenang mendapatkan akses penuh secara gratis
it: 5. I vincitori ottengono l'accesso completo gratuitamente
ja: 5. 当選者は無料でフルアクセスを利用できます
no: 5. Vinnere får full tilgang gratis
pl: 5. Zwycięzcy otrzymują pełny dostęp za darmo
pt: 5. Vencedores têm acesso completo gratuitamente
ru: 5. Победители получают полный доступ бесплатно
sv: 5. Vinnare får full tillgång gratis
th: 5. ผู้ชนะจะได้รับสิทธิ์การเข้าใช้แบบเต็มรูปแบบฟรี
tr: 5. Kazananlar tam erişimi ücretsiz olarak elde eder
uk: 5. Переможці отримують повний доступ безкоштовно
vi: 5. Người chiến thắng sẽ được truy cập đầy đủ miễn phí

source: 6 Ways Busy Professionals Can Improve Their English Fluency for Job Interviews
ar: 6 طرق يمكن للمحترفين المشغولين تحسين طلاقتهم في اللغة الإنجليزية لمقابلات العمل
be: 6 спосабаў для зацягнутых прафесіяналаў палепшыць сваю валоднасць англійскай мовай для праходжэння працоўных інтэрв'ю
da: 6 måder travle professionelle kan forbedre deres engelske flydende til jobsamtaler
de: 6 Möglichkeiten, wie vielbeschäftigte Fachleute ihre Englischkenntnisse für Vorstellungsgespräche verbessern können
es: 6 Maneras en que los Profesionales Ocupados pueden Mejorar su Fluidez en Inglés para Entrevistas de Trabajo
fr: 6 Façons Pour Les Professionnels Occupés D'Améliorer Leur Maîtrise De L'Anglais Pour Les Entretiens D'Embauche
id: 6 Cara Profesional Sibuk Dapat Meningkatkan Kemampuan Bahasa Inggris mereka untuk Wawancara Kerja
it: 6 Modi in cui i Professionisti Occupati Possono Migliorare la loro Fluency in Inglese per i Colloqui di Lavoro
ja: 6つの方法 忙しいプロフェッショナルが就職面接のための英語の流暢さを向上させる
ms: 6 Cara Profesional Sibuk Boleh Meningkatkan Kecekapan Bahasa Inggeris Untuk Temuduga Kerja
no: 6 Måter Travle Profesjonelle Kan Forbedre Sin Engelsk Flytendehet for Jobbintervjuer
pl: 6 Sposoby, Dzięki Którym Zapracowani Profesjonaliści Mogą Poprawić Swoją Płynność Języka Angielskiego na Rozmowy Kwalifikacyjne
pt: 6 Maneiras de Profissionais Ocupados Melhorarem Sua Fluência em Inglês para Entrevistas de Emprego
ru: 6 способов для занятых профессионалов улучшить свою владение английским для собеседований на работу
sv: 6 Sätt Hektiska Professionella Kan Förbättra Sin Engelska Flyt för Jobbintervjuer
th: 6 วิธีที่ผู้มีอาชีพที่ยุ่งยากสามารถปรับปรุงความชำนาญในภาษาอังกฤษสำหรับการสัมภาษณ์งาน
tr: İş Görüşmeleri İçin Meşgul Profesyonellerin İngilizce Akıcılıklarını Geliştirmenin 6 Yolu
uk: 6 способів, як зайняті професіонали можуть покращити свою володіння англійською мовою для співбесіди на роботу
vi: 6 Cách Mà Những Người Làm Việc Bận Rộn Có Thể Cải Thiện Sự Lưu Loát Tiếng Anh Của Mình Cho Cuộc Phỏng Vấn Việc Làm

source: A bit more time to explore the app and create a habit.
uk: Трохи більше часу, щоб дослідити додаток та створити звичку.

source: A friendly compliment to break the ice.
ar: مجاملة ودية لكسر الجليد.
be: Прыемны камплімент для размякчэння льоду.
da: Et venligt kompliment for at bryde isen.
de: Ein freundliches Kompliment, um das Eis zu brechen.
es: Un cumplido amistoso para romper el hielo.
fr: Un compliment amical pour briser la glace.
id: Sebuah pujian ramah untuk memecahkan kebekuan.
it: Un complimento amichevole per rompere il ghiaccio.
ja: 気軽に話せるような褒め言葉で場を和ませましょう。
ms: Satu pujian mesra untuk memecahkan kebekuan.
no: Et vennlig kompliment for å bryte isen.
pl: Miły komplement, aby przełamać lody.
pt: Um elogio amigável para quebrar o gelo.
ru: Дружеский комплимент, чтобы разрядить обстановку.
sv: En vänlig komplimang för att bryta isen.
th: คำชมเชยที่เป็นมิตรเพื่อผ่อนคลายบรรยากาศ
tr: Buzu kırmak için dostane bir iltifat.
uk: Приємний комплімент, щоб розривати лід.
vi: Một lời khen thân thiện để xóa tan bầu không khí căng thẳng.

source: A fun word guessing game for 2-20 players. Explain words to your teammates without saying the word itself!
id: Permainan menebak kata yang menyenangkan untuk 2-20 pemain. Jelaskan kata-kata kepada rekan tim Anda tanpa menyebutkan kata itu sendiri!
it: Un divertente gioco di parole da 2 a 20 giocatori. Spiega le parole ai tuoi compagni di squadra senza pronunciare la parola stessa!
ja: 2〜20人用の楽しい言葉当てゲーム。言葉自体を言わずに、あなたのチームメイトに言葉を説明しましょう！
no: Et morsomt ordgjettingsspill for 2-20 spillere. Forklar ordene til lagkameratene dine uten å si selve ordet!
ru: Веселая игра на угадывание слов для 2-20 игроков. Объясняйте слова своим товарищам по команде, не произнося самого слова!
uk: Гра в відгадування слів для 2-20 гравців. Поясніть слова своїм товаришам по команді, не виголошуючи самого слова!

source: A method focused on clarity and reliability
ar: طريقة تركز على الوضوح والموثوقية
be: Метад, накіраваны на празрыстасць і надзейнасць
da: En metode fokuseret på klarhed og pålidelighed
de: Eine Methode, die auf Klarheit und Zuverlässigkeit fokussiert ist
es: Un método centrado en la claridad y la fiabilidad
fr: Une méthode axée sur la clarté et la fiabilité
id: Metode yang berfokus pada kejelasan dan keandalan
it: Un metodo incentrato sulla chiarezza e l'affidabilità
ja: 明確さと信頼性に焦点を当てた方法
ms: Satu kaedah yang memfokuskan pada kejelasan dan kebolehpercayaan
no: En metode fokusert på klarhet og pålitelighet
pl: Metoda skoncentrowana na przejrzystości i niezawodności
pt: Um método focado na clareza e confiabilidade
ru: Метод, ориентированный на ясность и надежность
sv: En metod fokuserad på tydlighet och tillförlitlighet
th: เมธอดที่เน้นความชัดเจนและความน่าเชื่อถือ
tr: Açıklık ve güvenilirliğe odaklanmış bir yöntem
uk: Метод, зосереджений на ясності та надійності
vi: Một phương pháp tập trung vào sự rõ ràng và đáng tin cậy

source: A polite and professional greeting.
ar: تحية طيبة ومهنية.
be: Вежлівае і прафесійнае вітанне.
da: En høflig og professionel hilsen.
de: Eine höfliche und professionelle Begrüßung.
es: Un saludo educado y profesional.
fr: Une salutation polie et professionnelle.
id: Sebuah sapaan yang sopan dan profesional.
it: Un saluto educato e professionale.
ja: 丁寧でプロフェッショナルな挨拶。
ms: Salam yang sopan dan profesional.
no: En høflig og profesjonell hilsen.
pl: Upojone i profesjonalne powitanie.
pt: Uma saudação educada e profissional.
ru: Вежливое и профессиональное приветствие.
sv: En artig och professionell hälsning.
th: การทักทายที่สุภาพและมืออาชีพ
tr: Nazik ve profesyonel bir selamlama.
uk: Ввічливе та професійне вітання.
vi: Một lời chào lịch sự và chuyên nghiệp.

source: A proven method that delivers measurable results
ar: طريقة مثبتة تقدم نتائج قابلة للقياس
be: Правераны метад, які дае вымяральныя вынікі
da: En gennemprøvet metode, der leverer målbare resultater
de: Eine bewährte Methode, die messbare Ergebnisse liefert
es: Un método comprobado que ofrece resultados medibles
fr: Une méthode éprouvée qui offre des résultats mesurables
id: Metode yang terbukti memberikan hasil yang terukur
it: Un metodo comprovato che offre risultati misurabili
ja: 測定可能な結果をもたらす実績のある方法
ms: Satu kaedah yang terbukti yang memberikan hasil yang boleh diukur
no: En bevist metode som gir målbare resultater
pl: Sprawdzona metoda, która zapewnia mierzalne wyniki
pt: Um método comprovado que oferece resultados mensuráveis
ru: Метод, который приносит измеримые результаты
sv: En beprövad metod som levererar mätbara resultat
th: วิธีการที่พิสูจน์แล้วว่ามีผลลัพธ์ที่สามารถวัดได้
tr: Ölçülebilir sonuçlar veren kanıtlanmış bir yöntem
uk: Доведений метод, який забезпечує вимірювані результати
vi: Một phương pháp đã được chứng minh mang lại kết quả có thể đo lường được

source: A silence at the end of the algorithm
ar: صمت في نهاية الخوارزمية
be: Цішыня ў канцы алгарытму
da: En stilhed i slutningen af algoritmen
de: Ein Schweigen am Ende des Algorithmus
es: Un silencio al final del algoritmo
fr: Un silence à la fin de l'algorithme
id: Sebuah keheningan di akhir algoritma
it: Un silenzio alla fine dell'algoritmo
ja: アルゴリズムの終わりの沈黙
ms: Kediaman di akhir algoritma
no: En stillhet på slutten av algoritmen
pl: Cisza na końcu algorytmu
pt: Um silêncio no final do algoritmo
ru: Тишина в конце алгоритма
sv: En tystnad vid slutet av algoritmen
th: ความเงียบที่ปลายทางของอัลกอริทึม
tr: Algoritmanın sonunda bir sessizlik
uk: Тиша наприкінці алгоритму
vi: Một sự im lặng ở cuối thuật toán

source: A small temporary authorization may appear on your statement and will be released automatically by your bank.
ar: قد يظهر ترخيص صغير مؤقت في كشف حسابك وسيتم تحريره تلقائيًا بواسطة البنك الخاص بك.
be: На выпісцы можа з'явіцца невялікая часовая аўтарызацыя, якая аўтаматычна будзе знята вашым банкам.
da: En lille midlertidig godkendelse kan vises på din kontoudskrift og vil automatisk blive frigivet af din bank.
de: Eine kleine temporäre Autorisierung kann auf Ihrem Kontoauszug erscheinen und wird automatisch von Ihrer Bank freigegeben.
es: Puede aparecer una pequeña autorización temporal en su estado de cuenta y será liberada automáticamente por su banco.
fr: Une petite autorisation temporaire peut apparaître sur votre relevé et sera automatiquement libérée par votre banque.
id: Otorisasi sementara yang kecil mungkin muncul pada laporan Anda dan akan dilepaskan secara otomatis oleh bank Anda.
it: Una piccola autorizzazione temporanea potrebbe apparire nel tuo estratto conto e verrà rilasciata automaticamente dalla tua banca.
ja: あなたの明細書に小さな一時的な認証が表示されることがありますが、これは銀行によって自動的に解除されます。
ms: Satu kebenaran sementara yang kecil mungkin akan muncul pada penyata anda dan akan dilepaskan secara automatik oleh bank anda.
no: En liten midlertidig autorisasjon kan vises på kontoutskriften din og vil bli frigitt automatisk av banken din.
pl: Na wyciągu może pojawić się mała tymczasowa autoryzacja, która zostanie automatycznie zwolniona przez Twój bank.
pt: Uma pequena autorização temporária pode aparecer no seu extrato e será liberada automaticamente pelo seu banco.
ru: На вашей выписке может появиться небольшая временная авторизация, которая будет автоматически снята вашим банком.
sv: En liten tillfällig auktorisation kan visas på ditt kontoutdrag och kommer att släppas automatiskt av din bank.
th: อาจมีการอนุมัติชั่วคราวขนาดเล็กปรากฏในรายการเงินฝากของคุณและจะถูกปล่อยโดยอัตโนมัติโดยธนาคารของคุณ
tr: Hesap özetinizde küçük bir geçici yetkilendirme görünebilir ve bankanız tarafından otomatik olarak serbest bırakılacaktır.
uk: Невелика тимчасова авторизація може з'явитися у вашій виписці і буде автоматично скасована вашим банком.
vi: Một uỷ quyền tạm thời nhỏ có thể xuất hiện trên bảng sao kê của bạn và sẽ được ngân hàng của bạn tự động giải phóng.

source: A standard reply to “How are you?”
ar: رد قياسي على "كيف حالك؟"
be: Стандартны адказ на "Як справы?"
da: Et standard svar på "Hvordan har du det?"
de: Eine Standardantwort auf "Wie geht es Ihnen?"
es: Una respuesta estándar a "¿Cómo estás?"
fr: Une réponse standard à "Comment ça va ?"
id: Sebuah jawaban standar untuk "Apa kabar?"
it: Una risposta standard a "Come stai?"
ja: 「お元気ですか？」への一般的な返答
ms: Balasan standard untuk "Apa khabar?"
no: Et standard svar på "Hvordan har du det?"
pl: Standardowa odpowiedź na "Jak się masz?"
pt: Uma resposta padrão para "Como você está?"
ru: Стандартный ответ на "Как дела?"
sv: Ett standard svar på "Hur mår du?"
th: การตอบที่มาตรฐานสำหรับ "คุณเป็นอย่างไร?"
tr: “Nasılsın?”a standart bir yanıt.
uk: Стандартна відповідь на "Як справи?"
vi: Một câu trả lời tiêu chuẩn cho “Bạn khỏe không?”

source: A voice and style that suits you.
no: En stemme og stil som passer deg.
uk: Голос і стиль, що підходять вам.

source: About
ja: 約
no: Om
uk: Про

source: Academic Word List
ar: قائمة الكلمات الأكاديمية
be: Акадэмічны спіс слоў
da: Akademisk ordliste
de: Akademische Wortliste
es: Lista de Palabras Académicas
fr: Liste de mots académiques
id: Daftar Kata Akademik
it: Elenco di Parole Accademiche
ja: アカデミックワードリスト
ms: Senarai Perkataan Akademik
no: Akademisk ordliste
pl: Akademicka Lista Słów
pt: Lista de Palavras Acadêmicas
ru: Академический Список Слов
sv: Akademisk ordlista
th: รายชื่อคำศัพท์วิชาการ
tr: Akademik Kelime Listesi
uk: Академічний Список Слів
vi: Danh sách từ vựng học thuật

source: Accept
ar: قبول
be: Прыняць
da: Accepter
de: Akzeptieren
es: Aceptar
fr: Accepter
id: Terima
it: Accetta
ja: 受け入れる
no: Godta
pl: Zaakceptuj
pt: Aceitar
ru: Принять
sv: Acceptera
th: ยอมรับ
tr: Kabul et
uk: Прийняти
vi: Chấp nhận

source: Access to the community
id: Akses ke komunitas
it: Accesso alla comunità
ja: コミュニティへのアクセス
no: Tilgang til fellesskapet
ru: Доступ к сообществу
sv: Access till gemenskapen
uk: Доступ до спільноти

source: Accuracy
id: Akurasi
it: Precisione
ja: 正確さ
no: Nøyaktighet
ru: Точность
uk: Точність
