Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Recruiters ask a variety of standard questions to understand your motivation and personality. Preparing answers in advance will help you stay calm and articulate. Focus on showing enthusiasm and confidence in your skills. Let’s look at some common questions and how to answer them:
ar: يطرح المجندون مجموعة متنوعة من الأسئلة القياسية لفهم دوافعك وشخصيتك. ستساعدك الإجابات المعدة مسبقًا على البقاء هادئًا وبلاغًا. ركز على إظهار الحماس والثقة في مهاراتك. دعونا ننظر في بعض الأسئلة الشائعة وكيفية الإجابة عليها:
be: Рэкрутэры задаюць розныя стандартныя пытанні, каб зразумець вашу мацівацыю і асабістасць. Падрыхтоўка адказаў наперад дапаможа вам заставацца спакойнымі і выразна выкладваць свае думкі. Сконцэнтруйцеся на дэманстрацыі энтузіязму і ўпэўненасці ў сваіх навыках. Паглядзім на некаторыя распаўсюджаныя пытанні і як на іх адказваць:
da: Rekrutterere stiller en række standardspørgsmål for at forstå din motivation og personlighed. Forberedelse af svar på forhånd vil hjælpe dig med at forblive rolig og artikuleret. Fokuser på at vise entusiasme og tillid til dine evner. Lad os se på nogle almindelige spørgsmål og hvordan man besvarer dem:
de: Personalvermittler stellen eine Vielzahl von Standardfragen, um Ihre Motivation und Persönlichkeit zu verstehen. Das Vorbereiten von Antworten im Voraus hilft Ihnen, ruhig und artikuliert zu bleiben. Konzentrieren Sie sich darauf, Begeisterung und Selbstvertrauen in Ihre Fähigkeiten zu zeigen. Lassen Sie uns einige häufig gestellte Fragen und deren Beantwortung betrachten:
es: Los reclutadores hacen una variedad de preguntas estándar para entender tu motivación y personalidad. Preparar las respuestas con anticipación te ayudará a mantener la calma y a expresarte de manera articulada. Enfócate en mostrar entusiasmo y confianza en tus habilidades. Veamos algunas preguntas comunes y cómo responderlas:
fr: Les recruteurs posent une variété de questions standard pour comprendre votre motivation et votre personnalité. Préparer des réponses à l'avance vous aidera à rester calme et articulé. Concentrez-vous sur la démonstration de votre enthousiasme et de votre confiance en vos compétences. Examinons quelques questions courantes et comment y répondre :
id: Perekrut bertanya berbagai pertanyaan standar untuk memahami motivasi dan kepribadian Anda. Mempersiapkan jawaban di awal akan membantu Anda tetap tenang dan berbicara jelas. Fokuslah untuk menampilkan antusiasme dan kepercayaan diri dalam keterampilan Anda. Mari kita lihat beberapa pertanyaan umum dan cara menjawabnya:
it: I reclutatori fanno una serie di domande standard per capire la tua motivazione e personalità. Preparare le risposte in anticipo ti aiuterà a rimanere calmo e ad esprimerti chiaramente. Concentrati su mostrare entusiasmo e fiducia nelle tue abilità. Vediamo alcune domande comuni e come rispondere:
ja: リクルーターはあなたの動機や人格を理解するために様々な標準的な質問をします。事前に答えを準備しておくことで安心して明瞭に話すことができます。あなたのスキルに対する熱意と自信を表現することに集中しましょう。一般的な質問とその答え方を見てみましょう：
ms: Perekrut bertanya pelbagai soalan standard untuk memahami motivasi dan personaliti anda. Menyediakan jawapan terlebih dahulu akan membantu anda kekal tenang dan fasih. Fokuslah pada menunjukkan semangat dan keyakinan dalam kemahiran anda. Mari kita lihat beberapa soalan biasa dan bagaimana menjawabnya:
no: Rekrutterere stiller en rekke standardspørsmål for å forstå din motivasjon og personlighet. Å forberede svar på forhånd vil hjelpe deg med å holde deg rolig og artikulert. Fokuser på å vise entusiasme og selvtillit i dine ferdigheter. La oss se på noen vanlige spørsmål og hvordan du kan svare på dem:
pl: Rekruterzy zadają różnego rodzaju standardowe pytania, aby zrozumieć Twoją motywację i osobowość. Przygotowanie odpowiedzi z góry pomoże Ci zachować spokój i artykulację. Skup się na wykazaniu entuzjazmu i pewności siebie w swoich umiejętnościach. Spójrzmy na niektóre powszechne pytania i sposoby na ich odpowiedź:
pt: Os recrutadores fazem uma variedade de perguntas padrão para entender sua motivação e personalidade. Preparar respostas com antecedência ajudará você a permanecer calmo e articulado. Concentre-se em mostrar entusiasmo e confiança em suas habilidades. Vamos olhar algumas perguntas comuns e como respondê-las:
ru: Рекрутеры задают разнообразные стандартные вопросы, чтобы понять вашу мотивацию и личность. Подготовка ответов заранее поможет вам оставаться спокойными и красноречивыми. Сосредоточьтесь на демонстрации энтузиазма и уверенности в своих навыках. Давайте посмотрим на некоторые общие вопросы и как на них отвечать:
sv: Rekryterare ställer en mängd standardfrågor för att förstå din motivation och personlighet. Att förbereda svar i förväg hjälper dig att förbli lugn och artikulerad. Fokusera på att visa entusiasm och självförtroende i dina färdigheter. Låt oss titta på några vanliga frågor och hur man svarar på dem:
th: ผู้สรรหางานมักถามคำถามมาตรฐานหลากหลายเพื่อทำความเข้าใจถึงจุดเริ่มต้นและบุคลิกภาพของคุณ การเตรียมคำตอบล่วงหน้าจะช่วยให้คุณสงบและสามารถพูดคุยได้ชัดเจน โฟกัสที่การแสดงความกระตือรือร้นและความมั่นใจในทักษะของคุณ มาดูคำถามทั่วไปและวิธีตอบพวกแล้ว:
tr: İşe alımcılar motivasyonunuzu ve kişiliğinizi anlamak için çeşitli standart sorular sorar. Cevapları önceden hazırlamak, sakin kalmanıza ve açık şekilde ifade etmenize yardımcı olur. Yeteneklerinize duyduğunuz güven ve coşkuyu göstermeye odaklanın. Şimdi bazı yaygın sorulara ve onlara nasıl cevap verileceğine bir bakalım:
uk: Рекрутери задають різноманітні стандартні питання, щоб зрозуміти вашу мотивацію та особистість. Попередня підготовка відповідей допоможе вам залишатися спокійним та виразним. Сконцентруйтеся на демонстрації ентузіазму та впевненості в своїх навиках. Давайте розглянемо деякі поширені питання та як на них відповідати:
vi: Các nhà tuyển dụng đặt ra một loạt các câu hỏi tiêu chuẩn để hiểu về động lực và cá nhân tính của bạn. Chuẩn bị câu trả lời trước sẽ giúp bạn giữ được bình tĩnh và diễn đạt lời nói. Tập trung vào việc thể hiện sự nhiệt huyết và tự tin vào kỹ năng của mình. Hãy xem một số câu hỏi thường gặp và cách trả lời chúng:

source: Reflex
ar: ريفلكس
be: Рэфлекс
da: Refleks
es: Reflejo
fr: Réflexe
id: Refleks
it: Riflesso
ja: リフレックス
ms: Refleks
no: Refleks
pl: Refleks
pt: Reflexo
ru: Рефлекс
th: สะท้อน
tr: Refleks
uk: Рефлекс
vi: Phản xạ

source: Refresh
ar: تحديث
be: Абнавіць
da: Opdater
de: Aktualisieren
es: Actualizar
fr: Rafraîchir
id: Segarkan Ulang
it: Aggiorna
ja: リフレッシュ
ms: Muat Semula
no: Oppdater
pl: Odśwież
pt: Atualizar
ru: Обновить
sv: Uppdatera
th: รีเฟรช
tr: Yenile
uk: Оновити
vi: Làm mới

source: Refund
ar: رد الأموال
be: Вяртанне грошай
da: Refundering
de: Rückerstattung
es: Reembolso
fr: Remboursement
id: Pengembalian dana
it: Rimborso
ja: 返金
ms: Pulangan
no: Refusjon
pl: Zwrot
pt: Reembolso
ru: Возврат
sv: Återbetalning
th: คืนเงิน
tr: İade
uk: Відшкодування
vi: Hoàn tiền

source: Refund form
de: Rückerstattungsformular
es: Formulario de reembolso
id: Formulir pengembalian dana
it: Modulo di rimborso
ja: 返金フォーム
no: Refusjonsskjema
pl: Formularz zwrotu
pt: Formulário de reembolso
ru: Форма возврата
sv: Återbetalningsformulär
th: ฟอร์มการคืนเงิน
tr: İade formu
uk: Форма повернення коштів
vi: Biểu mẫu hoàn tiền

source: Refund guarantee
id: Jaminan pengembalian dana
it: Garanzia di rimborso
ja: 返金保証
no: Refusjonsgaranti
ru: Гарантия возврата средств
sv: Återbetalningsgaranti
uk: Гарантія повернення коштів

source: Related Scenarios
ar: سيناريوهات ذات صلة
be: Павязаныя сцэнары
da: Relaterede scenarier
de: Verwandte Szenarien
es: Escenarios Relacionados
fr: Scénarios Connexes
id: Terkait Skenario
it: Scenari Correlati
ja: 関連シナリオ
ms: Situasi Berkaitan
no: Relaterte Scenarier
pl: Powiązane scenariusze
pt: Cenários Relacionados
ru: Связанные сценарии
sv: Relaterade scenarier
th: สถานการณ์ที่เกี่ยวข้อง
tr: İlgili Senaryolar
uk: ПОВ’ЯЗАНІ СЦЕНАРІЇ
vi: Cảnh liên quan

source: Reload page
ar: إعادة تحميل الصفحة
be: Перазагрузіць старонку
da: Genindlæs side
de: Seite neu laden
es: Recargar página
fr: Recharger la page
id: Muat ulang halaman
it: Ricarica pagina
ja: ページを再読み込み
ms: Muat semula halaman
no: Last inn siden på nytt
pl: Odśwież stronę
pt: Recarregar página
ru: Перезагрузить страницу
sv: Ladda om sidan
th: โหลดหน้าเว็บใหม่
tr: Sayfayı yeniden yükle
uk: Перезавантажте сторінку
vi: Tải lại trang

source: Remove
ar: إزالة
be: Выдаліць
da: Fjern
de: Entfernen
es: Eliminar
fr: Supprimer
id: Hapus
it: Rimuovi
ja: 削除
no: Fjern
pl: Usuń
pt: Remover
ru: Удалить
sv: Ta bort
th: ลบออก
tr: Kaldır
uk: Вилучити
vi: Loại bỏ

source: Remove my data (delete account)
ar: إزالة بياناتي (حذف الحساب)
be: Выдаліць мае даныя (выдаліць рахунак)
da: Fjern mine data (slet konto)
de: Entfernen Sie meine Daten (Konto löschen)
es: Eliminar mis datos (eliminar cuenta)
fr: Supprimer mes données (supprimer le compte)
id: Hapus data saya (hapus akun)
it: Rimuovi i miei dati (elimina account)
ja: 私のデータを削除する（アカウントを削除）
ms: Padam data saya (hapus akaun)
no: Fjern mine data (slett konto)
pl: Usuń moje dane (usuń konto)
pt: Remover meus dados (excluir conta)
ru: Удалить мои данные (удалить аккаунт)
sv: Ta bort mina uppgifter (radera konto)
th: ลบข้อมูลของฉัน (ลบบัญชี)
tr: Verilerimi kaldır (hesabı sil)
uk: Видалити мої дані (видалити обліковий запис)
vi: Xóa dữ liệu của tôi (xóa tài khoản)

source: Removing your data...
ar: جاري إزالة بياناتك...
be: Выдаленне вашых даных...
da: Fjerner dine data...
de: Entfernen Ihrer Daten...
es: Eliminando tus datos...
fr: Retrait de vos données...
id: Menghapus data Anda...
it: Rimozione dei tuoi dati...
ja: データを削除しています...
ms: Mengeluarkan data anda...
no: Fjerner dataene dine...
pl: Usuwanie Twoich danych...
pt: Removendo seus dados...
ru: Удаление ваших данных...
sv: Tar bort dina data...
th: ลบข้อมูลของคุณ...
tr: Verileriniz kaldırılıyor...
uk: Видалення ваших даних...
vi: Đang xóa dữ liệu của bạn...

source: Rendering Performance
ar: أداء العرض
be: Прадукцыйнасць візуалізацыі
da: Ydeevne ved gengivelse
de: Renderleistung
es: Rendimiento de Renderizado
fr: Rendu des Performances
id: Kinerja Rendering
it: Prestazioni di rendering
ja: レンダリングパフォーマンス
ms: Prestasi Perenderan
no: Gjengivelsesperformance
pl: Wydajność Renderowania
pt: Desempenho de Renderização
ru: Производительность рендеринга
sv: Renderingprestanda
th: ประสิทธิภาพการแสดงผล
tr: Rendering Performansı
uk: Продуктивність рендерингу
vi: Hiệu Suất Kết Xuất

source: Replies
id: Balasan
it: Risposte
ja: 返信
no: Svar
pl: Odpowiedzi
ru: Ответы
sv: Svar
uk: Відповіді

source: Request Refund
de: Rückerstattung beantragen
es: Solicitar reembolso
id: Permintaan Pengembalian Dana
it: Richiedi Rimborso
ja: 払い戻しをリクエスト
no: Be om refusjon
pl: Zgłoś Zwrot
pt: Solicitar Reembolso
ru: Запрос на возврат средств
sv: Begär återbetalning
th: ขอคืนเงิน
tr: İade Talebi
uk: Запит на відшкодування
vi: Yêu cầu hoàn tiền

source: Resiliency & Observability
ar: المرونة والمراقبة
be: Устойлівасць і Наблюдаемасць
da: Robusthed & Synlighed
de: Resilienz & Beobachtbarkeit
es: Resiliencia y Observabilidad
fr: Résilience & Observabilité
id: Ketahanan & Keteramatan
it: Resilienza & Osservabilità
ja: レジリエンシー＆オブザーバビリティ
ms: Ketahanan & Kebolehlihatannya
no: Motstandsdyktighet og observabilitet
pl: Odporność i Kontrolowalność
pt: Resiliência e Observabilidade
ru: Устойчивость и Наблюдаемость
sv: Motståndskraft & Observabilitet
th: ความยืดหยุ่น & การมองเห็น
tr: Esneklik & Gözlemlenebilirlik
uk: Стійкість і Спостережуваність
vi: Độ bền bỉ & Khả năng quan sát

source: Restaurant
ar: مطعم
be: Рэстаран
es: Restaurante
id: Restoran
it: Ristorante
ja: レストラン
ms: Restoran
pl: Restauracja
pt: Restaurante
ru: Ресторан
sv: Restaurang
th: ร้านอาหาร
tr: Restoran
uk: Ресторан
vi: Nhà hàng

source: Results are closer than you think
ar: النتائج أقرب مما تعتقد
be: Вынікі бліжэй, чым вы думаеце
da: Resultater er tættere end du tror
de: Ergebnisse sind näher als Sie denken
es: Los resultados están más cerca de lo que piensas
fr: Les résultats sont plus proches que vous ne le pensez
id: Hasil lebih dekat daripada yang Anda pikirkan
it: I risultati sono più vicini di quanto pensi
ja: 結果はあなたが思っているよりも近いです
ms: Keputusan lebih dekat daripada yang anda fikirkan
no: Resultatene er nærmere enn du tror
pl: Wyniki są bliżej niż myślisz
pt: Os resultados estão mais próximos do que você pensa
ru: Результаты ближе, чем вы думаете
sv: Resultaten är närmare än du tror
th: ผลลัพธ์ใกล้กว่าที่คุณคิด
tr: Sonuçlar sandığınızdan daha yakın
uk: Результати ближче, ніж ви думаєте
vi: Kết quả gần hơn bạn nghĩ

source: Retries alone can amplify failures. Add exponential backoff, jitter, and a circuit breaker to prevent cascading issues. Combine with timeouts and fallback paths. Log structured context (correlation IDs) and emit metrics to observe error rates and latency.
ar: يمكن لإعادة المحاولات وحدها أن تضخم من الفشل. أضف تراجعًا متزايدًا، وتشتتًا، ودائرة قصر لمنع المشكلات المتتابعة. اجمع مع المهلات ومسارات الاسترجاع. سجل السياق المنظم (معرّفات الارتباط) واصدر مقاييس لمراقبة معدلات الخطأ وزمن الانتقال.
be: Паўторы самі па сабе могуць узмацніць няўдачы. Дадайце экспанентную адтэрміноўку, джытэр і аварыйны выключальнік, каб прадухіліць каскадныя праблемы. Спалучайце іх з таймаўтамі і рэзервовымі шляхамі. Захоўвайце структураваны кантэкст (ідэнтыфікатары карэляцыі) і выпраменьвайце метрыкі для назірання за ўзроўнямі памылак і затрымкай.
da: Gentagne forsøg kan alene forstærke fejl. Tilføj eksponentiel backoff, jitter og en circuit breaker for at forhindre kaskadeproblemer. Kombiner med timeouts og alternative stier. Log struktureret kontekst (korrelations-ID'er) og udsend metrics for at observere fejlrater og latenstid.
de: Retrys allein können Fehler verstärken. Verwenden Sie exponentielles Backoff, Jitter und eine Circuit-Breaker-Technik, um kaskadierende Probleme zu verhindern. Kombinieren Sie dies mit Timeouts und Ausweichpfaden. Protokollieren Sie strukturierten Kontext (Korrelations-IDs) und geben Sie Metriken aus, um Fehlerraten und Latenz zu beobachten.
es: Los reintentos por sí solos pueden amplificar los fallos. Agrega un retroceso exponencial, fluctuación, y un disyuntor para prevenir problemas en cascada. Combina con tiempos de espera y rutas de respaldo. Registra contexto estructurado (IDs de correlación) y emite métricas para observar tasas de error y latencia.
fr: Les réessais seuls peuvent amplifier les échecs. Ajoutez un repli exponentiel, du jitter et un disjoncteur pour éviter les problèmes en cascade. Combinez avec des délais d'attente et des chemins de repli. Consignez le contexte structuré (ID de corrélation) et émettez des métriques pour observer les taux d'erreur et la latence.
id: Percobaan ulang saja dapat memperbesar kegagalan. Tambahkan backoff eksponensial, jitter, dan pemutus sirkuit untuk mencegah masalah berantai. Gabungkan dengan batas waktu dan jalur cadangan. Catat konteks terstruktur (ID korelasi) dan keluarkan metrik untuk mengamati tingkat kesalahan dan latensi.
it: I soli tentativi di ritentare possono amplificare i fallimenti. Aggiungi il backoff esponenziale, il jitter e un interruttore automatico per prevenire problemi a cascata. Combina con timeout e percorsi di fallback. Registra il contesto strutturato (ID di correlazione) ed emetti metriche per osservare i tassi di errore e la latenza.
ja: リトライだけでは失敗を増幅する可能性があります。指数バックオフ、ジッター、サーキットブレーカーを追加して、連鎖する問題を防ぎましょう。タイムアウトとフォールバックパスを組み合わせます。構造化されたコンテキスト（相関ID）を記録し、エラー率とレイテンシーを観察するためにメトリクスを出力します。
ms: Cuba semula sendiri boleh membesarkan kegagalan. Tambah pengunduran eksponen, kerancuan, dan pemutus litar untuk mencegah isu berangkai. Gabungkan dengan had masa dan laluan gantian. Log konteks berstruktur (ID korelasi) dan emisikan metrik untuk memerhati kadar ralat dan kependaman.
no: Alene kan gjentatte forsøk forsterke feil. Legg til eksponentiell tilbakeslag, jitter og en kretsbryter for å forhindre kaskaderende problemer. Kombiner med tidsavbrudd og reserveveier. Logg strukturert kontekst (korrelasjons-IDer) og send inn måledata for å observere feilrater og ventetid.
pl: Ponowienia mogą same zwiększyć awarie. Dodaj wykładnicze wycofanie, losowy rozkład (jitter) i wyłącznik awaryjny, aby zapobiec kaskadowym problemom. Połącz z ograniczeniami czasowymi i ścieżkami zapasowymi. Rejestruj ustrukturyzowany kontekst (identyfikatory korelacji) i emituj metryki, aby obserwować współczynniki błędów i opóźnienia.
pt: Retentativas por si só podem amplificar falhas. Adicione recuo exponencial, jitter e um disjuntor de circuito para prevenir problemas em cascata. Combine com timeouts e caminhos de fallback. Registre o contexto estruturado (IDs de correlação) e emita métricas para observar taxas de erro e latência.
ru: Одни лишь повторные попытки могут усилить сбои. Добавьте экспоненциальную задержку, дрожание и автоматический переключатель цепи, чтобы предотвратить каскадные проблемы. Комбинируйте с таймаутами и альтернативными путями. Записывайте структурированный контекст (корреляционные идентификаторы) и излучайте метрики для наблюдения за частотой ошибок и задержкой.
sv: Återförsök ensamma kan förstärka fel. Lägg till exponentiell backoff, jitter och en kretsbrytare för att förhindra kaskadproblem. Kombinera med tidsgränser och reservvägar. Logga strukturerad kontext (korrelations-ID) och avge mätvärden för att observera felfrekvenser och latens.
th: การลองใหม่เพียงอย่างเดียวสามารถเพิ่มความล้มเหลวได้ เพิ่มการถอยหลังแบบเอ็กซ์โพเนนเชียล, การแทรกสัญญาณสุ่ม, และเซอร์กิตเบรกเกอร์เพื่อป้องกันปัญหาลูกโซ่ รวมเข้ากับการหมดเวลาและเส้นทางสำรอง บันทึกบริบทโครงสร้าง (ID ความสัมพันธ์) และปล่อยเมตริกเพื่อสังเกตอัตราความผิดพลาดและเวลาแฝง
tr: Yalnızca tekrar denemeleri hataları artırabilir. Bir artış gösteren geri alma, titreşim ve devre kesici ekleyerek zincirleme sorunların önüne geçin. Zaman aşımı ve geri dönüş yollarıyla birleştirin. Hata oranlarını ve gecikmeyi gözlemlemek için yapılandırılmış bağlam (korelasyon kimlikleri) günlüğü tutun ve ölçümler yayınlayın.
uk: Самі повторні спроби можуть збільшити невдачі. Додайте експоненціальне збільшення інтервалів, джиттер і схему вимикача, щоб запобігти каскадним проблемам. Комбінуйте з таймаутами та шляхами відновлення. Реєструйте структурований контекст (ідентифікатори кореляції) та передавайте метрики для спостереження за рівнями помилок і затримками.
vi: Retries alone can amplify failures. Add exponential backoff, jitter, and a circuit breaker to prevent cascading issues. Combine with timeouts and fallback paths. Log structured context (correlation IDs) and emit metrics to observe error rates and latency. Việc thử lại đơn thuần có thể làm gia tăng các thất bại. Sử dụng backoff theo cấp số nhân, jitter, và một mạch ngắt để ngăn chặn các vấn đề dây chuyền. Kết hợp với thời gian chờ và các đường đi dự phòng. Ghi lại ngữ cảnh có cấu trúc (ID tương quan) và xuất các chỉ số để quan sát tỷ lệ lỗi và độ trễ.

source: Retry & Backoff
ar: إعادة المحاولة والتراجع
be: Паўтор & Адкладка
da: Forsøg igen & Tilbagekobling
de: Erneuter Versuch & Rückoff
es: Reintentar y Retroceder
fr: Réessayer & Recul
id: Coba Lagi & Mundur
it: Riprova e Ritardo
ja: リトライ & バックオフ
ms: Cuba Semula & Pentangguhan
no: Gjenprøving & Tilbakeslag
pl: Ponowna próba i wycofanie w przypadku błędu
pt: Tentar Novamente & Retroceder
ru: Повтор и Отложенный старт
sv: Försök igen & Vänta och försök igen
th: ลองใหม่ & ถอยกลับ
tr: Tekrar Dene & Geri Çekil
uk: Повторити та Відкласти
vi: Thiết lập & Trì hoãn

source: Return
ar: عودة
be: Вяртанне
da: Retur
de: Rückkehr
es: Regresar
fr: Retour
id: Kembali
it: Ritorno
ja: 戻る
ms: Kembali
no: Returnere
pl: Powrót
pt: Retornar
ru: Вернуть
sv: Återvänd
th: คืน
tr: Geri dön
uk: Повернення
vi: Quay lại

source: Returning an Item to a Store
ar: إرجاع عنصر إلى المتجر
be: Вяртанне прадукту ў краму
da: Returnering af en vare til en butik
de: Rückgabe eines Artikels an ein Geschäft
es: Devolviendo un Artículo a una Tienda
fr: Renvoyer un article à un magasin
id: Mengembalikan Barang ke Toko
it: Restituire un articolo a un negozio
ja: アイテムを店舗に返品する
ms: Mengembalikan Barang ke Kedai
pl: Zwracanie towaru do sklepu
pt: Devolvendo um Item para uma Loja
ru: Возврат товара в магазин
sv: Återlämna en vara till en butik
th: การคืนสินค้ากลับไปยังร้านค้า
tr: Bir Ürünü Mağazaya İade Etmek
uk: Повернення товару в магазин
vi: Trả lại một món hàng cho cửa hàng

source: Review and edit what the AI remembers
id: Tinjau dan edit apa yang diingat oleh AI
it: Rivedi e modifica ciò che l'IA ricorda
ja: AIが記憶している内容を確認して編集する
no: Gjennomgå og rediger det AI-en husker
pl: Przeglądaj i edytuj, co sztuczna inteligencja zapamiętuje
ru: Просмотрите и отредактируйте то, что запомнил ИИ
sv: Granska och redigera vad AI:n kommer ihåg
uk: Перегляньте та відредагуйте те, що AI запам’ятовує

source: Review, edit, or add the notes AI uses about you.
id: Tinjau, edit, atau tambahkan catatan yang digunakan AI tentang Anda.
it: Rivedi, modifica o aggiungi le note che l'IA utilizza su di te.
ja: AIがあなたについて使用するメモを確認、編集、または追加します。
no: Gjennomgå, rediger eller legg til notatene som AI bruker om deg.
pl: Przejrzyj, edytuj lub dodaj notatki, które sztuczna inteligencja wykorzystuje o Tobie.
ru: Просмотрите, отредактируйте или добавьте заметки, которые ИИ использует о вас.
sv: Granska, redigera eller lägg till de anteckningar som AI använder om dig.
uk: Переглядайте, редагуйте або додавайте нотатки, які AI використовує про вас.

source: Robot Thinking
ar: الروبوت يفكر
be: Робат думае
da: Robot Tænker
de: Roboter Denken
es: Pensamiento del Robot
fr: Pensée du Robot
id: Robot Berpikir
it: Pensiero del Robot
ja: ロボット思考中
ms: Robot Sedang Berfikir
no: Robot Tenker
pl: Robot Myśli
pt: Pensamento do Robô
ru: Робот размышляет
sv: Robot tänker
th: โรบอทกำลังคิด
tr: Robot Düşünüyor
uk: Робот думає
vi: Robot Đang suy nghĩ

source: Role Play
ar: دور اللعب
be: Ролевая гра
da: Roller Spil
de: Rollen spielen
fr: Jeu de Rôle
id: Peran Main
it: Ruolo Giocato
ja: 役割演技
ms: Peranan Bermain
no: Rolle Spill
pl: Rola w grze
ru: Ролевая Игра
sv: Rollspel
th: บทบาทสมมติ
tr: Rol Oynama
uk: Рольова гра
vi: Vai diễn
