Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Engage in a casual conversation with a friendly stranger at a social event. Perfect for practicing how to break the ice and keep the chat going naturally. ## Why You Should Play *Small Talk with a Stranger* 1. Develop the confidence to start conversations in unfamiliar social settings. 2. Learn casual conversation starters about the weather, hobbies, or recent events. 3. Practice being an active listener and responding with genuine interest. 4. Overcome nervousness or hesitation by interacting with a supportive AI partner. 5. Build comfortable, everyday communication skills you can apply anywhere. ## How the Scenario Works In this scenario, you’ll step into the role of someone meeting a new acquaintance at a social event. The AI acts as a friendly stranger, prompting you to talk about casual topics like weather or shared interests. As you exchange pleasantries, the AI will adapt to your responses, helping you refine your small-talk abilities.
ar: انخرط في محادثة غير رسمية مع غريب ودود في حدث اجتماعي. مثالي لممارسة كيفية كسر الجليد واستمرار المحادثة بشكل طبيعي. ## لماذا يجب عليك لعب *الدردشة القصيرة مع غريب* 1. تطوير الثقة لبدء المحادثات في بيئات اجتماعية غير مألوفة. 2. تعلم أساليب المحادثة غير الرسمية حول الطقس، والهوايات، أو الأحداث الأخيرة. 3. ممارسة كونك مستمعًا نشطًا والرد بجدية اهتمام. 4. التغلب على التوتر أو التردد من خلال التفاعل مع شريك AI داعم. 5. بناء مهارات التواصل اليومية المريحة التي يمكنك تطبيقها في أي مكان. ## كيف تعمل السيناريو في هذا السيناريو، ستتولى دور شخص يلتقي بمعارف جديدة في حدث اجتماعي. يتصرف الذكاء الاصطناعي كغريب ودود، محفزًا لك للتحدث حول مواضيع غير رسمية مثل الطقس أو الاهتمامات المشتركة. بينما تتبادلان المجاملات، سيتكيف الذكاء الاصطناعي مع ردودك، مما يساعدك على تحسين مهارات الدردشة القصيرة لديك.
be: Узявайце ўдзел у нефармальнай размове зь прыязным незнаёмцам на грамадскім заходзе. Працягваець відавочна для практыкі, як пачынаць размову і ўмацоўваць непрымусовы паток размовы. ## Чаму варта гуляць у *Незабавыя размовы са незнаёмцам* 1. Развівайце ўпэўненасць для начатку размоў у незнаёмых сацыяльных параметрах. 2. Увучыцеся адному з першых слоў пра непрацоўныя тэмы пагоды, хобі, ці нядаўніх падзеях. 3. Практыкуйцеся ў ролі актыўнага слухача і адказваць са сапраўдняй інтэрэс. 4. Адкладвайце нервознасць і нерашучасць, узаемадзейнічаючы з падтрымліваючым партнёрам- ШІ. 5. Стварыце ўмоўы для штодзённых навыкаў камунікацыі, якія можна выкарыстоўваць у любым месцы. ## Як працуе сцэнарый У гэтам сцэнарыі вы атрымаеце ролю чалавека, які знаёміцца з новым знаёмым на грамадскім заходзе. ШІ дзейнічае як прыязны незнаёмец, які прапаноўвае гаварыць пра непершыя тэмы, напрыклад, пра пагоду ці агульныя інтэрэсы. Падчас абміну віітуваннямі вялікі розум адаптуецца да вашых адказаў, дапамагаючы вам ўдасканаліць вашыя навыкі ў вядзенні беседы.
da: Engager dig i en uformel samtale med en venlig fremmed ved et socialt arrangement. Perfekt til at øve, hvordan man bryder isen og naturligt holder samtalen i gang. ## Hvorfor Du Skal Spille *Småsnak med en Fremmed* 1. Udvikl selvtillid til at starte samtaler i ukendte sociale settinger. 2. Lær uformelle samtalestartere om vejret, hobbyer eller nylige begivenheder. 3. Øv dig i at være en aktiv lytter og reagere med ægte interesse. 4. Overvind nervøsitet eller tøven ved at interagere med en støttende AI-partner. 5. Opbyg komfortable, dagligdags kommunikationsevner, du kan anvende overalt. ## Sådan Får Scenariet Til At Virke I dette scenarie træder du ind i rollen som en, der møder en ny bekendtskab ved et socialt arrangement. AI'en fungerer som en venlig fremmed, der opmuntrer dig til at tale om uformelle emner som vejret eller fælles interesser. Mens I udveksler venligheder, vil AI'en tilpasse sig dine svar og hjælpe dig med at forbedre dine småsnak færdigheder.
de: Engagieren Sie sich in ein zwangloses Gespräch mit einem freundlichen Fremden auf einer sozialen Veranstaltung. Perfekt, um zu üben, wie man das Eis bricht und das Gespräch natürlich am Laufen hält. ## Warum Sie *Kleine Gespräche mit einem Fremden* spielen sollten 1. Entwickeln Sie das Selbstbewusstsein, Gespräche in unbekannten sozialen Umgebungen zu beginnen. 2. Lernen Sie zwanglose Gesprächseinstiege über das Wetter, Hobbys oder aktuelle Ereignisse. 3. Üben Sie, aktiver Zuhörer zu sein und mit echtem Interesse zu antworten. 4. Überwinden Sie Nervosität oder Zögern, indem Sie mit einem unterstützenden KI-Partner interagieren. 5. Entwickeln Sie bequeme, alltägliche Kommunikationsfähigkeiten, die Sie überall anwenden können. ## So funktioniert das Szenario In diesem Szenario schlüpfen Sie in die Rolle von jemandem, der einen neuen Bekannten auf einer sozialen Veranstaltung trifft. Die KI agiert als freundlicher Fremder und fordert Sie auf, über zwanglose Themen wie das Wetter oder gemeinsame Interessen zu sprechen. Während Sie Höflichkeiten austauschen, wird die KI sich an Ihre Antworten anpassen und Ihnen helfen, Ihre Small-Talk-Fähigkeiten zu verfeinern.
es: Inicie una conversación informal con un extraño amigable en un evento social. Perfecto para practicar cómo romper el hielo y mantener la charla de manera natural. ## Por Qué Deberías Jugar *Conversaciones Informales con un Extraño* 1. Desarrolla la confianza para iniciar conversaciones en entornos sociales desconocidos. 2. Aprende iniciadores de conversación informales sobre el clima, pasatiempos o eventos recientes. 3. Practica ser un oyente activo y responder con interés genuino. 4. Supera la nerviosidad o la vacilación interactuando con un compañero de IA solidario. 5. Construye habilidades de comunicación cómodas y cotidianas que puedes aplicar en cualquier lugar. ## Cómo Funciona el Escenario En este escenario, asumirás el papel de alguien que conoce a un nuevo conocido en un evento social. La IA actúa como un extraño amigable, incitándote a hablar sobre temas informales como el clima o intereses compartidos. A medida que intercambias cumplidos, la IA se adaptará a tus respuestas, ayudándote a perfeccionar tus habilidades de conversación informal.
fr: Engagez-vous dans une conversation décontractée avec un étranger amical lors d'un événement social. Parfait pour s'entraîner à briser la glace et à maintenir la discussion de manière naturelle. ## Pourquoi vous devriez jouer à *Small Talk with a Stranger* 1. Développez la confiance pour engager des conversations dans des environnements sociaux inconnus. 2. Apprenez des amorces de conversation décontractées sur la météo, les hobbies ou les événements récents. 3. Pratiquez l'écoute active et répondez avec un intérêt sincère. 4. Surmontez la nervosité ou l'hésitation en interagissant avec un partenaire IA bienveillant. 5. Construisez des compétences en communication quotidiennes et confortables que vous pouvez appliquer partout. ## Comment le scénario fonctionne Dans ce scénario, vous prendrez le rôle de quelqu'un rencontrant une nouvelle connaissance lors d'un événement social. L'IA agit comme un étranger amical, vous incitant à parler de sujets décontractés comme la météo ou les intérêts communs. Au fur et à mesure que vous échangez des politesses, l'IA s'adaptera à vos réponses, vous aidant à affiner vos compétences en matière de petites conversations.
it: Partecipa a una conversazione informale con un estraneo amichevole a un evento sociale. Perfetto per esercitarsi a rompere il ghiaccio e mantenere la chiacchierata fluida in modo naturale. ## Perché dovresti giocare a *Small Talk with a Stranger* 1. Sviluppa la fiducia necessaria per avviare conversazioni in contesti sociali sconosciuti. 2. Impara a utilizzare avvii di conversazione informali riguardo al meteo, ai passatempi o agli eventi recenti. 3. Esercitati ad essere un ascoltatore attivo e a rispondere con interesse genuino. 4. Supera la nervosità o l'esitazione interagendo con un partner AI di supporto. 5. Costruisci capacità di comunicazione quotidiana e confortevole che puoi applicare ovunque. ## Come funziona lo scenario In questo scenario, assumerai il ruolo di qualcuno che incontra un nuovo conoscente a un evento sociale. L'AI agirà come un estraneo amichevole, invitandoti a parlare di argomenti informali come il meteo o interessi condivisi. Mentre scambiate cortesie, l'AI si adatterà alle tue risposte, aiutandoti a perfezionare le tue abilità di conversazione leggera.
ja: カジュアルな会話を楽しむために、社交イベントで友好的な見知らぬ人とお話ししましょう。アイスブレイクを上手に行い、自然に会話を続ける練習に最適です。 ## なぜ *見知らぬ人とのスモールトーク* をプレイすべきなのか 1. 知らない社交の場で会話を始める自信を育む。 2. 天気や趣味、最近の出来事についてのカジュアルな会話の始め方を学ぶ。 3. アクティブリスナーになり、興味を持って反応する練習をする。 4. 支持的なAIパートナーと対話しながら緊張やためらいを克服する。 5. どこでも応用できる、快適な日常のコミュニケーションスキルを身につける。 ## シナリオの進め方 このシナリオでは、社交イベントで新しい知り合いと出会った人の役割になります。AIは友好的な見知らぬ人として、天気や共通の興味などのカジュアルなトピックについて話すよう促します。挨拶を交わす中で、AIはあなたの反応に合わせて適応し、スモールトークの能力を高める手助けをします。
ms: Engage in a casual conversation with a friendly stranger at a social event. Perfect for practicing how to break the ice and keep the chat going naturally. ## Kenapa Anda Perlu Bermain *Perbualan Santai dengan Stranger* 1. Kembangkan keyakinan untuk memulakan perbualan dalam situasi sosial yang tidak dikenali. 2. Belajar pengenalan perbualan santai mengenai cuaca, hobi, atau acara terkini. 3. Amalkan menjadi pendengar aktif dan memberikan respons dengan minat yang tulen. 4. Atasi rasa gugup atau keraguan dengan berinteraksi dengan rakan AI yang menyokong. 5. Bangunkan kemahiran komunikasi harian yang selesa yang boleh anda gunakan di mana sahaja. ## Cara Senario Ini Berfungsi Dalam senario ini, anda akan memasuki peranan seseorang yang bertemu dengan kenalan baharu di sebuah acara sosial. AI bertindak sebagai stranger yang mesra, mendorong anda untuk bercakap tentang topik santai seperti cuaca atau minat bersama. Semasa anda bertukar-tukar ucapan, AI akan menyesuaikan diri dengan respons anda, membantu anda memperhalusi kemahiran perbualan kecil anda.
no: Engasjer deg i en uformell samtale med en vennlig fremmed på et sosialt arrangement. Perfekt for å øve på hvordan du kan bryte isen og holde samtalen i gang naturlig. ## Hvorfor du bør spille *Småprat med en fremmed* 1. Utvikle selvtillit til å starte samtaler i ukjente sosiale settinger. 2. Lære uformelle samtalestartere om været, hobbyer eller nylige hendelser. 3. Øve på å være en aktiv lytter og svare med ekte interesse. 4. Overvinne nervøsitet eller nøling ved å samhandle med en støttende AI-partner. 5. Bygge komfortable, hverdagslige kommunikasjonsevner du kan bruke hvor som helst. ## Hvordan scenariet fungerer I dette scenariet vil du tre inn i rollen som noen som møter en ny bekjent på et sosialt arrangement. AI-en fungerer som en vennlig fremmed og oppfordrer deg til å snakke om uformelle emner som været eller felles interesser. Mens dere bytter høfligheter, vil AI-en tilpasse seg svarene dine, og hjelpe deg med å forbedre småpratteferdighetene dine.
pl: Zaangażuj się w swobodną rozmowę z przyjaznym nieznajomym na wydarzeniu społecznym. Idealne do ćwiczenia, jak przełamać lody i naturalnie kontynuować rozmowę. ## Dlaczego warto zagrać w *Small Talk with a Stranger* 1. Rozwijaj pewność siebie w rozpoczynaniu rozmów w nieznanych sytuacjach społecznych. 2. Ucz się swobodnych rozpoczęć rozmowy na tematy dotyczące pogody, hobby lub ostatnich wydarzeń. 3. Ćwicz bycie aktywnym słuchaczem i odpowiadanie z autentycznym zainteresowaniem. 4. Pokonaj nerwowość lub wahanie, wchodząc w interakcję z wspierającym partnerem AI. 5. Buduj umiejętności komunikacyjne, które możesz zastosować wszędzie w codziennym życiu. ## Jak działa ta scenariusz W tym scenariuszu wcielisz się w kogoś, kto spotyka nowego znajomego na wydarzeniu społecznym. AI działa jako przyjazny nieznajomy, zachęcając cię do rozmowy o swobodnych tematach, takich jak pogoda czy wspólne zainteresowania. W miarę wymiany grzeczności AI dostosuje się do twoich odpowiedzi, pomagając ci udoskonalić umiejętności prowadzenia małej rozmowy.
pt: Engaje em uma conversa casual com um estranho amigável em um evento social. Perfeito para praticar como quebrar o gelo e manter a conversa fluindo naturalmente. ## Por Que Você Deveria Jogar *Conversa Casual com um Estranho* 1. Desenvolva a confiança para iniciar conversas em ambientes sociais desconhecidos. 2. Aprenda iniciadores de conversas casuais sobre o tempo, hobbies ou eventos recentes. 3. Pratique ser um ouvinte ativo e responder com interesse genuíno. 4. Supere a nervosidade ou hesitação interagindo com um parceiro de IA solidário. 5. Construa habilidades de comunicação confortáveis e cotidianas que você pode aplicar em qualquer lugar. ## Como o Cenário Funciona Neste cenário, você assumirá o papel de alguém conhecendo um novo conhecido em um evento social. A IA atua como um estranho amigável, incentivando você a falar sobre tópicos casuais como o tempo ou interesses compartilhados. À medida que você troca gentilezas, a IA se adaptará às suas respostas, ajudando você a aprimorar suas habilidades de conversa casual.
ru: Заведите непринужденную беседу с дружелюбным незнакомцем на социальном мероприятии. Идеально для практики, как начать разговор и поддерживать его естественно. ## Почему вам стоит сыграть *Небольшой разговор с незнакомцем* 1. Развийте уверенность в том, чтобы начинать разговоры в незнакомых социальных обстановках. 2. Узнайте непринужденные фразы для начала разговора о погоде, хобби или недавних событиях. 3. Практикуйтесь быть активным слушателем и отвечать с искренним интересом. 4. Преодолевая нервозность или колебания, взаимодействуйте с поддерживающим ИИ-партнером. 5. Развивайте комфортные, повседневные навыки общения, которые можно применять везде. ## Как работает сценарий В этом сценарии вы станете на место человека, встречающего нового знакомого на социальном мероприятии. ИИ выступает в роли дружелюбного незнакомца, предлагая вам говорить о непринужденных темах, таких как погода или общие интересы. Обмениваясь любезностями, ИИ будет адаптироваться к вашим ответам, помогая вам отточить навыки ведения небольшого разговора.
sv: Engagera dig i en avslappnad konversation med en vänlig främling på ett socialt evenemang. Perfekt för att öva på hur man bryter isen och håller samtalet på en naturlig nivå. ## Varför du bör spela *Small Talk with a Stranger* 1. Utveckla självförtroendet att inleda konversationer i obekanta sociala miljöer. 2. Lär dig avslappnade samtalsämnen om vädret, fritidsintressen eller nyliga händelser. 3. Öva på att vara en aktiv lyssnare och svara med äkta intresse. 4. Övervinna nervositet eller tvekan genom att interagera med en stödjande AI-partner. 5. Bygg upp bekväma, vardagliga kommunikationsfärdigheter som du kan använda överallt. ## Hur scenariot fungerar I detta scenario kommer du att ta rollen som någon som träffar en ny bekantskap på ett socialt evenemang. AI:n agerar som en vänlig främling och uppmuntrar dig att prata om avslappnade ämnen som väder eller gemensamma intressen. När ni utbyter artigheter kommer AI:n att anpassa sig efter dina svar och hjälpa dig att förbättra dina small-talk-färdigheter.
uk: Ведіть неформальну розмову з привітним незнайомцем на соціальному заході. Ідеально підходить для практики того, як розпочати розмову і плавно її підтримувати. ## Чому варто зіграти в *Малу розмову з незнайомцем* 1. Розвивайте впевненість у початку розмов у незнайомих соціальних обставинах. 2. Досліджуйте неформальні теми для розмов про погоду, хобі або нещодавні події. 3. Практикуйте навички активного слухання та реакції з щирим інтересом. 4. Подолайте нервозність чи вагання, взаємодіючи з підтримуючим партнером на базі ШІ. 5. Розвивайте комфортні, повсякденні комунікативні навички, які ви зможете застосувати де завгодно. ## Як працює сценарій У цьому сценарії ви візьмете на себе роль людини, яка знайомиться з новим знайомим на соціальному заході. ШІ діє як привітний незнайомець, заохочуючи вас говорити про неформальні теми, такі як погода або спільні інтереси. Поки ви обмінюєтеся ввічливими розмовами, ШІ адаптуватиметься до ваших відповідей, допомагаючи вам вдосконалити ваші навички малих розмов.
vi: Tham gia vào một cuộc trò chuyện thân mật với một người lạ thân thiện tại một sự kiện xã hội. Hoàn hảo để thực hành cách bắt chuyện và duy trì cuộc trò chuyện một cách tự nhiên. ## Tại Sao Bạn Nên Chơi *Nói Chuyện Nhỏ với Người Lạ* 1. Phát triển sự tự tin để bắt đầu các cuộc trò chuyện trong những tình huống xã hội không quen thuộc. 2. Học các câu mở đầu trò chuyện thân mật về thời tiết, sở thích hoặc các sự kiện gần đây. 3. Thực hành việc lắng nghe tích cực và phản hồi với sự quan tâm chân thành. 4. Vượt qua sự lo lắng hoặc do dự bằng cách tương tác với một đối tác AI hỗ trợ. 5. Xây dựng kỹ năng giao tiếp thoải mái, hàng ngày mà bạn có thể áp dụng ở bất kỳ đâu. ## Cách Kịch Bản Hoạt Động Trong kịch bản này, bạn sẽ vào vai người gặp một người quen mới tại một sự kiện xã hội. AI đóng vai người lạ thân thiện, gợi ý cho bạn nói về những chủ đề thân mật như thời tiết hoặc sở thích chung. Khi bạn trao đổi những câu xã giao, AI sẽ điều chỉnh theo phản hồi của bạn, giúp bạn hoàn thiện khả năng nói chuyện nhỏ của mình.

source: Engage in friendly small talk about pets and daily routines
ar: انخرط في حديث ودي صغير حول الحيوانات الأليفة والروتين اليومي
be: Займіцеся прыемнай паўдзённай балачкай пра домашніх пітамцаў і шкодных рутынах
da: Engager dig i venlig small talk om kæledyr og daglige rutiner
de: Führen Sie freundliche Smalltalk-Gespräche über Haustiere und tägliche Abläufe
es: Participa en una charla amistosa sobre mascotas y rutinas diarias
id: Terlibat dalam obrolan santai yang ramah tentang hewan peliharaan dan rutinitas sehari-hari
it: Impegnati in una conversazione amichevole sui capelli e le routine quotidiane
ja: ペットや日常のルーチンについてのフレンドリーなスモールトークに参加しましょう。
ms: Bercakap tentang haiwan peliharaan dan rutin harian secara santai dan mesra
no: Engasjer deg i vennlig småprat om kjæledyr og daglige rutiner
pl: Zainicjuj przyjazną rozmowę o zwierzętach i codziennych rutynach
pt: Engaje em uma conversa amigável sobre animais de estimação e rotinas diárias
ru: Завести дружеский разговор о домашних животных и повседневных делах
sv: Engagera dig i vänlig småprat om husdjur och dagliga rutiner
th: สนทนาสั้น ๆ อย่างเป็นมิตรเกี่ยวกับสัตว์เลี้ยงและกิจวัตรประจำวัน
tr: Evcil hayvanlar ve günlük rutinler hakkında dostane küçük sohbetlere katılın
uk: Ведіть дружню бесіду про домашніх тварин та повсякденні справи
vi: Tham gia vào cuộc trò chuyện thân thiện về thú cưng và thói quen hàng ngày

source: Engage in real-life conversations like job interviews or ordering food
ar: انخرط في محادثات الحياة الواقعية مثل مقابلات العمل أو طلب الطعام
be: Удзельнічайце ў размовах з рэальнага жыцця, такіх як працоўныя інтэрв'ю ці заказ ежы
da: Deltag i virkelige samtaler som jobsamtaler eller bestilling af mad
de: Beteiligen Sie sich an realen Gesprächen wie Vorstellungsgesprächen oder beim Bestellen von Essen
es: Involúcrate en conversaciones de la vida real como entrevistas de trabajo o pedir comida
fr: Participez à des conversations réelles comme des entretiens d'embauche ou des commandes de nourriture
id: Terlibat dalam percakapan kehidupan nyata seperti wawancara kerja atau memesan makanan
it: Impegnati in conversazioni reali come colloqui di lavoro o ordinare cibo
ja: 実際の会話に参加しましょう、例えば仕事の面接や食べ物の注文など。
ms: Libatkan dalam perbualan kehidupan sebenar seperti temu duga kerja atau memesan makanan
no: Engasjer deg i virkelige samtaler som jobbintervjuer eller bestilling av mat
pl: Angażuj się w rozmowy w prawdziwym życiu, takie jak rozmowy kwalifikacyjne lub zamawianie jedzenia
pt: Participe de conversas da vida real, como entrevistas de emprego ou pedidos de comida
ru: Занимайтесь реальными разговорами, такими как собеседования или заказ еды
sv: Engagera dig i verkliga samtal som jobbintervjuer eller beställa mat
th: มีส่วนร่วมในการสนทนาในชีวิตจริง เช่น สัมภาษณ์งานหรือสั่งอาหาร
tr: Gerçek yaşam konuşmalarına katılın, örneğin iş görüşmeleri veya yemek siparişi verme gibi
uk: Займайтеся реальними розмовами, такими як співбесіди на роботу або замовлення їжі
vi: Tham gia vào các cuộc trò chuyện thực tế như phỏng vấn xin việc hoặc đặt đồ ăn

source: Engineers confident in basics but improving architectural reasoning
ar: المهندسون واثقون في الأساسيات ولكنهم يحسنون التفكير المعماري
be: Інжынеры ўпэўнены ў асновах, але ўдасканальваюць архітэктурнае мысленне
da: Ingeniører er sikre i det grundlæggende, men forbedrer deres arkitektoniske ræsonnering
de: Ingenieure sind in den Grundlagen sicher, verbessern jedoch das architektonische Denken.
es: Ingenieros confiados en lo básico pero mejorando el razonamiento arquitectónico
fr: Les ingénieurs confiants dans les bases mais en amélioration du raisonnement architectural
id: Insinyur yakin pada dasar tetapi meningkatkan penalaran arsitektural
it: Ingegneri fiduciosi nelle basi ma migliorano il ragionamento architettonico
ja: 基礎に自信のあるエンジニアだが、アーキテクチャの論理に改善の余地あり
ms: Jurutera yakin dalam asas tetapi meningkatkan penaakulan seni bina
no: Ingeniører har tillit til det grunnleggende, men forbedrer den arkitektoniske resonneringen
pl: Inżynierowie pewni podstaw, ale poprawiający umiejętności w zakresie rozumowania architektonicznego
pt: Engenheiros confiantes nos fundamentos, mas melhorando o raciocínio arquitetônico
ru: Инженеры уверены в основах, но улучшают архитектурное мышление
sv: Ingenjörer är säkra på grunderna men förbättrar den arkitektoniska resonemangen
th: วิศวกรเชื่อมั่นในพื้นฐานแต่กำลังพัฒนาความสามารถในการให้เหตุผลทางสถาปัตยกรรม
tr: Temeller konusunda kendine güvenen mühendisler, ancak mimari akıl yürütmeyi geliştiriyorlar.
uk: Інженери впевнені в основах, проте покращують архітектурне мислення
vi: Kỹ sư tự tin về các kiến thức cơ bản nhưng đang cải thiện khả năng lập luận kiến trúc

source: Engineers interviewing for Senior, Lead, or Staff backend positions
ar: مهندسون يجرون مقابلات لوظائف خلفية عالية المستوى مثل كبير المهندسين، قائد الفريق، أو موظف ذو خبرة
be: Інжынеры, якія праходзяць сумоўе на пазіцыі старшага, вядучага або галоўнага backend-распрацоўніка
da: Ingeniører der interviewer til Senior, Lead eller Staff backend positioner
de: Ingenieure im Bewerbungsprozess für Positionen als Senior, Lead oder Staff im Backend-Bereich
es: Ingenieros entrevistándose para posiciones de backend Senior, Líder o Staff
fr: Ingénieurs passant des entretiens pour des postes backend de Senior, Leader ou Staff
id: Insinyur yang diwawancarai untuk posisi backend Senior, Lead, atau Staff
it: Ingegneri che si candidano per posizioni di backend Senior, Lead o Staff
ja: シニア、リード、またはスタッフのバックエンドポジションのエンジニアへのインタビュー
ms: Jurutera menemu bual untuk jawatan backend Senior, Lead, atau Staff
no: Ingeniører som intervjuer for senior, ledende eller stab backend-stillinger
pl: Inżynierowie ubiegający się o stanowiska starszego, lidera lub starszego pracownika działu backendu
pt: Engenheiros entrevistando para posições de backend Sênior, Líder ou Staff
ru: Инженеры проходят собеседование на должности старшего, ведущего или штатного специалиста по бэкенду
sv: Ingenjörer som intervjuar för seniora, ledande eller personalpositioner inom backend
th: วิศวกรที่กำลังสัมภาษณ์สำหรับตำแหน่งงานด้านหลังแบบอาวุโส ผู้นำ หรือทีมงาน
tr: Kıdemli, Lider veya Kıdemli Geliştirici backend pozisyonları için mülakata katılan mühendisler
uk: Інженери, які проходять співбесіду на старші, провідні або штатні позиції бекенд-розробників
vi: Kỹ sư phỏng vấn cho các vị trí backend Cấp cao, Trưởng nhóm hoặc Nhân viên
