Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: In this session, you'll answer questions designed for junior frontend roles. After responding, you'll receive feedback to help you improve your answers, confidence, and interview structure.
ar: في هذه الجلسة، ستجيب على أسئلة مصممة للأدوار التمهيدية في تطوير الواجهة الأمامية. بعد الرد، ستحصل على ملاحظات تساعدك على تحسين إجاباتك وثقتك وهيكل المقابلة.
be: У гэтай сесіі вы будзеце адказваць на пытанні, прызначаныя для роляў малодшых фронтэнд-распрацоўшчыкаў. Пасля адказу вы атрымаеце водгук, які дапаможа вам палепшыць вашы адказы, упэўненасць і структуру інтэрв'ю.
da: I denne session vil du besvare spørgsmål designet til junior frontend-roller. Efter at have svaret vil du modtage feedback for at hjælpe dig med at forbedre dine svar, selvtillid og interviewstruktur.
de: In dieser Sitzung wirst du Fragen beantworten, die für Junior Frontend-Rollen konzipiert sind. Nach der Beantwortung erhältst du Feedback, um deine Antworten, dein Selbstvertrauen und die Struktur deines Interviews zu verbessern.
es: En esta sesión, responderás preguntas diseñadas para roles junior de frontend. Después de responder, recibirás retroalimentación para ayudarte a mejorar tus respuestas, confianza y estructura de entrevista.
fr: Dans cette session, vous répondrez à des questions conçues pour des postes de débutant en frontend. Après avoir répondu, vous recevrez des commentaires pour vous aider à améliorer vos réponses, votre confiance et la structure de votre entretien.
id: Dalam sesi ini, Anda akan menjawab pertanyaan yang dirancang untuk peran frontend junior. Setelah merespons, Anda akan menerima umpan balik untuk membantu Anda meningkatkan jawaban Anda, kepercayaan diri, dan struktur wawancara.
it: In questa sessione, risponderai a domande progettate per ruoli junior di frontend. Dopo aver risposto, riceverai un feedback per aiutarti a migliorare le tue risposte, la fiducia e la struttura dell'intervista.
ja: このセッションでは、ジュニアフロントエンドの役割向けに設計された質問に答えます。回答後、あなたの回答や自信、面接構造を改善するのに役立つフィードバックを受け取ります。
no: I denne økten vil du svare på spørsmål designet for junior frontend roller. Etter å ha svart, vil du motta tilbakemeldinger for å hjelpe deg med å forbedre svarene dine, selvtilliten og intervjustrukturen.
pl: W tej sesji odpowiesz na pytania stworzone z myślą o rolach juniorskiego frontendowca. Po udzieleniu odpowiedzi otrzymasz informacje zwrotne, które pomogą Ci poprawić swoje odpowiedzi, pewność siebie oraz strukturę rozmowy kwalifikacyjnej.
pt: Nesta sessão, você responderá a perguntas projetadas para cargos de frontend júnior. Após responder, você receberá feedback para ajudá-lo a melhorar suas respostas, confiança e estrutura de entrevista.
ru: В этой сессии вы будете отвечать на вопросы, разработанные для младших ролей фронтенд-разработчиков. После ответа вы получите обратную связь, которая поможет вам улучшить свои ответы, уверенность и структуру интервью.
sv: I den här sessionen kommer du att besvara frågor utformade för junior frontend-roller. Efter att ha svarat kommer du att få feedback som hjälper dig att förbättra dina svar, ditt självförtroende och din intervjustruktur.
th: ในเซสชันนี้ คุณจะตอบคำถามที่ออกแบบมาสำหรับบทบาทระดับจูเนียร์ของตำแหน่งเฟรนต์เอนด์ หลังจากตอบสนองแล้ว คุณจะได้รับคำติชมเพื่อช่วยให้คุณปรับปรุงคำตอบ ความมั่นใจ และโครงสร้างการสัมภาษณ์ของคุณ
tr: Bu oturumda, junior frontend rolleri için tasarlanmış soruları yanıtlayacaksınız. Yanıtladıktan sonra, yanıtlarınızı, güveninizi ve görüşme yapınızı geliştirmenize yardımcı olacak bir geri bildirim alacaksınız.
uk: У цій сесії ви відповісте на запитання, призначені для молодших ролей фронтенд-розробників. Після відповідей ви отримаєте відгуки, які допоможуть вам покращити ваші відповіді, підвищити впевненість і структуру інтерв'ю.
vi: Trong buổi học này, bạn sẽ trả lời các câu hỏi được thiết kế cho các vai trò frontend cấp cơ bản. Sau khi trả lời, bạn sẽ nhận được phản hồi để giúp bạn cải thiện câu trả lời, sự tự tin và cấu trúc buổi phỏng vấn.

source: In this session, you'll answer questions designed for senior frontend roles. After responding, you'll receive feedback to help you refine your answers and improve your interview skills.
ar: في هذه الجلسة، ستقوم بالإجابة على أسئلة مصممة لأدوار الخبراء في تطوير الواجهة الأمامية. بعد الرد، ستحصل على ملاحظات لمساعدتك على تحسين إجاباتك وتطوير مهاراتك في المقابلات.
be: У гэтай сесіі вы адкажаце на пытанні, разлічаныя на ролі старшага фронтэнда. Пасля адказу вы атрымаеце водгук, які дапаможа вам удасканаліць вашы адказы і палепшыць навыкі сумоўя.
da: I denne session vil du besvare spørgsmål designet til senior frontend-roller. Efter at have svaret vil du modtage feedback for at hjælpe dig med at forfine dine svar og forbedre dine interviewfærdigheder.
de: In dieser Sitzung beantworten Sie Fragen, die für leitende Frontend-Positionen gestaltet sind. Nach der Beantwortung erhalten Sie Feedback, das Ihnen hilft, Ihre Antworten zu verfeinern und Ihre Interviewfähigkeiten zu verbessern.
es: En esta sesión, responderás preguntas diseñadas para roles de frontend senior. Después de responder, recibirás comentarios para ayudarte a refinar tus respuestas y mejorar tus habilidades en entrevistas.
fr: Dans cette session, vous répondrez à des questions conçues pour des rôles seniors en développement frontend. Après avoir répondu, vous recevrez des retours pour vous aider à affiner vos réponses et améliorer vos compétences en entretien.
id: Dalam sesi ini, Anda akan menjawab pertanyaan yang dirancang untuk peran frontend senior. Setelah merespons, Anda akan menerima umpan balik untuk membantu Anda menyempurnakan jawaban Anda dan meningkatkan keterampilan wawancara Anda.
it: In questa sessione, risponderai a domande progettate per ruoli senior di frontend. Dopo aver risposto, riceverai feedback per aiutarti a perfezionare le tue risposte e migliorare le tue competenze per i colloqui.
ja: このセッションでは、シニアフロントエンドの役割のために設計された質問に答えていただきます。回答の後、フィードバックを受け取り、回答を洗練し、面接スキルを向上させるのに役立てていただきます。
ms: Dalam sesi ini, anda akan menjawab soalan-soalan yang direka untuk peranan frontend senior. Selepas menjawab, anda akan menerima maklum balas untuk membantu anda memperbaiki jawapan anda dan meningkatkan kemahiran temuduga anda.
no: I denne økten vil du svare på spørsmål laget for senior frontend-roller. Etter å ha svart, vil du motta tilbakemelding som hjelper deg med å forbedre svarene dine og forbedre intervjuevnene dine.
pl: W tej sesji będziesz odpowiadać na pytania zaprojektowane dla starszych ról frontendowych. Po udzieleniu odpowiedzi otrzymasz informację zwrotną, która pomoże ci udoskonalić odpowiedzi i poprawić umiejętności związane z rozmowami kwalifikacyjnymi.
pt: Nesta sessão, você responderá a perguntas elaboradas para cargos seniores de frontend. Após responder, você receberá um feedback para ajudá-lo a refinar suas respostas e melhorar suas habilidades de entrevista.
ru: В этом сеансе вы ответите на вопросы, предназначенные для старших ролей фронтенд-разработчиков. После ответа вы получите обратную связь, которая поможет вам улучшить ваши ответы и развить навыки прохождения собеседований.
sv: I den här sessionen kommer du att svara på frågor som är utformade för seniora frontendroller. Efter att ha svarat kommer du att få feedback som hjälper dig att finslipa dina svar och förbättra dina intervjufärdigheter.
th: ในเซสชันนี้ คุณจะต้องตอบคำถามที่ออกแบบมาสำหรับตำแหน่งอาวุโสในด้านการพัฒนาฝั่งหน้าของเว็บไซต์ หลังจากตอบคำถาม คุณจะได้รับข้อเสนอแนะเพื่อช่วยให้คุณปรับปรุงคำตอบและพัฒนาทักษะการสัมภาษณ์ของคุณ
tr: Bu oturumda, üst düzey frontend pozisyonları için tasarlanmış soruları yanıtlayacaksınız. Yanıt verdikten sonra, cevaplarınızı geliştirmenize ve mülakat becerilerinizi artırmanıza yardımcı olacak geri bildirim alacaksınız.
uk: У цій сесії ви відповідатимете на запитання, розроблені для старших фронтенд-ролей. Після надання відповідей ви отримаєте зворотний зв'язок, який допоможе вам вдосконалити свої відповіді та покращити навички проходження інтерв'ю.
vi: Trong phiên này, bạn sẽ trả lời các câu hỏi được thiết kế cho các vị trí phát triển frontend cao cấp. Sau khi trả lời, bạn sẽ nhận được phản hồi để giúp bạn chỉnh sửa câu trả lời của mình và cải thiện kỹ năng phỏng vấn.
