Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Show knowledge of the company and genuine interest. For example:
ar: اظهر معرفة بالشركة واهتمام حقيقي. على سبيل المثال:
be: Паказвайце веды пра кампанію і сапраўдны інтарэс. Напрыклад:
da: Vis viden om firmaet og ægte interesse. For eksempel:
de: Zeigen Sie Kenntnisse über das Unternehmen und echtes Interesse. Zum Beispiel:
es: Muestre conocimiento de la empresa e interés genuino. Por ejemplo:
fr: Montrez votre connaissance de l'entreprise et un intérêt sincère. Par exemple:
id: Tunjukkan pengetahuan tentang perusahaan dan minat yang tulus. Misalnya:
it: Mostra conoscenza dell'azienda e interesse genuino. Ad esempio:
ja: 会社についての知識を示し、真剣な関心を持つこと。例えば：
ms: Tunjukkan pengetahuan tentang syarikat dan minat yang sebenar. Sebagai contoh:
no: Vis kunnskap om selskapet og ekte interesse. For eksempel:
pl: Pokaż wiedzę na temat firmy i autentyczne zainteresowanie. Na przykład:
pt: Mostre conhecimento sobre a empresa e interesse genuíno. Por exemplo:
ru: Показывайте знание компании и искренний интерес. Например:
sv: Visa kunskap om företaget och äkta intresse. Till exempel:
th: แสดงความรู้เกี่ยวกับบริษัทและความสนใจที่แท้จริง. ยกตัวอย่างเช่น:
tr: Şirket hakkındaki bilgilerinizi gösterin ve samimi bir ilgi gösterin. Örneğin:
uk: Показуйте знання компанії та щиру зацікавленість. Наприклад:
vi: Hiển thị kiến thức về công ty và sự quan tâm chân thành. Ví dụ:

source: Show less
ar: عرض أقل
be: Паказаць менш
da: Vis mindre
de: Weniger anzeigen
es: Mostrar menos
fr: Afficher moins
id: Tampilkan lebih sedikit
it: Mostra meno
ja: 表示を減らす
ms: Tunjukkan kurang
no: Vis mindre
pl: Pokaż mniej
pt: Mostrar menos
ru: Показать меньше
sv: Visa mindre
th: แสดงน้อยลง
tr: Daha az göster
uk: Показати менше
vi: Hiển thị ít hơn

source: Show more
ar: أظهر المزيد
be: Паказаць больш
da: Vis flere
de: Mehr anzeigen
es: Mostrar más
fr: Montre plus
id: Tampilkan lebih banyak
it: Mostra di più
ja: もっと表示
ms: Tunjukkan lebih banyak
no: Vis mer
pl: Pokaż więcej
pt: Mostrar mais
ru: Показать больше
sv: Visa mer
th: แสดงเพิ่มเติม
tr: Daha fazla göster
uk: Показати більше
vi: Hiển thị thêm

source: Show More
ar: عرض المزيد
be: Паказаць больш
da: Vis Mere
de: Mehr Anzeigen
es: Mostrar más
fr: Afficher plus
id: Tampilkan Lebih
it: Mostra di più
ja: もっと表示する
no: Vis mer
pl: Pokaż więcej
pt: Mostrar Mais
ru: Показать больше
sv: Visa Mer
th: แสดงเพิ่มเติม
tr: Daha Fazla Göster
uk: Показати більше
vi: Hiển thị thêm

source: Show more lessons
ar: عرض المزيد من الدروس
be: Паказаць больш урокаў
da: Vis flere lektioner
de: Mehr Lektionen anzeigen
es: Mostrar más lecciones
fr: Afficher plus de leçons
id: Tampilkan lebih banyak pelajaran
it: Mostra più lezioni
ja: レッスンをもっと表示
no: Vis flere leksjoner
pl: Pokaż więcej lekcji
pt: Mostrar mais lições
ru: Показать больше уроков
sv: Visa fler lektioner
th: แสดงบทเรียนเพิ่มเติม
tr: Daha fazla ders göster
uk: Показати більше уроків
vi: Hiển thị thêm bài học

source: Show previous
id: Tampilkan sebelumnya
it: Mostra precedente
ja: 前のものを表示
no: Vis forrige
pl: Pokaż poprzednie
ru: Показать предыдущие
sv: Visa föregående
uk: Показати попередні

source: Show problem-solving skills
ar: أظهر مهارات حل المشكلات
be: Пакажыце навыкі рашэння праблем
da: Vis problemløsningsfærdigheder
de: Zeigen Sie Problemlösungsfähigkeiten
es: Mostrar habilidades para resolver problemas
fr: Afficher des compétences en résolution de problèmes
id: Tunjukkan keterampilan memecahkan masalah
it: Mostra abilità di problem solving
ja: 問題解決能力を示す
no: Vis evner til problemløsning
pl: Pokaż umiejętności rozwiązywania problemów
pt: Mostrar habilidades de resolução de problemas
ru: Показать навыки решения проблем
sv: Visa problemlösningsförmåga
th: แสดงทักษะการแก้ปัญหา
tr: Problem çözme becerilerini göster
uk: Покажіть навички вирішення проблем
vi: Thể hiện kỹ năng giải quyết vấn đề

source: Show strong data fundamentals
ar: أظهر أسسًا قوية للبيانات
be: Паказаць трывалую базу даных
da: Vis stærke datagrundlag
de: Zeigen Sie starke Datenfundamente
es: Mostrar fundamentos fuertes de datos
fr: Montrez de solides bases en matière de données
id: Tunjukkan dasar-dasar data yang kuat
it: Mostra solide basi di dati
ja: データ基盤を強化することを示す
ms: Tunjukkan asas data yang kukuh
no: Vis sterke datafundamenter
pl: Pokaż silne podstawy danych
pt: Mostre fundamentos sólidos de dados
ru: Показать прочные основы данных
sv: Visa starka datafundament
th: แสดงพื้นฐานข้อมูลที่แข็งแกร่ง
tr: Güçlü veri temellerini göster
uk: Покажіть сильні основи даних
vi: Hiển thị các nền tảng dữ liệu vững chắc

source: Show your long-term goals:
ar: أظهر أهدافك طويلة الأمد:
be: Пакажыце свае даўгатэрміновыя мэты:
da: Vis dine langsigtede mål:
de: Zeigen Sie Ihre langfristigen Ziele:
es: Muestra tus objetivos a largo plazo:
fr: Montrez vos objectifs à long terme:
id: Tunjukkan tujuan jangka panjang Anda:
it: Mostra i tuoi obiettivi a lungo termine:
ja: あなたの長期的な目標を示してください:
ms: Tunjukkan matlamat jangka panjang anda:
no: Vis dine langsiktige mål:
pl: Pokaż swoje długoterminowe cele:
pt: Mostre seus objetivos de longo prazo:
ru: Покажите свои долгосрочные цели:
sv: Visa dina långsiktiga mål:
th: แสดงเป้าหมายระยะยาวของคุณ:
tr: Uzun vadeli hedeflerinizi gösterin:
uk: Показуйте свої довготривалі цілі:
vi: Hiển thị mục tiêu dài hạn của bạn:

source: Showcase system design thinking
ar: اعرض التفكير في تصميم النظام
be: Паказваць мысленне ў дызайне сістэмы
da: Fokus på systemets designfilosofi
de: Entwurfsgedanken zum Systementwurf präsentieren
es: Muestra el pensamiento de diseño del sistema
fr: Présenter la pensée de conception de système
id: Memamerkan pemikiran desain sistem
it: Mostra il pensiero di progettazione del sistema
ja: システムデザイン思考を示す
ms: Pamerkan pemikiran reka bentuk sistem
no: Vis systemdesigntenkning
pl: Zaprojektuj system myślenia
pt: Mostre o pensamento de design de sistema
ru: Демонстрация проектного мышления системы
sv: Visa systemdesign-tänkande
th: แสดงระบบการออกแบบความคิด
tr: Sistem tasarım düşüncesini sergileyin
uk: Продемонструйте системний дизайн-мислення
vi: Trình bày tư duy thiết kế hệ thống

source: Showing no interest — Ask questions and react positively to company information.
ar: عرض عدم الاهتمام — قم بطرح الأسئلة ورد بشكل إيجابي على معلومات الشركة.
be: Паказваць няма зацікавлення — Задавайце пытанні і рэагуйце пазітыўна на інфармацыю кампаніі.
da: Viser ingen interesse — Stil spørgsmål og reager positivt på firmaoplysninger.
de: Interesse zeigen — Stellen Sie Fragen und reagieren Sie positiv auf Unternehmensinformationen.
es: Mostrando ningún interés — Haz preguntas y reacciona positivamente a la información de la empresa.
fr: Montrant aucun intérêt — Posez des questions et réagissez positivement aux informations de l'entreprise.
id: Menunjukkan tidak ada minat — Ajukan pertanyaan dan reaksi positif terhadap informasi perusahaan.
it: Mostrando nessun interesse — Fai domande e reagisci positivamente alle informazioni dell'azienda.
ja: 興味がないように見える - 企業情報に対して質問をし、積極的に反応します。
ms: Menunjukkan tiada minat — Ajukan soalan dan beri reaksi positif terhadap maklumat syarikat.
no: Viser ingen interesse — Still spørsmål og reager positivt på firmaopplysninger.
pl: Nie wykazując zainteresowania — Zadawaj pytania i reaguj pozytywnie na informacje o firmie.
pt: Mostrando nenhum interesse — Faça perguntas e reaja positivamente às informações da empresa.
ru: Показывать отсутствие интереса — задавайте вопросы и реагируйте положительно на информацию о компании.
sv: Visar inget intresse — Ställ frågor och reagera positivt på företagsinformation.
th: แสดงว่าไม่มีความสนใจ — ถามคำถามและตอบสนองอย่างเชิงบวกต่อข้อมูลของบริษัท
tr: İlgisiz görünüyor — Şirket bilgilerine olumlu tepkiler verin ve sorular sorun.
uk: Не проявляє інтересу — Задавайте питання та реагуйте позитивно на інформацію компанії.
vi: Không thể hiện hứng thú — Hãy đặt câu hỏi và phản hồi tích cực với thông tin của công ty.

source: Sign In
ar: تسجيل الدخول
be: Увайсці
da: Log Ind
de: Anmelden
es: Iniciar sesión
fr: Se Connecter
id: Masuk
it: Accedi
ja: サインイン
ms: Log Masuk
no: Logg Inn
pl: Zaloguj się
pt: Entrar
ru: Войти
sv: Logga in
th: เข้าสู่ระบบ
tr: Oturum Aç
uk: Увійти
vi: Đăng Nhập

source: Sign in with email
ar: تسجيل الدخول باستخدام البريد الإلكتروني
be: plaintext Увайсці з дапамогай электроннай пошты
da: Log ind med e-mail
de: Mit E-Mail anmelden
es: Iniciar sesión con correo electrónico
fr: Se connecter avec email
id: Masuk dengan email
it: Accedi con email
ja: メールでサインイン
no: Logg inn med e-post
pl: Zaloguj się za pomocą e-maila
pt: plaintext Entrar com e-mail
ru: Войти с помощью электронной почты
sv: Logga in med e-post
th: ลงชื่อเข้าใช้งานด้วยอีเมล
tr: E-posta ile giriş yap
uk: Увійти за допомогою електронної пошти
vi: Đăng nhập bằng email

source: Sign in with Google
ar: تسجيل الدخول باستخدام جوجل
be: Увайсці з Google
da: Log ind med Google
de: Mit Google anmelden
es: Iniciar sesión con Google
fr: Se connecter avec Google
id: Masuk dengan Google
it: Accedi con Google
ja: plaintext Googleでサインイン
ms: Log masuk dengan Google
no: Logg inn med Google
pl: Zaloguj się przez Google
pt: Entre com o Google
ru: Войти через Google
sv: Logga in med Google
th: ลงชื่อเข้าใช้ด้วย Google
tr: Google ile giriş yap
uk: Увійти через Google
vi: Đăng nhập bằng Google

source: Simple
id: Sederhana
it: Semplice
ja: シンプル
no: Enkel
ru: Простой
uk: Простий

source: Simple & Effective
ar: بسيط وفعال
be: Просты & Эфектыўны
da: Enkel & Effektiv
de: Einfach & Effektiv
es: Simple y Efectivo
fr: Simple & Efficace
id: Sederhana & Efektif
it: Semplice & Efficace
ja: シンプル & 効果的
no: Enkel & Effektiv
pl: Proste i Efektywne
pt: Simples e Eficaz
ru: Простой и эффективный
sv: Enkelt & Effektivt
th: เรียบง่าย & มีประสิทธิภาพ
tr: Basit ve Etkili
uk: Простий та ефективний
vi: plaintext Đơn giản & Hiệu quả

source: Simple steps to get the app for free.
ar: خطوات بسيطة للحصول على التطبيق مجانًا.
be: Простыя крокі, каб атрымаць дадатак бясплатна.
da: Enkle trin for at få appen gratis.
de: Einfache Schritte, um die App kostenlos zu erhalten.
es: Pasos simples para obtener la aplicación gratis.
fr: Étapes simples pour obtenir l'application gratuitement.
id: Langkah-langkah sederhana untuk mendapatkan aplikasi secara gratis.
it: Passaggi semplici per ottenere l'app gratuitamente.
ja: 無料でアプリを入手する簡単な手順。
no: Enkle trinn for å få appen gratis.
pl: Proste kroki, aby pobrać aplikację za darmo.
pt: Passos simples para obter o aplicativo gratuitamente.
ru: Простые шаги, чтобы получить приложение бесплатно.
sv: Enkla steg för att få appen gratis.
th: ขั้นตอนง่ายๆ ในการรับแอปฟรี
tr: Ücretsiz uygulamayı edinmek için basit adımlar.
uk: Прості кроки, щоб отримати додаток безкоштовно.
vi: Các bước đơn giản để tải ứng dụng miễn phí.

source: Simulate real frontend interviews and practice explaining your decisions under pressure — without risking a real offer.
ar: حاكي مقابلات الفرونت إند الحقيقية ومارس توضيح قراراتك تحت الضغط — دون المخاطرة بعرض حقيقي.
be: Сімілюйце сапраўдныя інтэрв'ю на пярэднім канцы і практыкуйце тлумачэнне вашых рашэнняў пад ціскам — без рызыкі страціць сапраўдную прапанову.
da: Simuler rigtige frontend-interviews og øv dig i at forklare dine beslutninger under pres - uden at risikere et rigtigt tilbud.
de: Simulieren Sie echte Frontend-Interviews und üben Sie, Ihre Entscheidungen unter Druck zu erklären – ohne ein echtes Angebot zu riskieren.
es: Simula entrevistas reales de frontend y practica explicando tus decisiones bajo presión, sin arriesgar una oferta real.
fr: Simulez de véritables entretiens front-end et entraînez-vous à expliquer vos décisions sous pression — sans risquer une offre réelle.
id: Simulasikan wawancara frontend yang sesungguhnya dan latih keterampilan menjelaskan keputusan Anda di bawah tekanan — tanpa mempertaruhkan tawaran yang sebenarnya.
it: Simula interviste reali per sviluppatori frontend e pratica spiegando le tue decisioni sotto pressione — senza rischiare un'offerta reale.
ja: 実際のフロントエンド面接をシミュレートし、実際のオファーを危険にさらすことなく、プレッシャーの中で自分の決定を説明する練習をしましょう。
no: Simuler ekte frontend-intervjuer og øv på å forklare beslutningene dine under press — uten å risikere et reelt tilbud.
pl: Symuluj rzeczywiste rozmowy kwalifikacyjne na stanowiska frontendowe i ćwicz wyjaśnianie swoich decyzji pod presją — bez ryzyka utraty prawdziwej oferty.
pt: Simule entrevistas reais de frontend e pratique explicando suas decisões sob pressão — sem arriscar uma oferta real.
ru: Симулируйте реальные собеседования на фронтенд-разработчика и практикуйтесь в объяснении своих решений под давлением — не рискуя настоящим предложением.
sv: Simulera verkliga frontend-intervjuer och öva på att förklara dina beslut under press — utan att riskera ett riktigt erbjudande.
th: จำลองการสัมภาษณ์งานด้านส่วนติดต่อผู้ใช้จริงและฝึกฝนอธิบายเหตุผลในการตัดสินใจของคุณภายใต้ความกดดัน — โดยไม่ต้องเสี่ยงต่อการเสียโอกาสที่แท้จริง
tr: Gerçek ön uç görüşmelerini simüle edin ve gerçek bir teklifi riske atmadan baskı altında kararlarınızı açıklama pratiği yapın.
uk: Симулюйте реальні співбесіди на фронтенд-розробника та практикуйте пояснення своїх рішень під тиском — без ризику для реальної пропозиції.
vi: Mô phỏng các cuộc phỏng vấn frontend thực sự và thực hành giải thích các quyết định của bạn dưới áp lực — mà không gặp rủi ro với một đề nghị thực sự.

source: Simulate real senior frontend interviews and practice explaining your decisions under pressure — without risking a real offer.
ar: قم بمحاكاة مقابلات كبار المطورين واجهة المستخدم الأمامية (Frontend) الحقيقية وتدرب على شرح قراراتك تحت الضغط — بدون المخاطرة بعرض حقيقي.
be: Сімулюйце рэальныя інтэрв'ю на пасаду старэйшага фронтэнд-распрацоўніка і практыкуйцеся ў тлумачэнні сваіх рашэнняў пад ціскам — не рызыкуючы рэальнай прапановай.
da: Simuler ægte frontend-interviews på seniorniveau og øv dig i at forklare dine beslutninger under pres — uden at risikere et reelt tilbud.
de: Simulieren Sie echte Senior-Frontend-Interviews und üben Sie, Ihre Entscheidungen unter Druck zu erklären - ohne ein echtes Angebot zu riskieren.
es: Simula entrevistas reales de frontend senior y practica explicando tus decisiones bajo presión — sin arriesgar una oferta real.
fr: Simulez de véritables entretiens frontend seniors et entraînez-vous à expliquer vos décisions sous pression — sans risquer une offre réelle.
id: Simulasikan wawancara frontend senior yang sebenarnya dan latih menjelaskan keputusan Anda di bawah tekanan — tanpa mempertaruhkan tawaran nyata.
it: Simula veri colloqui per sviluppatori frontend senior e pratica a spiegare le tue decisioni sotto pressione, senza rischiare un'offerta reale.
ja: 本物の上級フロントエンド面接をシミュレーションし、実際のオファーを危険にさらすことなく、プレッシャーの中で自分の決定を説明する練習をしましょう。
no: Simuler ekte senior frontend-intervjuer og øv deg på å forklare dine beslutninger under press — uten å risikere et reelt tilbud.
pl: Symuluj prawdziwe rozmowy kwalifikacyjne na starszego frontend developera i ćwicz wyjaśnianie swoich decyzji pod presją — bez ryzyka utraty prawdziwej oferty.
pt: Simule entrevistas reais de frontend sênior e pratique explicar suas decisões sob pressão — sem arriscar uma oferta real.
ru: Симулируйте реальные собеседования на должность старшего фронтенд-разработчика и практикуйте объяснение своих решений под давлением — без риска для реального предложения.
sv: Simulera riktiga senior frontend-intervjuer och öva på att förklara dina beslut under press — utan att riskera ett riktigt erbjudande.
th: จำลองการสัมภาษณ์งานจริงของนักพัฒนาซอฟต์แวร์อาวุโสด้านส่วนหน้าพร้อมฝึกฝนการอธิบายการตัดสินใจของคุณภายใต้แรงกดดันโดยไม่เสี่ยงต่อข้อเสนอที่แท้จริง
tr: Gerçek kıdemli frontend mülakatlarını simüle edin ve kararlarınızı baskı altında açıklama pratiği yapın — gerçek bir teklifi riske atmadan.
uk: Симулюйте реальні співбесіди на вакансії старшого фронтенд-розробника та практикуйтеся пояснювати свої рішення під тиском — не ризикуючи реальною пропозицією.
vi: Mô phỏng các buổi phỏng vấn front-end cao cấp thực sự và luyện tập giải thích các quyết định của bạn dưới áp lực — mà không phải mạo hiểm với một lời đề nghị thực.

source: Simulate speaking tasks from the TOEFL exam.
ar: محاكاة مهام الكلام من امتحان TOEFL.
be: Сімуляцыя размовных заданняў з экзамену TOEFL.
da: Simuler taleopgaver fra TOEFL-eksamen.
de: Simulieren Sie Sprechaufgaben aus dem TOEFL-Examen.
es: Simula tareas de habla del examen TOEFL.
fr: Simulez les tâches de discours de l'examen TOEFL.
id: Simulasikan tugas berbicara dari ujian TOEFL.
it: Simula le attività di speaking dall'esame TOEFL.
ja: TOEFL試験のスピーキングタスクをシミュレートします。
ms: Simulasikan tugas berbicara dari peperiksaan TOEFL.
no: Simuler taleoppgaver fra TOEFL-eksamen.
pl: Symuluj zadania mówione z egzaminu TOEFL.
pt: Simule tarefas de fala do exame TOEFL.
ru: Имитируйте задания на говорение из экзамена TOEFL.
sv: Simulera taluppgifter från TOEFL-provet.
th: จำลองการทำงานพูดจากสอบ TOEFL.
tr: TOEFL sınavından konuşma görevlerini simüle edin.
uk: Симулюйте завдання зі структурованого висловлювання від іспиту TOEFL.
vi: Mô phỏng các tác vụ nói từ bài thi TOEFL.

source: Sing in
ar: تسجيل الدخول
be: Увайсці
da: Log ind
de: Anmelden
es: Iniciar sesión
fr: Se connecter
id: Masuk
it: Accedi
ja: サインイン
ms: Masuk
no: Logg inn
pl: Zaloguj się
pt: Entrar
ru: Войти
sv: Logga in
th: เข้าสู่ระบบ
tr: Giriş Yap
uk: Увійти
vi: Đăng nhập

source: Single player mode with AI
id: Mode pemain tunggal dengan AI
it: Modalità giocatore singolo con AI
ja: AIとのシングルプレイヤーモード
no: Enkeltspillermodus med AI
ru: Режим одиночной игры с ИИ
uk: Однокористувацький режим з ШІ

source: Sketch a simple microservice architecture with API gateway, auth, services, and async communication.
ar: ارسم بنية خدمة ميكرو بسيطة مع بوابة API، المصادقة، الخدمات، والاتصال غير المتزامن.
be: Нарыхтуйце простую архітэктуру мікрасэрвісаў з шлюзам API, аўтэнтыфікацыяй, сэрвісамі і асінхроннай камунікацыяй.
da: Skitsér en simpel mikroservice-arkitektur med API-gateway, auth, tjenester og asynkron kommunikation.
de: Entwerfen Sie eine einfache Microservice-Architektur mit API-Gateway, Authentifizierung, Diensten und asynchroner Kommunikation.
es: Esquema de una arquitectura de microservicios simple con puerta de enlace API, autenticación, servicios y comunicación asíncrona.
fr: Dessinez une architecture de microservice simple avec passerelle API, authentification, services, et communication asynchrone.
id: Gambarlah arsitektur mikrolayanan sederhana dengan API gateway, otentikasi, layanan, dan komunikasi asinkron.
it: Schizza un'architettura semplice di microservizi con gateway API, autenticazione, servizi e comunicazione asincrona.
ja: マイクロサービスアーキテクチャの簡単なスケッチを描く。APIゲートウェイ、認証、サービス、および非同期通信を含める。
ms: Rangka lakar seni bina perkhidmatan mikro yang ringkas dengan pintu masuk API, pengesahan, perkhidmatan, dan komunikasi tak segerak.
no: Skisser en enkel mikrotjenestearkitektur med API-gateway, autentisering, tjenester og asynkron kommunikasjon.
pl: Narysuj prostą architekturę mikrousług z bramą API, uwierzytelnianiem, usługami i komunikacją asynchroniczną.
pt: Esboce uma arquitetura simples de microsserviços com gateway de API, autenticação, serviços e comunicação assíncrona.
ru: Набросайте простую архитектуру микросервисов с API-шлюзом, аутентификацией, сервисами и асинхронной коммуникацией.
sv: Skriv en enkel mikrotjänstarkitektur med API-gateway, autentisering, tjänster och asynkron kommunikation.
th: ร่างสถาปัตยกรรมไมโครเซอร์วิสแบบง่ายพร้อมเกตเวย์ API, การยืนยันตัวตน, บริการ, และการสื่อสารแบบอะซิงโครนัส
tr: API Gateway, kimlik doğrulama, servisler ve asenkron iletişim ile basit bir mikroservis mimarisi çizin.
uk: Намалюйте просту архітектуру мікросервісів з API шлюзом, аутентифікацією, сервісами та асинхронним зв’язком.
vi: Vẽ một kiến trúc microservice đơn giản với API gateway, xác thực, dịch vụ, và giao tiếp không đồng bộ.

source: Skip
ar: تخطي
be: Прапусціць
de: Überspringen
es: Saltar
fr: Passer
it: Salta
ja: スキップ
pl: Przeskocz
pt: Pular
ru: Пропустить
th: ข้าม
tr: Atla
uk: Пропустити
vi: Bỏ qua

source: Skip all
id: Lewati semua
it: Salta tutto
ja: すべてスキップ
no: Hopp over alle
pl: Pomiń wszystko
ru: Пропустить все
sv: Hoppa över alla
uk: Пропустити все

source: Skip for now
ar: تخطي في الوقت الحالي
be: Прапусціць пакуль
da: Spring over for nu
de: Überspringen für jetzt
es: Saltar por ahora
fr: Passer pour l'instant
id: Lewati untuk sekarang
it: Salta per ora
ja: 今はスキップ
no: Hopp over for nå
pl: Pomiń na razie
pt: Pular por enquanto
ru: Пропустить сейчас
sv: Hoppa över för nuvarande
th: ข้ามไปก่อน
tr: Şimdilik atla
uk: Пропустити наразі
vi: Bỏ qua bây giờ

source: Skipped
id: Lewati
it: Saltato
ja: スキップ済み
no: Hoppet over
ru: Пропущено
uk: Пропущено

source: Skipping small talk — Follow the interviewer’s lead and be friendly.
ar: تجنب الحديث الفرعي - اتبع قيادة المقابل وكن ودودا.
be: Прапусціць незначныя размовы — Следуйце за кіраўніцтвам інтэрв'юэра і будзьце прыязнымі.
da: Spring småsnakken over — Følg intervieweren's anvisninger og vær venlig.
de: Kleinen Plausch überspringen — Folgen Sie der Führung des Interviewers und seien Sie freundlich.
es: Saltándose las formalidades — Siga la guía del entrevistador y sea amigable.
fr: Passer les banalités — Suivez l'exemple de l'intervieweur et soyez amical.
id: Melewatkan pembicaraan kecil — Ikuti petunjuk pewawancara dan bersikap ramah.
it: Saltando le chiacchiere — Segui la guida dell'intervistatore e sii amichevole.
ja: 余計な世間話をスキップ — 面接官のリードに従って、フレンドリーに振る舞ってください。
ms: Mengelakkan perbualan ringan — Ikuti aluan pemeriksa dan bersikap mesra.
no: Hopper over småprat — Følg intervjuerens ledelse og vær vennlig.
pl: Pomijanie drobnej rozmowy — Podążaj za wskazówkami rozmówcy i bądź przyjazny.
pt: Pulando a conversa fiada — Siga a liderança do entrevistador e seja amigável.
ru: Пропуская пустые разговоры — Следуйте за интервьюером и будьте дружелюбными.
sv: Hoppa över småprat — Följ intervjuarens ledning och var vänlig.
th: ข้ามการพูดคุยเล็กน้อย — ปฏิบัติตามผู้สัมภาษณ์และเป็นกันเอง
tr: Küçük sohbetleri atlayın - Mülakatçının yönlendirmelerini takip edin ve samimi olun.
uk: Пропускаємо невимушені розмови — слідкуйте за ініціативою інтерв'юера та будьте дружелюбними.
vi: Bỏ qua phần nói chuyện phiếm — Theo sự hướng dẫn của người phỏng vấn và hãy thân thiện.

source: Slow
id: Lambat
it: Lento
ja: 遅い
no: Langsom
ru: Медленно
uk: Повільно

source: Small Talk
ar: حديث خفيف
be: Малая балачка
es: Charla Informal
fr: Petite Conversation
id: Obrolan Ringan
it: Chiacchierata
ja: スモールトーク
ms: Perbualan Ringan
no: Småprat
pl: Mała rozmowa
pt: Conversa Informal
ru: Небольшой разговор
sv: Småprat
th: การพูดคุยเล็กๆน้อยๆ
tr: Küçük Sohbet
uk: Мала бесіда
vi: Trò chuyện phiếm

source: Small Talk Practice
ar: ممارسة الحديث القصير
be: Практыка ў сфере невялікага размовы
da: Small Talk Øvelse
de: Kleine Gesprächsübungen
es: Práctica de Conversación Casual
fr: Pratique de la Conversation Informelle
id: Praktik Percakapan Santai
it: Esercizio di Piccole Conversazioni
ja: 小話の練習
no: Liten samtalepraksis
pt: Prática de Conversa Casual
ru: Практика неформального общения
sv: Småpratsövning
th: การฝึกพูดคุยทั่วไป
tr: Küçük Sohbet Pratiği
uk: Практика невеликої розмови
vi: Thực hành nói chuyện nhỏ

source: Smart Start
ar: البداية الذكية
be: Уменны пачатак
de: Intelligenter Start
es: Inicio Inteligente
fr: Début Intelligent
id: Mulai Pintar
it: Avvio Intelligente
ja: スマートスタート
ms: Permulaan Pintar
pl: Mądry Start
pt: Início Inteligente
ru: Умный Старт
th: เริ่มต้นอย่างฉลาด
tr: Akıllı Başlangıç
uk: Розумний Старт
vi: Khởi Đầu Thông Minh
