Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: "Don't forget if something goes wrong you have always someone to help you. If you don't like our service or something else, just let me know and I will return your money without any questions."
uk: "Не забувайте, якщо щось піде не так, у вас завжди є хтось, хто вам допоможе. Якщо вам не подобається наш сервіс або щось інше, просто повідомте мене, і я поверну вам гроші без зайвих запитань."

source: 'Open in Chrome' to continue.
ar: 'افتح في كروم' للمتابعة.
be: 'Адкрыць у Chrome', каб працягнуць.
da: 'Åbn i Chrome' for at fortsætte.
de: 'Öffnen Sie in Chrome', um fortzufahren.
es: 'Abre en Chrome' para continuar.
fr: 'Ouvrir dans Chrome' pour continuer.
id: 'Buka di Chrome' untuk melanjutkan.
it: 'Apri in Chrome' per continuare.
ja: 'Chromeで開く'を続行します。
ms: 'Buka dalam Chrome' untuk meneruskan.
no: 'Åpne i Chrome' for å fortsette.
pl: 'Otwórz w Chrome', aby kontynuować.
pt: 'Abra no Chrome' para continuar.
ru: 'Открыть в Chrome', чтобы продолжить.
sv: 'Öppna i Chrome' för att fortsätta.
th: 'เปิดใน Chrome' เพื่อดำเนินการต่อ.
tr: "Devam etmek için 'Chrome'da Aç'."
uk: 'Відкрити в Chrome', щоб продовжити.
vi: "Mở trong Chrome" để tiếp tục.

source: 'Open in external Browser' to continue.
ar: 'افتح في المتصفح الخارجي' للمتابعة.
be: 'Адкрыць у вонкавым браўзеры' для працягу.
da: 'Åbn i ekstern browser' for at fortsætte.
de: "Öffnen Sie im externen Browser", um fortzufahren.
es: 'Abre en navegador externo' para continuar.
fr: 'Ouvrir dans un navigateur externe' pour continuer.
id: "Buka di Browser Eksternal" untuk melanjutkan.
it: 'Apri in Browser esterno' per continuare.
ja: '外部ブラウザで開く'を続行します。
ms: 'Buka di Browser Luar' untuk teruskan.
no: 'Åpne i ekstern nettleser' for å fortsette.
pl: "Otwórz w zewnętrznej przeglądarce", aby kontynuować.
pt: 'Abra no Navegador externo' para continuar.
ru: 'Открыть во внешнем браузере' для продолжения.
sv: 'Öppna i extern webbläsare' för att fortsätta.
th: 'เปิดในเบราว์เซอร์ภายนอก' เพื่อดำเนินการต่อ.
tr: "Devam etmek için 'Harici Tarayıcıda Aç'."
uk: "Відкрити в зовнішньому браузері" для продовження.
vi: "Mở trong Trình duyệt bên ngoài" để tiếp tục.
