Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Design a high-throughput REST API in ASP.NET Core with proper validation, authentication, and rate limiting.
ar: صمم واجهة برمجة تطبيقات REST عالية الإنتاجية في ASP.NET Core مع التحقق المناسب، والمصادقة، وتحديد معدل الطلبات.
be: Стварайце API з высокай прапускной здольнасцю ў ASP.NET Core з правільнай валідацыяй, аўтэнтыфікацыяй і абмежаваннем хуткасці.
da: Design en højkapacitets-REST API i ASP.NET Core med passende validering, godkendelse og hastighedsbegrænsning.
de: Entwickeln Sie eine High-Throughput-REST-API in ASP.NET Core mit ordnungsgemäßer Validierung, Authentifizierung und Ratenbegrenzung.
es: Diseña una API REST de alto rendimiento en ASP.NET Core con validación adecuada, autenticación y limitación de velocidad.
fr: Concevoir une API REST à haut débit dans ASP.NET Core avec validation appropriée, authentification et limitation du taux.
id: Rancang API REST throughput tinggi di ASP.NET Core dengan validasi, autentikasi, dan pembatasan tingkat yang tepat.
it: Progetta un'API REST ad alta velocità in ASP.NET Core con una corretta validazione, autenticazione e limitazione del tasso.
ja: ASP.NET Coreで適切なバリデーション、認証、およびレート制限を備えた高スループットなREST APIを設計する。
ms: Reka bentuk API REST throughput tinggi dalam ASP.NET Core dengan penilaian, pengesahan, dan had kadar yang sesuai.
no: Design en REST API med høy gjennomstrømming i ASP.NET Core med riktig validering, autentisering og hastighetsbegrensning.
pl: Zaprojektuj REST API o wysokiej przepustowości w ASP.NET Core z odpowiednią walidacją, uwierzytelnianiem i ograniczeniami szybkości.
pt: Projete uma API REST de alta capacidade em ASP.NET Core com validação adequada, autenticação e limitação de taxa.
ru: Создайте высокопроизводительный REST API на платформе ASP.NET Core с надлежащей валидацией, аутентификацией и ограничением по количеству запросов.
sv: Designa ett REST-API med hög genomströmning i ASP.NET Core med korrekt validering, autentisering och begränsning av hastighet.
th: ออกแบบ REST API ที่มีประสิทธิภาพสูงใน ASP.NET Core พร้อมการตรวจสอบความถูกต้อง การยืนยันตัวตน และการจำกัดอัตราการเรียกใช้งานที่เหมาะสม
tr: ASP.NET Core'da uygun doğrulama, kimlik doğrulama ve oran sınırlaması ile yüksek verimli bir REST API tasarlayın.
uk: Розробіть високопродуктивний REST API у ASP.NET Core з належною валідацією, автентифікацією та обмеженнями швидкості.
vi: Thiết kế một API REST có thông lượng cao trong ASP.NET Core với xác thực, xác thực, và giới hạn tốc độ hợp lý.

source: Designed for experienced backend engineers
ar: مصمم لمهندسي البنية الخلفية ذوي الخبرة
be: Прызначана для вопытных інжынераў бэкэнду
da: Designet til erfarne backend-ingeniører
de: Entwickelt für erfahrene Backend-Ingenieure
es: Diseñado para ingenieros de backend con experiencia
fr: Conçu pour les ingénieurs backend expérimentés
id: Dirancang untuk insinyur backend berpengalaman
it: Progettato per ingegneri backend esperti
ja: 経験豊富なバックエンドエンジニア向けに設計された
ms: Direka untuk jurutera backend berpengalaman
no: Designet for erfarne backend-ingeniører
pl: Zaprojegtowany dla doświadczonych inżynierów backendowych
pt: Projetado para engenheiros backend experientes
ru: Предназначено для опытных backend-инженеров
sv: Designad för erfarna backend-ingenjörer
th: ออกแบบสำหรับวิศวกรแบ็กเอนด์ที่มีประสบการณ์
tr: Deneyimli backend mühendisleri için tasarlandı
uk: Призначено для досвідчених інженерів backend систем
vi: Được thiết kế cho các kỹ sư backend có kinh nghiệm

source: Designed specifically for aspiring and junior frontend engineers
ar: مصمم خصيصًا للمهندسين الطموحين والناشئين في تطوير الواجهة الأمامية
be: Прызначаны спецыяльна для будучых і пачатковых фронтэнд-інжынераў
da: Designet specifikt til kommende og junior frontend-ingeniører
de: Speziell für angehende und junior Frontend-Ingenieure konzipiert
es: Diseñado específicamente para ingenieros frontend aspirantes y junior
fr: Conçu spécifiquement pour les ingénieurs frontend débutants et aspirants
id: Dirancang khusus untuk insinyur frontend pemula dan yang bercita-cita tinggi
it: Progettato specificamente per ingegneri frontend aspiranti e junior
ja: 特に、志望者やジュニアのフロントエンドエンジニアのために設計された
no: plaintext Designet spesielt for ambisiøse og junior frontend-ingeniører
pl: Zaprojektowane specjalnie dla początkujących i młodszych inżynierów frontendowych
pt: Projetado especificamente para engenheiros de frontend iniciantes e aspirantes
ru: Разработан специально для начинающих и младших frontend инженеров
sv: Designad speciellt för blivande och junior frontend-ingenjörer
th: ออกแบบมาโดยเฉพาะสำหรับวิศวกร frontend ฝึกหัดและระดับจูเนียร์
tr: Gelecek vadeden ve yeni başlayan frontend mühendisleri için özel olarak tasarlandı
uk: Розроблено спеціально для початківців та молодших фронтенд-інженерів
vi: plaintext Được thiết kế đặc biệt cho các kỹ sư frontend mới vào nghề và đang phát triển

source: Designed specifically for experienced frontend engineers
ar: مصممة خصيصًا لمهندسي الواجهة الأمامية ذوي الخبرة
be: Спраектавана спецыяльна для вопытных frontend інжынераў
da: Designet specifikt til erfarne frontend-ingeniører
de: Speziell für erfahrene Frontend-Ingenieure entwickelt
es: Diseñado específicamente para ingenieros frontend experimentados
fr: Conçu spécialement pour les ingénieurs frontend expérimentés
id: Dirancang khusus untuk insinyur frontend berpengalaman
it: Progettato specificamente per ingegneri frontend esperti
ja: 経験豊富なフロントエンドエンジニア向けに特別に設計されました
ms: plaintext Direka khas untuk jurutera frontend berpengalaman
no: Designet spesielt for erfarne frontend-ingeniører
pl: Zaprojektowane specjalnie dla doświadczonych inżynierów frontendowych
pt: Projetado especificamente para engenheiros frontend experientes
ru: Предназначено специально для опытных frontend инженеров
sv: Utformad specifikt för erfarna frontend-ingenjörer
th: ออกแบบมาโดยเฉพาะสำหรับวิศวกรหน้าเว็บไซต์ที่มีประสบการณ์
tr: Deneyimli frontend mühendisleri için özel olarak tasarlanmıştır
uk: Розроблено спеціально для досвідчених фронтенд-інженерів
vi: Được thiết kế đặc biệt cho kỹ sư frontend có kinh nghiệm

source: Desired Job Title
ar: عنوان الوظيفة المرغوبة
be: Пажаданая Пасада
da: Ønsket Jobtitel
de: Gewünschter Jobtitel
es: Título del Trabajo Deseado
fr: Titre de poste souhaité
id: Judul Pekerjaan yang Diinginkan
it: Titolo del Lavoro Desiderato
ja: 希望職種
ms: Jawatan Yang Diharapkan
no: Ønsket stilling
pl: Żądany tytuł zawodowy
pt: Título do Trabalho Desejado
ru: Желаемая должность
sv: Önskad Jobbtitel
th: ตำแหน่งงานที่ต้องการ
tr: İstenilen İş Ünvanı
uk: Бажана посада
vi: Tiêu đề công việc mong muốn

source: Develop formal writing skills for academic success.
ar: تطوير مهارات الكتابة الرسمية للنجاح الأكاديمي.
be: Развіваць навыкі афіцыйнага пісьма для акадэмічнага успеху.
da: Udvikl formelle skrivefærdigheder for akademisk succes.
de: Entwickeln Sie formelle Schreibfähigkeiten für den akademischen Erfolg.
es: Desarrolla habilidades de escritura formal para el éxito académico.
fr: Développez des compétences d'écriture formelle pour la réussite académique.
id: Kembangkan keterampilan menulis formal untuk keberhasilan akademik.
it: Sviluppa competenze di scrittura formale per il successo accademico.
ja: 学術的な成功のための形式的なライティングスキルを育成します。
ms: Kembangkan kemahiran penulisan rasmi untuk kejayaan akademik.
no: Utvikle formelle skriveferdigheter for akademisk suksess.
pl: Rozwijaj formalne umiejętności pisania dla sukcesu akademickiego.
pt: Desenvolva habilidades de escrita formal para sucesso acadêmico.
ru: Развивайте навыки формального письма для академического успеха.
sv: Utveckla formella skrivfärdigheter för akademisk framgång.
th: พัฒนาทักษะการเขียนแบบเป็นทางการเพื่อความสำเร็จในการศึกษา
tr: Akademik başarı için resmi yazma becerileri geliştirin.
uk: Розвивайте формальні навички письма для академічного успіху.
vi: Phát triển kỹ năng viết chính thức cho thành công học thuật.

source: Develop your conversational skills with casual small talk
ar: طور مهاراتك في المحادثة من خلال الدردشة غير الرسمية
be: Развівайце свае навыкі размовы з памаччу нізкамоўнага абмену меркаваннямі
da: Udvikl dine samtaleevner med afslappet small talk
de: Entwickeln Sie Ihre Gesprächsfähigkeiten mit legerem Small Talk
es: Desarrolla tus habilidades conversacionales con charlas informales.
fr: Développez vos compétences conversationnelles avec des échanges informels
id: Kembangkan keterampilan percakapan Anda dengan obrolan santai
it: Sviluppa le tue abilità conversazionali con chiacchiere informali
ja: カジュアルな雑談で会話スキルを磨こう
ms: Kembangkan kemahiran perbualan anda dengan sembang santai
no: Utvikle samtaleferdighetene dine med uformell småprat
pl: Rozwijaj swoje umiejętności konwersacyjne dzięki swobodnym rozmowom.
pt: Desenvolva suas habilidades de conversação com pequenas conversas casuais
ru: Развивайте свои разговорные навыки с помощью непринужденного общения
sv: Utveckla dina konversationsfärdigheter med avslappnad småprat
th: พัฒนาทักษะการสนทนาของคุณด้วยการพูดคุยเล็กน้อยอย่างไม่เป็นทางการ
tr: Günlük küçük sohbetlerle konuşma becerilerinizi geliştirin
uk: Розвивайте свої розмовні навички з невимушеного спілкування
vi: Phát triển kỹ năng giao tiếp của bạn với những cuộc trò chuyện thân mật

source: Developers moving from mid-level to senior with stronger stories
ar: المطورون ينتقلون من المستوى المتوسط إلى المستوى الأعلى بقصص أقوى
be: Распрацоўшчыкі, якія пераходзяць з сярэдняга ўзроўню на старшы са значна мацнейшымі гісторыямі
da: Udviklere, der går fra mellemniveau til senior med stærkere historier
de: Entwickler, die vom mittleren Niveau zum Senior aufsteigen, mit stärkeren Geschichten
es: Desarrolladores que pasan de nivel medio a senior con historias más sólidas
fr: Développeurs passant de niveau intermédiaire à senior avec des récits plus solides
id: Pengembang yang naik dari tingkat menengah ke tingkat senior dengan cerita yang lebih kuat
it: Sviluppatori che passano da un livello intermedio a senior con storie più forti
ja: より強力なストーリーを持つミッドレベルからシニアへの開発者の移行
ms: Pembangun bergerak dari tahap pertengahan ke senior dengan cerita yang lebih kuat
no: Utviklere som går fra mellomnivå til senior med sterkere historier
pl: Deweloperzy przechodzący z poziomu średniego na starszy z silniejszymi historiami
pt: Desenvolvedores passando do nível intermediário para sênior com histórias mais fortes
ru: Разработчики переходят с среднего уровня на старший с более сильными историями
sv: plaintext Utvecklare som går från mellannivå till senior med starkare berättelser
th: พัฒนาเป็นนักพัฒนาที่ขยับจากระดับกลางไปสู่ระดับอาวุโสพร้อมเรื่องราวที่เข้มแข็งยิ่งขึ้น
tr: Orta düzeyden üst düzeye geçiş yapan geliştiriciler daha güçlü hikayelerle
uk: Розробники, які переходять з середнього рівня на старший із сильнішими історіями
vi: Các nhà phát triển chuyển từ cấp trung lên cấp cao với những câu chuyện mạnh mẽ hơn

source: Developers targeting product companies with complex frontends and high performance requirements
ar: plaintext المطورون الذين يستهدفون شركات المنتجات ذات الواجهات الأمامية المعقدة ومتطلبات الأداء العالي
be: Распрацоўшчыкі, накіраваныя на прадуктовыя кампаніі з складанымі інтэрфэйсамі і высокімі патрабаваннямі да прадукцыйнасці
da: Udviklere, der henvender sig til produktvirksomheder med komplekse frontend-løsninger og høje ydeevnekrav
de: Entwickler, die Produktunternehmen mit komplexen Frontends und hohen Leistungsanforderungen anvisieren
es: Desarrolladores dirigidos a empresas de productos con frontends complejos y requisitos de alto rendimiento
fr: Développeurs ciblant les entreprises de produits avec des frontend complexes et des exigences de haute performance
id: Pengembang menargetkan perusahaan produk dengan antarmuka kompleks dan persyaratan kinerja tinggi
it: Sviluppatori che mirano a aziende di prodotto con interfacce complesse e requisiti di alta performance
ja: 製品企業をターゲットにした開発者は、複雑なフロントエンドと高いパフォーマンス要求を持っています
ms: Pemaju menyasarkan syarikat produk dengan antaramuka hadapan yang kompleks dan keperluan prestasi tinggi
no: Utviklere som retter seg mot produktbedrifter med komplekse frontend og høye ytelseskrav
pl: Deweloperzy docelowi to firmy produktowe złożonymi interfejsami frontowymi i wymaganiami dotyczącymi wysokiej wydajności
pt: Desenvolvedores direcionando empresas de produtos com frontends complexos e requisitos de alto desempenho
ru: Разработчики, нацеленные на продуктовые компании со сложными интерфейсами и высокими требованиями к производительности
sv: Utvecklare som riktar sig mot produktföretag med komplexa frontend och höga prestandakrav
th: นักพัฒนาที่มุ่งเน้นบริษัทผลิตภัณฑ์ที่มีส่วนหน้าแบบซับซ้อนและต้องการประสิทธิภาพสูง
tr: Karmaşık ön yüzler ve yüksek performans gereksinimleri olan ürün şirketlerini hedefleyen geliştiriciler
uk: Розробники, які націлені на продуктові компанії зі складними фронтендами та високими вимогами до продуктивності
vi: Các nhà phát triển nhắm đến các công ty sản phẩm với các giao diện phức tạp và yêu cầu hiệu suất cao

source: Diagnosis
ar: تشخيص
be: Дыягноз
da: Diagnose
de: Diagnose
es: Diagnóstico
fr: Diagnostic
it: Diagnosi
ja: 診断
no: Diagnose
pl: Diagnoza
pt: Diagnóstico
ru: Диагноз
sv: Diagnos
th: การวินิจฉัย
tr: Teşhis
uk: Діагностика
vi: Chẩn đoán

source: Discounted AI Usage
ar: استخدام الذكاء الاصطناعي المخفض
be: Зніжанае выкарыстанне AI
da: Rabatteret AI-brug
de: Rabattierte KI-Nutzung
es: Descuento en el uso de IA
fr: Usage de l'IA à prix réduit
id: Diskon Penggunaan AI
it: Utilizzo dell'IA scontato
ja: 割引されたAI使用
ms: Penggunaan AI Diskaun
no: Rabattert AI-bruk
pl: Przecenione korzystanie z AI
pt: Uso de IA com Desconto
ru: Скидки на использование ИИ
sv: Rabatterad AI-användning
th: ส่วนลดการใช้งาน AI
tr: Indirimli AI Kullanımı
uk: Знижки на використання ШІ
vi: Giá sử dụng AI đã giảm

source: Discover
ar: اكتشف
be: Адкрыць
da: Opdag
de: Entdecken
es: Descubrir
fr: Découvrez
id: Temukan
it: Scopri
ja: 発見する
ms: Temui
no: Oppdag
pl: Odkryj
pt: Descubra
ru: Откройте для себя
sv: Upptäck
th: ค้นพบ
tr: Keşfet
uk: Відкрийте для себе
vi: Khám phá

source: Discover effective daily habits to improve your business English skills effortlessly and quickly.
ar: اكتشف العادات اليومية الفعالة لتحسين مهاراتك في الإنجليزية التجارية بسهولة وسرعة.
be: Адкрыйце для сябе эфектыўныя шкодныя навыкі, каб паляпшыць вашыя навыкі бізнес-англійскай хутка і без зусім.
da: Opdag effektive daglige vaner til ubesværet og hurtigt at forbedre dine forretning engelskkundskaber.
de: Entdecken Sie effektive tägliche Gewohnheiten, um Ihre Geschäftsenglischkenntnisse mühelos und schnell zu verbessern.
es: Descubre hábitos diarios efectivos para mejorar tus habilidades de inglés de negocios de manera fácil y rápida.
fr: Découvrez des habitudes quotidiennes efficaces pour améliorer vos compétences en anglais des affaires facilement et rapidement.
id: Temukan kebiasaan sehari-hari yang efektif untuk meningkatkan keterampilan Bahasa Inggris bisnis Anda dengan mudah dan cepat.
it: Scopri abitudini quotidiane efficaci per migliorare le tue competenze in inglese commerciale in modo semplice e veloce.
ja: あなたのビジネス英語スキルを効果的に、そして迅速に向上させるための日常習慣を発見しましょう。
ms: Temui tabiat harian yang berkesan untuk meningkatkan kemahiran Bahasa Inggeris perniagaan anda dengan mudah dan cepat.
no: Oppdag effektive daglige vaner for å forbedre dine forretningengelsk ferdigheter uten anstrengelse og raskt.
pl: Odkryj skuteczne codzienne nawyki, które pozwolą Ci poprawić Twoje umiejętności biznesowego angielskiego bez wysiłku i szybko.
pt: Descubra hábitos diários eficazes para melhorar suas habilidades em inglês de negócios de maneira fácil e rápida.
ru: Откройте для себя эффективные ежедневные привычки, чтобы без усилий и быстро улучшить свои навыки делового английского.
sv: Upptäck effektiva dagliga vanor för att förbättra dina affärsengelska färdigheter utan ansträngning och snabbt.
th: ค้นพบวิธีการฝึกฝนทุกวันที่มีประสิทธิภาพในการปรับปรุงทักษะภาษาอังกฤษเพื่อธุรกิจของคุณโดยไม่ยากลำบากและรวดเร็ว
tr: İş İngilizcenizi çabasızca ve hızlıca geliştirmek için etkili günlük alışkanlıkları keşfedin.
uk: Відкрийте для себе ефективні щоденні звички, які допоможуть вам легко та швидко вдосконалити ваші навички бізнес-англійської.
vi: Khám phá những thói quen hàng ngày hiệu quả để cải thiện kỹ năng tiếng Anh thương mại của bạn một cách dễ dàng và nhanh chóng.

source: Discuss and improve your skills together!
ar: ناقش وحسّن مهاراتك معًا!
be: Абмяркоўвайце і ўдасканальвайце свае навыкі разам!
da: Diskutér og forbedr dine færdigheder sammen!
de: Diskutieren und verbessern Sie gemeinsam Ihre Fähigkeiten!
es: ¡Discute y mejora tus habilidades juntos!
fr: Discutez et améliorez vos compétences ensemble !
id: Diskusikan dan tingkatkan keterampilan Anda bersama!
it: Discute e migliora le tue abilità insieme agli altri!
ja: 一緒にスキルを話し合い、向上させましょう！
no: Diskuter og forbedre ferdighetene dine sammen!
pl: Dyskutuj i rozwijaj swoje umiejętności razem!
pt: Discuta e melhore suas habilidades juntos!
ru: Обсуждайте и улучшайте свои навыки вместе!
sv: Diskutera och förbättra dina färdigheter tillsammans!
th: พูดคุยและพัฒนาทักษะของคุณไปพร้อมกัน!
tr: Becerilerinizi birlikte tartışın ve geliştirin!
uk: Обговорюйте та вдосконалюйте свої навички разом!
vi: Thảo luận và cải thiện kỹ năng của bạn cùng nhau!

source: Discuss component structure and state management
ar: ناقش هيكل المكونات وإدارة الحالة
be: Абмяркуйце структуру кампанента і кіраванне станам
da: Diskuter komponentstruktur og tilstandshåndtering
de: Diskutieren Sie die Komponentenstruktur und das Zustandsmanagement
es: Discutir la estructura de componentes y la gestión del estado
fr: Discuter de la structure des composants et de la gestion d'état
id: Diskusikan struktur komponen dan manajemen state
it: Discutere la struttura dei componenti e la gestione dello stato
ja: コンポーネント構造と状態管理について議論する
ms: Bincangkan struktur komponen dan pengurusan keadaan
no: Diskuter komponentstruktur og tilstandshåndtering
pl: Omów strukturę komponentów i zarządzanie stanem
pt: Discutir a estrutura dos componentes e o gerenciamento de estado
ru: Обсудите структуру компонентов и управление состоянием
sv: Diskutera komponentstruktur och statehantering
th: พูดคุยเกี่ยวกับโครงสร้างคอมโพเนนต์และการจัดการ state
tr: Bileşen yapısını ve durum yönetimini tartışın
uk: Обговорення структури компонента і управління станом
vi: Thảo luận về cấu trúc thành phần và quản lý trạng thái

source: Discuss mental health topics and express your thoughts effectively
ar: ناقش مواضيع الصحة النفسية وعبّر عن أفكارك بفعالية
be: Абмеркавайце тэмы псіхічнага здароўя і выслоўваць свае думкі эфектыўна
da: Diskuter emner inden for mental sundhed og udtryk dine tanker effektivt
de: Diskutieren Sie Themen der psychischen Gesundheit und drücken Sie Ihre Gedanken effektiv aus
es: Discutir temas de salud mental y expresar tus pensamientos de manera efectiva
fr: Discuter des sujets de santé mentale et exprimer vos pensées de manière efficace
id: Diskusikan topik kesehatan mental dan ungkapkan pemikiran Anda dengan efektif
it: Discuti argomenti di salute mentale e esprimi i tuoi pensieri in modo efficace
ja: メンタルヘルスに関するトピックを議論し、自分の考えを効果的に表現する
ms: Bincangkan topik kesihatan mental dan sampaikan pemikiran anda dengan berkesan
no: Diskuter emner relatert til mental helse og uttrykk tankene dine effektivt
pl: Omów tematy zdrowia psychicznego i wyraź swoje myśli w sposób skuteczny
pt: Discutir tópicos sobre saúde mental e expressar seus pensamentos de forma eficaz
ru: Обсуждайте темы психического здоровья и выражайте свои мысли эффективно
sv: Diskutera ämnen kring mental hälsa och uttryck dina tankar effektivt
th: พูดคุยเกี่ยวกับหัวข้อสุขภาพจิตและแสดงความคิดของคุณอย่างมีประสิทธิภาพ
tr: Zihinsel sağlık konularını tartışın ve düşüncelerinizi etkili bir şekilde ifade edin
uk: Обговорюйте теми психічного здоров'я та ефективно висловлюйте свої думки
vi: Thảo luận về các chủ đề sức khỏe tâm thần và bày tỏ suy nghĩ của bạn một cách hiệu quả
