Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: I aware that this is a simulation and not a real medical consultation.
ar: أنا أدرك أن هذا مجرد محاكاة وليس استشارة طبية حقيقية.
be: Я усведамляю, што гэта сімуляцыя, а не сапраўдная медыцынская кансультацыя.
da: Jeg er klar over, at dette er en simulering og ikke en rigtig lægekonsultation.
de: Ich bin mir bewusst, dass dies eine Simulation und keine echte medizinische Beratung ist.
es: Soy consciente de que esto es una simulación y no una consulta médica real.
fr: Je suis conscient que ceci est une simulation et non une véritable consultation médicale.
id: Saya menyadari bahwa ini adalah simulasi dan bukan konsultasi medis yang sebenarnya.
it: Sono consapevole che questa è una simulazione e non una vera consulenza medica.
ja: これはシミュレーションであり、実際の医療相談ではないことを理解しています。
ms: Saya sedar bahawa ini adalah simulasi dan bukan konsultasi perubatan sebenar.
no: Jeg er klar over at dette er en simulering og ikke en ekte medisinsk konsultasjon.
pl: Jestem świadomy, że to jest symulacja, a nie prawdziwa konsultacja medyczna.
pt: Estou ciente de que isso é uma simulação e não uma consulta médica real.
ru: Я осознаю, что это симуляция, а не реальная медицинская консультация.
sv: Jag är medveten om att detta är en simulering och inte en riktig läkarundersökning.
th: ฉันรู้ดีว่านี่เป็นการจำลองและไม่ใช่การปรึกษาทางการแพทย์จริงๆ
tr: Bu bir simülasyonun ve gerçek bir tıbbi danışmanlığın farkındayım.
uk: Я усвідомлюю, що це симуляція, а не справжня медична консультація.
vi: Tôi nhận thức rằng đây chỉ là một mô phỏng và không phải là một cuộc tư vấn y tế thực sự.

source: I don't like the service. Can I get a refund?
id: Saya tidak suka layanannya. Bisakah saya mendapatkan pengembalian dana?
it: Non mi piace il servizio. Posso ottenere un rimborso?
ja: サービスが気に入らないのですが、返金してもらえますか？
no: Jeg liker ikke tjenesten. Kan jeg få en refusjon?
pl: Nie podoba mi się usługa. Czy mogę otrzymać zwrot pieniędzy?
ru: Мне не нравится сервис. Могу я получить возврат?
sv: Jag gillar inte tjänsten. Kan jag få en återbetalning?
uk: Мені не подобається послуга. Чи можу я отримати відшкодування?

source: I don't like the service. I expected a different feature.
id: Saya tidak menyukai layanan ini. Saya mengharapkan fitur yang berbeda.
it: Non mi piace il servizio. Mi aspettavo una funzione diversa.
ja: サービスが気に入りません。別の機能を期待していました。
no: Jeg liker ikke tjenesten. Jeg forventet en annen funksjon.
pl: Nie podoba mi się ta usługa. Oczekiwałem innej funkcji.
ru: Я недоволен услугой. Я ожидал другую функцию.
sv: Jag gillar inte tjänsten. Jag förväntade mig en annan funktion.
uk: Я не задоволений сервісом. Я очікував іншу функцію.

source: I finally got 3 offers after months of silence. The React component challenges were exactly what I needed.
ar: لقد حصلت أخيرًا على 3 عروض بعد شهور من الصمت. كانت تحديات مكونات React بالضبط ما أحتاجه.
be: Нарэшце я атрымаў 3 прапановы пасля месяцаў маўчання. Выпрабаванні кампанентаў React былі якраз тым, што мне было патрэбна.
da: Jeg fik endelig 3 tilbud efter måneder af stilhed. React-komponent-udfordringerne var præcis, hvad jeg havde brug for.
de: Ich habe endlich 3 Angebote nach Monaten der Stille erhalten. Die React-Komponenten-Herausforderungen waren genau das, was ich brauchte.
es: Finalmente recibí 3 ofertas después de meses de silencio. Los desafíos de componentes de React eran exactamente lo que necesitaba.
fr: J'ai enfin obtenu 3 offres après des mois de silence. Les défis de composants React étaient exactement ce dont j'avais besoin.
id: Akhirnya saya mendapatkan 3 tawaran setelah berbulan-bulan tidak ada kabar. Tantangan komponen React adalah apa yang saya butuhkan.
it: Finalmente ho ricevuto 3 offerte dopo mesi di silenzio. Le sfide sui componenti React erano esattamente ciò di cui avevo bisogno.
ja: 何ヶ月もの沈黙の後、ついに3つのオファーを得ることができました。Reactコンポーネントの課題がまさに私に必要なものでした。
ms: Saya akhirnya mendapat 3 tawaran selepas berbulan-bulan berdiam diri. Cabaran komponen React adalah betul-betul apa yang saya perlukan.
no: Jeg fikk endelig 3 tilbud etter måneder med stillhet. React-komponentutfordringene var akkurat det jeg trengte.
pl: W końcu otrzymałem 3 oferty po miesiącach ciszy. Wyzwania związane z komponentami React były dokładnie tym, czego potrzebowałem.
pt: Finalmente recebi 3 ofertas após meses de silêncio. Os desafios dos componentes React foram exatamente o que eu precisava.
ru: Наконец-то я получил 3 предложения после месяцев молчания. Испытания с React-компонентами были именно тем, что мне нужно.
sv: Jag fick äntligen 3 erbjudanden efter månader av tystnad. React-komponentutmaningarna var precis vad jag behövde.
th: ในที่สุดฉันก็ได้รับข้อเสนอ 3 ข้อหลังจากความเงียบมาหลายเดือน ความท้าทายใน React component เป็นสิ่งที่ฉันต้องการจริงๆ
tr: Aylardır süren sessizlikten sonra sonunda 3 teklif aldım. React bileşen zorlukları tam da ihtiyacım olan şeydi.
uk: Зрештою, після місяців тиші, я отримав 3 пропозиції. Виклики з компонентами React були саме тим, що мені потрібно.
vi: Cuối cùng tôi đã nhận được 3 đề nghị sau nhiều tháng im ắng. Các thử thách với thành phần React chính là những gì tôi cần.

source: I know these
es: Conozco estos
id: Saya tahu ini
it: Conosco questi
ja: 知っています
no: Jeg kjenner disse
pl: Znam te
pt: Eu conheço estes
ru: Я знаю это
sv: Jag kan dessa
uk: Я знаю це

source: I paid, but I still don’t have access.
id: Saya sudah membayar, tetapi saya masih belum mendapatkan akses.
it: Ho pagato, ma non ho ancora accesso.
ja: 支払いましたが、まだアクセスできません。
no: Jeg har betalt, men jeg har fortsatt ikke tilgang.
pl: Zapłaciłem, ale nadal nie mam dostępu.
ru: Я заплатил, но у меня всё ещё нет доступа.
sv: Jag har betalat, men jag har fortfarande inte tillgång.
uk: Я заплатив, але досі не маю доступу.

source: I want the service to be provided immediately and I acknowledge that as soon as the Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" provides the service, I will lose the right to terminate the contract.
uk: Я хочу, щоб послугу було надано негайно, і я визнаю, що як тільки Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" надасть послугу, я втрачу право на розірвання договору.

source: I want the service to be provided immediately and I acknowledge that as soon as the Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" provides the service, I will lose the right to terminate the contract.
ar: أريد تقديم الخدمة فورًا وأعترف أنه بمجرد أن تقدم Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" خدمة ، سأفقد الحق في إنهاء العقد.
be: Я хачу, каб паслуга была аказана немедленна, і я падцверджаю, што, як толькі Фундацыя распрацоўкі прадпрыемства "Твой StartUp" надае паслугу, я страчаю права на растаргненне дагавору.
da: Jeg ønsker, at tjenesten leveres med det samme, og jeg anerkender, at så snart Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" leverer tjenesten, vil jeg miste retten til at opsige kontrakten.
de: Ich möchte, dass der Service sofort bereitgestellt wird und ich erkenne an, dass sobald die Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" den Service bereitstellt, ich das Recht verliere, den Vertrag zu kündigen.
es: Quiero que el servicio se preste de inmediato y reconozco que tan pronto como la Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" proporciona el servicio, perderé el derecho a terminar el contrato.
fr: Je souhaite que le service soit fourni immédiatement et je reconnais que dès que la Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" fournit le service, je perdrai le droit de résilier le contrat.
id: Saya ingin layanan diberikan segera dan saya mengakui bahwa segera setelah Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" memberikan layanan, saya akan kehilangan hak untuk mengakhiri kontrak.
it: Voglio che il servizio venga fornito immediatamente e riconosco che non appena la Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" fornisce il servizio, perderò il diritto di rescindere il contratto.
ja: 私はサービスが即時に提供されることを希望し、 フンダツィヤ・ロズヴォユ・プレドシェンビョルチョシチ「トヴォイ・スタートアップ」によってサービスが 提供されるとすぐに、契約を終了する権利を失うことを認めます。
ms: Saya mahu perkhidmatan disediakan segera dan saya mengakui bahawa sebaik sahaja Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" menyediakan perkhidmatan, saya akan kehilangan hak untuk menamatkan kontrak.
no: Jeg ønsker at tjenesten skal leveres umiddelbart, og jeg anerkjenner at så snart Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" leverer tjenesten, vil jeg miste retten til å avslutte kontrakten.
pl: Chcę, aby usługa była świadczona natychmiast i przyjmuję do wiadomości, że jak tylko Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" świadczy usługę, stracę prawo do rozwiązania umowy.
pt: Eu quero que o serviço seja fornecido imediatamente e reconheço que assim que a Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" fornecer o serviço, perderei o direito de terminar o contrato.
ru: Я хочу, чтобы услуга была предоставлена немедленно, и я признаю, что как только Фонд развития предпринимательства "Твой Стартап" предоставит услугу, я потеряю право на расторжение договора.
sv: Jag vill att tjänsten tillhandahålls omedelbart och jag erkänner att så snart som Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" tillhandahåller tjänsten, kommer jag att förlora rätten att avsluta kontraktet.
th: ฉันต้องการให้บริการทันทีและฉันยอมรับว่าทันที่ Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" ให้บริการ ฉันจะสูญเสียสิทธิ์ในการยกเลิกสัญญา
tr: Hizmetin hemen sağlanmasını istiyorum ve Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" hizmeti sağladığı anda, sözleşmeyi feshetme hakkımı kaybedeceğimi kabul ediyorum.
uk: Я хочу, щоб послугу надано негайно, і я визнаю, що як тільки Фундація розвитку підприємництва "Twój StartUp" надасть послугу, я втрачу право розірвати контракт.
vi: Tôi muốn dịch vụ được cung cấp ngay lập tức và tôi thừa nhận rằng ngay khi Quỹ Phát triển Doanh nghiệp "Twój StartUp" cung cấp dịch vụ, tôi sẽ mất quyền hủy hợp đồng.

source: I want to learn...
ar: أريد أن أتعلم...
be: Я хачу вывучыць...
da: Jeg vil lære...
de: Ich möchte lernen...
es: Quiero aprender...
fr: Je veux apprendre...
id: Saya ingin belajar...
it: Voglio imparare...
ja: 私は学びたい...
ms: Saya mahu belajar...
no: Jeg vil lære...
pl: Chcę się nauczyć...
pt: Eu quero aprender...
ru: Я хочу изучать...
sv: Jag vill lära mig...
th: ฉันต้องการเรียนรู้...
tr: Öğrenmek istiyorum...
uk: Я хочу вивчити...
vi: Tôi muốn học...

source: I want to receive commercial and marketing content
ar: أريد أن أتلقى المحتوى التجاري والتسويقي
be: Я хачу атрымаць камерцыйны і маркетынгавы кантэнт
da: Jeg ønsker at modtage kommercielt og markedsføringsmæssigt indhold
de: Ich möchte kommerzielle und Marketinginhalte erhalten
es: Quiero recibir contenido comercial y de marketing
fr: Je souhaite recevoir du contenu commercial et marketing
id: Saya ingin menerima konten komersial dan pemasaran
it: Voglio ricevere contenuti commerciali e di marketing
ja: 私は商用とマーケティングのコンテンツを受け取りたい
ms: Saya mahu menerima kandungan komersial dan pemasaran
no: Jeg ønsker å motta kommersielt og markedsføringsinnhold
pl: Chcę otrzymywać treści komercyjne i marketingowe
pt: Eu quero receber conteúdo comercial e de marketing
ru: Я хочу получать коммерческие и маркетинговые материалы
sv: Jag vill ta emot kommersiellt och marknadsföringsinnehåll
th: ฉันต้องการรับเนื้อหาทางการค้าและการตลาด
tr: Ticari ve pazarlama içeriği almak istiyorum
uk: Я хочу отримувати комерційний та маркетинговий контент
vi: Tôi muốn nhận nội dung thương mại và tiếp thị

source: I was confident and clear — FluencyPal prepared me better than any coach for technical discussions about state management.
ar: كنت واثقًا وواضحًا - أعدني FluencyPal بشكل أفضل من أي مدرب للمناقشات التقنية حول إدارة الحالة.
be: Я быў упэўнены і выразны — FluencyPal падрыхтаваў мяне лепш, чым любы трэнер для тэхнічных абмеркаванняў аб кіраванні станам.
da: Jeg var selvsikker og klar — FluencyPal forberedte mig bedre end nogen coach til tekniske diskussioner om statshåndtering.
de: Ich war selbstbewusst und klar — FluencyPal hat mich besser als jeder Coach auf technische Diskussionen über Zustandsverwaltung vorbereitet.
es: Estaba seguro y claro — FluencyPal me preparó mejor que cualquier entrenador para discusiones técnicas sobre la gestión del estado.
fr: J'étais confiant et clair — FluencyPal m'a mieux préparé que n'importe quel coach pour des discussions techniques sur la gestion d'état.
id: Saya percaya diri dan jelas — FluencyPal mempersiapkan saya lebih baik daripada pelatih mana pun untuk diskusi teknis tentang manajemen status.
it: Ero sicuro e chiaro — FluencyPal mi ha preparato meglio di qualsiasi coach per discussioni tecniche sulla gestione dello stato.
ja: 自信を持って明確に話せました - FluencyPalはステート管理に関する技術的な議論において、どのコーチよりも私をしっかりと準備させてくれました。
ms: Saya yakin dan jelas — FluencyPal mempersiapkan saya lebih baik daripada mana-mana jurulatih untuk perbincangan teknikal mengenai pengurusan negeri.
no: Jeg var trygg og tydelig — FluencyPal forberedte meg bedre enn noen coach for tekniske diskusjoner om tilstandshåndtering.
pl: Byłem pewny siebie i zrozumiały — FluencyPal przygotował mnie lepiej niż jakikolwiek trener do dyskusji technicznych na temat zarządzania stanem.
pt: Fiquei confiante e claro — o FluencyPal me preparou melhor do que qualquer treinador para discussões técnicas sobre gerenciamento de estado.
ru: Я был уверен и ясен — FluencyPal подготовил меня лучше, чем любой тренер, к техническим обсуждениям о управлении состоянием.
sv: Jag var självsäker och tydlig — FluencyPal förberedde mig bättre än någon coach för tekniska diskussioner om tillståndshantering.
th: ฉันรู้สึกมั่นใจและชัดเจน — FluencyPal เตรียมความพร้อมให้ฉันดีกว่าโค้ชคนไหน ๆ สำหรับการอภิปรายทางเทคนิคเกี่ยวกับการจัดการสถานะ
tr: Kendime güvendim ve net bir şekilde ilettim — FluencyPal beni, durum yönetimiyle ilgili teknik tartışmalara herhangi bir koçtan daha iyi hazırladı.
uk: Я був впевнений і ясний — FluencyPal підготував мене краще, ніж будь-який тренер, до технічних обговорень про управління станом.
vi: Tôi đã tự tin và rõ ràng — FluencyPal đã chuẩn bị cho tôi tốt hơn bất kỳ huấn luyện viên nào trong các cuộc thảo luận kỹ thuật về quản lý trạng thái.

source: I would split the app into reusable components and use a global store for state.
ar: أود تقسيم التطبيق إلى مكونات قابلة لإعادة الاستخدام واستخدام متجر عالمي للحالة.
be: Я б падзяліў прыкладанне на шматразовыя кампаненты і выкарыстаў глабальны магазін для стану.
da: Jeg ville opdele appen i genanvendelige komponenter og bruge en global store til tilstand.
de: Ich würde die App in wiederverwendbare Komponenten aufteilen und einen globalen Speicher für den Status verwenden.
es: Dividiría la aplicación en componentes reutilizables y usaría una tienda global para el estado.
fr: Je diviserais l'application en composants réutilisables et j'utiliserais un magasin global pour l'état.
id: Saya akan membagi aplikasi menjadi komponen yang dapat digunakan kembali dan menggunakan penyimpanan global untuk keadaan.
it: Suddividerei l'app in componenti riutilizzabili e userei uno store globale per lo stato.
ja: アプリを再利用可能なコンポーネントに分割し、状態管理にはグローバルストアを使用します。
ms: Saya akan membahagikan aplikasi kepada komponen yang boleh digunakan semula dan menggunakan stor global untuk keadaan.
no: Jeg ville dele appen opp i gjenbrukbare komponenter og bruke en global lagring for tilstand.
pl: Podzieliłbym aplikację na komponenty wielokrotnego użytku i użył globalnego magazynu do zarządzania stanem.
pt: Eu dividiria o aplicativo em componentes reutilizáveis e usaria um armazenamento global para estado.
ru: Я бы разделил приложение на повторно используемые компоненты и использовал глобальное хранилище для состояния.
sv: Jag skulle dela upp appen i återanvändbara komponenter och använda en global butik för tillstånd.
th: ฉันจะแยกแอปออกเป็นส่วนประกอบที่นำกลับมาใช้ใหม่ได้และใช้ที่เก็บข้อมูลทั่วโลกสำหรับสถานะ
tr: Uygulamayı yeniden kullanılabilir bileşenlere böler ve durumu yönetmek için bir global mağaza kullanırdım.
uk: Я б розділив додаток на багаторазові компоненти і використовував глобальне сховище для стану.
vi: Tôi sẽ tách ứng dụng thành các thành phần có thể tái sử dụng và sử dụng một cửa hàng toàn cục cho trạng thái.

source: I would use margin: auto on the div.
ar: يمكنني استخدام margin: auto على ال div.
be: Я б выкарыстаў margin: auto на div.
da: Jeg ville bruge margin: auto på div'en.
de: Ich würde margin: auto auf das div anwenden.
es: Usaría margin: auto en el div.
fr: plaintext J'utiliserais margin: auto sur le div.
id: Saya akan menggunakan margin: auto pada div.
it: Userei margin: auto sul div.
ja: plaintext 私はdivにmargin: autoを使用します。
no: Jeg ville brukt margin: auto på div-en.
pl: Użyłbym margin: auto na div.
pt: Eu usaria margin: auto no div.
ru: Я бы использовал margin: auto для div.
sv: Jag skulle använda margin: auto på div-elementet.
th: ฉันจะใช้ margin: auto บน div.
tr: Div üzerinde margin: auto kullanırdım.
uk: Я б використав margin: auto на div.
vi: Tôi sẽ sử dụng margin: auto trên div.

source: I would use React.memo and lazy loading to reduce unnecessary renders.
ar: سأستخدم React.memo والتحميل الكسول (lazy loading) لتقليل عمليات إعادة العرض غير الضرورية.
be: Я б выкарыстаў React.memo і лянівае загрузку, каб скараціць непатрэбныя рэндэры.
da: Jeg ville bruge React.memo og lazy loading for at reducere unødvendige rendering.
de: Ich würde React.memo und Lazy Loading verwenden, um unnötige Renderings zu reduzieren.
es: Usaría React.memo y carga diferida para reducir renderizados innecesarios.
fr: Je voudrais utiliser React.memo et le chargement différé pour réduire les rendus inutiles.
id: Saya akan menggunakan React.memo dan lazy loading untuk mengurangi render yang tidak perlu.
it: Userei React.memo e il caricamento lazy per ridurre i render non necessari.
ja: 私は、不要なレンダリングを減らすために React.memo およびレイジーローディングを使用します。
ms: Saya akan menggunakan React.memo dan pemuatan malas untuk mengurangkan rendering yang tidak perlu.
no: Jeg ville brukt React.memo og lazy loading for å redusere unødvendige rendering.
pl: Użyłbym React.memo i ładowania leniwego, aby zredukować niepotrzebne renderowania.
pt: Eu usaria React.memo e carregamento sob demanda para reduzir renderizações desnecessárias.
ru: Я бы использовал React.memo и ленивую загрузку, чтобы уменьшить ненужные рендеры.
sv: Jag skulle använda React.memo och lazy loading för att minska onödiga renderingar.
th: ฉันจะใช้ React.memo และการโหลดแบบ lazy loading เพื่อลดการเรนเดอร์ที่ไม่จำเป็น
tr: Gereksiz renderları azaltmak için React.memo ve lazy loading kullanabilirim.
uk: Я б використовував React.memo та ліниве завантаження, щоб зменшити непотрібні рендери.
vi: Tôi sẽ sử dụng React.memo và tải lười để giảm bớt render không cần thiết.

source: I'd add in-memory caching and increase DB resources.
ar: plaintext سأضيف ذاكرة تخزين مؤقت في الذاكرة وأزيد من موارد قاعدة البيانات.
be: Я б дадаў кэшаванне ў памяці і павялічыў рэсурсы БД.
da: Jeg ville tilføje in-memory caching og øge database ressourcerne.
de: Ich würde In-Memory-Caching hinzufügen und die Datenbankressourcen erhöhen.
es: Añadiría almacenamiento en caché en memoria y aumentaría los recursos de la base de datos.
fr: J'ajouterais une mise en cache en mémoire et augmenterais les ressources DB.
id: Saya akan menambahkan caching dalam memori dan meningkatkan sumber daya basis data.
it: Aggiungerei la cache in-memory e incrementerei le risorse del DB.
ja: メモリ内キャッシュを追加し、データベースリソースを増やします。
ms: Saya akan menambah penampanan dalam memori dan meningkatkan sumber DB.
no: Jeg vil legge til in-memory caching og øke DB-ressursene.
pl: Dodałbym pamięć podręczną w pamięci i zwiększył zasoby bazy danych.
pt: Eu adicionaria cache em memória e aumentaria os recursos do banco de dados.
ru: Я бы добавил кэширование в памяти и увеличил ресурсы базы данных.
sv: Jag skulle lägga till caching i minnet och öka DB-resurserna.
th: ฉันจะเพิ่มการแคชในหน่วยความจำและเพิ่มทรัพยากรฐานข้อมูล
tr: Bellek içi önbellekleme ekler ve veritabanı kaynaklarını artırırım.
uk: Я б додав кешування в оперативній пам'яті та збільшив ресурси бази даних.
vi: Tôi sẽ thêm bộ nhớ đệm trong bộ nhớ và tăng tài nguyên cơ sở dữ liệu.

source: I'd add retries with a longer timeout.
ar: سأضيف محاولات إعادة مع وقت انتظار أطول.
be: Я б дадаў паўторы з больш доўгім часам чакання.
da: Jeg vil tilføje gentagelsesforsøg med en længere timeout.
de: Ich würde Wiederholungen mit einem längeren Timeout hinzufügen.
es: Agregaría reintentos con un tiempo de espera más largo.
fr: J'ajouterais des nouvelles tentatives avec un délai d'attente plus long.
id: Saya akan menambahkan percobaan ulang dengan batas waktu yang lebih lama.
it: Aggiungerei ritentativi con un timeout più lungo.
ja: 再試行を追加し、タイムアウトを長くします。
ms: Saya akan menambah percubaan semula dengan tempoh tamat yang lebih lama.
no: Jeg ville lagt til nye forsøk med lengre tidsavbrudd.
pl: Dodałbym ponowienia z dłuższym limitem czasu.
pt: Eu adicionaria novas tentativas com um tempo limite mais longo.
ru: Я бы добавил повторные попытки с более длительным тайм-аутом.
sv: Jag skulle lägga till omförsök med en längre timeout.
th: ฉันจะเพิ่มการลองใหม่พร้อมกับการหมดเวลาที่ยาวนานขึ้น
tr: Tekrar denemeler ve daha uzun bir zaman aşımı süresi eklerdim.
uk: Я б додав повтори з довшим тайм-аутом.
vi: Tôi sẽ thêm thử lại với thời gian chờ lâu hơn.

source: I'll ask you a few questions to get to know you. Then, based on your answers, I'll create a personalized practice plan for you.
de: Ich werde Ihnen ein paar Fragen stellen, um Sie besser kennenzulernen. Anhand Ihrer Antworten erstelle ich dann einen personalisierten Übungsplan für Sie.
es: Te haré algunas preguntas para conocerte. Luego, basado en tus respuestas, crearé un plan de práctica personalizado para ti.
id: Saya akan mengajukan beberapa pertanyaan untuk mengenal Anda. Kemudian, berdasarkan jawaban Anda, saya akan membuat rencana latihan yang dipersonalisasi untuk Anda.
it: Ti farò alcune domande per conoscerti meglio. Poi, in base alle tue risposte, creerò un piano di pratica personalizzato per te.
ja: あなたを知るためにいくつか質問をします。その後、あなたの回答に基づいて、個別の練習プランを作成します。
no: Jeg vil stille deg noen spørsmål for å bli kjent med deg. Deretter vil jeg, basert på svarene dine, lage en personlig tilpasset praksisplan for deg.
pl: Zadam ci kilka pytań, aby cię lepiej poznać. Następnie, na podstawie twoich odpowiedzi, stworzę spersonalizowany plan ćwiczeń dla ciebie.
pt: Vou lhe fazer algumas perguntas para conhecê-lo melhor. Em seguida, com base em suas respostas, criarei um plano de prática personalizado para você.
ru: Я задам вам несколько вопросов, чтобы лучше с вами познакомиться. Затем, на основе ваших ответов, я создам для вас персонализированный план практики.
sv: Jag kommer att ställa några frågor för att lära känna dig. Baserat på dina svar kommer jag sedan att skapa en personlig övningsplan för dig.
th: ฉันจะถามคุณบางคำถามเพื่อทำความรู้จักคุณ จากนั้น ตามคำตอบของคุณ ฉันจะสร้างแผนการฝึกฝนที่เหมาะสมสำหรับคุณ
tr: Sizi tanımak için size birkaç soru soracağım. Ardından, verdiğiniz cevaplara dayanarak size kişiselleştirilmiş bir çalışma planı oluşturacağım.
uk: Я задам вам кілька запитань, щоб дізнатися більше про вас. Після цього, на основі ваших відповідей, я створю для вас персоналізований план практики.
vi: Tôi sẽ hỏi bạn một vài câu hỏi để hiểu hơn về bạn. Sau đó, dựa vào câu trả lời của bạn, tôi sẽ tạo một kế hoạch luyện tập cá nhân hóa cho bạn.
