Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: of the Website operated by Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" with its registered office in Warsaw.
ar: للموقع الإلكتروني الذي تديره Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" والذي يقع مكتبها المسجل في وارسو.
be: вэб-сайт, які аперуе Фундацыя развіцця прадпрыемстваў "Твой Стартап" з яго зарэгістраваным офісам у Варшаве.
da: af websitet drevet af Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" med sit registrerede kontor i Warszawa.
de: der von der Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" betriebenen Website mit Sitz in Warschau.
es: del Sitio Web operado por Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" con su oficina registrada en Varsovia.
fr: du site Web exploité par la Fondation pour le développement de l'entrepreneuriat "Twój StartUp", avec son siège à Varsovie.
id: dari Situs yang dioperasikan oleh Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" dengan kantor pusatnya di Warsaw.
it: del Sito Web gestito da Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" con sede legale a Varsavia.
ja: Fundacja Rozwoju Przedsiębiorczości "Twój StartUp"という名前でワルシャワに本社を置く運営されるウェブサイトの。
ms: dari Laman Web yang dikendalikan oleh Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" dengan pejabatnya yang berdaftar di Warsaw.
no: av nettstedet som drives av Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" med sitt registrerte kontor i Warszawa.
pl: strony internetowej prowadzonej przez Fundację Rozwoju Przedsiębiorczości "Twój StartUp" z siedzibą w Warszawie.
pt: do Website operado pela Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" com seu escritório registrado em Varsóvia.
ru: сайта, управляемого Фондом Развития Предпринимательства "Твой Стартап" со своей зарегистрированной службой в Варшаве.
sv: av webbplatsen som drivs av Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" med sitt registrerade kontor i Warszawa.
th: ของเว็บไซต์ที่ดำเนินการโดย Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" ที่มีสำนักงานใหญ่อยู่ที่วอร์ซอ
tr: Varşova'da kayıtlı ofisi bulunan Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" tarafından işletilen Web Sitesi.
uk: вебсайту, що керується Фондом розвитку підприємництва "Twój StartUp" зі своїм зареєстрованим офісом у Варшаві.
vi: của trang web được điều hành bởi Fundacja Rozwoju Przedsiębiorczości "Twój StartUp" có trụ sở đăng ký tại Warsaw.

source: On the next steps, you'll receive a detailed analysis of your answers and example responses to help you improve.
ar: في الخطوات التالية، ستتلقى تحليلًا مفصلًا لأجوبتك وأمثلة على الردود لمساعدتك في التحسن.
be: На наступных кроках вы атрымаеце падрабязны аналіз вашых адказаў і прыклады адказаў, каб дапамагчы вам палепшыцца.
da: I de næste trin vil du modtage en detaljeret analyse af dine svar og eksempler på svar for at hjælpe dig med at forbedre dig.
de: In den nächsten Schritten erhalten Sie eine detaillierte Analyse Ihrer Antworten und Beispielantworten, um Ihnen bei der Verbesserung zu helfen.
es: En los próximos pasos, recibirás un análisis detallado de tus respuestas y ejemplos de respuestas para ayudarte a mejorar.
fr: Dans les prochaines étapes, vous recevrez une analyse détaillée de vos réponses et des exemples de réponses pour vous aider à vous améliorer.
id: Pada langkah berikutnya, Anda akan menerima analisis terperinci dari jawaban Anda dan contoh tanggapan untuk membantu Anda meningkatkan.
it: Nei prossimi passi, riceverai un'analisi dettagliata delle tue risposte e delle risposte esempio per aiutarti a migliorare.
ja: 次のステップでは、あなたの回答の詳細な分析と、改善のための例となる回答を受け取ることができます。
ms: Pada langkah seterusnya, anda akan menerima analisis terperinci mengenai jawapan anda dan contoh respons untuk membantu anda memperbaiki diri.
no: I de neste trinnene vil du motta en detaljert analyse av svarene dine og eksempler på svar for å hjelpe deg med å forbedre deg.
pl: Na kolejnych krokach otrzymasz szczegółową analizę swoich odpowiedzi oraz przykładowe odpowiedzi, które pomogą Ci się poprawić.
pt: Nos próximos passos, você receberá uma análise detalhada das suas respostas e exemplos de respostas para ajudá-lo a melhorar.
ru: На следующем этапе вы получите детальный анализ ваших ответов и примеры ответов, которые помогут вам улучшить ваши навыки.
sv: I nästa steg kommer du att få en detaljerad analys av dina svar och exempelresponser för att hjälpa dig att förbättra dig.
th: ในขั้นตอนถัดไป คุณจะได้รับการวิเคราะห์รายละเอียดของคำตอบของคุณและตัวอย่างคำตอบที่ช่วยให้คุณพัฒนาได้มากขึ้น
tr: Bir sonraki adımlarda, yanıtlarınızın ayrıntılı bir analizini ve gelişmenize yardımcı olması için örnek yanıtlar alacaksınız.
uk: На наступних етапах ви отримаєте детальний аналіз ваших відповідей та приклади відповідей, які допоможуть вам покращити навички.
vi: Trong các bước tiếp theo, bạn sẽ nhận được phân tích chi tiết về câu trả lời của mình và các ví dụ trả lời để giúp bạn cải thiện.

source: On this platform, you can upload your resume, specify your desired job, and go through a realistic interview with an AI interviewer.
ar: على هذا المنصة، يمكنك تحميل سيرتك الذاتية، تحديد الوظيفة التي ترغب فيها، والمرور بمقابلة واقعية مع مقابل وظيفي من الذكاء الاصطناعي.
be: На гэтай платформе вы можаце загрузіць сваё рэзюмэ, указаць пажаданую работу і прайсці рэалістычнае інтэрв'ю з AI-спрадвыкаўцам.
da: På denne platform kan du uploade dit cv, angive dit ønskede job og gennemgå et realistisk interview med en AI-interviewer.
de: Auf dieser Plattform können Sie Ihren Lebenslauf hochladen, Ihren gewünschten Job angeben und ein realistisches Interview mit einem KI-Interviewer durchlaufen.
es: En esta plataforma, puedes subir tu currículum, especificar el trabajo deseado y pasar por una entrevista realista con un entrevistador de IA.
fr: Sur cette plateforme, vous pouvez télécharger votre CV, spécifier l'emploi que vous désirez, et passer un entretien réaliste avec un intervieweur IA.
id: Di platform ini, Anda dapat mengunggah resume Anda, menentukan pekerjaan yang diinginkan, dan melalui wawancara yang realistis dengan pewawancara AI.
it: Su questa piattaforma, puoi caricare il tuo curriculum, specificare il lavoro desiderato e sostenere un colloquio realistico con un intervistatore AI.
ja: このプラットフォームでは、履歴書をアップロードし、希望する職種を指定し、AI面接官とのリアルな面接を行うことができます。
ms: Di platform ini, anda boleh memuat naik resume anda, menentukan pekerjaan yang diingini, dan menjalani temuduga yang realistik dengan pewawancara AI.
no: På denne plattformen kan du laste opp din CV, spesifisere din ønskede jobb, og gå gjennom et realistisk intervju med en AI-intervjuer.
pl: Na tej platformie możesz przesłać swoje CV, określić pożądaną pracę i przejść przez realistyczną rozmowę kwalifikacyjną z AI rekruterem.
pt: Nesta plataforma, você pode fazer o upload do seu currículo, especificar o emprego desejado e passar por uma entrevista realista com um entrevistador IA.
ru: На этой платформе вы можете загрузить свое резюме, указать желаемую работу и пройти реалистичное собеседование с AI интервьюером.
sv: På denna plattform kan du ladda upp ditt CV, specificera ditt önskade jobb och genomgå en realistisk intervju med en AI-intervjuare.
th: บนแพลตฟอร์มนี้ คุณสามารถอัพโหลดเรซูเม่ของคุณ ระบุงานที่คุณต้องการ และผ่านการสัมภาษณ์ที่เป็นจริงด้วยผู้สัมภาษณ์ AI
tr: Bu platformda, özgeçmişinizi yükleyebilir, istediğiniz işi belirtebilir ve bir AI mülakatçısıyla gerçekçi bir mülakata girebilirsiniz.
uk: На цій платформі ви можете завантажити своє резюме, вказати бажану роботу та пройти реалістичне співбесідування з AI-інтерв'юером.
vi: Trên nền tảng này, bạn có thể tải lên hồ sơ của mình, xác định công việc mong muốn và trải qua cuộc phỏng vấn thực tế với người phỏng vấn AI.

source: Once the debate begins, you'll need to record down your answers. Then, AI will determine the winner! {userName} will see your answers too
id: Setelah debat dimulai, Anda perlu mencatat jawaban Anda. Kemudian, AI akan menentukan pemenangnya! {userName} juga akan melihat jawaban Anda
it: Una volta iniziato il dibattito, dovrai annotare le tue risposte. Poi, l'AI determinerà il vincitore! {userName} vedrà anche le tue risposte.
ja: 論戦が始まったら、答えを記録する必要があります。その後、AI が勝者を決定します！{userName}もあなたの答えを見ることができます。
no: Når debatten begynner, må du notere svarene dine. Deretter vil AI avgjøre hvem som vinner! {userName} vil også se svarene dine
pl: Gdy debata się rozpocznie, będziesz musiał zapisać swoje odpowiedzi. Następnie AI wyłoni zwycięzcę! {userName} również zobaczy twoje odpowiedzi
ru: Как только начнётся дебаты, вам нужно будет записать свои ответы. Затем ИИ определит победителя! {userName} тоже увидит ваши ответы
sv: När debatten börjar måste du anteckna dina svar. Därefter kommer AI att avgöra vinnaren! {userName} kommer också att se dina svar
uk: Як тільки почнеться дебати, вам потрібно буде записати свої відповіді. Потім AI визначить переможця! {userName} також побачить ваші відповіді

source: One more thing.
ja: もう一つ。
no: En ting til.
uk: Ще одна річ.

source: One thing left to do
ar: بقي شيء واحد للقيام به
be: Застаецца адно, што трэба зрабіць
da: En ting tilbage at gøre
de: Noch eine Sache zu tun
es: Una cosa más por hacer
fr: Il ne reste qu'une chose à faire
id: Satu hal lagi yang harus dilakukan
it: Una cosa ancora da fare
ja: 後に残された一つのこと
ms: Satu perkara lagi yang perlu dilakukan
no: Én ting igjen å gjøre
pl: Jedna rzecz do zrobienia
pt: Uma coisa restante a fazer
ru: Осталось сделать одну вещь
sv: En sak kvar att göra
th: อีกสิ่งเดียวที่ต้องทำ
tr: Yapılacak bir şey kaldı
uk: Залишилось зробити одну річ
vi: Chỉ còn một việc cần làm

source: Online English
ar: &nbsp;تعليم الإنجليزية عبر الإنترنت
be: Анлайн англійская
da: Online engelsk
de: Online Englisch
es: Online Inglés
fr: En ligne anglais
id: Online Inggris
ja: オンライン英語
ms: Dalam Talian Bahasa Inggeris
no: Online engelsk
pl: Online Angielski
pt: Online em Inglês
ru: Онлайн английский
sv: Online engelska
th: ออนไลน์ภาษาอังกฤษ
tr: Çevrimiçi İngilizce
uk: Онлайн англійська
vi: Online tiếng Anh

source: online English pricing
ar: تسعير الدروس الإنجليزية عبر الإنترنت
be: цэны на англійскую мову ў Інтэрнэце
da: online engelsk prisfastsættelse
de: online Englisch Preise
es: precio del inglés en línea
fr: prix en ligne de l'anglais
id: harga bahasa Inggris daring
it: prezzi inglesi online
ja: オンライン英語料金
ms: harga Bahasa Inggeris dalam talian
no: online engelsk prismodell
pl: cennik kursów języka angielskiego online
pt: preços de inglês online
ru: онлайн-цены на английский язык
sv: online engelska prissättning
th: ราคาคอร์สเรียนภาษาอังกฤษออนไลน์
tr: online İngilizce fiyatlandırması
uk: онлайн ціни на англійську
vi: giá học tiếng Anh trực tuyến

source: Online Language Practice
ar: ممارسة اللغة عبر الإنترنت
be: Практыка анлайн мовы
da: Online sprogpraksis
de: Online-Sprachpraxis
es: Práctica de Idiomas en Línea
fr: Pratique de langues en ligne
it: Pratica Linguistica Online
ja: オンライン言語練習
ms: Amalan Bahasa Dalam Talian
no: Online Språkpraksis
pl: Online praktyka językowa
pt: Prática de Línguas Online
ru: Онлайн практика языка
sv: Online språkträning
th: การฝึกภาษาทางออนไลน์
tr: Çevrimiçi Dil Pratiği
uk: Онлайн практика мов
vi: Chăm Sóc Ngôn Ngữ Trực Tuyến

source: Oops! Something went wrong
ar: عفوًا! حدث خطأ ما
be: Ой! Нешта пайшло не так
da: Ups! Noget gik galt
de: Hoppla! Etwas ist schief gelaufen
es: ¡Vaya! Algo salió mal
fr: Oups! Quelque chose s'est mal passé
id: Ups! Ada yang salah
it: Oops! Qualcosa è andato storto
ja: おっと！何かが間違っています
ms: Oops! Ada yang tidak kena
no: Oops! Noe gikk galt
pl: Ups! Coś poszło nie tak
pt: Ops! Algo deu errado
ru: Ой! Что-то пошло не так
sv: Oj! Något gick fel
th: โอ๊ะ! มีบางอย่างผิดพลาด
tr: Hata! Bir şeyler ters gitti
uk: Ой! Щось пішло не так
vi: Rất tiếc! Đã xảy ra lỗi

source: Open
ar: افتح
be: Адкрыць
da: Åben
de: Öffnen
es: Abrir
fr: Ouvrir
id: Buka
it: Apri
ja: 開く
ms: Buka
no: Åpne
pl: Otwórz
pt: Abrir
ru: Открыть
sv: Öppna
th: เปิด
tr: Aç
uk: Відкрити
vi: Mở

source: Open Dashboard
ar: افتح لوحة التحكم
be: Адкрыць панэль кіравання
da: Åbn Dashboard
de: Dashboard öffnen
es: Abrir Panel de Control
fr: Ouvrir le tableau de bord
id: Buka Dasbor
it: Apri Dashboard
ja: ダッシュボードを開く
no: Åpne Dashboard
pl: Otwórz Pulpit
pt: Abrir Painel de Controle
ru: Открыть Панель управления
sv: Öppna Instrumentpanel
th: เปิดแผงควบคุม
tr: Gösterge Tablosunu Aç
uk: Відкрити Панель управління
vi: Mở Bảng Điều Khiển

source: Open history
ar: افتح السجل
be: Адкрыць гісторыю
da: Åben historik
de: Öffnen Sie die Geschichte
es: Abrir historial
fr: Ouvrir l'historique
id: Buka sejarah
it: Apri la cronologia
ja: 履歴を開く
ms: Buka sejarah
no: Åpne historikk
pl: Otwórz historię
pt: Abrir histórico
ru: Открыть историю
sv: Öppna historik
th: เปิดประวัติ
tr: Geçmişi aç
uk: Відкрити історію
vi: Mở lịch sử

source: Open in Browser
ar: افتح في المتصفح
be: Адкрыць у браўзеры
da: Åbn i Browser
de: Im Browser öffnen
es: Abrir en el navegador
fr: Ouvrir dans le navigateur
id: Buka di Peramban
it: Apri nel Browser
ja: ブラウザで開く
ms: Buka dalam Pelayar
no: Åpne i nettleser
pl: Otwórz w przeglądarce
pt: Abrir no Navegador
ru: Открыть в браузере
sv: Öppna i webbläsare
th: เปิดในเบราว์เซอร์
tr: Tarayıcıda Aç
uk: Відкрити в браузері
vi: Mở trong Trình duyệt

source: Open in Telegram
ar: افتح في تيليجرام
be: Адкрыць у Telegram
da: Åbn i Telegram
de: In Telegram öffnen
es: Abrir en Telegram
fr: Ouvrir dans Telegram
id: Buka di Telegram
it: Apri in Telegram
ja: テレグラムで開く
ms: Buka dalam Telegram
no: Åpne i Telegram
pl: Otwórz w Telegramie
pt: Abrir no Telegram
ru: Открыть в Telegram
sv: Öppna i Telegram
th: เปิดใน Telegram
tr: Telegram'da Aç
uk: Відкрити в Telegram
vi: Mở trong Telegram

source: Open personal plan
ar: افتح الخطة الشخصية
be: Адкрыць персанальны план
da: Åbn personlig plan
de: Persönlichen Plan öffnen
es: Abrir plan personal
fr: Ouvrir le plan personnel
id: Buka rencana pribadi
it: Apri piano personale
ja: パーソナルプランを開く
ms: Buka pelan peribadi
no: Åpne personlig plan
pl: Otwórz plan osobisty
pt: Abrir plano pessoal
ru: Открыть личный план
sv: Öppna personlig plan
th: เปิดแผนส่วนบุคคล
tr: Kişisel planı aç
uk: Відкрити персональний план
vi: Mở kế hoạch cá nhân

source: Open results
ar: افتح النتائج
be: Адкрыць вынікі
da: Åbn resultater
de: Ergebnisse öffnen
es: Abrir resultados
fr: Résultats ouverts
id: Buka hasil
it: Apri i risultati
ja: 結果を開く
ms: Buka hasil
no: Åpne resultater
pl: Otwórz wyniki
pt: Abrir resultados
ru: Открыть результаты
sv: Öppna resultat
th: เปิดผลลัพธ์
tr: Sonuçları aç
uk: Відкрити результати
vi: Mở kết quả

source: Open someones profile and press "Invite to a debate" button to start a debate!
id: Buka profil seseorang dan tekan tombol "Undang ke debat" untuk memulai debat!
it: Apri il profilo di qualcuno e premi il pulsante "Invita a un dibattito" per avviare un dibattito!
ja: 他の人のプロフィールを開き、「ディベートに招待」ボタンを押してディベートを開始してください！
no: Åpne noens profil og trykk på "Inviter til en debatt" knappen for å starte en debatt!
pl: Otwórz profil kogoś i naciśnij przycisk „Zaproś do debaty”, aby rozpocząć debatę!
ru: Откройте чей-то профиль и нажмите кнопку «Пригласить на дебаты», чтобы начать дебаты!
sv: Öppna någons profil och tryck på knappen "Bjud in till en debatt" för att starta en debatt!
uk: Відкрийте профіль когось і натисніть кнопку "Запросити до дебатів", щоб почати дебати!

source: Order food, schedule appointments, ace job interviews, and more—all with guidance from your AI tutor.
ar: أطلب الطعام، جدولة المواعيد، التميز في مقابلات العمل، والمزيد - كل ذلك مع توجيه من معلمك الذكي.
be: Замовляйце ежу, распрацавайце графік прыёмаў, успешна праходзьце сабеседаванні на работу і многае іншае — усё пад кіраўніцтвам вашага штучнага інтэлекту-рэпетытара.
da: Bestil mad, planlæg aftaler, klar jobinterviews og meget mere—alt sammen med vejledning fra din AI lærer.
de: Bestellen Sie Essen, planen Sie Termine, meistern Sie Vorstellungsgespräche und mehr – alles mit Unterstützung Ihres KI-Tutors.
es: Ordena comida, programa citas, destaca en entrevistas de trabajo y más, todo con la orientación de tu tutor de IA.
fr: Commandez de la nourriture, planifiez des rendez-vous, réussissez vos entretiens d'embauche, et plus encore—tout cela avec l'aide de votre tuteur IA.
id: Pesan makanan, jadwalkan janji temu, sukses dalam wawancara kerja, dan lainnya—semua dengan bimbingan dari tutor AI Anda.
it: Ordina cibo, programma appuntamenti, supera colloqui di lavoro e altro ancora—tutto con l'assistenza del tuo tutor AI.
ja: 食べ物の注文、予約のスケジュール、仕事の面接の成功など、すべてあなたのAIチューターからのガイダンスで行います。
ms: Pesan makanan, jadwalkan janji temu, cemerlang dalam wawancara kerja, dan banyak lagi—semua dengan panduan dari tutor AI anda.
no: Bestill mat, planlegg avtaler, bestå jobbintervjuer og mer—alt med veiledning fra din AI-lærer.
pl: Zamawiaj jedzenie, planuj spotkania, zdobądź pracę marzeń i więcej—wszystko z pomocą swojego nauczyciela AI.
pt: Peça comida, agende compromissos, arrase em entrevistas de emprego e muito mais—tudo com a orientação do seu tutor de IA.
ru: Заказывайте еду, планируйте встречи, успешно проходите собеседования и многое другое — с помощью вашего AI-наставника.
sv: Beställ mat, schemalägg möten, lyckas på anställningsintervjuer och mer—allt med vägledning från din AI-lärare.
th: สั่งอาหาร, นัดหมาย, ทำสัมภาษณ์งานให้ผ่าน, และอื่นๆ—ทั้งหมดนั้นมีแนวทางจากผู้สอน AI ของคุณ
tr: Yemek siparişi verin, randevuları planlayın, iş mülakatlarında başarılı olun ve daha fazlası— hepsi AI eğitmeninizin rehberliğinde.
uk: Замовляйте їжу, плануйте зустрічі, успішно проходьте співбесіди та більше — все з підтримкою вашого AI-репетитора.
vi: Đặt đồ ăn, lên lịch hẹn, thành công trong các buổi phỏng vấn, và nhiều hơn thế nữa—tất cả với sự hướng dẫn từ gia sư AI của bạn.

source: Other common questions include:
ar: تشمل الأسئلة الشائعة الأخرى:
be: Іншыя распаўсюджаныя пытанні:
da: Andre almindelige spørgsmål inkluderer:
de: Andere häufig gestellte Fragen beinhalten:
es: Otras preguntas comunes incluyen:
fr: D'autres questions courantes incluent :
id: Pertanyaan umum lainnya meliputi:
it: Altre domande comuni includono:
ja: 他の一般的な質問には以下のようなものがあります：
ms: Soalan-soalan lain yang biasa termasuk:
no: Andre vanlige spørsmål inkluderer:
pl: Inne często zadawane pytania obejmują:
pt: Outras perguntas comuns incluem:
ru: Другие распространенные вопросы включают в себя:
sv: Andra vanliga frågor inkluderar:
th: คำถามทั่วไปอื่น ๆ รวมถึง:
tr: Diğer yaygın sorular şunları içerir:
uk: Інші поширені питання включають:
vi: Các câu hỏi phổ biến khác bao gồm:

source: Other languages
ar: لغات أخرى
be: Іншыя мовы
da: Andre sprog
de: Andere Sprachen
es: Otros idiomas
fr: Autres langues
id: Bahasa lain
it: Altre lingue
ja: 他の言語
ms: Bahasa lain
no: Andre språk
pl: Inne języki
pt: Outros idiomas
ru: Другие языки
sv: Andra språk
th: ภาษาอื่นๆ
tr: Diğer diller
uk: Інші мови
vi: Ngôn ngữ khác

source: Other useful strengths:
ar: نقاط قوة أخرى مفيدة:
be: Іншыя карысныя мацаванні:
da: Andre nyttige styrker:
de: Andere nützliche Stärken:
es: Otras fortalezas útiles:
fr: Autres forces utiles :
id: Kekuatan lain yang berguna:
it: Altre forze utili:
ja: 他に有用な強み:
ms: Kekuatan lain yang berguna:
no: Andre nyttige styrker:
pl: Inne użyteczne mocne strony:
pt: Outras habilidades úteis:
ru: Другие полезные сильные стороны:
sv: Andra användbara styrkor:
th: คุณสมบัติที่มีประโยชน์อื่น ๆ:
tr: Diğer kullanışlı güçler:
uk: Інші корисні сильні сторони:
vi: Các điểm mạnh khác hữu ích:
