Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: margin: auto only centers horizontally, not vertically. For a junior frontend role, you should know modern solutions: Flexbox (display: flex; justify-content: center; align-items: center on the parent), CSS Grid (place-items: center), or absolute positioning with transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Explain which method you'd prefer and why—this shows you understand trade-offs and current best practices.
ar: الهامش: auto يُركز فقط أفقياً، وليس عمودياً. بالنسبة لدور مبتدئ في واجهة المستخدم، يجب أن تعرف الحلول الحديثة: Flexbox (display: flex; justify-content: center; align-items: center على العنصر الأب)، CSS Grid (place-items: center)، أو التموضع المطلق مع التحويل (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). اشرح الطريقة التي تُفضلها ولماذا - هذا يُظهر أنك تفهم الموازنات وأفضل الممارسات الحالية.
be: margin: auto цэнтруе толькі па гарызанталі, не па вертыкалі. Для пазіцыі малодшага фронтэнда-распрацоўшчыка вы павінны ведаць сучасныя рашэнні: Flexbox (display: flex; justify-content: center; align-items: center на бацькоўскім элеменце), CSS Grid (place-items: center), або абсалютнае пазіцыянаванне з transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Патлумачце, які метад вы аддаяце перавагу і чаму - гэта дэманструе ваша разуменне кампрамісаў і сучасных лепшых практык.
da: margin: auto centrerer kun horisontalt, ikke vertikalt. Til en junior frontend rolle bør du kende moderne løsninger: Flexbox (display: flex; justify-content: center; align-items: center på forælderen), CSS Grid (place-items: center), eller absolut positionering med transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Forklar hvilken metode du foretrækker og hvorfor—dette viser, at du forstår afvejninger og aktuelle bedste praksis.
de: margin: auto zentriert nur horizontal, nicht vertikal. Für eine Junior-Frontend-Position sollten Sie moderne Lösungen kennen: Flexbox (display: flex; justify-content: center; align-items: center beim Elternteil), CSS Grid (place-items: center) oder absolute Positionierung mit transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Erklären Sie, welche Methode Sie bevorzugen und warum—das zeigt, dass Sie Kompromisse und aktuelle Best Practices verstehen.
es: margin: auto solo centra horizontalmente, no verticalmente. Para un rol junior de frontend, deberías conocer soluciones modernas: Flexbox (display: flex; justify-content: center; align-items: center en el elemento padre), CSS Grid (place-items: center), o posicionamiento absoluto con transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Explica qué método preferirías y por qué, esto demuestra que entiendes los compromisos y las mejores prácticas actuales.
fr: margin: auto centre uniquement horizontalement, pas verticalement. Pour un rôle de développeur frontend junior, vous devez connaître les solutions modernes : Flexbox (display: flex; justify-content: center; align-items: center sur le parent), CSS Grid (place-items: center), ou positionnement absolu avec transformation (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Expliquez quelle méthode vous préférez et pourquoi—cela montre que vous comprenez les compromis et les meilleures pratiques actuelles.
id: margin: auto hanya memusatkan secara horizontal, bukan vertikal. Untuk peran frontend junior, kamu seharusnya tahu solusi modern: Flexbox (display: flex; justify-content: center; align-items: center pada elemen induk), CSS Grid (place-items: center), atau penempatan absolut dengan transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Jelaskan metode mana yang kamu lebih pilih dan mengapa—ini menunjukkan bahwa kamu memahami trade-off dan praktik terbaik saat ini.
it: margin: auto centra solo orizzontalmente, non verticalmente. Per un ruolo junior di frontend, dovresti conoscere le soluzioni moderne: Flexbox (display: flex; justify-content: center; align-items: center sul genitore), CSS Grid (place-items: center), o posizionamento assoluto con trasformazione (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Spiega quale metodo preferiresti e perché—questo dimostra che comprendi compromessi e pratiche migliori attuali.
ja: margin: autoは水平方向にのみ中央揃えを行い、垂直方向には行いません。 ジュニアフロントエンドの役割においては、モダンな解決策を知っておくべきです：Flexbox（display: flex; parentにjustify-content: center; align-items: center）、CSS Grid（place-items: center）、またはtransformを使用した絶対位置指定（position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)）。どの方法を好むか、そしてその理由を説明してください。これにより、トレードオフと現在のベストプラクティスを理解していることが示されます。
no: margin: auto sentrerer bare horisontalt, ikke vertikalt. For en junior frontend-rolle bør du vite om moderne løsninger: Flexbox (display: flex; justify-content: center; align-items: center på forelderen), CSS Grid (place-items: center), eller absolutt posisjonering med transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Forklar hvilken metode du foretrekker og hvorfor—dette viser at du forstår trade-offs og nåværende beste praksis.
pl: margin: auto centrowanie poziome, a nie pionowe. Na junior frontend dewelopera roli, powinieneś znać nowoczesne rozwiązania: Flexbox (display: flex; justify-content: center; align-items: center na elemencie nadrzędnym), CSS Grid (place-items: center) lub pozycjonowanie absolutne z transformacją (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Wyjaśnij, którą metodę preferujesz i dlaczego - to pokazuje, że rozumiesz kompromisy i obecne najlepsze praktyki.
pt: margin: auto só centraliza horizontalmente, não verticalmente. Para um cargo júnior de frontend, você deve conhecer soluções modernas: Flexbox (display: flex; justify-content: center; align-items: center no elemento pai), CSS Grid (place-items: center) ou posicionamento absoluto com transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Explique qual método você prefere e por quê—isso mostra que você entende as compensações e as melhores práticas atuais.
ru: margin: auto центрирует только по горизонтали, а не по вертикали. Для младшей должности фронтенд-разработчика вы должны знать современные решения: Flexbox (display: flex; justify-content: center; align-items: center на родительском элементе), CSS Grid (place-items: center) или абсолютное позиционирование с использованием transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Объясните, какой метод вы предпочли бы и почему — это покажет, что вы понимаете компромиссы и современные лучшие практики.
sv: margin: auto centrerar endast horisontellt, inte vertikalt. För en junior frontend-roll bör du känna till moderna lösningar: Flexbox (display: flex; justify-content: center; align-items: center på föräldern), CSS Grid (place-items: center), eller absolut positionering med transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Förklara vilken metod du skulle föredra och varför—detta visar att du förstår kompromisser och nuvarande bästa praxis.
th: margin: auto ใช้เพื่อจัดกึ่งกลางในแนวนอนเท่านั้น ไม่ใช่แนวตั้ง สำหรับหน้าที่เริ่มต้นในส่วนของการพัฒนา frontend ควรที่จะรู้จักวิธีการที่ทันสมัย: Flexbox (display: flex; justify-content: center; align-items: center บนพาเรนต์), CSS Grid (place-items: center) หรือการกำหนดด้วยตำแหน่งสัมบูรณ์ร่วมกับการแปลง (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). อธิบายว่าวิธีใดที่คุณต้องการใช้และทำไม—การตอบนี้จะแสดงให้เห็นว่าคุณเข้าใจถึงการแลกเปลี่ยนและวิธีการที่ดีที่สุดในปัจจุบัน
tr: margin: auto yalnızca yatayda ortalar, dikeyde değil. Junior frontend rolü için modern çözümleri bilmelisiniz: Flexbox (parent üzerinde display: flex; justify-content: center; align-items: center), CSS Grid (place-items: center) veya transform ile mutlak konumlandırma (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Hangi yöntemi tercih edeceğiniz ve nedenini açıklayın—bu, alışverişleri ve mevcut en iyi uygulamaları anladığınızı gösterir.
uk: margin: auto центрує лише по горизонталі, а не по вертикалі. Для позиції молодшого фронтенд-розробника ви повинні знати сучасні рішення: Flexbox (display: flex; justify-content: center; align-items: center на батьківському елементі), CSS Grid (place-items: center) або абсолютне позиціювання з трансформацією (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Поясніть, який метод ви б віддали перевагу і чому — це показує, що ви розумієте компроміси та сучасні найкращі практики.
vi: margin: auto chỉ căn giữa theo chiều ngang, không phải theo chiều dọc. Đối với một vai trò frontend junior, bạn nên biết các giải pháp hiện đại: Flexbox (display: flex; justify-content: center; align-items: center trên phần tử cha), CSS Grid (place-items: center), hoặc định vị tuyệt đối với transform (position: absolute; top: 50%; left: 50%; transform: translate(-50%, -50%)). Hãy giải thích phương pháp mà bạn ưa thích và lý do tại sao—điều này cho thấy bạn hiểu được sự đánh đổi và các thực hành tốt nhất hiện nay.

source: Master answering common interview questions with AI
ar: اتقن الإجابة على أسئلة المقابلات الشائعة باستخدام الذكاء الاصطناعي
be: Апануй адказы на агульныя пытанні на спатканні з дапамогай AI
da: Behersk besvarelse af almindelige interviewspørgsmål med AI
de: Meistern Sie die Beantwortung von häufigen Vorstellungsgesprächen mit KI
es: Domina las respuestas a las preguntas comunes de entrevistas con IA
fr: Maîtrisez les réponses aux questions d'entretien courantes avec l'IA
id: Kuasai menjawab pertanyaan wawancara umum dengan AI
it: Padroneggia la risposta alle domande comuni del colloquio con l'IA
ja: AIを使って一般的な面接質問に答えるコツをマスターしよう
ms: Kuasa menjawab soalan temuduga umum dengan AI
no: Behersk å svare på vanlige intervjuspørsmål med AI
pl: Mistrz odpowiadania na powszechne pytania podczas rozmowy kwalifikacyjnej z AI
pt: Domine a resposta a perguntas comuns de entrevistas com IA
ru: Освойте ответы на распространенные вопросы собеседования с помощью ИИ
sv: Behärska att svara på vanliga intervjufrågor med AI
th: เชี่ยวชาญในการตอบคำถามสัมภาษณ์ทั่วไปด้วย AI
tr: Yapay Zeka ile yaygın mülakat sorularını yanıtlamada ustalaşın
uk: Опануйте відповіді на поширені питання інтерв'ю за допомогою ШІ
vi: Làm chủ việc trả lời các câu hỏi phỏng vấn phổ biến với AI

source: Master API and service design
ar: إتقان واجهة برمجة التطبيقات وتصميم الخدمات
be: Майстар API і распрацоўка сэрвісаў
da: Mestre API og servicedesign
de: Beherrsche API und Servicedesign
es: Dominar el diseño de APIs y servicios
fr: Maîtriser la conception d'API et de service
id: Kuasai Desain API dan Layanan
it: Dominare l'API e la progettazione dei servizi
ja: APIとサービスデザインをマスターする
ms: Master API dan reka bentuk perkhidmatan
no: Mestre API og tjenestedesign
pl: Opanuj projektowanie API i usług
pt: Domine a API e o design de serviço
ru: Освойте API и проектирование сервисов
sv: Bemästra API och tjänstedesign
th: เชี่ยวชาญด้านการออกแบบ API และบริการ
tr: API ve servis tasarımında ustalaşın
uk: Опановуйте API та дизайн сервісів
vi: Làm chủ thiết kế API và dịch vụ

source: Master English Fluency
ar: إتقان الطلاقة في اللغة الإنجليزية
be: Овладей англійскай бегласцю
da: Mestring af engelsk flydende
de: Meistere die Englische Sprachbeherrschung
es: Domina la fluidez en inglés
fr: Maîtriser la fluidité en anglais
id: Kuasai Kefasihan Bahasa Inggris
it: Mastera la fluentia in inglese
ja: マスター英語流暢さ
ms: Kuasai Kecairan Bahasa Inggeris
no: Mestrer Engelsk Flyt
pl: Zdobądź biegłość w języku angielskim
pt: Domine a Fluência em Inglês
ru: Освойте беглость английского языка
sv: Mästra engelska flytande
th: ควบคุมความคล่องแคล่วในภาษาอังกฤษ
tr: Usta İngilizce Akıcılığı
uk: Опанування англійської мови з відмінною вимовою
vi: Chủ động Tính Thành Thạo Tiếng Anh

source: Master essential phrases for interviews in English and boost your confidence with FluencyPal.
ar: اكتسب العبارات الأساسية للمقابلات باللغة الإنجليزية وقوي ثقتك مع FluencyPal.
be: Апануй неабходныя фразы для інтэрв'ю на англійскай мове і падвысьце сваю упэўненасць з FluencyPal.
da: Master essentielle sætninger til interviews på engelsk og boost din selvtillid med FluencyPal.
de: Beherrschen Sie wesentliche Phrasen für Interviews auf Englisch und steigern Sie Ihr Selbstvertrauen mit FluencyPal.
es: Domina frases esenciales para entrevistas en inglés y aumenta tu confianza con FluencyPal.
fr: Maîtrisez les phrases essentielles pour les entretiens en anglais et augmentez votre confiance avec FluencyPal.
id: Kuasai frasa penting untuk wawancara dalam Bahasa Inggris dan tingkatkan kepercayaan diri Anda dengan FluencyPal.
it: Impara le frasi essenziali per i colloqui in inglese e aumenta la tua sicurezza con FluencyPal.
ja: FluencyPalで英語の面接に必要なフレーズをマスターし、自信を高めましょう。
ms: Kuasai frasa penting untuk temuduga dalam Bahasa Inggeris dan tingkatkan keyakinan anda dengan FluencyPal.
no: Lær deg essensielle fraser for intervjuer på engelsk og øk din tillit med FluencyPal.
pl: Opanuj niezbędne zwroty na rozmowy kwalifikacyjne w języku angielskim i zwiększ swoją pewność siebie dzięki FluencyPal.
pt: Domine frases essenciais para entrevistas em inglês e aumente sua confiança com FluencyPal.
ru: Освойте ключевые фразы для собеседований на английском языке и усилите свою уверенность с FluencyPal.
sv: Behärska väsentliga fraser för intervjuer på engelska och öka ditt självförtroende med FluencyPal.
th: เรียนรู้วลีที่จำเป็นสำหรับการสัมภาษณ์ด้วยภาษาอังกฤษ และเพิ่มความมั่นใจของคุณด้วย FluencyPal.
tr: İngilizce mülakatlarda önemli ifadeleri öğrenin ve FluencyPal ile özgüveninizi artırın.
uk: Освоюйте основні фрази для співбесід англійською мовою та підвищуйте впевненість в собі з FluencyPal.
vi: Nắm vững những cụm từ thiết yếu cho phỏng vấn bằng tiếng Anh và tăng sự tự tin của bạn với FluencyPal.

source: Master fundamental technical questions
ar: إتقان الأسئلة التقنية الأساسية
be: Асвойце асноўныя тэхнічныя пытанні
da: Mestr de grundlæggende tekniske spørgsmål
de: Beherrschen Sie grundlegende technische Fragen
es: Domina preguntas técnicas fundamentales
fr: Maîtriser les questions techniques fondamentales
id: Kuasi pertanyaan teknis fundamental
it: Padroneggia le domande tecniche fondamentali
ja: 基本的な技術的質問をマスターする
no: Mestre fundamentale tekniske spørsmål
pl: Opanuj fundamentalne pytania techniczne
pt: Masterize questões técnicas fundamentais
ru: Мастер ключевых технических вопросов
sv: Bemästra grundläggande tekniska frågor
th: เชี่ยวชาญคำถามทางเทคนิคพื้นฐาน
tr: Temel teknik soruları ustalaştırın
uk: Опануйте основні технічні запитання
vi: Nắm vững các câu hỏi kỹ thuật cơ bản

source: Master high-frequency TOEFL vocabulary.
ar: إتقان المفردات الشائعة لامتحان TOEFL.
be: Освойте вакабуляр TOEFL з высокай частатай выкарыстання.
da: Mestre hyppigt forekommende TOEFL-vokabular.
de: Beherrschen Sie häufig verwendete TOEFL-Vokabeln.
es: Domina el vocabulario de alta frecuencia del TOEFL.
fr: Maîtrisez le vocabulaire du TOEFL à haute fréquence.
id: Kuasai kosa kata TOEFL frekuensi tinggi.
it: Padroneggia il vocabolario TOEFL ad alta frequenza.
ja: 高頻度のTOEFL単語をマスターしましょう。
ms: Kuasai kosa kata TOEFL berfrekuensi tinggi.
no: Master høyfrekvent TOEFL-vokabular.
pl: Opanuj słownictwo TOEFL o wysokiej częstotliwości.
pt: Domine o vocabulário de alta frequência do TOEFL.
ru: Овладейте словарем TOEFL высокой частотности.
sv: Behärska högfrekvent TOEFL-ordförråd.
th: เรียนรู้คำศัพท์ TOEFL ระดับความถี่สูง
tr: Yüksek frekanslı TOEFL kelime dağarcığınızı geliştirin.
uk: Оволодій високочастотною лексикою TOEFL.
vi: Nắm vững từ vựng TOEFL xuất hiện thường xuyên.

source: Master technical leadership questions
ar: أتقن أسئلة القيادة التقنية
be: Майстар пытанні па тэхнічным лідэрстве
da: Mestr tekniske lederskabsspørgsmål
de: Beherrsche technische Führungsfragen
es: Domina las preguntas de liderazgo técnico
fr: Maîtriser les questions de leadership technique
id: Kuasi pertanyaan kepemimpinan teknis
it: Domina le domande sulla leadership tecnica
ja: 技術リーダーシップの質問をマスターする
ms: Kuasi soalan kepimpinan teknikal
no: Mestre tekniske lederskapsspørsmål
pl: Opanuj pytania dotyczące technicznego przywództwa
pt: plaintext Domine perguntas de liderança técnica
ru: Освойте вопросы технического лидерства
sv: Mästra tekniska ledarskapsfrågor
th: ฝึกฝนคำถามเกี่ยวกับความเป็นผู้นำทางเทคนิค
tr: Teknik liderlik sorularında ustalaşın
uk: Освойте питання технічного лідерства
vi: Thông thạo các câu hỏi về lãnh đạo kỹ thuật

source: Master these essential phrases and boost your confidence in any professional interview setting.
ar: أتقن هذه العبارات الأساسية وعزز ثقتك في أي إعداد مهني للمقابلات.
be: Апануйце гэтыя неабходныя фразы і павялічце свой упэўненасць у любым професійным інтэрв'ю.
da: Master disse essentielle sætningsudtryk og styrk din selvtillid i enhver professionel interviewsituation.
de: Beherrschen Sie diese wesentlichen Redewendungen und stärken Sie Ihr Selbstbewusstsein in jedem professionellen Interview-Umfeld.
es: Domina estas frases esenciales y aumenta tu confianza en cualquier entorno de entrevista profesional.
fr: Maîtrisez ces phrases essentielles et boostez votre confiance dans n'importe quel cadre d'entretien professionnel.
id: Kuasai frase-frase penting ini dan tingkatkan kepercayaan diri Anda dalam setiap pengaturan wawancara profesional.
it: Padroneggia queste frasi essenziali e aumenta la tua sicurezza in qualsiasi contesto di colloquio professionale.
ja: これらの必須フレーズをマスターして、あらゆるプロフェッショナルな面接の場で自信をつけましょう。
ms: Kuasai ungkapan penting ini dan tingkatkan keyakinan anda dalam sebarang tetapan temuduga profesional.
no: Bemestring disse essensielle frasene og øk din selvtillit i enhver profesjonell intervjusituasjon.
pl: Opanuj te niezbędne zwroty i zwiększ swoją pewność siebie w dowolnym profesjonalnym kontekście rozmowy kwalifikacyjnej.
pt: Domine estas frases essenciais e aumente a sua confiança em qualquer ambiente de entrevista profissional.
ru: Освойте эти ключевые фразы и повысьте свое самоуверенность в любой профессиональной собеседовательской обстановке.
sv: Behärska dessa väsentliga fraser och öka ditt självförtroende i alla professionella intervjuinställningar.
th: เรียนรู้วลีเหล่านี้ที่จำเป็นสำหรับการสัมภาษณ์งานในภาคสามารถเพิ่มความมั่นใจให้คุณ
tr: Bu temel ifadeleri öğrenin ve profesyonel herhangi bir mülakat ortamında özgüveninizi artırın.
uk: Опануйте ці ключові фрази та підвищте впевненість в будь-якому професійному інтерв'ю.
vi: Nắm vững những cụm từ quan trọng này và tăng sự tự tin của bạn trong bất kỳ môi trường phỏng vấn chuyên nghiệp nào.

source: Master your next English job interview with this step-by-step guide! Learn key strategies for Business English learners to boost confidence, vocabulary, and performance.
ar: أتقن مقابلتك الوظيفية الإنجليزية القادمة مع هذا الدليل الخطوة بخطوة! تعلم الاستراتيجيات الرئيسية لمتعلمي الإنجليزية الأعمال لتعزيز الثقة، والمفردات، والأداء.
be: Адкрыйце сваё наступнае працоўнае інтэрв'ю на англійскай з гэтым паэтапным кіраўнікам! Вывучайце ключавыя стратэгіі для вучэння бізнес-англійскай, каб павысіць упэўненасць, слоўнік і продукцыйнасць.
da: Mestr dit næste engelske jobinterview med denne trin-for-trin-guide! Lær nøglestrategier for Business English-undervisning for at booste selvtillid, ordforråd og performance.
de: Beherrschen Sie Ihr nächstes englisches Vorstellungsgespräch mit diesem Schritt-für-Schritt-Leitfaden! Lernen Sie Schlüsselstrategien für Business-Englisch-Lernende kennen, um Selbstvertrauen, Wortschatz und Leistung zu steigern.
es: ¡Domina tu próxima entrevista de trabajo en inglés con esta guía paso a paso! Aprende estrategias clave para los estudiantes de inglés de negocios para aumentar la confianza, el vocabulario y el rendimiento.
fr: Maîtrisez votre prochain entretien d'embauche en anglais avec ce guide étape par étape! Apprenez des stratégies clés pour les apprenants en anglais des affaires pour augmenter la confiance, le vocabulaire et la performance.
id: Kuasai wawancara pekerjaan Bahasa Inggris berikutnya dengan panduan langkah-demi-langkah ini! Pelajari strategi kunci untuk pelajar Bahasa Inggris Bisnis untuk meningkatkan kepercayaan diri, kosa kata, dan kinerja.
it: Padroneggia il tuo prossimo colloquio di lavoro in inglese con questa guida passo dopo passo! Impara strategie chiave per gli studenti di Business English per aumentare la fiducia, il vocabolario e le prestazioni.
ja: この段階的なガイドで次の英語の仕事の面接をマスターしましょう！ビジネス英語学習者のための主要戦略を学び、自信、語彙、パフォーマンスを向上させます。
ms: Kuasai temu duga kerja bahasa Inggeris seterusnya anda dengan panduan langkah demi langkah ini! Pelajari strategi utama untuk pembelajar Bahasa Inggeris Perniagaan untuk meningkatkan kepercayaan diri, perbendaharaan kata, dan prestasi.
no: Bli en mester på ditt neste engelske jobbintervju med denne steg-for-steg guiden! Lær nøkkelstrategier for Business English studenter for å øke selvtillit, vokabular og ytelse.
pl: Opanuj swoją następną rozmowę kwalifikacyjną po angielsku dzięki temu przewodnikowi krok po kroku! Poznaj kluczowe strategie dla osób uczących się języka angielskiego biznesowego, aby zwiększyć pewność siebie, słownictwo i wydajność.
pt: Domine a sua próxima entrevista de emprego em inglês com este guia passo a passo! Aprenda estratégias chave para os alunos de Business English para impulsionar a confiança, o vocabulário e o desempenho.
ru: Освойте свое следующее собеседование на английском языке с помощью этого пошагового руководства! Изучите ключевые стратегии для изучающих деловой английский, чтобы повысить уверенность, словарный запас и производительность.
sv: Behärska din nästa engelska jobbintervju med denna steg-för-steg-guide! Lär dig nyckelstrategier för affärsengelska-lärare för att öka självförtroende, ordförråd och prestation.
th: ควบคุมการสัมภาษณ์งานภาษาอังกฤษในครั้งถัดไปของคุณด้วยคู่มือขั้นตอนนี้! เรียนรู้กลยุทธ์สำคัญสำหรับผู้เรียนภาษาอังกฤษเพื่อธุรกิจเพื่อเพิ่มความมั่นใจ คำศัพท์ และสมรรถนะ
tr: Bu adım adım kılavuz ile bir sonraki İngilizce iş görüşmenizi tam anlamıyla hâkim olun! İş İngilizcesi öğrenenler için güveni, kelime dağarcığını ve performansı artırmaya yönelik ana stratejileri öğrenin.
uk: Освойте своє наступне англійське співбесіду з цим поетапним керівництвом! Дізнайтесь ключові стратегії для вивчаючих бізнес-англійську, щоб підвищити впевненість, словниковий запас та продуктивність.
vi: Nắm vững cuộc phỏng vấn công việc tiếng Anh tiếp theo của bạn với hướng dẫn từng bước này! Tìm hiểu các chiến lược chính cho người học tiếng Anh kinh doanh để tăng cường sự tự tin, từ vựng và hiệu suất.

source: Medical Talk Simulation
ar: محاكاة الحديث الطبي
be: Медыцынская сімуляцыя размовы
da: Medicinsk Samtale Simulation
de: Medizinische Gesprächssimulation
es: Simulación de Conversación Médica
fr: Simulation de Discussion Médicale
id: Simulasi Pembicaraan Medis
it: Simulazione di Conversazione Medica
ja: メディカルトークシミュレーション
ms: Simulasi Percakapan Medikal
no: Medisinsk samtale simulering
pl: Symulacja Medycznej Rozmowy
pt: Simulação de Conversa Médica
ru: Медицинская Симуляция Разговора
sv: Medicinsk Samtalssimulation
th: จำลองการสนทนาทางการแพทย์
tr: Medikal Konuşma Simülasyonu
uk: Медичний діалог-симуляція
vi: Mô phỏng Cuộc trò chuyện y khoa
