Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Self-taught developers looking to validate their HTML, CSS, and JavaScript knowledge
ar: المطورون الذين علموا أنفسهم بأنفسهم يبحثون عن التحقق من معرفتهم بـ HTML و CSS و JavaScript
be: Самавучкі-распрацоўшчыкі, якія хочуць пацвердзіць свае веды ў HTML, CSS і JavaScript
da: Selvlærte udviklere, der ønsker at validere deres viden om HTML, CSS og JavaScript
de: Autodidaktische Entwickler, die ihr Wissen in HTML, CSS und JavaScript validieren möchten
es: Desarrolladores autodidactas buscando validar sus conocimientos en HTML, CSS y JavaScript
fr: Développeurs autodidactes cherchant à valider leurs connaissances en HTML, CSS, et JavaScript
id: Pengembang otodidak yang ingin memvalidasi pengetahuan HTML, CSS, dan JavaScript mereka
it: Sviluppatori autodidatti che cercano di convalidare le loro conoscenze di HTML, CSS e JavaScript
ja: HTML、CSS、JavaScriptの知識を検証したい独学の開発者向け
no: Selvlærte utviklere som ønsker å validere sin kunnskap i HTML, CSS og JavaScript
pl: Programiści samoucy szukający sposobu, aby zweryfikować swoją wiedzę z HTML, CSS i JavaScript
pt: Desenvolvedores autodidatas buscando validar seus conhecimentos em HTML, CSS e JavaScript
ru: Самоучки-разработчики, которые хотят подтвердить свои знания в области HTML, CSS и JavaScript
sv: Självlärda utvecklare som vill validera sina kunskaper i HTML, CSS och JavaScript
th: นักพัฒนาที่เรียนรู้ด้วยตนเองที่ต้องการตรวจสอบความรู้ด้าน HTML, CSS และ JavaScript ของตนเอง
tr: HTML, CSS ve JavaScript bilgilerini doğrulamak isteyen kendi kendine öğrenen geliştiriciler
uk: Самоучки-розробники, які хочуть підтвердити свої знання HTML, CSS та JavaScript
vi: Các nhà phát triển tự học đang tìm cách kiểm tra kiến thức HTML, CSS, và JavaScript của mình

source: Semantic HTML
ar: markdown HTML الدلالي
be: Семантычны HTML
da: plaintext Semantisk HTML
de: Semantisches HTML
es: HTML Semántico
fr: plaintext HTML sémantique
id: plaintext Semantic HTML
it: HTML Semantico
ja: セマンティックHTML
ms: HTML Semantik
no: norsk Semantisk HTML
pl: Semantyczny HTML
pt: HTML semântico
ru: Семантический HTML
sv: Semantisk HTML
th: HTML ความหมาย
tr: Semantik HTML
uk: Семантична HTML

source: Send
ar: أرسل
be: Адправіць
de: Senden
es: Enviar
fr: Envoyer
id: Kirim
it: Invia
ja: 送信
ms: Hantar
pl: Wyślij
pt: Enviar
ru: Отправить
sv: Skicka
th: ส่ง
tr: Gönder
uk: Відправити
vi: Gửi

source: Send a message to the community
de: Sende eine Nachricht an die Gemeinschaft
es: Enviar un mensaje a la comunidad
id: Kirim pesan kepada komunitas
it: Invia un messaggio alla community
ja: コミュニティにメッセージを送信
no: Send en melding til fellesskapet
pl: Wyślij wiadomość do społeczności
pt: Envie uma mensagem para a comunidade
ru: Отправить сообщение сообществу
sv: Skicka ett meddelande till gemenskapen
th: ส่งข้อความถึงชุมชน
tr: Topluluğa bir mesaj gönder
uk: Надіслати повідомлення спільноті

source: Send email again
ar: إعادة إرسال البريد الإلكتروني
be: Адправіць электронную пошту яшчэ раз
da: Send e-mail igen
de: E-Mail erneut senden
es: Enviar correo electrónico de nuevo
fr: Envoyer l'e-mail à nouveau
id: Kirim email lagi
it: Invia nuovamente l'email
ja: メールを再送信
no: Send e-post på nytt
pl: Wyślij e-mail ponownie
pt: Enviar e-mail novamente
ru: Отправить письмо снова
sv: Skicka e-post igen
th: ส่งอีเมลอีกครั้ง
tr: E-postayı tekrar gönder
uk: Надіслати електронний лист ще раз
vi: Gửi email lại

source: Send me sign-in link
ar: أرسل لي رابط تسجيل الدخول
be: Дашліце мне спасылку для ўваходу
da: Send mig tilmeldingslink
de: Senden Sie mir den Anmeldelink
es: Envíame el enlace para iniciar sesión
fr: Envoyez-moi le lien de connexion
id: Kirimkan saya tautan masuk
it: Mandami il link di accesso
ja: サインインリンクを送信してください。
no: Send meg påloggingslenke
pl: Wyślij mi link do logowania
pt: Enviar link de acesso
ru: Отправьте мне ссылку для входа
sv: Skicka mig inloggningslänken
th: ส่งลิงก์สำหรับเข้าสู่ระบบให้ฉัน
tr: Bana giriş bağlantısını gönder
uk: Надішліть мені посилання для входу
vi: Gửi cho tôi liên kết đăng nhập

source: Send Message
ar: إرسال رسالة
be: Адправіць паведамленне
da: Send besked
de: Nachricht senden
es: Enviar mensaje
fr: Envoyer un message
id: Kirim Pesan
it: Invia messaggio
ja: メッセージを送信
no: Send melding
pl: Wyślij wiadomość
pt: Enviar Mensagem
ru: Отправить сообщение
sv: Skicka meddelande
th: ส่งข้อความ
tr: Mesaj Gönder
uk: Надіслати повідомлення
vi: Gửi Tin Nhắn

source: Send Request
ar: إرسال الطلب
be: Адправіць запыт
da: Send anmodning
de: Anfrage senden
es: Enviar solicitud
fr: Envoyer la demande
id: Kirim Permintaan
it: Invia richiesta
ja: リクエストを送信
no: Send forespørsel
pl: Wyślij Żądanie
pt: Enviar Solicitação
ru: Отправить запрос
sv: Skicka förfrågan
th: ส่งคำขอ
tr: İsteği Gönder
uk: Надіслати запит
vi: Gửi Yêu Cầu

source: Send {messagesNeeded} messages to unlock full access
uk: Надішліть {messagesNeeded} повідомлень, щоб розблокувати повний доступ

source: Sending...
ar: جارٍ الإرسال...
be: Адпраўка...
da: Afsender...
de: Senden...
es: Enviando...
fr: Envoi...
id: Mengirim...
it: Inviando...
ja: 送信中...
ms: Menghantar...
no: Sender...
pl: Wysyłanie...
pt: Enviando...
ru: Отправка...
sv: Skickar...
th: กำลังส่ง...
tr: Gönderiliyor...
uk: Надсилання...
vi: Đang gửi...

source: Senior and lead backend roles focused on .NET, APIs, data modeling, concurrency, resiliency, and system design.
ar: أدوار عليا وقيادية في الخلفية تركز على .NET، وواجهات برمجة التطبيقات (APIs)، ونمذجة البيانات، والتزامن، والمرونة، وتصميم النظام.
be: Старэйшыя і вядучыя ролі ў распрацоўцы бэкэнд-функцыяналу, сфакусаваныя на .NET, API, мадэляванні даных, канкурэнцыі, устойлівасці і праектаванні сістэм.
da: Senior- og ledende backend-roller fokuseret på .NET, API'er, datamodellering, samtidighed, robusthed og systemdesign.
de: Senior- und Lead-Backend-Rollen mit Schwerpunkt auf .NET, APIs, Datenmodellierung, Parallelität, Belastbarkeit und Systemdesign.
es: Roles senior y de liderazgo en backend enfocados en .NET, APIs, modelado de datos, concurrencia, resiliencia y diseño de sistemas.
fr: Rôles seniors et de lead backend axés sur .NET, les APIs, la modélisation de données, la concurrence, la résilience, et la conception de systèmes.
id: Peran backend senior dan pemimpin yang berfokus pada .NET, API, pemodelan data, concurrency, ketahanan, dan desain sistem.
it: Ruoli senior e di lead backend focalizzati su .NET, API, modellazione dei dati, concorrenza, resilienza e progettazione di sistemi.
ja: .NET、API、データモデリング、同時実行性、回復力、システム設計に焦点を当てたシニアおよびリードバックエンドロール。
ms: Peranan senior dan ketua backend yang berfokus pada .NET, API, pemodelan data, konkuren, ketahanan, dan reka bentuk sistem.
no: Senior- og ledende backend-roller med fokus på .NET, API-er, datamodellering, samtidighet, robusthet og systemdesign.
pl: Starsze i wiodące role backendowe skupione na .NET, API, modelowaniu danych, współbieżności, odporności oraz projektowaniu systemów.
pt: Funções de backend sênior e líder focadas em .NET, APIs, modelagem de dados, concorrência, resiliência e design de sistemas.
ru: Старшие и ведущие роли бэкенд разработчиков с фокусом на .NET, API, моделирование данных, конкуренцию, устойчивость и проектирование систем.
sv: Senior- och ledande backend-positioner fokuserade på .NET, API:er, datamodellering, samtidighet, motståndskraft och systemdesign.
th: บทบาทอาวุโสและผู้นำด้านแบ็กเอนด์ที่มุ่งเน้น .NET, APIs, การสร้างแบบจำลองข้อมูล, การประมวลผลพร้อมกัน, ความยืดหยุ่น, และการออกแบบระบบ
tr: .NET, API'ler, veri modelleme, eşzamanlılık, dayanıklılık ve sistem tasarımı odaklı kıdemli ve öncü backend roller.
uk: Старші та провідні бекенд-ролі зосереджені на .NET, API, моделюванні даних, конкурентності, стійкості та проектуванні систем.
vi: Vị trí cấp cao và dẫn dắt phần backend tập trung vào .NET, API, mô hình dữ liệu, đồng thời, khả năng phục hồi và thiết kế hệ thống.

source: Senior Frontend Developer
ar: مبرمج واجهات أمامية أول
be: Старшы Frontend Распрацоўшчык
da: Senior Frontend-udvikler
de: Senior Frontend-Entwickler
es: Desarrollador Frontend Senior
fr: Développeur Frontend Senior
id: Pengembang Frontend Senior
it: Sviluppatore Frontend Senior
ja: シニア フロントエンド デベロッパー
ms: Pemaju Frontend Senior
no: Senior Frontend Utvikler
pl: Starszy Programista Frontendowy
pt: Desenvolvedor Frontend Sênior
ru: Старший фронтенд-разработчик
sv: Senior Frontend-utvecklare
th: นักพัฒนาระบบส่วนหน้ารุ่นอาวุโส
tr: Kıdemli Ön Uç Geliştirici
uk: Старший Frontend-розробник
vi: Nhà Phát Triển Giao Diện Người Dùng Cao Cấp

source: senior frontend developer interview
ar: مقابلة مطور واجهات أمامية كبير
be: інтэрв'ю з старшым фронтэнд-распрацоўшчыкам
da: senior frontend udvikler interview
de: Interview für Senior Frontend-Entwickler
es: entrevista a desarrollador frontend senior
fr: entretien développeur frontend senior
id: wawancara pengembang frontend senior
it: colloquio per sviluppatore frontend senior
ja: シニアフロントエンドデベロッパーの面接
ms: temuduga pembangun UI hadapan kanan
no: senior frontend utviklerintervju
pl: wywiad z starszym programistą frontendowym
pt: entrevista para desenvolvedor frontend sênior
ru: интервью для старшего frontend-разработчика
sv: senior frontend utvecklare intervju
th: การสัมภาษณ์สำหรับนักพัฒนาฟร้อนเอนด์อาวุโส
tr: kıdemli frontend geliştirici mülakatı
uk: інтерв'ю для старшого фронтенд-розробника
vi: phỏng vấn lập trình viên front-end cao cấp

source: Senior Frontend Developers preparing for promotions or new roles
ar: مطورو الواجهة الأمامية الأقدم الذين يستعدون للترقيات أو الأدوار الجديدة
be: Старшыя фронтэнд-распрацоўшчыкі, якія рыхтуюцца да павышэння альбо новых роляў
da: Senior Frontend-udviklere, der forbereder sig på forfremmelser eller nye roller
de: Senior Frontend-Entwickler, die sich auf Beförderungen oder neue Rollen vorbereiten
es: Desarrolladores Frontend Senior que se preparan para promociones o nuevos roles
fr: Développeurs Frontend Seniors se préparant à des promotions ou à de nouveaux rôles
id: Pengembang Frontend Senior yang mempersiapkan untuk promosi atau peran baru
it: Sviluppatori Frontend Senior che si preparano per promozioni o nuovi ruoli
ja: 昇進や新しい役職を目指すシニアフロントエンドデベロッパー
ms: Pembangun Frontend Kanan bersedia untuk promosi atau peranan baharu
no: Erfarne frontend-utviklere som forbereder seg på forfremmelser eller nye roller
pl: Starszy programista frontendu przygotowujący się do awansu lub nowych ról
pt: Senior Frontend Developers se preparando para promoções ou novos cargos
ru: Старшие фронтенд-разработчики, готовящиеся к продвижению или новым ролям
sv: Senior Frontend-utvecklare som förbereder sig för befordran eller nya roller
th: นักพัฒนาฟรอนต์เอนด์อาวุโสที่เตรียมความพร้อมสำหรับการเลื่อนตำแหน่งหรือบทบาทใหม่
tr: Kıdemli Frontend Geliştiriciler terfi veya yeni roller için hazırlanıyor
uk: Досвідчені Frontend-розробники, які готуються до підвищення або нових ролей
vi: Các nhà phát triển Frontend cấp cao đang chuẩn bị cho việc thăng chức hoặc vai trò mới

source: senior frontend interview
ar: plaintext مقابلة تطوير الواجهة الأمامية لكبار الموظفين
be: старэйшы інтэрв’ю для frontend распрацоўніка
es: entrevista de frontend senior
fr: entretien senior frontend
id: wawancara frontend senior
it: colloquio senior frontend
ja: シニアフロントエンド面接
ms: temuduga frontend senior
no: senior frontend-intervju
pl: starszy frontendowy wywiad
pt: entrevista para desenvolvedor frontend sênior
ru: интервью на должность старшего фронтенд-разработчика
sv: senior frontend-intervju
th: การสัมภาษณ์ Frontend อาวุโส
tr: kıdemli ön uç görüşmesi
uk: співбесіда на позицію старшого фронтенд-розробника
vi: phỏng vấn frontend cấp cao

source: Sentences
de: Sätze
es: Oraciones
id: Kalimat
it: Frasi
ja: 文
no: Setninger
pl: Zdania
pt: Frases
ru: Предложения
sv: Meningar
th: ประโยค
tr: Cümleler
uk: Речення
vi: Câu

source: Set My Language
ar: اضبط لغتي
be: Усталяваць маю мову
da: Indstil Mit Sprog
de: Meine Sprache festlegen
es: Establecer Mi Idioma
fr: Définir Ma Langue
id: Atur Bahasa Saya
it: Imposta La Mia Lingua
ja: 私の言語を設定する
ms: Tetapkan Bahasa Saya
no: Sett Mitt Språk
pl: Ustaw Mój Język
pt: Definir Meu Idioma
ru: Установить мой язык
sv: Ställ in mitt språk
th: ตั้งค่าภาษาของฉัน
tr: Dilimi Ayarla
uk: Встановити Мою Мову
vi: Đặt Ngôn Ngữ Của Tôi

source: Set the goal of your learning
ar: حدد هدف تعلمك
be: Выстаўце мэту вашага навучання
da: Indstil målet for din læring
de: Legen Sie das Ziel Ihres Lernens fest
es: Establece el objetivo de tu aprendizaje
fr: Définissez l'objectif de votre apprentissage
id: Tetapkan tujuan pembelajaran Anda
it: Imposta l'obiettivo del tuo apprendimento
ja: あなたの学習の目標を設定します
ms: Tetapkan matlamat pembelajaran anda
no: Sett målet for læringen din
pl: Ustal cel swojej nauki
pt: Defina o objetivo do seu aprendizado
ru: Установите цель вашего обучения
sv: Ange målet med ditt lärande
th: ตั้งเป้าหมายของการเรียนรู้ของคุณ
tr: Öğrenme hedefinizi belirleyin
uk: Встановіть мету вашого навчання
vi: Đặt mục tiêu cho việc học của bạn

source: Share a phrase you learned today (or one that confused you)
uk: Поділіться фразою, яку ви вивчили сьогодні (або яка вас збентежила)

source: Share compelling stories about cross-team collaboration, conflict resolution, and project ownership.
ar: شارك قصصًا مثيرة حول التعاون بين الفرق، وحل النزاعات، وتحمل المسؤولية عن المشاريع.
be: Падзяліцеся захапляльнымі гісторыямі пра міжкаманднае супрацоўніцтва, вырашэнне канфліктаў і валоданне праектамі.
da: Del inspirerende historier om samarbejde på tværs af teams, konfliktløsning og ejerskab over projekter.
de: Teilen Sie fesselnde Geschichten über teamübergreifende Zusammenarbeit, Konfliktlösung und Projektverantwortung.
es: Comparte historias atractivas sobre colaboración entre equipos, resolución de conflictos y toma de responsabilidad en proyectos.
fr: Partagez des histoires captivantes sur la collaboration entre équipes, la résolution de conflits et la prise en charge de projets.
id: Bagikan cerita menarik tentang kolaborasi lintas tim, resolusi konflik, dan kepemilikan proyek.
it: Condividi storie avvincenti sulla collaborazione tra team, risoluzione dei conflitti e responsabilità del progetto.
ja: チーム間のコラボレーション、紛争解決、およびプロジェクトの所有権についての説得力のあるストーリーを共有します。
ms: Kongsikan cerita-cerita menarik tentang kerjasama silang pasukan, penyelesaian konflik, dan pemilikan projek.
no: Del engasjerende historier om samarbeid på tvers av team, konfliktløsning og eierskap til prosjekter.
pl: Podziel się fascynującymi historiami na temat współpracy między zespołami, rozwiązywania konfliktów oraz poczucia odpowiedzialności za projekt.
pt: Compartilhe histórias convincentes sobre colaboração entre equipes, resolução de conflitos e responsabilidade pelo projeto.
ru: Поделитесь увлекательными историями о сотрудничестве между командами, разрешении конфликтов и владении проектами.
sv: Dela engagerande berättelser om samarbeten mellan team, konfliktlösning och projektägarskap.
th: แบ่งปันเรื่องราวที่น่าสนใจเกี่ยวกับความร่วมมือระหว่างทีม การแก้ไขความขัดแย้ง และการรับผิดชอบในโครงการ
tr: Çapraz takım iş birliği, çatışma çözümü ve proje sahipliği hakkında ilgi çekici hikayeler paylaşın.
uk: Поділіться захоплюючими історіями про співпрацю між командами, вирішення конфліктів та відповідальність за проекти.
vi: Chia sẻ những câu chuyện hấp dẫn về sự hợp tác giữa các nhóm, giải quyết xung đột và sự sở hữu dự án.

source: Share fun facts about yourself
de: Teilen Sie lustige Fakten über sich selbst
es: Comparte datos curiosos sobre ti mismo
id: Bagikan fakta menyenangkan tentang dirimu
it: Condividi curiosità su di te
ja: あなた自身についての楽しい事実を共有しましょう
no: Del morsomme fakta om deg selv
pl: Podziel się ciekawostkami o sobie
pt: Compartilhe fatos divertidos sobre você
ru: Расскажите забавные факты о себе
sv: Dela roliga fakta om dig själv
tr: Kendiniz hakkında eğlenceli bilgiler paylaşın
uk: Поділіться цікавими фактами про себе

source: Share what you're currently learning
ar: شارك ما تتعلمه حاليًا
be: Падзяліцеся, што вы зараз вывучаеце
da: Del, hvad du i øjeblikket lærer
de: Teilen Sie, was Sie derzeit lernen
es: Comparte lo que estás aprendiendo actualmente
fr: Partagez ce que vous apprenez actuellement
id: Bagikan apa yang sedang Anda pelajari
it: Condividi cosa stai attualmente imparando
ja: 現在学んでいることを共有する
no: Del hva du lærer akkurat nå
pl: Podziel się, czego się obecnie uczysz
pt: Compartilhe o que você está aprendendo atualmente
ru: Поделитесь, что вы изучаете в данный момент
sv: Dela vad du lär dig just nu
th: แบ่งปันสิ่งที่คุณกำลังเรียนรู้ในขณะนี้
tr: Şu anda ne öğreniyorsun paylaş
uk: Поділіться тим, що ви зараз вивчаєте
vi: Chia sẻ những gì bạn đang học hiện tại

source: Share your thoughts and get feedback!
de: Teile deine Gedanken und erhalte Feedback!
es: ¡Comparte tus pensamientos y recibe comentarios!
id: Bagikan pemikiran Anda dan dapatkan masukan!
it: Condividi i tuoi pensieri e ricevi feedback!
ja: 意見を共有してフィードバックを得よう！
no: Del tankene dine og få tilbakemelding!
pl: Podziel się swoimi przemyśleniami i otrzymaj informację zwrotną!
pt: Compartilhe suas ideias e receba feedback!
ru: Поделитесь своими мыслями и получите обратную связь!
sv: Dela dina tankar och få feedback!
th: แบ่งปันความคิดของคุณและรับคำติชม!
tr: Düşüncelerinizi paylaşın ve geri bildirim alın!
uk: Поділіться своїми думками та отримайте відгук!
vi: Chia sẻ ý kiến của bạn và nhận phản hồi!

source: Shopping
ar: التسوق
be: Купля
de: Einkaufen
es: Compras
fr: Achats
id: Belanja
ja: ショッピング
ms: Pembelian
pl: Zakupy
pt: Compras
ru: Покупки
th: การช็อปปิ้ง
tr: Alışveriş
uk: Покупки
vi: Mua sắm

source: Shopping at the Grocery Store
ar: التسوق في متجر البقالة
be: Купля ў краме
da: Shopping i supermarkedet
de: Einkaufen im Lebensmittelgeschäft
es: Compras en el supermercado
fr: Shopping à l'épicerie
id: Belanja di Toko Sembako
it: Shopping al Negozio di Generi Alimentari
ja: ショッピング：食料品店での買い物
ms: Membeli-belah di Kedai Runcit
no: Shopping i dagligvarebutikken
pl: Zakupy w Sklepie Spożywczym
pt: Comprando no Supermercado
ru: Покупки в продуктовом магазине
sv: Shopping på mataffären
th: การช็อปปิ้งที่ร้านขายของชำ
tr: Market Alışverişi
uk: Покупки в продуктовому магазині
vi: Mua sắm tại cửa hàng tạp hoá

source: Short answers with a positive attitude show that you’re easy to talk to and open to dialogue.
ar: الإجابات القصيرة بموقف إيجابي تظهر أنك سهل الحديث معه ومفتوح للحوار.
be: Кароткія адказы з пазітыўным настроем паказваюць, што з вамі лёгка размаўляць і вы адкрытыя да дыялогу.
da: Korte svar med en positiv attitude viser, at du er nem at tale med og åben for dialog.
de: Kurze Antworten mit einer positiven Einstellung zeigen, dass Sie leicht ansprechbar sind und offen für Dialoge.
es: Las respuestas cortas con una actitud positiva muestran que eres fácil de hablar y abierto al diálogo.
fr: Des réponses courtes avec une attitude positive montrent que vous êtes facile à aborder et ouvert au dialogue.
id: Jawaban singkat dengan sikap positif menunjukkan bahwa Anda mudah diajak bicara dan terbuka untuk dialog.
it: Le risposte brevi con un atteggiamento positivo dimostrano che sei facile da approcciare e aperto al dialogo.
ja: 肯定的な態度での短い返答は、あなたが話しやすく、対話にオープンであることを示します。
ms: Jawapan pendek dengan sikap positif menunjukkan bahawa anda mudah diajak bercakap dan terbuka untuk dialog.
no: Korte svar med en positiv holdning viser at du er lett å snakke med og åpen for dialog.
pl: Krótkie odpowiedzi z pozytywnym nastawieniem pokazują, że łatwo się z tobą rozmawia i jesteś otwarty na dialog.
pt: Respostas curtas com uma atitude positiva mostram que você é fácil de conversar e aberto ao diálogo.
ru: Короткие ответы с позитивным настроем показывают, что с вами легко общаться и вы открыты для диалога.
sv: Korta svar med en positiv attityd visar att du är lätt att prata med och öppen för dialog.
th: การตอบสั้น ๆ ด้วยทัศนคติที่เชิงบวกแสดงว่าคุณง่ายต่อการสื่อสารและพร้อมสำหรับการสนทนา
tr: Olumlu bir tutumla verilen kısa yanıtlar, sizinle konuşmanın kolay ve diyaloga açık olduğunuzu gösterir.
uk: Короткі відповіді з позитивним настроєм показують, що ви легко спілкуєтесь і відкриті для діалогу.
vi: Câu trả lời ngắn gọn với thái độ tích cực cho thấy bạn dễ gần và sẵn lòng trò chuyện.

source: short story
ar: قصة قصيرة
be: кароткі расказ
da: kort historie
de: Kurzgeschichte
es: cuento corto
fr: histoire courte
id: cerita pendek
it: breve storia
ja: 短編小説
ms: cerita pendek
no: kort historie
pl: krótka opowieść
pt: curta história
ru: короткая история
sv: kort berättelse
th: เรื่องสั้น
tr: kısa hikaye
uk: коротка історія
vi: truyện ngắn

source: Shorter words and familiar vocabulary
id: Kata yang lebih pendek dan kosakata yang dikenal
it: Parole più brevi e vocabolario familiare
ja: 短い言葉と親しみやすい語彙
no: Kortere ord og kjent vokabular
ru: Короткие слова и знакомая лексика
uk: Коротші слова та знайомий словник

source: Show curiosity and engagement. Don’t forget to thank them for their answers:
ar: أظهر الفضول والالتزام. لا تنسى أن تشكرهم على أجوبتهم:
be: Паказвайце цікавасць і зацікаўленасць. Не забывайце дзякуйца ім за іх адказы:
da: Vis nysgerrighed og engagement. Glem ikke at takke dem for deres svar:
de: Zeigen Sie Neugier und Engagement. Vergessen Sie nicht, sich für ihre Antworten zu bedanken:
es: Muestra curiosidad e interés. No olvides agradecerles por sus respuestas:
fr: Montrez de la curiosité et de l'engagement. N'oubliez pas de les remercier pour leurs réponses :
id: Tunjukkan rasa ingin tahu dan keterlibatan. Jangan lupa untuk berterima kasih kepada mereka atas jawabannya:
it: Mostra curiosità e coinvolgimento. Non dimenticare di ringraziarli per le loro risposte:
ja: 興味と関与を示しましょう。 回答に感謝するのを忘れないでください:
ms: Tunjukkan rasa ingin tahu dan keterlibatan. Jangan lupa untuk berterima kasih kepada mereka atas jawapan mereka:
no: Vis nysgjerrighet og engasjement. Ikke glem å takke dem for svarene deres:
pl: Okazuj ciekawość i zaangażowanie. Nie zapomnij podziękować im za ich odpowiedzi:
pt: Mostre curiosidade e envolvimento. Não se esqueça de agradecer por suas respostas:
ru: Проявляйте любознательность и участие. Не забывайте благодарить их за ответы:
sv: Visa nyfikenhet och engagemang. Glöm inte att tacka dem för deras svar:
th: แสดงความอยากรู้อยากเห็นและมีส่วนร่วม อย่าลืมขอบคุณพวกเขาสำหรับคำตอบของพวกเขา:
tr: Merak ve ilgi gösterin. Yanıtları için onlara teşekkür etmeyi unutmayın:
uk: Показуйте цікавість та зацікавленість. Не забувайте подякувати їм за їх відповіді:
vi: Thể hiện sự tò mò và tham gia. Đừng quên cảm ơn họ vì những câu trả lời của họ:

source: Show Debates
ar: عرض المناظرات
be: Паказаць дэбаты
da: Vis Debatter
de: Debatten anzeigen
es: Mostrar Debates
fr: Afficher les débats
id: Tampilkan Debat
it: Mostra Dibattiti
ja: ディベートを表示
no: Vis Debatter
pl: Pokaż Debaty
pt: Mostrar Debates
ru: Показать дебаты
sv: Visa Debatter
th: แสดงการอภิปราย
tr: Tartışmaları Göster
uk: Показати дебати
vi: Hiển thị Tranh luận
