Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: AI English Tutor
ar: معلم اللغة الإنجليزية الذكي
be: Інструктар з англійскай мовы AI
da: AI Engelsk Tutor
de: AI Englisch Tutor
es: AI Tutor de Inglés
fr: Tuteur d'anglais IA
id: AI Tutor Bahasa Inggris
it: AI Tutor di Inglese
ja: AI英語チューター
ms: AI Tutor Bahasa Inggeris
no: AI Engelsk Lærer
pl: AI Nauczyciel Języka Angielskiego
pt: Tutor de Inglês com IA
ru: AI Учитель Английского
sv: AI-engelsklärare
th: AI อังกฤษติวเตอร์
tr: AI İngilizce Eğitmeni
uk: AI Англійський Репетитор
vi: AI Gia Sư Tiếng Anh

source: ai English tutor
ar: مدرس اللغة الإنجليزية الذكي
be: AI англійскі рэпетытар
da: ai engelsk tutor
de: ai Englisch-Lehrer
es: tutor de inglés AI
fr: tuteur d'anglais IA
id: ai tutor bahasa Inggris
it: insegnante di inglese AI
ja: ai英語講師
no: ai engelsk veileder
pl: ai nauczyciel angielskiego
pt: ai tutor de inglês
sv: ai engelsk lärare
th: ai ผู้สอนภาษาอังกฤษ
tr: ai İngilizce öğretmeni
uk: ai викладач англійської
vi: giáo viên tiếng Anh AI

source: AI feedback
ar: التغذية الراجعة للذكاء الاصطناعي
be: Зваротная сувязь AI
de: KI-Feedback
es: Retroalimentación de AI
fr: Retour d'information de l'IA
id: Umpan balik AI
it: Feedback dell'IA
ja: AIフィードバック
ms: Maklum balas AI
no: AI-tilbakemelding
pl: Opinia AI
pt: Feedback de IA
ru: Отзыв AI
th: ข้อเสนอแนะ AI
tr: AI geri bildirimi
uk: Відгук AI
vi: Phản hồi AI

source: AI feedback on clarity and fundamentals
ar: تغذية راجعة من الذكاء الاصطناعي عن الوضوح والأساسيات
be: Водгук AI аб зразумеласці і асноўных прынцыпах
da: AI feedback om klarhed og grundprincipper
de: KI-Feedback zu Klarheit und Grundlagen
es: Comentarios de IA sobre la claridad y los fundamentos
fr: Retour d'IA sur la clarté et les fondamentaux
id: Umpan balik AI tentang kejelasan dan dasar-dasar
it: Feedback dell'IA su chiarezza e fondamentali
ja: 明確さと基本原則に関するAIフィードバック
no: AI tilbakemelding på klarhet og grunnleggende prinsipper
pl: Informacje zwrotne AI na temat jasności i podstaw
pt: Feedback de IA sobre clareza e fundamentos
ru: Отзыв ИИ о ясности и основах
sv: AI-återkoppling om tydlighet och grundläggande färdigheter
th: AI ข้อมูลป้อนกลับเกี่ยวกับความชัดเจนและพื้นฐาน
tr: AI geri bildirimi açıklık ve temel konular üzerine
uk: Відгук ШІ щодо зрозумілості та основних принципів
vi: Phản hồi AI về sự rõ ràng và các nguyên tắc cơ bản

source: AI Feedback on Your Answers
ar: ملاحظات الذكاء الاصطناعي على إجاباتك
be: Водгукі AI на вашы адказы
da: AI-feedback på dine svar
de: KI-Feedback zu Ihren Antworten
es: Comentarios de IA en tus respuestas
fr: Retour d'IA sur vos réponses
id: Masukan AI pada Jawaban Anda
it: Feedback dell'IA sulle Tue Risposte
ja: あなたの回答に対するAIフィードバック
ms: Maklum Balas AI pada Jawapan Anda
no: AI-tilbakemelding på svarene dine
pl: Informacje zwrotne AI na temat Twoich odpowiedzi
pt: Feedback de IA sobre suas Respostas
ru: Отзывы ИИ о Ваших Ответах
sv: AI-feedback på dina svar
th: ฟีดแบ็ก AI เกี่ยวกับคำตอบของคุณ
tr: AI'nizin Cevaplarınıza Geri Bildirimi
uk: Відгук ШІ щодо ваших відповідей
vi: Phản hồi AI về Câu Trả Lời của Bạn

source: AI feedback that matters
ar: تغذية راجعة من الذكاء الاصطناعي تهمك
be: Зваротная сувязь AI, якая мае значэнне
da: AI-feedback der betyder noget
de: KI-Feedback, das zählt
es: Comentarios de IA que importan
fr: Des commentaires d'IA qui comptent
id: Umpan balik AI yang berarti
it: Riscontro AI che conta
ja: AIフィードバックが重要です
ms: Maklum balas AI yang penting
no: AI-tilbakemelding som betyr noe
pl: Informacje zwrotne od AI, które mają znaczenie
pt: Feedback de IA que importa
ru: Обратная связь ИИ, которая имеет значение
sv: AI-återkoppling som gör skillnad
th: ข้อเสนอแนะของ AI ที่สำคัญ
tr: Önemli olan AI geri bildirimi
uk: Зворотний зв'язок AI, що має значення
vi: Phản hồi AI thực sự quan trọng

source: AI hours left in your balance.
ar: ساعات الذكاء الاصطناعي المتبقية في رصيدك.
be: У вашым балансе засталося AI гадзін.
da: AI timer tilbage i din saldo.
de: AI Stunden übrig in Ihrem Guthaben.
es: Quedan horas de IA en tu saldo.
fr: Heures IA restantes dans votre solde.
id: Sisa jam AI di saldo Anda.
it: Ore AI rimanenti nel tuo saldo.
ja: あなたの残高に残っているAIの時間。
ms: Jam AI yang masih tersisa dalam baki anda.
no: AI timer igjen på din saldo.
pl: Pozostało ci godzin AI na twoim koncie.
pt: Horas de IA restantes no seu saldo.
ru: Оставшиеся часы AI в вашем балансе.
sv: AI timmar kvar på ditt saldo.
th: ชั่วโมง AI ที่เหลือในยอดคงเหลือของคุณ
tr: AI bakiyenizde kalan saatler.
uk: У вашому балансі залишилося AI годин.
vi: Số giờ AI còn lại trong số dư của bạn.

source: AI Interview Coach
ar: مدرب مقابلات الذكاء الاصطناعي
es: Entrenador de Entrevistas de IA
fr: Coach d'Entretien AI
id: Pelatih Wawancara AI
it: Coach dell'intervista AI
ja: AIインタビューコーチ
ms: Jurulatih Temuduga AI
no: AI Intervju Coach
pl: AI Trener Wywiadów
pt: Treinador de Entrevistas por IA
ru: AI Interview Coach Искусственный интеллект - тренер по собеседованиям
sv: AI Intervjuguide
th: โค้ชสัมภาษณ์งาน AI
tr: AI Görüşme Antrenörü
uk: Коуч зі співбесід на основі ШІ
vi: Huấn Luyện Viên Phỏng Vấn AI

source: AI Interview Practice
ar: ممارسة المقابلات بالذكاء الاصطناعي
be: AI Інтэрв'ю Практыка
da: AI Interview Praktik
de: AI-Interviewübung
es: Práctica de Entrevista con IA
fr: Pratique d'entretien avec AI
id: Latihan Wawancara AI
it: Pratica di Intervista AI
ja: AIインタビュープラクティス
ms: Latihan Temuduga AI
no: AI-intervjupraksis
pl: Praktyka Wywiadów AI
pt: Prática de Entrevista com IA
ru: Практика интервью с ИИ
sv: AI-intervjuträning
th: ฝึกสัมภาษณ์ด้วย AI
tr: AI Mülakat Pratiği
uk: Практика співбесід з AI
vi: Luyện phỏng vấn với AI

source: AI knowledge about you
id: Pengetahuan AI tentang Anda
it: Conoscenza AI su di te
ja: AIがあなたに関する知識
no: AI-kunnskap om deg
pl: Wiedza AI na Twój temat
ru: Знания AI о вас
sv: AI-kunskaper om dig
uk: Знання штучного інтелекту про вас

source: AI Language Tutor
ar: مدرس اللغة الذكية
be: Інтэрактыўны настаўнік па мове AI
da: AI Sproglærer
de: AI Sprachtrainer
es: AI Tutor de Idiomas
fr: Tuteur de Langue IA
id: AI Tutor Bahasa
it: Tutor di Lingua AI
ja: AI言語チューター
ms: AI Pengajar Bahasa
no: AI Språklærer
pl: AI Nauczyciel Języków
pt: Tutor de Idiomas de IA
ru: ИИ языковой репетитор
sv: AI Språkhandledare
th: ครูสอนภาษา AI
tr: AI Dil Eğitmeni
uk: AI Мовний Наставник
vi: Hướng Dẫn Ngôn Ngữ AI

source: AI language tutor pricing
ar: أسعار معلم اللغة الذكاء الاصطناعي
be: Цэны на штучны інтэлект як рэпетытар з мовы
da: AI sprogunderviser priser
de: AI Sprachlehrer Preisgestaltung
es: Precios del tutor de idiomas de IA
fr: Tarification du tuteur linguistique IA
id: Harga tutor bahasa AI
it: Prezzi del tutor di lingua AI
ja: AI言語チューターの料金
ms: Harga tutor bahasa AI
no: AI språklærerpriser
pl: Ceny tutora języka AI
pt: precificação do tutor de idiomas AI
ru: Цены на AI языкового наставника
sv: AI språkhandledare prissättning
th: ราคาเรียนภาษา AI
tr: AI dil eğitmeni fiyatlandırması
uk: Ціни на AI репетитора з мови
vi: Giá cho gia sư ngôn ngữ AI

source: AI responses are text-only
ar: الردود الذكية هي نصوص فقط
be: Адказы штучнага інтэлекту ў выглядзе толькі тэксту
da: AI-svar er kun tekst
de: KI-Antworten sind nur Text
es: Las respuestas de IA son solo texto.
fr: Les réponses de l'IA sont uniquement textuelles
id: Respon AI hanya berupa teks
it: Le risposte dell'IA sono solo testo
ja: AIの応答はテキストのみです
no: AI-responser er kun tekst
pl: Odpowiedzi AI zawierają tylko tekst.
pt: As respostas da IA são apenas em texto
ru: Ответы ИИ предоставляются только в текстовом формате
sv: AI-svar är endast text
th: AI responses are text-only การตอบกลับของ AI เป็นข้อความเท่านั้น
tr: AI yanıtları yalnızca metin şeklindedir.
uk: Відповіді ШІ є лише текстовими
vi: Các câu trả lời của AI chỉ có văn bản

source: AI speaking partner
ar: شريك محادثة الذكاء الاصطناعي
be: Партнёр для размоў на штучным інтэлекту
da: AI samtalepartner
de: KI Gesprächspartner
es: AI compañero de conversación
fr: Partenaire de conversation IA
id: Mitra berbicara AI
it: Partner di conversazione AI
ja: AI 会話パートナー
ms: Rakan bicara AI
no: AI samtalepartner
pl: AI partner do rozmów
pt: Parceiro de conversa com IA
ru: Партнёр для разговоров с ИИ
sv: AI samtalspartner
th: พาร์ทเนอร์พูดคุย AI
tr: AI konuşma partneri
uk: Партнер для розмов на основі ШІ
vi: Đối tác hội thoại AI

source: AI Speaking Practice
ar: ممارسة التحدث مع الذكاء الاصطناعي
be: Практыка маўлення з AI
da: AI Taletræning
de: AI Sprechübung
es: Práctica de Habla con IA
fr: Pratique de Parole avec l'IA
id: Latihan Berbicara AI
it: AI Esercizio di Conversazione
ja: AIスピーキング練習
pl: Ćwiczenia Mówienia z AI
pt: Prática de Fala com IA
ru: Практика говорения с ИИ
sv: AI Talövning
th: การฝึกพูดด้วย AI
tr: AI Konuşma Pratiği
uk: Практика мовлення з AI
vi: Luyện Nói Cùng AI

source: AI tutor cost
ar: تكلفة المعلم الذكي
be: Кошт AI-рэпетытара
da: AI vejleder omkostninger
de: AI Tutor Kosten
es: Costo del tutor de IA
fr: Coût du tuteur IA
id: Biaya tutor AI
it: Costo del tutor AI
ja: AI家庭教師の費用
ms: Kos tutor AI
no: AI lærerveiledning kostnad
pl: Koszt korepetytora AI
pt: Custo do tutor de IA
ru: Стоимость AI репетитора
sv: AI-tutor kostnad
th: ค่าใช้จ่ายของติวเตอร์ AI
tr: AI öğretmen maliyeti
uk: Вартість AI репетитора
vi: Chi phí gia sư AI

source: AI Tutor Updates
ar: تحديثات المعلم الذكي
be: Абнаўленні AI настаўніка
da: AI Tutor Opdateringer
es: Actualizaciones del Tutor de IA
fr: Mises à jour du tuteur IA
id: Pembaruan Tutor AI
it: Aggiornamenti del Tutor AI
ja: AIチューターの更新
ms: Kemaskini Tutor AI
no: AI Læreroppdateringer
pl: Aktualizacje AI Tutora
pt: Atualizações do Tutor de IA
ru: Обновления AI Репетитора
sv: AI Tutor Uppdateringar
th: การอัปเดตติวเตอร์ AI
tr: AI Eğitmen Güncellemeleri
uk: Оновлення AI Репетитора
vi: Cập nhật Gia sư AI

source: AI Voice
id: AI Suara
it: Voce AI
ja: AI 音声
no: AI-stemme
pl: Głos AI
ru: Голос ИИ
sv: AI-röst
uk: Голос AI

source: AI voice
ar: صوت الذكاء الاصطناعي
be: Голас AI
da: AI stemme
de: KI-Stimme
es: voz de IA
fr: Voix AI
id: Suara AI
it: Voce AI
ja: AIボイス
no: AI-stemme
pl: Głos AI
pt: Voz de IA
ru: Голос ИИ
sv: AI-röst
th: เสียง AI
tr: AI sesi
uk: Голос ШІ
vi: Giọng nói AI

source: AI voice is disabled
ar: الصوت الذكي معطل
be: Голас AI адключаны
da: AI-stemme er deaktiveret
de: AI-Stimme ist deaktiviert
es: La voz de la IA está desactivada
fr: La voix AI est désactivée
id: AI suara dinonaktifkan
it: La voce AI è disabilitata
ja: AI音声が無効になっています
no: AI-stemme er deaktivert
pl: AI głos jest wyłączony
pt: A voz da IA está desativada
ru: Голосовой AI отключен
sv: AI-röst är inaktiverad
th: AI voice ถูกปิดใช้งาน
tr: AI sesi devre dışı bırakıldı
uk: Голосовий AI вимкнено
vi: AI Voice bị vô hiệu hóa

source: AI will evaluate answers and determine the winner.
ar: سيقوم الذكاء الاصطناعي بتقييم الإجابات وتحديد الفائز.
be: AI будзе ацэньваць адказы і вызначаць пераможцу.
da: AI vil evaluere svarene og afgøre vinderen.
de: KI wird die Antworten bewerten und den Gewinner bestimmen.
es: La IA evaluará las respuestas y determinará al ganador.
fr: L'IA évaluera les réponses et déterminera le gagnant.
id: AI akan mengevaluasi jawaban dan menentukan pemenangnya.
it: L'intelligenza artificiale valuterà le risposte e determinerà il vincitore.
ja: AIが回答を評価し、勝者を決定します。
no: AI vil evaluere svarene og bestemme vinneren.
pl: AI oceni odpowiedzi i wyłoni zwycięzcę.
pt: A IA avaliará as respostas e determinará o vencedor.
ru: ИИ оценит ответы и определит победителя.
sv: AI kommer att utvärdera svaren och utse vinnaren.
th: AI จะประเมินคำตอบและตัดสินผู้ชนะ
tr: AI cevapları değerlendirecek ve kazananı belirleyecek.
uk: AI оцінить відповіді та визначить переможця.
vi: AI sẽ đánh giá câu trả lời và xác định người chiến thắng.

source: AI-driven feedback on your answers
ar: التعليقات المستندة إلى الذكاء الاصطناعي على إجاباتك
be: AI-кіраваная зваротная сувязь на вашы адказы
da: AI-drevet feedback på dine svar
de: KI-gesteuertes Feedback zu Ihren Antworten
es: Comentarios impulsados por IA sobre tus respuestas
fr: Retour d'information piloté par l'IA sur vos réponses
id: Umpan balik yang didorong oleh AI pada jawaban Anda
it: Riscontro basato sull'intelligenza artificiale sulle tue risposte
ja: AIを活用した解答へのフィードバック
ms: Maklum balas berasaskan AI untuk jawapan anda
no: AI-drevet tilbakemelding på svarene dine
pl: Informacje zwrotne na temat Twoich odpowiedzi generowane przez AI
pt: Feedback orientado por IA sobre suas respostas
ru: Отзыв, основанный на ИИ, на ваши ответы
sv: AI-styrd feedback på dina svar
th: คำติชมจาก AI เกี่ยวกับคำตอบของคุณ
tr: AI destekli cevaplarınıza geri bildirim
uk: Зворотній зв'язок на ваші відповіді з підтримкою штучного інтелекту
vi: Phản hồi từ AI dựa trên câu trả lời của bạn

source: AI-powered interview preparation that helps you get more job offers.
ar: <|vq_2296|>متابعة التحضير للمقابلات باستخدام الذكاء الاصطناعي الذي يساعدك في الحصول على المزيد من عروض العمل.
be: Інтэрв'ю падрыхтоўка з падтрымкай штучнага інтэлекту, якая дапамагае вам атрымаць больш прапаноў працы.
da: AI-drevet interviewforberedelse, der hjælper dig med at få flere jobtilbud.
de: KI-gestützte Interviewvorbereitung, die Ihnen hilft, mehr Jobangebote zu erhalten.
es: Preparación para entrevistas impulsada por IA que te ayuda a obtener más ofertas de trabajo.
fr: Préparation d'entretien alimentée par l'IA qui vous aide à obtenir plus d'offres d'emploi.
id: Persiapan wawancara didukung AI yang membantu Anda mendapatkan lebih banyak tawaran pekerjaan.
it: Preparazione ai colloqui alimentata dall'IA che ti aiuta a ottenere più offerte di lavoro.
ja: AIを活用した面接準備で、より多くの仕事を獲得しよう。
ms: Persediaan temuduga berkuasa AI yang membantu anda mendapatkan lebih banyak tawaran pekerjaan.
no: AI-drevet intervjuforberedelse som hjelper deg med å få flere jobbtilbud.
pl: Przygotowanie do rozmowy kwalifikacyjnej wspierane przez AI, które pomaga zdobyć więcej ofert pracy.
pt: Preparação para entrevistas com IA que ajuda você a receber mais ofertas de emprego.
ru: Подготовка к собеседованию с помощью ИИ, которая помогает вам получить больше предложений о работе.
sv: AI-driven intervjuförberedelser som hjälper dig att få fler jobberbjudanden.
th: การเตรียมตัวสัมภาษณ์ด้วย AI ที่ช่วยให้คุณได้รับข้อเสนองานมากขึ้น
tr: Yapay zeka destekli mülakat hazırlığı, daha fazla iş teklifi almanıza yardımcı olur.
uk: Підготовка до співбесіди на основі штучного інтелекту, яка допомагає отримати більше пропозицій про роботу.
vi: Chuẩn bị phỏng vấn được hỗ trợ bằng AI giúp bạn nhận được nhiều lời mời làm việc hơn.

source: Alex Dmowski (Founder)
uk: Alex Dmowski (Засновник)

source: Alias
ar: الاسم المستعار
be: Аліас
ja: エイリアス
pt: Apelido
ru: Псевдоним
th: นามแฝง
tr: Takma Ad
uk: Псевдонім
vi: Bí danh

source: Alias Game
id: Permainan Alias
it: Gioco Alias
ja: エイリアスゲーム
no: Alias Spill
ru: Игра "Алиас"
uk: Гра "Аліас"

source: Alias Game Levels
ar: مستويات لعبة الأسماء المستعارة
be: Узроўні гульні "Аліяс"
da: Alias Spil Niveauer
de: Alias Spielstufen
es: Niveles del Juego Alias
fr: Niveaux de Jeu Alias
id: Tingkat Permainan Alias
it: Livelli del Gioco Alias
ja: エイリアスゲームのレベル
ms: Tahap Permainan Alias
no: Alias Spill Nivåer
pl: Poziomy Gry Alias
pt: Níveis do Jogo Alias
ru: Уровни игры "Alias"
sv: Alias Spel Nivåer
th: ระดับเกม Alias
tr: Alias Oyun Seviyeleri
uk: Рівні гри Alias
vi: Các Mức độ Trò chơi Alias

source: alias game online
id: alias permainan online
it: alias gioco online
ja: plaintext エイリアスゲームオンライン
no: alias spill online
ru: псевдоним игра онлайн
uk: онлайн гра alias

source: Alias Game options
ar: خيارات لعبة الأسماء المستعارة
be: Опцыі гульні Alias
da: Alias-spil muligheder
de: Alias Spieloptionen
es: Opciones del juego Alias
fr: Options du jeu Alias
id: Opsi Game Alias
it: Opzioni di Alias Game
ja: エイリアスゲームのオプション
ms: Pilihan Permainan Alias
no: Alias Spillalternativer
pl: Opcje gry Alias
pt: Opções do jogo Alias
ru: Опции игры Alias
sv: Alias Spelalternativ
th: ตัวเลือกเกม Alias
tr: Takma Ad Oyunu seçenekleri
uk: Опції гри "Аліас"
vi: Tùy chọn cho Trò chơi Đoán tên

source: Alias Game Recording
ar: تسجيل لعبة الأسماء المستعارة
be: Запіс Гульні Alias
da: Alias Spiloptagelse
de: Alias Spiel Aufnahme
es: Grabación del Juego Alias
fr: Enregistrement du Jeu Alias
id: Rekaman Game Alias
it: Registrazione del Gioco Alias
ja: エイリアスゲームレコーディング
ms: Rakaman Permainan Alias
no: Alias spillinnspilling
pl: Nagranie Gry Alias
pt: Gravação do Jogo Alias
ru: Запись игры "Alias"
sv: Alias Spelinspelning
th: บันทึกเกม Alias
tr: Alias Oyun Kaydı
uk: Запис Гри в Псевдоніми
vi: Ghi Âm Trò Chơi Alias

source: alias in english online
id: alias dalam bahasa Inggris online
it: alias in inglese online
ja: 英語オンラインのエイリアス
no: alias på engelsk online
ru: псевдоним на английском онлайн
uk: псевдонім англійською онлайн

source: alias online english
id: alias bahasa inggris online
it: alias inglese online
ja: エイリアス オンライン英語
no: alias online engelsk
ru: алиас онлайн английский
uk: alias онлайн англійська

source: Alias Word Guessing Game
ar: لعبة تخمين الكلمات المستعارة
be: Гульня ў адгадванне аліясаў
da: Alias Ordbogs Gætte Spil
de: Alias Wortschätzspiel
es: Juego de Adivinanza de Palabras Alias
fr: Jeu de Devinette de Mots Alias
id: Permainan Tebak Kata Alias
it: Gioco di Indovinare la Parola Alias
ja: エイリアス単語推測ゲーム
ms: Alias Permainan Tebak Kata
no: Alias Ordgjettingsspill
pl: Gra w zgadywanie słów Alias
pt: Jogo de Adivinhação de Palavras Alias
ru: Игра в угадывание слов по аллегориям
sv: Alias Ordgissningsspel
th: เกมเดาอักษรแฝง
tr: Alias Kelime Tahmin Oyunu
uk: Гра у вгадування слів Alias
vi: Alias Trò Chơi Đoán Từ

source: All
id: Semua
it: Tutti
ja: すべて
no: Alle
pl: Wszystko
ru: Все
sv: Alla
uk: Усі

source: All Blogs
ar: جميع المدونات
be: Усе блогі
da: Alle Blogs
de: Alle Blogs
es: Todos los Blogs
fr: Tous les Blogs
id: Semua Blog
it: Tutti i Blog
ja: すべてのブログ
ms: Semua Blog
no: Alle Blogger
pl: Wszystkie Blogi
pt: Todos os Blogs
ru: Все Блоги
sv: Alla Bloggar
th: บล็อกทั้งหมด
tr: Tüm Bloglar
uk: Всі Блоги
vi: Tất cả Blogs

source: All Interviews
ar: جميع المقابلات
be: Усе інтэрв'ю
da: Alle interviews
de: Alle Interviews
es: Todas las Entrevistas
fr: Toutes les interviews
id: Semua Wawancara
it: Tutte le Interviste
ja: すべてのインタビュー
ms: Semua Temu Bual
no: Alle intervjuer
pl: Wszystkie wywiady
pt: Todas as Entrevistas
ru: Все интервью
sv: Alla intervjuer
th: การสัมภาษณ์ทั้งหมด
tr: Tüm Görüşmeler
uk: Усі інтерв'ю
vi: Tất cả cuộc phỏng vấn

source: All Scenarios
ar: جميع السيناريوهات
be: Усе сцэнары
da: Alle Scenarier
de: Alle Szenarien
es: Todos los escenarios
fr: Tous les scénarios
id: Semua Skenario
it: Tutti gli scenari
ja: すべてのシナリオ
ms: Semua Senario
no: Alle Scenarier
pl: Wszystkie Scenariusze
pt: Todos os Cenários
ru: Все сценарии
sv: Alla scenarier
th: ทุกสถานการณ์
tr: Tüm Senaryolar
uk: Всі сценарії
vi: Tất cả các kịch bản

source: All the source code is open and publicly available. If you know how to code, you're welcome to improve it.
ja: すべてのソースコードはオープンで公開されています。もしコーディングができるなら、ぜひ改良してください。
no: All kildekoden er åpen og offentlig tilgjengelig. Hvis du kan kode, er du velkommen til å forbedre den.
uk: Весь вихідний код є відкритим та загальнодоступним. Якщо ви вмієте програмувати, ви можете його вдосконалити.

source: Allow Microphone Access
es: Permitir acceso al micrófono
id: Izinkan Akses Mikrofon
it: Consenti Accesso al Microfono
ja: マイクへのアクセスを許可
no: Tillat mikrofontilgang
pl: Zezwól na dostęp do mikrofonu
pt: Permitir Acesso ao Microfone
ru: Разрешить доступ к микрофону
sv: Tillåt mikrofonåtkomst
uk: Дозволити доступ до мікрофона

source: Allow WebCam
ar: السماح بكاميرا الويب
be: Дазволіць вэб-камеру
da: Tillad WebCam
de: WebCam zulassen
es: Permitir cámara web
fr: Autoriser la Webcam
id: Izinkan Webcam
it: Consenti WebCam
ja: Webカメラを許可
no: Tillat webkameraet
pl: Zezwól na kamerę internetową
pt: Permitir câmera web
ru: Разрешить веб-камеру
sv: Tillåt WebCam
th: อนุญาตกล้องเว็บแคม
tr: WebCam'e İzin Ver
uk: Дозволити веб-камеру
vi: Cho phép WebCam

source: Almost correct
ar: تقريبا صحيح
be: Прачы папраўна
da: Næsten korrekt
de: Fast richtig
es: Casi correcto
fr: Presque correct
id: Hampir benar
it: Quasi corretto
ja: ほぼ正確
ms: Hampir betul
no: Nesten riktig
pl: Prawie poprawne
pt: Quase correto
ru: Почти правильно
sv: Nästan rätt
th: เกือบถูก
tr: Neredeyse doğru
uk: Майже вірно
vi: Gần đúng

source: Almost there!
ar: تقريبًا هناك!
be: Амаль там!
da: Næsten der!
de: Fast da!
es: ¡Casi allí!
fr: Presque là !
id: Hampir di sana!
it: Quasi lì!
ja: もう少しで終わります！
ms: Hampir sampai!
no: Nesten der!
pl: Prawie gotowe!
pt: Quase lá!
ru: Почти готово!
sv: Nästan där!
th: เกือบถึงแล้ว!
tr: Neredeyse oradayız!
uk: Майже готово!
vi: Gần xong rồi!

source: alternate timelines
ar: مسارات زمنية بديلة
be: альтэрнатыўныя часовыя лініі
da: alternative tidslinjer
de: alternative Zeitlinien
es: líneas temporales alternas
fr: chronologies alternatives
id: garis masa alternatif
it: linee temporali alternative
ja: 代替タイムライン
ms: garis masa alternatif
no: alternative tidslinjer
pl: alternatywne linie czasowe
pt: linhas do tempo alternativas
ru: альтернативные временные линии
sv: alternativa tidslinjer
th: ทางเลือกของเส้นเวลา
tr: alternatif zaman çizelgeleri
uk: альтернативні часові лінії
vi: các dòng thời gian thay thế

source: Always respond politely:
ar: دائماً رد بأدب:
be: Заўсёды вадзіцеся вежліва:
da: Svar altid høfligt:
de: Immer höflich antworten:
es: Responde siempre educadamente:
fr: Toujours répondre poliment:
id: Selalu beri tanggapan dengan sopan:
it: Rispondi sempre educatamente:
ja: 常に丁寧に返答してください:
ms: Sentiasa beri balasan dengan sopan:
no: Alltid svar høflig:
pl: Zawsze odpowiadaj grzecznie:
pt: Responda sempre educadamente:
ru: Всегда отвечайте вежливо:
sv: Svara alltid artigt:
th: ตอบสุภาพเสมอ:
tr: Her zaman kibarca cevap verin:
uk: Завжди відповідайте ввічливо:
vi: Luôn phản hồi một cách lịch sự:

source: An error occurred while analyzing the message. Please try again.
ar: حدث خطأ أثناء تحليل الرسالة. يرجى المحاولة مرة أخرى.
be: Адбылася памылка пры аналізе паведамлення. Калі ласка, паспрабуйце яшчэ раз.
de: Ein Fehler ist bei der Analyse der Nachricht aufgetreten. Bitte versuchen Sie es erneut.
es: Se produjo un error al analizar el mensaje. Por favor, inténtalo de nuevo.
fr: Une erreur est survenue lors de l'analyse du message. Veuillez réessayer.
id: Terjadi kesalahan saat menganalisis pesan. Silakan coba lagi.
it: Si è verificato un errore durante l'analisi del messaggio. Si prega di riprovare.
ja: メッセージの分析中にエラーが発生しました。もう一度お試しください。
no: En feil oppstod under analysen av meldingen. Vennligst prøv igjen.
pl: Wystąpił błąd podczas analizowania wiadomości. Proszę spróbować ponownie.
pt: Ocorreu um erro ao analisar a mensagem. Por favor, tente novamente.
ru: Произошла ошибка при анализе сообщения. Пожалуйста, попробуйте еще раз.
sv: Ett fel uppstod vid analysen av meddelandet. Vänligen försök igen.
th: เกิดข้อผิดพลาดระหว่างการวิเคราะห์ข้อความ กรุณาลองใหม่อีกครั้ง
tr: Mesajı analiz ederken bir hata oluştu. Lütfen tekrar deneyin.
uk: Під час аналізу повідомлення сталася помилка. Будь ласка, спробуйте ще раз.
vi: Đã xảy ra lỗi khi phân tích thông điệp. Vui lòng thử lại.

source: Analyzing
ar: تحليل
be: Аналіз
da: Analyserer
de: Analysieren
es: Analizando
fr: Analyser
id: Menganalisis
it: Analizzando
ja: 分析中
ms: Menganalisis
no: Analyserer
pl: Analizowanie
pt: Analisando
ru: Анализируется
sv: Analyserar
th: การวิเคราะห์
tr: Analiz ediliyor
uk: Аналіз
vi: Phân tích
