Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: My name is Alex, I am the creator of this website. I am a software engineer and I am passionate about learning languages and career development. I created this website to help people learn languages in a fun and interactive way, as well as prepare effectively for job interviews. I hope you enjoy using it!
ar: اسمي أليكس، أنا منشئ هذا الموقع. أنا مهندس برمجيات وأنا شغوف بتعلم اللغات وتطوير المهارات المهنية. لقد أنشأت هذا الموقع لمساعدة الأشخاص على تعلم اللغات بطريقة ممتعة وتفاعلية، وكذلك التحضير بفعالية لمقابلات العمل. آمل أن تستمتع باستخدامه!
be: Мяне завуць Алекс, я стваральнік гэтага сайта. Я інжынер-праграміст, і мяне захапляе навучанне мовам і развіццё кар'еры. Я стварыў гэты сайт, каб дапамагчы людзям вывучаць мовы ў цікавы і інтэрактыўны спосаб, а таксама эфектыўна рыхтавацца да сумоўяў на працу. Спадзяюся, вам спадабаецца карыстацца ім!
da: Mit navn er Alex, jeg er skaberen af denne hjemmeside. Jeg er softwareingeniør, og jeg brænder for at lære sprog og karriereudvikling. Jeg skabte denne hjemmeside for at hjælpe folk med at lære sprog på en sjov og interaktiv måde, samt forberede sig effektivt til jobsamtaler. Jeg håber, du nyder at bruge den!
de: Mein Name ist Alex, ich bin der Ersteller dieser Website. Ich bin Software-Ingenieur und leidenschaftlich daran interessiert, Sprachen zu lernen und mich beruflich weiterzuentwickeln. Ich habe diese Website erstellt, um Menschen zu helfen, Sprachen auf eine unterhaltsame und interaktive Weise zu lernen und sich effektiv auf Vorstellungsgespräche vorzubereiten. Ich hoffe, Sie haben Freude daran, sie zu nutzen!
es: Mi nombre es Alex, soy el creador de este sitio web. Soy ingeniero de software y me apasiona aprender idiomas y el desarrollo profesional. Creé este sitio web para ayudar a las personas a aprender idiomas de manera divertida e interactiva, así como a prepararse eficazmente para entrevistas de trabajo. ¡Espero que lo disfrutes!
fr: Mon nom est Alex, je suis le créateur de ce site web. Je suis ingénieur logiciel et je suis passionné par l'apprentissage des langues et le développement de carrière. J'ai créé ce site web pour aider les gens à apprendre les langues de manière ludique et interactive, ainsi qu'à se préparer efficacement pour les entretiens d'embauche. J'espère que vous apprécierez l'utiliser !
id: Nama saya Alex, saya adalah pencipta situs web ini. Saya seorang insinyur perangkat lunak dan saya sangat antusias tentang belajar bahasa dan pengembangan karier. Saya membuat situs web ini untuk membantu orang belajar bahasa dengan cara yang menyenangkan dan interaktif, serta mempersiapkan diri secara efektif untuk wawancara kerja. Saya harap Anda menikmati menggunakannya!
it: Il mio nome è Alex, sono il creatore di questo sito web. Sono un ingegnere del software e sono appassionato di apprendimento delle lingue e sviluppo della carriera. Ho creato questo sito web per aiutare le persone a imparare le lingue in modo divertente e interattivo, oltre a prepararsi efficacemente per i colloqui di lavoro. Spero che tu ti diverta a usarlo!
ms: Nama saya Alex, saya adalah pencipta laman web ini. Saya seorang jurutera perisian dan saya bersemangat tentang pembelajaran bahasa dan pembangunan kerjaya. Saya mencipta laman web ini untuk membantu orang belajar bahasa dengan cara yang menyeronokkan dan interaktif, serta menyediakan persediaan yang berkesan untuk temu duga pekerjaan. Saya harap anda menikmati menggunakannya!
pl: Mam na imię Alex, jestem twórcą tej strony internetowej. Jestem inżynierem oprogramowania i pasjonuję się nauką języków oraz rozwojem kariery zawodowej. Stworzyłem tę stronę, aby pomóc ludziom w nauce języków w sposób zabawny i interaktywny, a także skutecznie przygotowywać się do rozmów kwalifikacyjnych. Mam nadzieję, że korzystanie z niej sprawi Ci przyjemność!
pt: Meu nome é Alex, sou o criador deste site. Sou engenheiro de software e sou apaixonado por aprender idiomas e desenvolvimento de carreira. Criei este site para ajudar as pessoas a aprender idiomas de uma forma divertida e interativa, assim como se preparar de forma eficaz para entrevistas de emprego. Espero que você goste de usá-lo!
ru: Меня зовут Алекс, я создатель этого сайта. Я - инженер-программист, и меня увлекает изучение языков и развитие карьеры. Я создал этот сайт, чтобы помочь людям изучать языки весело и интерактивно, а также эффективно готовиться к собеседованиям на работу. Надеюсь, вам понравится его использование!
sv: Mitt namn är Alex, jag är skaparen av denna webbplats. Jag är mjukvaruingenjör och jag brinner för att lära mig språk och karriärutveckling. Jag skapade den här webbplatsen för att hjälpa människor att lära sig språk på ett roligt och interaktivt sätt, samt förbereda sig effektivt inför jobbintervjuer. Jag hoppas att du tycker om att använda den!
th: ชื่อของฉันคือ Alex ฉันเป็นผู้สร้างเว็บไซต์นี้ ฉันเป็นวิศวกรซอฟต์แวร์และมีความหลงใหลในการเรียนรู้ภาษาและการพัฒนาอาชีพ ฉันสร้างเว็บไซต์นี้ขึ้นมาเพื่อช่วยผู้คนในการเรียนรู้ภาษาในแบบที่สนุกสนานและมีการโต้ตอบ พร้อมทั้งเตรียมตัวสำหรับการสัมภาษณ์งานอย่างมีประสิทธิภาพ ฉันหวังว่าคุณจะสนุกกับการใช้งานเว็บไซต์นี้!
tr: Benim adım Alex, bu web sitesinin yaratıcısıyım. Bir yazılım mühendisiyim ve dil öğrenme ile kariyer gelişimi konusunda tutkuluyum. Bu web sitesini, insanların dilleri eğlenceli ve etkileşimli bir şekilde öğrenmelerine ve iş görüşmelerine etkili bir şekilde hazırlanmalarına yardımcı olmak için yarattım. Umarım kullanırken keyif alırsınız!
vi: Tên tôi là Alex, tôi là người tạo ra trang web này. Tôi là một kỹ sư phần mềm và tôi đam mê học ngôn ngữ cũng như phát triển sự nghiệp. Tôi đã tạo ra trang web này để giúp mọi người học ngôn ngữ một cách thú vị và tương tác, cũng như chuẩn bị hiệu quả cho các buổi phỏng vấn xin việc. Hy vọng bạn thích sử dụng nó!

source: Redis
ru: Редис

source: Select the voice your AI teacher will use during conversations. You can change this anytime.
id: Pilih suara yang akan digunakan pengajar AI Anda selama percakapan. Anda dapat mengubahnya kapan saja.
it: Seleziona la voce che il tuo insegnante di AI utilizzerà durante le conversazioni. Puoi cambiarla in qualsiasi momento.
pl: Wybierz głos, którego Twój nauczyciel AI będzie używał podczas rozmów. Możesz to zmienić w dowolnym momencie.
ru: Выберите голос, который ваш AI учитель будет использовать во время разговоров. Вы можете изменить его в любое время.
sv: Välj rösten som din AI-lärare kommer att använda under konversationer. Du kan ändra detta när som helst.

source: {count} round{plural}
ru: {count} раунд{plural}

source: {rounds}, {duration}s per turn
ru: {раунды}, {длительность}с на ход

source: {rounds}, {words} words per turn
ru: {раунды}, {слова} слов за ход

source: Limited Access
pl: Ograniczony Dostęp

source: Limited messages and voice features.
pl: Ograniczone wiadomości i funkcje głosowe.

source: Unlock full access to personalized practice plans and real-time conversations with AI.
pl: Odblokuj pełny dostęp do spersonalizowanych planów ćwiczeń i rozmów w czasie rzeczywistym z AI.

source: Limited messages per conversation
sv: Begränsade meddelanden per konversation

source: Unlimited messages per conversation
sv: Obegränsade meddelanden per konversation

source: Areas to improve
de: Bereiche zur Verbesserung
th: พื้นที่ที่ต้องปรับปรุง
tr: Geliştirilmesi Gereken Alanlar
vi: Các lĩnh vực cần cải thiện

source: Areas to improve:
ar: مناطق للتحسين:
be: Галіны для паляпшэння:
da: Områder at forbedre:
de: Bereiche zur Verbesserung:
fr: Zones à améliorer:
ms: Bidang yang perlu ditingkatkan:
th: พื้นที่ที่ควรปรับปรุง:
tr: İyileştirilecek Alanlar:
vi: Các khu vực cần cải thiện:

source: Continue conversation
ar: متابعة المحادثة
be: Працягваць размову
da: Fortsæt samtale
de: Fortsetzen der Unterhaltung
fr: Continuer la conversation
ms: Teruskan perbualan
th: ดำเนินการสนทนาต่อ
tr: Konuşmaya devam et
vi: Tiếp tục cuộc trò chuyện

source: Crafting new rule...
ar: إنشاء قاعدة جديدة...
be: Стварэнне новага правіла...
da: Oprettelse af ny regel...
de: Erstellen einer neuen Regel...
fr: Création d'une nouvelle règle...
ms: Membentuk peraturan baru...
th: กำลังสร้างกฎใหม่...
tr: Yeni kural oluşturuluyor...
vi: Đang tạo quy tắc mới...

source: Crafting new words...
ar: صياغة كلمات جديدة...
be: Стварэнне новых слоў...
da: Skriver nye ord...
de: Neue Wörter kreieren...
fr: Création de nouveaux mots...
ms: Mencipta perkataan baru...
th: การสร้างคำใหม่...
tr: Yeni kelimeler oluşturuluyor...
vi: Đang tạo ra những từ mới...

source: Daily Question
de: Tägliche Frage
es: Pregunta Diaria
pt: Pergunta Diária
th: คำถามประจำวัน
tr: Günlük Soru
vi: Câu Hỏi Hàng Ngày

source: Error Processing the goal
ar: خطأ في معالجة الهدف
be: Памылка пры апрацоўцы мэты
da: Fejl ved behandling af målet
de: Fehler bei der Verarbeitung des Ziels
fr: Erreur de traitement de l'objectif
ms: Ralat Memproses matlamat
th: ข้อผิดพลาดในการประมวลผลเป้าหมาย
tr: Hedefi işleme hatası
vi: Lỗi trong quá trình xử lý mục tiêu

source: Finish
ar: إنهاء
be: Завяршыць
da: Afslut
de: Fertigstellen
es: Finalizar
fr: Terminer
ms: Selesaikan
pt: Terminar
th: เสร็จสิ้น
tr: Bitir
vi: Hoàn tất

source: FluencyPal is my personal project and I want to keep it simple. No subscriptions, no recurring payments, just straightforward access when you need it.
de: FluencyPal ist mein persönliches Projekt und ich möchte es einfach halten. Keine Abonnements, keine wiederkehrenden Zahlungen, nur unkomplizierter Zugang, wenn du ihn benötigst.
es: FluencyPal es mi proyecto personal y quiero mantenerlo simple. Sin suscripciones, sin pagos recurrentes, solo acceso directo cuando lo necesites.
pt: FluencyPal é meu projeto pessoal e quero mantê-lo simples. Sem assinaturas, sem pagamentos recorrentes, apenas acesso direto quando você precisar.
th: FluencyPal เป็นโครงการส่วนตัวของฉันและฉันต้องการให้มันเรียบง่าย ไม่มีการสมัครสมาชิก ไม่มีการชำระเงินที่เกิดขึ้นซ้ำ เพียงแค่การเข้าถึงที่ตรงไปตรงมาเมื่อคุณต้องการ
tr: FluencyPal benim kişisel projem ve bunu basit tutmak istiyorum. Abonelik yok, tekrar eden ödemeler yok, yalnızca ihtiyaç duyduğunuzda doğrudan erişim.
vi: FluencyPal là dự án cá nhân của tôi và tôi muốn giữ cho nó đơn giản. Không có đăng ký, không có những khoản thanh toán định kỳ, chỉ là quyền truy cập trực tiếp khi bạn cần.

source: Full access is free if you reach the top 5 on the community leaderboard!
de: Vollzugriff ist kostenlos, wenn Sie die Top 5 der Community-Bestenliste erreichen!
es: ¡El acceso completo es gratis si llegas al top 5 en la tabla de clasificación de la comunidad!
th: การเข้าถึงทั้งหมดฟรีหากคุณไปถึงอันดับ 5 อันดับแรกในกระดานผู้นำชุมชน!
tr: Topluluk liderlik tablosunda ilk 5'e ulaşırsanız tam erişim ücretsiz!
vi: Quyền truy cập đầy đủ là miễn phí nếu bạn đạt top 5 trên bảng xếp hạng cộng đồng!

source: Goal is created
ar: تم إنشاء الهدف
be: Мэта створана
da: Målet er oprettet
de: Ziel ist erstellt
fr: L'objectif est créé
ms: Matlamat telah dicipta
th: เป้าหมายถูกสร้างขึ้น
tr: Hedef oluşturuldu
vi: Mục tiêu đã được tạo

source: Help with answer
ar: مساعدة في الإجابة
be: Дапамагчы з адказам
da: Hjælp med svar
de: Hilfe bei der Antwort
es: Ayuda con la respuesta
fr: Aide avec la réponse
ms: Bantuan dengan jawapan
pt: Ajuda com a resposta
th: ช่วยเหลือเรื่องคำตอบ
tr: Cevapla ilgili yardım
vi: Giúp với câu trả lời

source: I know all of them
ar: أعرفهم جميعًا
be: Я ведаю іх усіх
da: Jeg kender dem alle
de: Ich kenne sie alle
fr: Je les connais tous.
ms: Saya tahu kesemuanya
th: ฉันรู้จักพวกเขาทั้งหมด
tr: Hepsini biliyorum
vi: Tôi biết tất cả bọn họ

source: Idea for your message
ar: فكرة لرسالتك
be: Ідэя для вашага паведамлення
da: Idé til din besked
de: Idee für Ihre Nachricht
es: Idea para tu mensaje
fr: Idée pour votre message
ms: Idea untuk mesej anda
pt: Ideia para a sua mensagem
th: ความคิดสำหรับข้อความของคุณ
tr: Mesajınız için fikir
vi: Ý tưởng cho tin nhắn của bạn

source: Keyboard mode
ar: وضع لوحة المفاتيح
be: Рэжым клавіятуры
da: Tastaturtilstand
de: Tastaturmodus
es: Modo de teclado
fr: Mode clavier
ms: Mod papan kekunci
pt: Modo teclado
th: โหมดคีย์บอร์ด
tr: Klavye modu
vi: Chế độ bàn phím

source: Language level
de: Sprachniveau
th: ระดับภาษา
tr: Dil seviyesi
vi: Trình độ ngôn ngữ

source: Language level:
ar: مستوى اللغة:
be: Узровень мовы:
da: Sprog niveau:
de: Sprachniveau:
fr: Niveau de langue:
ms: Tahap bahasa:
th: ระดับภาษา:
tr: Dil seviyesi:
vi: Trình độ ngôn ngữ:

source: Lesson Review
ar: مراجعة الدرس
be: Агляд урока
da: Lektion Gennemgang
de: Lektionsüberblick
fr: Révision de la Leçon
ms: Ulasan Pelajaran
th: การทบทวนบทเรียน
tr: Ders İncelemesi
vi: Đánh Giá Bài Học

source: Lessons added:
ar: تمت إضافة الدروس:
be: Дададзеныя урокі:
da: Lektioner tilføjet:
de: Hinzugefügte Lektionen:
fr: Leçons ajoutées :
ms: Pelajaran ditambah:
th: บทเรียนที่เพิ่ม:
tr: Eklenen dersler:
vi: Bài học được thêm:

source: Loading Goal...
ar: جاري تحميل الهدف...
be: Загрузка мэты...
da: Indlæser mål...
de: Ladeziel...
fr: Chargement de l'objectif...
ms: Memuatkan Matlamat...
th: กำลังโหลดวัตถุประสงค์...
tr: Hedef Yükleniyor...
vi: Đang tải Mục tiêu...

source: Mute microphone
ar: إيقاف الميكروفون
be: Выключыць мікрафон
da: Slå mikrofon fra
de: Mikrofon stummschalten
fr: Couper le microphone
th: ปิดไมโครโฟน
tr: Mikrofonu sessize al
vi: Tắt microphone

source: My Chats
de: Meine Chats
es: Mis Chats
pt: Meus Bate-papos
th: การสนทนาของฉัน
tr: Sohbetlerim
vi: Cuộc Trò Chuyện Của Tôi

source: My name is Alex. I am the founder of this project. You will find my contacts below.
ar: اسمي أليكس. أنا مؤسس هذا المشروع. ستجد اتصالاتي أدناه.
be: Мяне клічуць Аляксей. Я - заснавальнік гэтага праекта. Вы знойдзеце мае кантакты ніжэй.
da: Mit navn er Alex. Jeg er grundlæggeren af dette projekt. Du vil finde mine kontakter nedenfor.
de: Mein Name ist Alex. Ich bin der Gründer dieses Projekts. Sie finden meine Kontakte unten.
es: Mi nombre es Alex. Soy el fundador de este proyecto. Encontrarás mis contactos a continuación.
fr: Mon nom est Alex. Je suis le fondateur de ce projet. Vous trouverez mes coordonnées ci-dessous.
ms: Nama saya adalah Alex. Saya adalah pengasas projek ini. Anda boleh mencari maklumat hubungan saya di bawah.
pt: O meu nome é Alex. Eu sou o fundador deste projeto. Você vai encontrar os meus contatos abaixo.
th: ฉันชื่อ Alex ฉันเป็นผู้ก่อตั้งโครงการนี้ คุณจะพบข้อมูลติดต่อของฉันที่ด้านล่าง
tr: Benim adım Alex. Bu projenin kurucusuyum. İletişim bilgilerimi aşağıda bulabilirsiniz.
vi: Tên tôi là Alex. Tôi là người sáng lập dự án này. Bạn sẽ tìm thấy thông tin liên hệ của tôi ở phía dưới.

source: New rule to practice.
ar: قاعدة جديدة للممارسة.
be: Новае правіла для практыкі.
da: Ny regel at øve.
de: Neue Regel zum Üben.
fr: Nouvelle règle à pratiquer.
ms: Peraturan baru untuk berlatih.
th: กฎใหม่ในการฝึกฝน.
tr: Yeni kural uygulama.
vi: Quy tắc mới để thực hành.

source: New words
ar: كلمات جديدة
be: Новыя словы
da: Nye ord
de: Neue Wörter
fr: Nouveaux mots
ms: Perkataan baru
th: คำศัพท์ใหม่
tr: Yeni kelimeler
vi: Từ mới

source: New words to practice.
ar: كلمات جديدة للتدريب.
be: Новыя словы для практыкі.
da: Nye ord at øve.
de: Neue Wörter zum Üben.
fr: Nouveaux mots à pratiquer.
ms: Perkataan baru untuk berlatih.
th: คำศัพท์ใหม่สำหรับฝึกฝน.
tr: Yeni kelimeler pratik edilecek.
vi: Từ mới để luyện tập.

source: Next, please allow access to the microphone to communicate with the AI.
ar: التالي، يُرجى السماح بالوصول إلى الميكروفون للتواصل مع الذكاء الاصطناعي.
be: Далей, калі ласка, дазвольце доступ да мікрафона для сувязі з AI.
da: Dernæst, giv venligst adgang til mikrofonen for at kommunikere med AI'en.
de: Als nächstes erlauben Sie bitte den Zugriff auf das Mikrofon, um mit der KI zu kommunizieren.
fr: Ensuite, veuillez autoriser l'accès au microphone pour communiquer avec l'IA.
ms: Seterusnya, sila benarkan akses kepada mikrofon untuk berkomunikasi dengan AI.
th: ถัดไป กรุณาอนุญาตการเข้าถึงไมโครโฟนเพื่อสื่อสารกับ AI
tr: Sonraki adımda, yapay zeka ile iletişim kurmak için lütfen mikrofona erişim izni verin.
vi: Tiếp theo, vui lòng cho phép truy cập vào micro để giao tiếp với AI.

source: No
ar: لا
be: Не
da: Nej
de: Nein
fr: Non
ms: Tidak
th: ไม่
tr: Hayır
vi: Không

source: No message recorded yet.
ar: لا توجد رسالة مسجلة بعد.
be: Яшчэ няма захаваных паведамленняў.
da: Ingen besked er optaget endnu.
de: Noch keine Nachricht aufgezeichnet.
fr: plaintext Aucun message enregistré pour le moment.
th: ยังไม่มีข้อความบันทึก
tr: Kayıtlı bir mesaj yok.
vi: Chưa có tin nhắn nào được ghi lại.

source: Open community chat
de: Öffne den Community-Chat
th: เปิดแชทชุมชน
tr: Açık topluluk sohbeti

source: Open plan
ar: خطة مفتوحة
be: Адкрыты план
da: Åben plan
de: Offener Plan
fr: Plan ouvert
ms: Rancangan terbuka
th: เปิดแผน
tr: Açık plan
vi: Kế hoạch mở

source: Practice new vocabulary with the AI
ar: ممارسة مفردات جديدة مع الذكاء الاصطناعي
be: Практыкуйце новую лексіку з АІ
da: Øv nyt ordforråd med AI'en
de: Übe neuen Wortschatz mit der KI
fr: Pratiquez de nouveau vocabulaire avec l'IA
ms: Amalkan perbendaharaan kata baru dengan AI
th: ฝึกคำศัพท์ใหม่กับ AI
tr: Yeni kelimeleri AI ile pratik yapın
vi: Thực hành từ vựng mới với AI

source: Practice with AI
ar: تدرب مع الذكاء الاصطناعي
be: Практыка з AI
da: Øv med AI
de: Übung mit KI
es: Practica con IA
fr: Pratiquer avec l'IA
pt: Pratique com IA
th: ฝึกฝนกับ AI
tr: Yapay Zeka ile Pratik Yap
vi: Luyện tập với AI

source: Preparing Goal
ar: تجهيز الهدف
be: Падрыхтоўка Мэты
da: Forbereder Mål
de: Zielvorbereitung
fr: Préparation de l'objectif
ms: Menyediakan Matlamat
th: การเตรียมตั้งเป้าหมาย
tr: Hedef Hazırlama
vi: Đang Chuẩn bị Mục tiêu

source: Processing the goal...
ar: جاري معالجة الهدف...
be: Апрацоўка мэты...
da: Behandler målet...
de: Verarbeite das Ziel...
fr: Traitement de l'objectif...
ms: Memproses matlamat...
th: กำลังดำเนินการตามเป้าหมาย...
tr: Hedef işleniyor...
vi: Đang xử lý mục tiêu...

source: Rating
ar: التقييم
be: Ацэнка
da: Bedømmelse
de: Bewertung
es: Calificación
fr: Évaluation
pt: Avaliação
th: การให้คะแนน
tr: Derecelendirme
vi: Đánh giá

source: Ready?
ar: هل أنت مستعد؟
be: Гатовы?
da: Klar?
de: Bereit?
fr: Prêt ?
ms: Sedia?
th: พร้อมแล้วหรือยัง?
tr: Hazır mısın?
vi: Sẵn sàng?

source: Review Message
de: Überprüfungsnachricht
th: ข้อความตรวจสอบ
tr: Mesajı İncele

source: Send 6 messages to complete
ar: أرسل 6 رسائل للإكمال
be: Адправце 6 паведамленняў, каб завершыць
da: Send 6 beskeder for at fuldføre
de: Sende 6 Nachrichten zum Abschließen
fr: Envoyez 6 messages pour terminer
ms: Hantar 6 mesej untuk melengkapkan
th: ส่ง 6 ข้อความเพื่อเสร็จสิ้น
tr: 6 mesaj göndermek için tamamlayın
vi: Gửi 6 tin nhắn để hoàn thành

source: Start new lesson
ar: ابدأ درسًا جديدًا
be: Пачаць новы ўрок
da: Start ny lektion
de: Neue Lektion beginnen
fr: Commencer une nouvelle leçon
ms: Mulakan pelajaran baru
th: เริ่มบทเรียนใหม่
tr: Yeni dersi başlat
vi: Bắt đầu bài học mới

source: Start practice
ar: ابدأ الممارسة
be: Пачніце практыку
da: Start øvelse
de: Startübungen
fr: Commencer la pratique
ms: Mulakan latihan
th: เริ่มฝึกฝน
tr: Başla pratik yapmaya
vi: Bắt đầu luyện tập

source: Start Voice Only
ar: ابدأ الصوت فقط
be: Пачаць толькі голас
da: Start kun lyd
de: Stimme Nur Starten
fr: Démarrer en mode vocal uniquement
th: เริ่มต้นเฉพาะเสียง
tr: Yalnızca Sesli Başlat
vi: Bắt đầu Chỉ giọng nói

source: Unmute microphone
ar: plaintext إلغاء كتم الميكروفون
be: Уключыць мікрафон
da: Slå mikrofon til lyd
de: Mikrofon aktivieren
fr: Réactiver le microphone
th: เปิดไมโครโฟน
tr: Mikrofon sesini aç
vi: Bật tiếng micro

source: Voice conversations without delays
de: Sprachgespräche ohne Verzögerungen
es: Conversaciones de voz sin demoras
fr: Conversations vocales sans délais
pt: Conversas por voz sem atrasos
th: การสนทนาด้วยเสียงโดยไม่ล่าช้า
tr: Gecikmesiz sesli konuşmalar
vi: Cuộc trò chuyện bằng giọng nói không bị trễ

source: Voice record mode
ar: وضع تسجيل الصوت
be: Рэжым галасавога запісу
da: Stem optagelsestilstand
de: Sprachaufnahmemodus
es: Modo de grabación de voz
fr: Mode d'enregistrement vocal
ms: Mod rakaman suara
pt: Modo de gravação de voz
th: โหมดบันทึกเสียง
tr: Ses kaydı modu
vi: Chế độ ghi âm giọng nói

source: What was great:
ar: ما كان رائعا:
be: Што было выдатна:
da: Hvad var fantastisk:
de: Was war großartig:
fr: Ce qui était génial :
ms: Apa yang hebat:
th: สิ่งที่ดีที่สุด:
tr: Harika olan neydi:
vi: Điều tuyệt vời:

source: What went well
de: Was gut lief
th: สิ่งที่ทำได้ดี
tr: Ne iyi gitti
vi: Điều gì đã diễn ra tốt

source: Yes, I am ready
ar: نعم، أنا جاهز
be: Так, я гатовы
da: Ja, jeg er klar
de: Ja, ich bin bereit
fr: Oui, je suis prêt
ms: Ya, saya bersedia
th: ใช่ ฉันพร้อมแล้ว
tr: Evet, hazırım
vi: Vâng, tôi đã sẵn sàng

source: You can use any language.
de: Du kannst jede Sprache verwenden.
tr: Herhangi bir dili kullanabilirsiniz.

source: Your Message:
ar: رسالتك:
be: Вашае паведамленне:
da: Din Besked:
de: Ihre Nachricht:
fr: Votre Message :
th: ข้อความของคุณ:
tr: Mesajınız:
vi: Tin nhắn của bạn:

source: Example:
th: ตัวอย่าง:
vi: Ví dụ:

source: Public
th: สาธารณะ
vi: Công cộng

source: You can also share fun facts about yourself or your goals!
th: คุณยังสามารถแชร์ข้อมูลสนุกๆ เกี่ยวกับตัวคุณหรือเป้าหมายของคุณได้ด้วย!
vi: Bạn cũng có thể chia sẻ những sự thật thú vị về bản thân hoặc mục tiêu của mình!

source: Go to Practice (Free Plan)
ar: اذهب إلى التمرين (الخطة المجانية)
be: Перайсці да практыкі (Бясплатны план)
da: Gå til øvelse (gratis plan)
fr: Aller à la pratique (Plan gratuit)
vi: Đi tới Thực hành (Gói Miễn phí)

source: Join a Call With AI
ar: انضم إلى مكالمة مع الذكاء الاصطناعي
be: Далучыцца да выкліку з AI
da: Deltag i et opkald med AI
fr: Rejoindre un appel avec l'IA
vi: Tham gia Cuộc gọi Với AI

source: Learn useful words so you never go blank mid-sentence
ar: تعلم الكلمات المفيدة حتى لا تتلعثم أبدًا في منتصف الجملة
be: Вучыце карысныя словы, каб вы ніколі не замаўчалі на паўслове
da: Lær nyttige ord, så du aldrig går i stå midt i en sætning
fr: Apprenez des mots utiles pour ne jamais rester à court de mots en plein milieu d'une phrase
ms: Belajar perkataan berguna supaya anda tidak terdiam di tengah ayat
vi: Học những từ hữu ích để bạn không bao giờ bị ngắc ngứ giữa câu

source: Practice real-life situations in advance
ar: تمرن على مواقف الحياة الواقعية مقدمًا
be: Практыкуйце рэальныя сітуацыі загадзя
da: Øv virkelige situationer på forhånd
fr: Pratiquez des situations de la vie réelle à l'avance
ms: Latih situasi kehidupan sebenar terlebih dahulu
vi: Luyện tập các tình huống thực tế trước

source: So we need your agreement with that
ar: إذًا نحن بحاجة إلى موافقتك على ذلك
be: Таму нам патрэбна ваша згода на гэта
da: Så vi har brug for din accept af det
fr: Donc nous avons besoin de votre accord pour cela
ms: Jadi kami memerlukan persetujuan anda mengenai perkara itu
vi: Vậy nên chúng tôi cần sự đồng ý của bạn với điều đó

source: Text message
vi: Tin nhắn văn bản

source: Welcome Message
vi: Thông điệp chào mừng

source: Record message
es: Grabar mensaje

source: You're all set! Continue practicing to improve your skills.
es: ¡Estás listo! Continúa practicando para mejorar tus habilidades.

source: Full access
ar: الوصول الكامل
be: Поўны доступ
da: Fuld adgang
fr: Accès complet

source: Unlimited AI Conversations
ar: plaintext محادثات غير محدودة مع الذكاء الاصطناعي
be: Неабмежаваныя гутаркі з AI
da: Ubegrænsede AI-samtaler

source: Realistic AI voice responses
ar: ردود صوتية واقعية للذكاء الاصطناعي
be: Рэалістычныя галасавыя адказы ШІ
da: Realistiske AI-stemmebesvarelser

source: Subscription for 1 month | Full access
ar: الاشتراك لمدة شهر | الوصول الكامل
be: Падпіска на 1 месяц | Поўны доступ
da: Abonnement for 1 måned | Fuld adgang
fr: Abonnement pour 1 mois | Accès complet
ms: Langganan untuk 1 bulan | Akses penuh

source: Subscription
ar: اشتراك
be: Падпіска
da: Abonnement
fr: Abonnement
ms: Langganan
