Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Backend outcomes that transform your interview performance
ar: نتائج الخلفية التي تحول أداء مقابلتك
be: Вынікі бэкенда, якія трансфармуюць вашу эфектыўнасць на сумоўі
da: Backend-resultater, der transformerer din interviewpræstation
de: Backend-Ergebnisse, die Ihre Interviewleistung transformieren
es: Resultados de backend que transforman tu desempeño en entrevistas
fr: Résultats backend qui transforment votre performance en entretien
id: Hasil backend yang mengubah kinerja wawancara Anda
it: Esiti del backend che trasformano le tue prestazioni in un colloquio
ja: インタビューのパフォーマンスを変革するバックエンドの成果
ms: Keputusan backend yang mengubah prestasi temuduga anda
no: Backend resultater som forvandler din intervjuprestasjon
pl: Rezultaty backendowe, które przekształcają Twoje wyniki na rozmowie kwalifikacyjnej
pt: Resultados de backend que transformam seu desempenho em entrevistas
ru: Результаты бэкенда, которые преобразуют вашу производительность на собеседовании
sv: Backendresultat som transformerar din intervjuprestation
th: ผลลัพธ์ของเบื้องหลังที่เปลี่ยนการแสดงของคุณในการสัมภาษณ์
tr: Mülakat performansınızı dönüştüren arka plan sonuçları
uk: Результати бекенду, які змінюють вашу ефективність на співбесіді
vi: Kết quả backend giúp biến đổi hiệu suất phỏng vấn của bạn

source: Backend Readiness Score
ar: درجة جاهزية الخلفية
da: Backend Læseparate Score
de: Backend-Bereitschafts-Score
es: Puntuación de Preparación del Backend
fr: Score de Préparation du Backend
id: Skor Kesiapan Backend
it: Punteggio Prontezza Backend
ja: バックエンド準備完了スコア
ms: Skor Kesediaan Backend
no: Backend klarhetsgrad
pl: Skala Przygotowania Backendu
pt: Pontuação de Prontidão do Backend
ru: Оценка готовности серверной части
th: คะแนนความพร้อมของระบบแบ็กเอนด์
tr: Backend Hazırlık Skoru
uk: Score Готовності Бекенду
vi: Điểm Sẵn Sàng Của Backend

source: Backend-focused answers
ar: إجابات مركزة على الجانب الخلفي
be: Адказы, арыентаваныя на бэкэнд
da: Backend-fokuserede svar
de: Backend-fokussierte Antworten
es: Respuestas enfocadas en backend
fr: Réponses axées sur le backend
id: Jawaban berfokus pada backend
it: Risposte incentrate sul backend
ja: バックエンドに焦点を当てた回答
ms: Jawapan berfokuskan backend
no: Backend-fokuserte svar
pl: Odpowiedzi skoncentrowane na zapleczu
pt: Respostas focadas no backend
ru: Ответы, ориентированные на бэкенд
sv: Backend-fokuserade svar
th: คำตอบที่เน้นด้านเบื้องหลัง
tr: Backende odaklanmış yanıtlar
uk: Відповіді, орієнтовані на бекенд
vi: Các câu trả lời tập trung vào phần backend

source: Balance
ar: توازن
be: Баланс
fr: Équilibre
id: Saldo
it: Bilancia
ja: バランス
ms: Keseimbangan
no: Balanse
pl: Równowaga
pt: Equilíbrio
ru: Баланс
sv: Balans
th: การทรงตัว
tr: Denge
uk: Баланс
vi: Cân bằng

source: Based on your CV, experience, and target role.
ar: بناءً على سيرتك الذاتية وخبرتك والدور المستهدف.
be: На аснове вашага рэзюмэ, вопыту і мэтавай ролі.
da: Baseret på dit CV, din erfaring og den målrettede rolle.
de: Basierend auf Ihrem Lebenslauf, Ihrer Erfahrung und der angestrebten Rolle.
es: Basado en tu CV, experiencia y rol objetivo.
fr: Basé sur votre CV, votre expérience et le rôle cible.
id: Berdasarkan CV, pengalaman, dan peran target Anda.
it: Basato sul tuo CV, esperienza e ruolo obiettivo.
ja: あなたの履歴書、経験、ターゲット役割に基づいています。
ms: Berdasarkan CV, pengalaman, dan peranan sasaran anda.
no: Basert på din CV, erfaring og målrolle.
pl: Na podstawie Twojego CV, doświadczenia i docelowej roli.
pt: Baseado no seu CV, experiência e função alvo.
ru: Основываясь на вашем резюме, опыте и целевой роли.
sv: Baserat på ditt CV, din erfarenhet och målsatta roll.
th: จากประวัติส่วนตัวของคุณ, ประสบการณ์, และบทบาทเป้าหมาย.
tr: CV'nize, deneyiminize ve hedeflediğiniz role dayanarak.
uk: На основі вашого резюме, досвіду та цільової ролі.
vi: Dựa trên CV, kinh nghiệm và vai trò mục tiêu của bạn.

source: Based on your level, the AI will suggest words to describe.
ar: استنادًا إلى مستواك، ستقترح الذكاء الاصطناعي كلمات للوصف.
be: На аснове вашага ўзроўню, ШІ будзе прапанаваць словы для апісання.
da: Baseret på dit niveau vil AI foreslå ord til at beskrive.
de: Basierend auf Ihrem Niveau wird die KI Wörter vorschlagen, die Sie beschreiben sollen.
es: Según tu nivel, la IA sugerirá palabras para describir.
fr: En fonction de votre niveau, l'IA suggérera des mots à décrire.
id: Berdasarkan level Anda, AI akan menyarankan kata-kata untuk dijelaskan.
it: In base al tuo livello, l'IA suggerirà parole da descrivere.
ja: あなたのレベルに基づき、AIは説明するための言葉を提案します。
ms: Berdasarkan tahap anda, AI akan mencadangkan perkataan untuk diterangkan.
no: Basert på ditt nivå, vil AI foreslå ord å beskrive.
pl: Na podstawie Twojego poziomu, AI zasugeruje słowa do opisania.
pt: Com base no seu nível, a IA irá sugerir palavras para descrever.
ru: Исходя из вашего уровня, ИИ предложит слова для описания.
sv: Baserat på din nivå kommer AI:n att föreslå ord att beskriva.
th: ตามระดับของคุณ, AI จะแนะนำคำที่ใช้ในการอธิบาย
tr: Seviyenize göre, AI tanımlamanız için kelimeler önerir.
uk: На основі вашого рівня, ШІ запропонує слова для опису.
vi: Dựa vào trình độ của bạn, AI sẽ đề xuất các từ để mô tả.

source: Based on your onboarding, FluencyPal instantly generates a custom learning plan just for you.
ar: استنادًا إلى التعلم الأولي لك، يولد FluencyPal خطة تعليم مخصصة فورية خاصة بك.
be: На аснове вашага адаптацыйнага перыяду, FluencyPal адразу стварае індывідуальны навучальны план толькі для вас.
da: Baseret på din implementering, genererer FluencyPal øjeblikkeligt en skræddersyet læringsplan kun for dig.
de: Basierend auf Ihrem Onboarding erstellt FluencyPal sofort einen individuellen Lernplan nur für Sie.
es: Basado en tus respuestas, FluencyPal genera al instante instantáneamente un plan de aprendizaje personalizado solo para ti.
fr: Selon votre intégration, FluencyPal génère instantanément un plan d'apprentissage personnalisé juste pour vous.
id: Berdasarkan onboarding Anda, FluencyPal secara instan menghasilkan rencana belajar khusus hanya untuk Anda.
it: In base al tuo onboarding, FluencyPal genera istantaneamente un piano di apprendimento personalizzato solo per te.
ja: あなたのオンボーディングに基づいて、FluencyPalは即座にあなただけのカスタム学習プランを生成します。
ms: Berdasarkan proses orientasi anda, FluencyPal dengan serta-merta menghasilkan rancangan pembelajaran kustom untuk anda.
no: Basert på dine opplæringsdata, genererer FluencyPal øyeblikkelig en tilpasset læringsplan bare for deg.
pl: Na podstawie Twojego procesu wprowadzania, FluencyPal natychmiast generuje dla Ciebie indywidualny plan nauki.
pt: Com base no seu onboarding, o FluencyPal gera instantaneamente um plano de aprendizado personalizado apenas para você.
ru: На основе вашего вводного обучения, FluencyPal мгновенно создает индивидуальный учебный план специально для вас.
sv: Baserat på din introduktion skapar FluencyPal omedelbart en anpassad inlärningsplan bara för dig.
th: ตามข้อมูลที่คุณได้ทำการสมัครสมาชิก ทาง FluencyPal จะทำการสร้างแผนการเรียนรู้ที่ออกแบบมาเฉพาะสำหรับคุณทันที
tr: Oryantasyonunuza dayanarak, FluencyPal anında sadece sizin için özel bir öğrenme planı oluşturur.
uk: На основі вашого початкового введення, FluencyPal миттєво генерує індивідуальний план навчання саме для вас.
vi: Dựa trên quá trình hướng dẫn của bạn, FluencyPal tức thì tạo ra một kế hoạch học tập tùy chỉnh chỉ dành cho bạn.

source: Be honest but diplomatic. Don’t say “I have no weaknesses.” Instead, mention a minor issue and how you’re working to improve it:
ar: كن صادقًا ولكن بتلطف. لا تقل "ليس لدي أي نقاط ضعف". بدلاً من ذلك، اذكر مشكلة طفيفة وكيف تعمل على تحسينها:
be: Будзьце шчырымі, але дыпламатычнымі. Не кажыце "У мяне няма слабасцей". Замест гэтага, упамяніце дробную праблему і як вы працуеце над яе паляпшэннем:
da: Vær ærlig, men diplomatisk. Sig ikke "Jeg har ingen svagheder." I stedet kan du nævne en mindre udfordring og hvordan du arbejder på at forbedre den:
de: Seien Sie ehrlich, aber diplomatisch. Sagen Sie nicht "Ich habe keine Schwächen." Nennen Sie stattdessen ein kleines Problem und wie Sie daran arbeiten, es zu verbessern:
es: Sé honesto pero diplomático. No digas "No tengo debilidades". En su lugar, menciona un problema menor y cómo estás trabajando para mejorarlo:
fr: Soyez honnête mais diplomatique. Ne dites pas "Je n'ai aucune faiblesse". Au lieu de cela, mentionnez un problème mineur et comment vous travaillez pour l'améliorer :
id: Jadilah jujur tetapi diplomatik. Jangan katakan "Saya tidak memiliki kelemahan." Sebaliknya, sebutkan masalah kecil dan bagaimana Anda sedang berusaha untuk memperbaikinya:
it: Sii onesto ma diplomatico. Non dire "Non ho debolezze." Invece, menziona un piccolo problema e come stai lavorando per migliorarlo:
ja: 正直だが外交的であれ。 「私には弱点がない」とは言わないでください。代わりに、些細な問題を挙げて、それをどのように改善しているかを述べてください：
ms: Berlaku jujur tetapi diplomatik. Jangan katakan "Saya tidak mempunyai kelemahan." Sebaliknya, sebutkan isu minor dan bagaimana anda bekerja untuk memperbaikinya:
no: Vær ærlig, men diplomatisk. Si ikke "Jeg har ingen svakheter." I stedet, nevn en mindre utfordring og hvordan du jobber for å forbedre den:
pl: Bądź szczery, ale dyplomatyczny. Nie mów „Nie mam słabości”. Zamiast tego, wspomnij o drobnym problemie i jak pracujesz nad jego poprawą:
pt: Seja honesto, mas diplomático. Não diga "Não tenho fraquezas". Em vez disso, mencione um pequeno problema e como você está trabalhando para melhorá-lo:
ru: Будьте честны, но дипломатичны. Не говорите: "У меня нет слабостей." Вместо этого упомяните незначительную проблему и то, как вы работаете над ее улучшением:
sv: Var ärlig men diplomatisk. Säg inte "Jag har inga svagheter." Istället, nämn ett mindre problem och hur du arbetar för att förbättra det:
th: เป็นคนที่ซื่อสัตย์แต่มีวิจารณญาณ อย่าพูดว่า "ฉันไม่มีจุดอ่อน" แทนที่จะพูดอย่างนั้น คุณควรกล่าวถึงปัญหาเล็ก ๆ ซึ่งคุณกำลังพยายามที่จะปรับปรุง:
tr: Dürüst ancak diplomatik olun. “Hiç zayıflığım yok” demeyin. Bunun yerine, küçük bir sorunu ve bunu nasıl geliştirmeye çalıştığınızı belirtin:
uk: Будьте чесними, але дипломатичними. Не говоріть "У мене немає слабких сторін." Натомість, згадайте незначну проблему та як ви працюєте над її вирішенням:
vi: Hãy trung thực nhưng ngoại giao. Đừng nói "Tôi không có điểm yếu." Thay vào đó, nêu ra một vấn đề nhỏ và cách bạn đang cố gắng cải thiện nó:

source: Be prepared for your job interview
ar: استعد لمقابلة العمل الخاصة بك
be: Будзьце падрыхтаваныя да сумоўя на працу
da: Vær forberedt på din jobsamtale
de: Seien Sie auf Ihr Vorstellungsgespräch vorbereitet
es: Esté preparado para su entrevista de trabajo
fr: Soyez prêt pour votre entretien d'embauche
id: Bersiaplah untuk wawancara pekerjaan Anda
it: Preparati per il tuo colloquio di lavoro
ja: 仕事の面接に備えましょう
ms: Bersedia untuk temu duga kerja anda
no: Vær forberedt til jobbintervjuet ditt
pl: Przygotuj się na rozmowę kwalifikacyjną
pt: Esteja preparado para sua entrevista de emprego
ru: Будьте готовы к собеседованию на работу
sv: Var förberedd inför din arbetsintervju
th: เตรียมพร้อมสำหรับการสัมภาษณ์งานของคุณ
tr: İş görüşmen için hazırlıklı ol
uk: Будьте готові до співбесіди на роботу
vi: Hãy chuẩn bị cho buổi phỏng vấn xin việc của bạn

source: Be specific about your role
ar: كن محددًا بشأن دورك
be: Будзьце канкрэтнымі пра сваю ролю
da: Vær specifik om din rolle
de: Seien Sie spezifisch in Bezug auf Ihre Rolle
es: Sea específico acerca de su rol
fr: Soyez précis quant à votre rôle
id: Bersikaplah spesifik tentang peran Anda
it: Sii specifico riguardo al tuo ruolo
ja: あなたの役割について具体的に記述してください
ms: Nyatakan dengan jelas tentang peranan anda
no: Vær spesifikk om din rolle
pl: Bądź precyzyjny w opisie swojej roli
pt: Seja específico sobre o seu papel
ru: Будьте конкретны в отношении вашей роли
sv: Var specifik om din roll
th: ระบุบทบาทของคุณให้ชัดเจน
tr: Rolünüz hakkında özellikle konuşun
uk: Будьте конкретними щодо вашої ролі
vi: Hãy xác định rõ vai trò của bạn

source: Before we start
ar: قبل أن نبدأ
be: Перш чым мы пачнем
da: Før vi starter
de: Bevor wir beginnen
es: Antes de empezar
fr: Avant de commencer
id: Sebelum kita mulai
it: Prima di iniziare
ja: 開始する前に
no: Før vi starter
pl: Zanim zaczniemy
pt: Antes de começarmos
ru: Перед началом
sv: Innan vi börjar
th: ก่อนที่เราจะเริ่ม
tr: Başlamadan önce
uk: Перш ніж ми почнемо
vi: Trước khi chúng ta bắt đầu

source: Beginners who understand basic concepts but need help presenting themselves confidently in interviews
ar: المبتدئين الذين يفهمون المفاهيم الأساسية لكنهم يحتاجون إلى مساعدة لتقديم أنفسهم بثقة في المقابلات
be: Пачаткоўцы, якія разумеюць асноўныя паняцці, але маюць патрэбу ў дапамозе для ўпэўненага прадстаўлення сябе на сумоўях
da: Begyndere, der forstår grundlæggende koncepter, men har brug for hjælp til at præsentere sig selv med selvtillid i interviews
de: Anfänger, die grundlegende Konzepte verstehen, aber Hilfe benötigen, um sich selbstbewusst in Vorstellungsgesprächen zu präsentieren
es: Principiantes que entienden los conceptos básicos pero necesitan ayuda para presentarse con confianza en las entrevistas
fr: Débutants qui comprennent les concepts de base mais qui ont besoin d'aide pour se présenter avec confiance lors des entretiens
id: Pemula yang memahami konsep dasar tetapi membutuhkan bantuan untuk mempresentasikan diri dengan percaya diri dalam wawancara
it: Principianti che comprendono i concetti di base ma hanno bisogno di aiuto per presentarsi con sicurezza nei colloqui
ja: 基本的な概念を理解しているが、面接で自信を持って自己表現するための支援が必要な初心者
no: Nybegynnere som forstår grunnleggende konsepter, men trenger hjelp til å presentere seg selv med selvtillit i intervjuer
pl: Osoby początkujące, które rozumieją podstawowe pojęcia, ale potrzebują pomocy w pewnym prezentowaniu się podczas rozmów kwalifikacyjnych.
pt: Iniciantes que entendem conceitos básicos, mas precisam de ajuda para se apresentarem com confiança em entrevistas
ru: Начинающие, которые понимают основные концепции, но нуждаются в помощи, чтобы уверенно представлять себя на собеседованиях
sv: Nybörjare som förstår grundläggande koncept men behöver hjälp med att framställa sig själva med självförtroende i intervjuer
th: ผู้เริ่มต้นที่เข้าใจแนวคิดพื้นฐานแต่ต้องการความช่วยเหลือในการแสดงออกอย่างมั่นใจในการสัมภาษณ์
tr: Temel kavramları anlayan ancak görüşmelerde kendilerini güvenle sunmak için yardıma ihtiyaç duyan başlangıç seviyesindekiler
uk: Новачки, які розуміють базові поняття, але потребують допомоги у впевненій презентації себе на співбесідах
vi: Những người mới bắt đầu đã hiểu các khái niệm cơ bản nhưng cần sự trợ giúp để thể hiện bản thân một cách tự tin trong các cuộc phỏng vấn

source: Behavioral Question
ar: السؤال السلوكي
be: Паводзінскае пытанне
da: Adfærdsmæssigt spørgsmål
de: Verhaltensfrage
es: Pregunta de Comportamiento
fr: Question Comportementale
id: Pertanyaan Perilaku
it: Domanda Comportamentale
ja: 行動に関する質問
ms: Soalan Kelakuan
no: Atferdsspørsmål
pl: Pytanie Behawioralne
pt: Pergunta Comportamental
ru: Вопрос о поведении
sv: Beteendefråga
th: คำถามเกี่ยวกับพฤติกรรม
tr: Davranışsal Soru
uk: Питання поведінки
vi: Câu hỏi hành vi

source: Behavioral questions feel **scripted and uncomfortable**
ar: تشعر الأسئلة السلوكية بأنها **مكتوبة مسبقًا وغير مريحة**
be: Паводзінкавыя пытанні выглядаюць **сцэніраванымі і нязручнымі**
da: Adfærdsspørgsmål føles **iscenesatte og ubehagelige**
de: Verhaltensfragen fühlen sich **geskriptet und unangenehm** an
es: Las preguntas de comportamiento se sienten **ensayadas e incómodas**
fr: Les questions comportementales semblent **stéréotypées et inconfortables**
id: Pertanyaan perilaku terasa **terencana dan tidak nyaman**
it: Le domande comportamentali sembrano **preconfezionate e scomode**
ja: 行動に関する質問は**台本のようで不快**に感じる
no: Atferdsspørsmål føles **iscenesatt og ubehagelig**
pl: Pytania behawioralne wydają się **wyreżyserowane i niewygodne**
pt: Perguntas comportamentais parecem **roteirizadas e desconfortáveis**
ru: Поведенческие вопросы кажутся **продуманными по сценарию и некомфортными**
sv: Beteendefrågor känns **regisserade och obekväma**
th: คำถามพฤติกรรมรู้สึก**เหมือนถูกเขียนสคริปต์และไม่สะดวกใจ**
tr: Davranışsal sorular **planlanmış ve rahatsız** hissettiriyor
uk: Запитання щодо поведінки відчуваються **сценарними та незручними**
vi: Câu hỏi hành vi khiến bạn cảm thấy **như kịch bản và không thoải mái**

source: Belarusian Learning Plan
ar: خطة التعلم البيلاروسية
be: План вучэння беларускай мовы
da: Hviderussisk Læringsplan
de: Weißrussischer Lernplan
es: Plan de Aprendizaje Bielorruso
fr: Plan d'apprentissage biélorusse
id: Rencana Pembelajaran Bahasa Belarusia
it: Piano di Apprendimento Bielorusso
ja: ベラルーシ語学習プラン
ms: Pelajaran Belajar Bahasa Belarusia
no: Læringsplan for Hviterussisk
pl: Plan Nauki Białoruskiego
pt: Plano de Aprendizagem Bielorrusso
ru: План изучения белорусского языка
sv: Vitryska Lärplan
th: แผนการเรียนรู้ภาษาเบลารุส
tr: Beyaz Rusya Öğrenme Planı
uk: План навчання білоруської
vi: Kế Hoạch Học Tiếng Belarusian

source: Benefits of Playing Alias Game
ar: فوائد لعبة الاسم المستعار
be: Перавагі гульні ў Alias
da: Fordelene ved at spille Alias-spil
de: Vorteile des Alias-Spiels
es: Beneficios de Jugar al Juego Alias
fr: Avantages de Jouer au Jeu Alias
id: Manfaat Bermain Game Alias
it: Benefici del Gioco Alias
ja: Aliasゲームをプレイする利点
ms: Kelebihan Bermain Permainan Alias
no: Fordeler ved å Spille Alias Spill
pl: Korzyści z Gry w Alias
pt: Benefícios de Jogar o Jogo Alias
ru: Преимущества Игры в Алиас
sv: Fördelar med att Spela Alias-spelet
th: ประโยชน์ของการเล่นเกม Alias
tr: Alias Oyunu Oynamanın Faydaları
uk: Переваги гри в Alias
vi: Lợi ích của việc chơi Trò chơi Alias

source: Benefits of Role Play
ar: فوائد التمثيل الدوري
be: Перавагі ролевай гульні
da: Fordele ved Rollespil
de: Vorteile des Rollenspiels
es: Beneficios del Role Play
fr: Avantages du jeu de rôle
id: Manfaat dari Bermain Peran
it: Vantaggi del Gioco di Ruolo
ja: 役割演技の利点
ms: Kelebihan Bermain Peranan
no: Fordeler med rollespill
pl: Korzyści z gry fabularnej
pt: Benefícios do Role Play
ru: Преимущества ролевых игр
sv: Fördelar med Rollspel
th: ประโยชน์ของการเล่นบทบาท
tr: Rol Oynamanın Faydaları
uk: Переваги рольової гри
vi: Lợi ích của Việc Đóng Vai

source: Best for most job seekers
ar: الأفضل لمعظم الباحثين عن عمل
be: Найлепшы для большасці суіскальнікаў працы
da: Bedst for de fleste jobsøgende
de: Am besten für die meisten Arbeitssuchenden
es: Mejor para la mayoría de los solicitantes de empleo
fr: Meilleur pour la plupart des chercheurs d'emploi
id: Terbaik untuk sebagian besar pencari kerja
it: Ideale per la maggior parte dei candidati lavorativi
ja: ほとんどの求職者に最適
ms: Terbaik untuk kebanyakan pencari kerja
no: Best for most job seekers på norsk: "Best for de fleste jobbsøkere"
pl: Najlepsze dla większości poszukujących pracy
pt: Ideal para a maioria dos candidatos a emprego
ru: Подходит для большинства соискателей
sv: Bäst för de flesta arbetssökande
th: ดีที่สุดสำหรับผู้หางานส่วนใหญ่
tr: Çoğu iş arayan için en iyi
uk: Найкраще для більшості шукачів роботи
vi: Phù hợp nhất cho hầu hết người tìm việc

source: Blog
ar: بلوق
be: Блог
ja: ブログ
no: Blogg
ru: Блог
sv: Blogg
th: บล็อก
uk: Блог

source: Booking a Doctor's Appointment
ar: حجز موعد مع طبيب
be: Запіс на прыём да лекара
de: Buchung eines Arzttermins
es: Reservar una Cita Médica
fr: Réserver un rendez-vous chez le médecin
id: Membuat Janji dengan Dokter
it: Prenotazione di un Appuntamento Medico
ja: 医師の予約をする
ms: Tempah Janji Temu Doktor
no: Bestille legetime
pl: Rezerwacja wizyty u lekarza
pt: Marcando uma Consulta Médica
ru: Запись на прием к врачу
sv: Boka en läkartid
th: การจองนัดพบแพทย์
tr: Doktor Randevusu Alma
uk: Запис на прийом до лікаря
vi: Đặt Lịch Hẹn Với Bác Sĩ

source: Boost your confidence in public speaking.
ar: عزز ثقتك في التحدث العلني.
be: Павысьце свой упэўненасць у публічных выступах.
da: Boost din tillid til offentlig tale.
de: Steigern Sie Ihr Selbstvertrauen im öffentlichen Sprechen.
es: Aumenta tu confianza en la oratoria pública.
fr: Augmentez votre confiance en parlant en public.
id: Tingkatkan kepercayaan diri Anda dalam berbicara di depan umum.
it: Aumenta la tua sicurezza nel parlare in pubblico.
ja: パブリックスピーキングでの自信を高めましょう。
ms: Tingkatkan keyakinan anda dalam berucap di khalayak ramai.
no: Styrk selvtilliten din i offentlig tale.
pl: Zwiększ swoją pewność siebie w mówieniu publicznym.
pt: Aumente sua confiança na oratória pública.
ru: Увеличьте вашу уверенность в публичных выступлениях.
sv: Öka ditt självförtroende i offentligt talande.
th: เพิ่มความมั่นใจในการพูดสาธารณะของคุณ
tr: Kamuoyu önünde konuşma konusunda güveninizi artırın.
uk: Підвищте свою впевненість у публічних виступах.
vi: Tăng cường sự tự tin trong việc nói trước đám đông.

source: Boost your English vocabulary and fluency by creatively describing and guessing words in this interactive AI-powered Alias game.
ar: عزز مفرداتك الإنجليزية وطلاقتك بوصف وتخمين الكلمات بطريقة إبداعية في هذه اللعبة المدعومة بالذكاء الاصطناعي Alias.
be: Павялічце свой слоўнік англійскай мовы і плыннасць мовы, творча апісваючы і загадваючы словы ў гэтай інтэрактыўнай гульні Alias, якая працуе на штучным інтэлекте.
da: Forbedr dit engelske ordforråd og flydighed ved kreativt at beskrive og gætte ord i dette interaktive AI-drevne Alias-spil.
de: Steigern Sie Ihren englischen Wortschatz und flüssiges Sprechen, indem Sie Wörter auf kreative Weise beschreiben und raten in diesem interaktiven, von KI angetriebenen Alias-Spiel.
es: Mejore su vocabulario y fluidez en inglés describiendo y adivinando palabras de manera creativa en este juego de Alias impulsado por IA interactivo.
fr: Boostez votre vocabulaire anglais et votre aisance à l'oral en décrivant et en devinant des mots de manière créative dans ce jeu d'Alias alimenté par l'IA.
id: Tingkatkan kosa kata dan kelancaran bahasa Inggris Anda dengan mendeskripsikan dan menebak kata-kata secara kreatif dalam permainan Alias yang ditenagai oleh AI interaktif ini.
it: Aumenta il tuo vocabolario e la fluidità in inglese descrivendo e indovinando creativamente parole in questo gioco interattivo di Alias alimentato da AI.
ja: この対話型AIパワードAliasゲームにより、創造的に言葉を表現し推測することで、あなたの英語の語彙力と流暢さを向上させましょう。
ms: Tingkatkan kosa kata dan kefasihan Bahasa Inggeris anda dengan mendeskripsikan dan menebak kata-kata secara kreatif dalam permainan Alias yang dikuasai oleh AI interaktif ini.
no: Forbedre ditt engelske vokabular og flyt ved kreativt å beskrive og gjette ord i dette interaktive AI-drevne Alias-spillet.
pl: Zwiększ swój angielski słownictwo i płynność w mówieniu, kreatywnie opisując i odgadując słowa w tej interaktywnej grze Alias, napędzanej przez sztuczną inteligencję.
pt: Aumente seu vocabulário em inglês e fluência descrevendo e adivinhando palavras de forma criativa neste jogo Alias interativo alimentado por AI.
ru: Повысьте свои знания английского языка и свободу общения, креативно описывая и отгадывая слова в этой интерактивной игре Alias, работающей на AI.
sv: Förbättra ditt engelska ordförråd och flyt genom att kreativt beskriva och gissa ord i detta interaktiva AI-drivna Alias-spel.
th: เพิ่มคำศัพท์ภาษาอังกฤษและความคล่องในการพูดโดยวิธีการอธิบายและทายคำอย่างสร้างสรรค์ใน เกม Alias ที่ขับเคลื่อนด้วย AI ออกแบบมาเพื่อการโต้ตอบ
tr: İnteraktif AI destekli Alias oyununda kelimeleri yaratıcı bir şekilde tarif ederek ve tahmin ederek İngilizce kelime dağarcığınızı ve akıcılığınızı geliştirin.
uk: Покращте свій англійський словник і вільне володіння мовою, креативно описуючи та відгадуючи слова в цій інтерактивній грі Alias, підсиланій штучним інтелектом.
vi: Nâng cao từ vựng và khả năng lưu loát tiếng Anh của bạn bằng cách mô tả và đoán từ một cách sáng tạo trong trò chơi Alias được hỗ trợ bởi AI tương tác này.
