Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Performance, resiliency, and architecture patterns
ar: الأداء والمرونة والأنماط المعمارية
be: Прадукцыйнасць, устойлівасць і архітэктурныя ўзоры
da: Ydeevne, modstandsdygtighed og arkitekturdesignmønstre
de: Leistung, Belastbarkeit und Architekturmodelle
es: Rendimiento, resiliencia y patrones de arquitectura
fr: Performance, résilience et modèles d'architecture
id: Kinerja, ketahanan, dan pola arsitektur
it: Prestazioni, resilienza e modelli di architettura
ja: パフォーマンス、回復力、アーキテクチャパターン
ms: Prestasi, ketahanan, dan corak seni bina
no: Ytelse, motstandskraft og arkitekturmønstre
pl: Wydajność, odporność i wzorce architektoniczne
pt: Desempenho, resiliência e padrões de arquitetura
ru: Производительность, устойчивость и архитектурные шаблоны
sv: Prestanda, motståndskraft och arkitekturmodeller
th: ประสิทธิภาพ, ความยืดหยุ่น, และรูปแบบสถาปัตยกรรม
tr: Performans, dayanıklılık ve mimari desenler
uk: Продуктивність, стійкість та архітектурні шаблони
vi: Hiệu suất, khả năng phục hồi, và mô hình kiến trúc

source: Personal Plan
ar: خطة شخصية
be: Асабісты план
da: Personlig Plan
de: Persönlicher Plan
es: Plan Personal
fr: Plan Personnel
id: Rencana Pribadi
it: Piano Personale
ja: パーソナルプラン
ms: Rancangan Peribadi
no: Personlig Plan
pl: Plan Osobisty
pt: Plano Pessoal
ru: Персональный план
sv: Personlig Plan
th: แผนบุคคล
tr: Kişisel Plan
uk: Особистий План
vi: Gói Cá Nhân

source: Personalized answer scripts
ar: نصوص الإجابة الشخصية
be: Персаналізаваныя сцэнарыі адказаў
da: Personlige svarskripter
de: Personalisierte Antwortskripte
es: Guiones de respuesta personalizados
fr: Scripts de réponse personnalisés
id: Skrip jawaban yang dipersonalisasi
it: Script personalizzati delle risposte
ja: パーソナライズされた回答スクリプト
ms: Skrip jawapan peribadi
no: Personlige svarskript
pl: Spersonalizowane skrypty odpowiedzi
pt: Scripts de respostas personalizadas
ru: Персонализированные сценарии ответов
sv: Personliga svarsskript
th: สคริปต์คำตอบเฉพาะบุคคล
tr: Kişiselleştirilmiş cevap metinleri
uk: Персоналізовані скрипти відповідей
vi: Kịch bản câu trả lời cá nhân hóa

source: Personalized improvement suggestions
ar: اقتراحات تحسين مخصصة
be: Персаналізаваныя прапановы па паляпшэнні
da: Personlige forbedringsforslag
de: Personalisierte Verbesserungsvorschläge
es: Sugerencias personalizadas de mejora
fr: Suggestions d'amélioration personnalisées
id: Saran peningkatan yang dipersonalisasi
it: Suggerimenti personalizzati per il miglioramento
ja: 個別の改善提案
ms: Cadangan peningkatan yang diperibadikan
no: Personlige forslag til forbedring
pl: Spersonalizowane sugestie dotyczące poprawy
pt: Sugestões personalizadas de melhoria
ru: Персонализированные предложения по улучшению
sv: Personliga förbättringsförslag
th: คำแนะนำในการปรับปรุงเฉพาะบุคคล
tr: Kişiselleştirilmiş gelişim önerileri
uk: Персоналізовані пропозиції для покращення
vi: Các gợi ý cải thiện cá nhân hóa

source: Personalized Interview Readiness Score
ar: درجة الاستعداد الشخصية للمقابلات
be: Персаналізаваны бал гатоўнасці да інтэрв'ю
da: Personlig Interview Parathedsscore
de: Personalisierte Interview-Bereitschaftsnote
es: Puntuación Personalizada de Preparación para Entrevistas
fr: Score de Préparation Personnalisée à l'Entretien
id: Skor Kesiapan Wawancara yang Dipersonalisasi
it: Punteggio di Prontezza all'Intervista Personalizzato
ja: パーソナライズされたインタビュー準備スコア
ms: Skor Kesiapsiagaan Temuduga Peribadi
no: Personlig Intervjuberedskap Poengsum
pl: Spersonalizowany Wynik Gotowości do Rozmowy Kwalifikacyjnej
pt: Pontuação Personalizada de Prontidão para Entrevista
ru: Персонализированный Балл Готовности к Интервью
sv: Personligt Beredskapspoäng för Intervju
th: คะแนนความพร้อมในการสัมภาษณ์ส่วนบุคคล
tr: Kişiselleştirilmiş Mülakat Hazırlık Skoru
uk: Персоналізований бал готовності до співбесіди
vi: Điểm Sẵn Sàng Phỏng Vấn Cá Nhân Hóa

source: Personalized plan tailored to your goals
ar: خطة مخصصة تتناسب مع أهدافك
be: Перапрацаваны план, адаптаваны да вашых мэтаў
da: Personlig plan skræddersyet til dine mål
de: Personalisierten Plan, der auf Ihre Ziele zugeschnitten ist
es: Plan personalizado adaptado a tus objetivos
fr: Plan personnalisé adapté à vos objectifs
id: Rencana personal yang disesuaikan dengan tujuan Anda
it: Piano personalizzato su misura per i tuoi obiettivi
ja: あなたの目標に合わせたパーソナライズされたプラン
ms: Pelan peribadi disesuaikan dengan matlamat anda
no: Personlig plan skreddersydd til dine mål
pl: Spersonalizowany plan dostosowany do Twoich celów
pt: Plano personalizado adaptado aos seus objetivos
ru: Персонализированный план, адаптированный под ваши цели
sv: Personlig plan anpassad efter dina mål
th: แผนที่ปรับแต่งเฉพาะตัวเพื่อให้สอดคล้องกับเป้าหมายของคุณ
tr: Hedeflerinize göre özelleştirilmiş kişisel plan
uk: Персоналізований план, адаптований до ваших цілей
vi: Kế hoạch cá nhân hoá phù hợp với mục tiêu của bạn

source: Personalized scripts
ar: plaintext نصوص شخصية
be: Персаналізаваныя скрыпты
da: Personlige manuskripter
de: Personalisierte Skripte
es: Guiones personalizados
fr: Scripts personnalisés
id: Naskah yang dipersonalisasi
it: Script personalizzati
ja: パーソナライズされたスクリプト
ms: Skrip diperibadikan
no: Personlige skript
pl: Spersonalizowane skrypty
pt: Scripts personalizadas
ru: Персонализированные сценарии
sv: Personliga manuskript
th: สคริปต์ที่กำหนดเอง
tr: Kişiselleştirilmiş senaryolar
uk: Персоналізовані сценарії
vi: Kịch bản cá nhân hóa

source: Phrases for an interview in English
ar: عبارات لمقابلة باللغة الإنجليزية
be: Фразы для сустрэчы на англійскай мове
da: Sætninger til et interview på engelsk
de: Phrasen für ein Interview auf Englisch
es: Frases para una entrevista en inglés
fr: Expressions pour un entretien en anglais
id: Frasa untuk wawancara dalam bahasa Inggris
it: Frasi per un colloquio in inglese
ja: 英語の面接用フレーズ
ms: Frasa untuk temuduga dalam Bahasa Inggeris
no: Uttrykk for et intervju på engelsk
pl: Zwroty na rozmowę kwalifikacyjną po angielsku
pt: Frases para uma entrevista em Inglês
ru: Фразы для собеседования на английском
sv: Fraser för en intervju på engelska
th: วลีสำหรับสัมภาษณ์งานเป็นภาษาอังกฤษ
tr: İngilizce mülakatta kullanılacak ifadeler
uk: Фрази для інтерв'ю англійською мовою
vi: Cụm từ cho một buổi phỏng vấn bằng tiếng Anh

source: Pick 2–3 key qualities relevant to the job. Avoid clichés and provide examples. For instance:
ar: اختر 2-3 صفات رئيسية ذات صلة بالوظيفة. تجنب الكليشيهات وقدم أمثلة. على سبيل المثال:
be: Выберыце 2-3 ключавыя якасці, якія рэлевантныя для работы. Унікаеце клішэ і падайце прыклады. Напрыклад:
da: Vælg 2-3 nøglekvaliteter relevante for jobbet. Undgå klichéer og give eksempler. For eksempel:
de: Wählen Sie 2-3 Schlüsselqualitäten, die für den Job relevant sind. Vermeiden Sie Klischees und geben Sie Beispiele. Zum Beispiel:
es: Elija de 2 a 3 cualidades clave relevantes para el trabajo. Evite los clichés y proporcione ejemplos. Por ejemplo:
fr: Choisissez 2-3 qualités clés pertinentes pour le poste. Évitez les clichés et donnez des exemples. Par exemple :
id: Pilih 2-3 kualitas kunci yang relevan untuk pekerjaan tersebut. Hindari klise dan berikan contoh. Misalnya:
it: Scegli 2-3 qualità chiave pertinenti al lavoro. Evita i cliché e fornisci esempi. Ad esempio:
ja: 仕事に関連する2〜3の主要な資質を選びます。陳腐な表現を避け、例を挙げてください。たとえば：
ms: Pilih 2-3 kualiti utama yang relevan dengan pekerjaan. Elakkan klise dan berikan contoh. Sebagai contoh:
no: Velg 2–3 nøkkelkvaliteter relevante for jobben. Unngå klisjeer og gi exempel. For eksempel:
pl: Wybierz 2-3 kluczowe cechy związane z pracą. Unikaj clichés i podaj przykłady. Na przykład:
pt: Escolha 2-3 qualidades chave relevantes para o trabalho. Evite clichês e forneça exemplos. Por exemplo:
ru: Выберите 2-3 ключевых качества, релевантных для работы. Избегайте клише и приводите примеры. Например:
sv: Välj 2–3 nyckelkvaliteter relevanta för jobbet. Undvik klichéer och ge exempel. Till exempel:
th: เลือก 2-3 คุณสมบัติหลักที่เกี่ยวข้องกับงาน หลีกเลี่ยงคำวิพากษ์ที่จะทำให้ดูโดดเด่นและให้ตัวอย่าง เช่น:
tr: İşle ilgili 2-3 anahtar nitelik seçin. Klişelerden kaçının ve örnekler sunun. Örneğin:
uk: Виберіть 2-3 ключових якості, що є актуальні для роботи. Уникайте кліше і надавайте приклади. Наприклад:
vi: Chọn 2-3 phẩm chất chính liên quan đến công việc. Tránh những câu cửa miệng và cung cấp ví dụ. Ví dụ như:

source: Pick a difficulty that matches your group.
id: Pilih tingkat kesulitan yang sesuai dengan kelompok Anda.
it: Seleziona un livello di difficoltà che corrisponde al tuo gruppo.
ja: グループに合った難易度を選んでください。
no: Velg en vanskelighetsgrad som passer for din gruppe.
ru: Выберите уровень сложности, который подходит вашей группе.
uk: Оберіть рівень складності, який відповідає вашій групі.

source: Pick a level to start playing!
ar: اختر مستوى لبدء اللعب!
be: Абярыце ўзровень, каб пачаць гуляць!
da: Vælg et niveau for at begynde at spille!
de: Wähle eine Stufe zum Starten des Spiels!
es: ¡Elige un nivel para empezar a jugar!
fr: Choisissez un niveau pour commencer à jouer !
id: Pilih level untuk mulai bermain!
it: Scegli un livello per iniziare a giocare!
ja: プレイ開始のレベルを選んでください！
ms: Pilih tahap untuk mula bermain!
no: Velg et nivå for å starte spillingen!
pl: Wybierz poziom, aby zacząć grać!
pt: Escolha um nível para começar a jogar!
ru: Выберите уровень, чтобы начать играть!
sv: Välj en nivå för att börja spela!
th: เลือกระดับเพื่อเริ่มเล่น!
tr: Oynamaya başlamak için bir seviye seçin!
uk: Виберіть рівень, щоб почати грати!
vi: Chọn một cấp độ để bắt đầu chơi!

source: Pick one or more categories to build your word list.
id: Pilih satu atau lebih kategori untuk membangun daftar kata Anda.
it: Scegli una o più categorie per creare la tua lista di parole.
ja: 一つ以上のカテゴリーを選んで、単語リストを作成しましょう。
no: Velg en eller flere kategorier for å bygge ordlisten din.
ru: Выберите одну или несколько категорий, чтобы создать свой список слов.
uk: Виберіть одну або кілька категорій, щоб скласти свій список слів.

source: Place in the top 5 in the game to gain full access
ar: ضع نفسك ضمن الخمسة الأوائل في اللعبة للحصول على وصول كامل
be: Займіце месца ў топ-5 у гульні, каб атрымаць поўны доступ
da: Placer dig i top 5 i spillet for at få fuld adgang
de: Platzieren Sie sich unter den Top 5 im Spiel, um vollen Zugang zu erhalten
es: Colócate entre los 5 primeros en el juego para obtener acceso completo
fr: Placez-vous dans le top 5 du jeu pour obtenir un accès complet
id: Tempatkan di posisi 5 teratas dalam permainan untuk mendapatkan akses penuh
it: Posizionati tra i primi 5 nel gioco per ottenere l'accesso completo
ja: ゲームでトップ5に入ってフルアクセスを獲得してください
no: Plasser i topp 5 i spillet for å få full tilgang
pl: Znajdź się w pierwszej piątce w grze, aby uzyskać pełny dostęp
pt: Coloque-se entre os 5 primeiros no jogo para obter acesso total
ru: Займите место в топ-5 в игре, чтобы получить полный доступ
sv: Placera dig bland de 5 bästa i spelet för att få full åtkomst
th: ติดอันดับใน 5 อันดับแรกในเกมเพื่อรับสิทธิ์เข้าถึงแบบเต็มรูปแบบ
tr: Oyunda ilk 5'e girerek tam erişim kazanın
uk: Займіть місце в топ-5 у грі, щоб отримати повний доступ
vi: Đạt vị trí trong top 5 trong trò chơi để có quyền truy cập đầy đủ

source: Plan for
ar: خطة لـ
be: План для
da: Planlæg for
de: Planen für
es: Planificar para
fr: Planifier pour
id: Rencana untuk
it: Piano per
ja: 計画する
no: Planlegg for
pl: Plan na
pt: Plano para
ru: План для
sv: Planera för
th: \[\text{วางแผนสำหรับ}\]
tr: İçin Planla
uk: План для
vi: Kế hoạch cho

source: Play
ar: العب
be: Гуляць
da: Afspil
de: Spielen
es: Jugar
fr: Jouer
id: Main
it: Gioca
ja: 再生
ms: Main
no: Spill
pl: Graj
pt: Jogar
ru: Играть
sv: Spela
th: เล่น
tr: Oyna
uk: Грати
vi: Chơi

source: Play Again
id: Mainkan Lagi
it: Gioca di nuovo
ja: もう一度プレイ
no: Spill Igjen
ru: Сыграть снова
uk: Грати ще раз

source: Play Alias offline with friends in person
id: Bermain Alias secara offline dengan teman secara langsung
it: Gioca a Alias offline con gli amici di persona
ja: 友達とオフラインでAliasをプレイ
no: Spill Alias offline med venner personlig
ru: Играйте в Алиас оффлайн с друзьями в жизни
uk: Грайте в Alias офлайн з друзями вживу

source: Play and Learn
ar: العب وتعلم
be: Гуляй і вучыся
da: Spil og Lær
de: Spielen und Lernen
es: Juega y Aprende
fr: Jouer et Apprendre
id: Bermain dan Belajar
it: Gioca e Impara
ja: プレイと学習
ms: Main dan Belajar
no: Spill og Lær
pl: Graj i Ucz się
pt: Jogue e Aprenda
ru: Играй и Учись
sv: Spela och Lär
th: เล่นและเรียนรู้
tr: Oyna ve Öğren
uk: Грай та Вчись
vi: Chơi và Học

source: Play the Game
ar: لعب اللعبة
be: Гуляць у гульню
da: Spil Spillet
de: Spielen Sie das Spiel
es: Juega el Juego
fr: Joue le Jeu
id: Mainkan Game
it: Gioca il Gioco
ja: ゲームをプレイする
ms: Main Permainan
no: Spill Spillet
pl: Zagraj w Grę
pt: Jogue o Jogo
ru: Играть в Игру
sv: Spela Spelet
th: เล่นเกม
tr: Oyunu Oyna
uk: Грай у Гру
vi: Chơi Trò Chơi

source: Play the role
ar: قم بدور
be: Грайце ролю
da: Spil rollen
de: Die Rolle spielen
es: Juega el papel
fr: Jouer le rôle
it: Gioca il ruolo
ja: 役割を演じる
ms: Mainkan peranan
no: Spill rollen
pl: Odegraj rolę
pt: Desempenhe o papel
ru: Играть роль
sv: Spela rollen
th: เล่นบทบาท
tr: Rol oyna
uk: Виконуй роль
vi: Chơi vai trò

source: Play With AI
id: Bermain Dengan AI
it: Gioca con l'AI
ja: AIで遊ぶ
no: Spill Med AI
ru: Играть с ИИ
uk: Грати з ШІ

source: Play With Friends
id: Bermain Dengan Teman
it: Gioca con gli amici
ja: 友達と遊ぶ
no: Spill med venner
ru: Играть с друзьями
uk: Грати з друзями

source: Player
id: Pemain
it: Giocatore
ja: プレイヤー
no: Spiller
ru: Игрок
uk: Гравець

source: Player turn
id: Giliran pemain
it: Turno del giocatore
ja: プレイヤーの番
no: Spillers tur
ru: Ход игрока
uk: Хід гравця

source: Player up next
id: Pemain selanjutnya
it: Giocatore successivo
ja: 次のプレーヤー
no: Spiller opp neste
ru: Следующий игрок
uk: Гравець далі

source: Player {index}
id: Pemain {indeks}
it: Giocatore {index}
ja: プレイヤー {index}
no: Spiller {index}
ru: Игрок {index}
uk: Гравець {index}

source: Players ({current}/{max})
id: Pemain ({current}/{max})
it: Giocatori ({current}/{max})
ja: プレイヤー ({current}/{max})
no: Spillere ({current}/{max})
ru: Игроки ({current}/{max})
uk: Гравці ({current}/{max})

source: Players compete in teams
id: Pemain bersaing dalam tim
it: I giocatori competono in squadre
ja: チームで競い合うプレイヤー
no: Spillere konkurrerer i lag
ru: Игроки соревнуются в командах
uk: Гравці змагаються в командах

source: Players Setup
id: Pemain Ditetapkan
it: Impostazione dei giocatori
ja: プレーヤー設定
no: Spilleroppsett
ru: Настройка игроков
uk: Налаштування гравців

source: Players:
de: Spieler:
es: Jugadores:
id: Pemain:
it: Giocatori:
ja: プレイヤー：
no: Spillere:
pl: Gracze:
pt: Jogadores:
ru: Игроки:
sv: Spelare:
tr: Oyuncular:
uk: Гравці:

source: Please confirm your credit card to access all features.
ar: يرجى تأكيد بطاقة الائتمان الخاصة بك للوصول إلى جميع الميزات.
be: Калі ласка, пацвердзіце вашу крэдытную картку, каб атрымаць доступ да ўсіх функцый.
da: Bekræft venligst dit kreditkort for at få adgang til alle funktioner.
de: Bitte bestätigen Sie Ihre Kreditkarte, um auf alle Funktionen zugreifen zu können.
es: Por favor confirme su tarjeta de crédito para acceder a todas las funciones.
fr: Veuillez confirmer votre carte de crédit pour accéder à toutes les fonctionnalités.
id: Silakan konfirmasi kartu kredit Anda untuk mengakses semua fitur.
it: Conferma la tua carta di credito per accedere a tutte le funzionalità.
ja: すべての機能にアクセスするために、クレジットカードを確認してください。
ms: Sila sahkan kad kredit anda untuk mengakses semua ciri.
no: Vennligst bekreft kredittkortet ditt for å få tilgang til alle funksjoner.
pl: Proszę potwierdzić swoją kartę kredytową, aby uzyskać dostęp do wszystkich funkcji.
pt: Por favor, confirme seu cartão de crédito para acessar todos os recursos.
ru: Пожалуйста, подтвердите свою кредитную карту, чтобы получить доступ ко всем функциям.
sv: Vänligen bekräfta ditt kreditkort för att få tillgång till alla funktioner.
th: กรุณายืนยันบัตรเครดิตของคุณเพื่อเข้าถึงคุณสมบัติทั้งหมด
tr: Lütfen tüm özelliklere erişmek için kredi kartınızı doğrulayın.
uk: Будь ласка, підтвердьте свою кредитну карту, щоб отримати доступ до всіх функцій.
vi: Vui lòng xác nhận thẻ tín dụng của bạn để truy cập tất cả các tính năng.

source: Please enter a name for every player.
id: Silakan masukkan nama untuk setiap pemain.
it: Per favore inserisci un nome per ogni giocatore.
ja: プレイヤーごとに名前を入力してください。
no: Vennligst skriv inn et navn for hver spiller.
ru: Пожалуйста, введите имя каждого игрока.
uk: Будь ласка, введіть ім'я для кожного гравця.

source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح
be: Калі ласка, увядзіце сапраўдны адрас электроннай пошты
da: Indtast venligst en gyldig e-mailadresse
de: Bitte geben Sie eine gültige E-Mail-Adresse ein
es: Por favor, introduce una dirección de correo electrónico válida
fr: Veuillez entrer une adresse e-mail valide
id: Silakan masukkan alamat email yang valid
it: Si prega di inserire un indirizzo email valido
ja: 有効なメールアドレスを入力してください
no: Vennligst skriv inn en gyldig e-postadresse
pl: Proszę wprowadzić prawidłowy adres e-mail
pt: Por favor, insira um endereço de e-mail válido
ru: Пожалуйста, введите действующий адрес электронной почты
sv: Vänligen ange en giltig e-postadress
th: กรุณาใส่ที่อยู่อีเมลที่ถูกต้อง
tr: Lütfen geçerli bir e-posta adresi giriniz
uk: Будь ласка, введіть дійсну електронну адресу
vi: Vui lòng nhập địa chỉ email hợp lệ

source: Please record a longer message (at least a few words).
ar: يرجى تسجيل رسالة أطول (بضع كلمات على الأقل).
be: Калі ласка, запішыце больш доўгае паведамленне (хаця б некалькі слоў).
da: Venligst optag en længere besked (mindst nogle få ord).
de: Bitte nehmen Sie eine längere Nachricht auf (mindestens ein paar Wörter).
es: Por favor, graba un mensaje más largo (al menos unas pocas palabras).
fr: Veuillez enregistrer un message plus long (au moins quelques mots).
id: Silakan rekam pesan yang lebih panjang (setidaknya beberapa kata).
it: Per favore, registra un messaggio più lungo (almeno alcune parole).
ja: 長めのメッセージ（少なくとも数単語）を記録してください。
no: Vennligst ta opp en lengre melding (minst noen få ord).
pl: Proszę nagrać dłuższą wiadomość (przynajmniej kilka słów).
pt: Por favor, grave uma mensagem mais longa (pelo menos algumas palavras).
ru: Пожалуйста, запишите более длинное сообщение (как минимум несколько слов).
sv: Vänligen spela in ett längre meddelande (åtminstone några ord).
th: โปรดบันทึกข้อความที่ยาวขึ้น (อย่างน้อยสองสามคำ)
tr: Lütfen daha uzun bir mesaj kaydedin (en az birkaç kelime).
uk: Будь ласка, запишіть довше повідомлення (щонайменше кілька слів).
vi: Vui lòng ghi lại một thông điệp dài hơn (ít nhất vài từ).

source: Please refresh the page and try one more time
ar: يرجى تحديث الصفحة ومحاولة مرة أخرى
be: Калі ласка, абнавіце старонку і паспрабуйце яшчэ раз
da: Opdater venligst siden og prøv en gang til
de: Bitte aktualisieren Sie die Seite und versuchen Sie es noch einmal
es: Por favor, refresca la página e intenta una vez más
fr: Veuillez rafraîchir la page et essayer une fois de plus
id: Silakan segarkan halaman dan coba sekali lagi
it: Si prega di aggiornare la pagina e provare un'altra volta
ja: ページを更新して、もう一度試してください
ms: Sila segarkan halaman dan cuba sekali lagi
no: Vennligst oppdater siden og prøv en gang til
pl: Proszę odświeżyć stronę i spróbować jeszcze raz
pt: Por favor, atualize a página e tente mais uma vez
ru: Пожалуйста, обновите страницу и попробуйте еще раз
sv: Vänligen uppdatera sidan och försök en gång till
th: กรุณารีเฟรชหน้าเว็บแล้วลองอีกครั้ง
tr: Lütfen sayfayı yenileyin ve bir kez daha deneyin
uk: Будь ласка, оновіть сторінку та спробуйте ще раз
vi: Vui lòng làm mới trang và thử một lần nữa

source: Please select a valid image file (JPEG, PNG, GIF, or WebP)
uk: Будь ласка, виберіть дійсний файл зображення (JPEG, PNG, GIF або WebP)

source: Please select at least one category.
id: Silakan pilih setidaknya satu kategori.
it: Per favore seleziona almeno una categoria.
ja: 少なくとも1つのカテゴリーを選択してください。
no: Vennligst velg minst én kategori.
ru: Пожалуйста, выберите хотя бы одну категорию.
uk: Будь ласка, виберіть принаймні одну категорію.

source: Please stop the recording before closing the window.
de: Bitte stoppen Sie die Aufnahme, bevor Sie das Fenster schließen.
es: Por favor detén la grabación antes de cerrar la ventana.
id: Harap hentikan perekaman sebelum menutup jendela.
it: Si prega di fermare la registrazione prima di chiudere la finestra.
ja: ウィンドウを閉じる前に録音を停止してください。
no: Vennligst stopp opptaket før du lukker vinduet.
pl: Proszę zatrzymać nagrywanie przed zamknięciem okna.
pt: Por favor, pare a gravação antes de fechar a janela.
ru: Пожалуйста, остановите запись перед закрытием окна.
sv: Vänligen stoppa inspelningen innan du stänger fönstret.
th: โปรดหยุดการบันทึกก่อนที่จะปิดหน้าต่าง
tr: Lütfen pencereyi kapatmadan önce kaydı durdurun.
uk: Будь ласка, зупиніть запис перед закриттям вікна.
vi: Vui lòng dừng ghi âm trước khi đóng cửa sổ.

source: Please tap the menu ••• and choose
ar: يرجى الضغط على القائمة ••• واختر
be: Калі ласка, націсніце на меню ••• і выберыце
da: Venligst tryk på menuen ••• og vælg
de: Bitte tippen Sie auf das Menü ••• und wählen Sie
es: Por favor, toca el menú ••• y elige
fr: Veuillez appuyer sur le menu ••• et choisir
id: Silakan tekan menu ••• dan pilih
it: Si prega di toccare il menu ••• e scegliere
ja: メニュー ••• をタップして選択してください
ms: Sila ketuk menu ••• dan pilih
no: Vennligst trykk på menyen ••• og velg
pl: Proszę kliknąć w menu ••• i wybrać
pt: Por favor, toque no menu ••• e escolha
ru: Пожалуйста, нажмите на меню ••• и выберите
sv: Vänligen tryck på menyn ••• och välj
th: กรุณาแตะที่เมนู ••• และเลือก
tr: Lütfen menüyü ••• seçin ve seçim yapın
uk: Будь ласка, натисніть на меню ••• та виберіть
vi: Vui lòng chạm vào menu ••• và chọn

source: Please tap the menu ⋮ and choose
ar: يرجى النقر على القائمة ⋮ واختيار
be: Калі ласка, націсніце на меню ⋮ і выберыце
da: Venligst tryk på menuen ⋮ og vælg
de: Bitte tippen Sie auf das Menü ⋮ und wählen Sie
es: Por favor, toca el menú ⋮ y elige
fr: Veuillez appuyer sur le menu ⋮ et choisir
id: Silakan ketuk menu ⋮ dan pilih
it: Si prega di toccare il menu ⋮ e scegliere
ja: メニュー⋮をタップして選択してください
ms: Sila ketuk menu ⋮ dan pilih
no: Vennligst trykk på menyen ⋮ og velg
pl: Proszę nacisnąć menu ⋮ i wybrać
pt: Por favor, toque no menu ⋮ e escolha
ru: Пожалуйста, нажмите на меню ⋮ и выберите
sv: Vänligen tryck på menyn ⋮ och välj
th: กรุณาแตะที่เมนู ⋮ และเลือก
tr: Lütfen menüyü ⋮ seçin ve tercihinizi belirleyin
uk: Будь ласка, натисніть на меню ⋮ та оберіть
vi: Vui lòng chạm vào menu ⋮ và chọn

source: Please wait while we process your payment.
ar: يرجى الانتظار بينما نقوم بمعالجة دفعتك.
be: Калі ласка, пачакайце, пакуль мы апрацоўваем ваш плацёж.
da: Vent venligst, mens vi behandler din betaling.
de: Bitte warten Sie, während wir Ihre Zahlung bearbeiten.
es: Espere mientras procesamos su pago.
fr: Veuillez patienter pendant que nous traitons votre paiement.
id: Silakan tunggu sementara kami memproses pembayaran Anda.
it: Attendere mentre elaboriamo il tuo pagamento.
ja: お支払いの処理中ですので、しばらくお待ちください。
ms: Sila tunggu sementara kami memproses pembayaran anda.
no: Vennligst vent mens vi behandler betalingen din.
pl: Proszę czekać, trwa przetwarzanie płatności.
pt: Por favor, aguarde enquanto processamos seu pagamento.
ru: Пожалуйста, подождите, пока мы обрабатываем ваш платёж.
sv: Vänligen vänta medan vi behandlar din betalning.
th: โปรดรอในขณะที่เราดำเนินการชำระเงินของคุณ
tr: Ödemenizi işlerken lütfen bekleyin.
uk: Зачекайте, поки ми обробляємо ваш платіж.
vi: Vui lòng chờ trong khi chúng tôi xử lý thanh toán của bạn.

source: Points
ar: النقاط
be: Ачкі
da: Point
de: Punkte
es: Puntos
id: Poin
it: Punti
ja: ポイント
no: Poeng
pl: Punkty
pt: Pontos
ru: Очки
sv: Poäng
th: คะแนน
tr: Puanlar
uk: Бали
vi: Điểm số
