Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: You don't have an active subscription.
ar: ليس لديك اشتراك نشط.
be: У вас няма актыўнай падпіскі.
da: Du har ikke et aktivt abonnement.
fr: Vous n'avez pas d'abonnement actif.
ms: Anda tidak mempunyai langganan yang aktif.

source: Your subscription is active until
ar: اشتراكك نشط حتى
be: Ваша падпіска актыўная да
da: Dit abonnement er aktivt indtil
fr: Votre abonnement est actif jusqu'à
ms: Langganan anda aktif sehingga

source: Manage your subscription settings
ar: إدارة إعدادات الاشتراك الخاصة بك
be: Кіраванне наладамі падпіскі
da: Administrer dine abonnementsindstillinger
fr: Gérer vos paramètres d'abonnement
ms: Urus tetapan langganan anda

source: Your plan for learning
ar: خطتك للتعلّم
be: Ваш план навучання
da: Din plan for læring
fr: Votre plan d'apprentissage
ms: Pelan pembelajaran anda

source: We are ready
ar: نحن مستعدون
be: Мы гатовы
da: Vi er klar
fr: Nous sommes prêts
ms: Kami bersedia

source: Let's talk. Tell me about yourself
ar: دعنا نتحدث. أخبرني عن نفسك
be: Давай пагаворым. Раскажы мне пра сябе
da: Lad os tale. Fortæl mig om dig selv
fr: Parlons-en. Parle-moi de toi.
ms: Mari bercakap. Ceritakan kepada saya tentang diri anda

source: Do you have any travel plans?
ar: هل لديك أي خطط للسفر؟
be: Ці ёсць у вас якія-небудзь планы падарожжаў?
da: Har du nogle rejseplaner?
fr: Avez-vous des projets de voyage ?
ms: Adakah anda mempunyai sebarang rancangan perjalanan?

source: Tell me about yourself
ar: أخبرني عن نفسك
be: Раскажы мне пра сябе
da: Fortæl mig om dig selv
fr: Dites-moi à propos de vous-même
ms: Beritahu saya tentang diri anda

source: Wow, that was awesome!
ar: واو، لقد كان ذلك رائعاً!
be: Вау, гэта было цудоўна!
da: Wow, det var fantastisk!
fr: Wow, c'était génial !
ms: Wow, itu hebat!

source: Let's continue, I have a question for you!
ar: لنواصل، لدي سؤال لك!
be: Давайце працягнем, у мяне ёсць пытанне для вас!
da: Lad os fortsætte, jeg har et spørgsmål til dig!
fr: Continuons, j'ai une question pour vous !
ms: Mari kita teruskan, saya ada soalan untuk anda!

source: Before the training plan...
ar: قبل خطة التدريب...
be: Перад планам трэніровак...
da: Før træningsplanen...
fr: \Avant le plan d'entraînement...
ms: Sebelum pelan latihan...

source: Let's talk about your goals a bit more
ar: دعونا نتحدث عن أهدافك قليلاً بشكل أعمق
be: Давайце пагаворым пра вашы мэты крыху больш
da: Lad os tale lidt mere om dine mål
fr: Parlons un peu plus de vos objectifs
ms: Mari berbincang tentang matlamat anda dengan lebih lanjut

source: Now, we ready to create your learning plan
ar: الآن، نحن مستعدون لإنشاء خطة التعلم الخاصة بك
be: Цяпер мы гатовы стварыць ваш план навучання
da: Nu er vi klar til at oprette din læringsplan
fr: Maintenant, nous sommes prêts à créer votre plan d'apprentissage
ms: Sekarang, kami bersedia untuk mencipta pelan pembelajaran anda

source: It might take up to a minute
ar: قد يستغرق الأمر دقيقة كاملة
be: Можа спатрэбіцца да хвіліны
da: Det kan tage op til et minut
fr: Cela pourrait prendre jusqu'à une minute
ms: Mungkin mengambil masa sehingga satu minit

source: Translate Guru
ar: ترجم جورو
be: Перакладчык Гуру
da: Oversæt Guru
fr: Traduire Guru

source: Sentence Builder
ar: بناء الجمل
be: Складальнік сentэнцый
da: Sætningsbygger
fr: Constructeur de phrases

source: Image Describer
ar: واصف الصورة
be: Апісвальнік выявы
da: Billedbeskriver
fr: Descripteur d'image

source: Topic Talker
ar: متحدث الموضوع
be: Тэма Гаварэньня
da: Emne Taler
fr: Sujet Parleur

source: Chat Enthusiast
ar: محب الدردشة
be: Чат Энтузіяст
da: Chat-entusiast
fr: Passionné de chat

source: Learn and Play
ar: تعلم والعب
be: Вучыцца і гуляць
da: Lær og Leg
ms: Belajar dan Bermain

source: Today
ar: اليوم
be: Сёння
da: I dag
fr: Aujourd'hui
ms: Hari ini

source: Today’s Question
ar: سؤال اليوم
be: Сённяшняе Пытанне
da: Dagens spørgsmål
fr: Question du jour
ms: Soalan Hari Ini

source: Analysis
ar: التحليل
be: Аналіз
da: Analyse
fr: Analyse
ms: Analisis

source: Suggestion
ar: اقتراح
be: Прапановa
da: Forslag
ms: Cadangan

source: Suggestion is loading...
ar: اقتراح قيد التحميل...
be: Прапанова загружаецца...
da: Forslag indlæses...
fr: La suggestion se charge...
ms: Saran sedang dimuat...

source: Record your answer to see AI suggestion
ar: سجل إجابتك لترى اقتراح الذكاء الاصطناعي
be: Запішыце свой адказ, каб убачыць рэкамендацыю ад штучнага інтэлекту
da: Optag dit svar for at se AI-forslag
fr: Enregistrez votre réponse pour voir la suggestion de l'IA
ms: Rakaman jawapan anda untuk melihat cadangan AI

source: Publish
ar: plaintext نشر
be: Апублікаваць
da: Udgiv
fr: Publier
ms: Terbitkan

source: Re-Record
ar: إعادة التسجيل
be: Перазапісаць
da: Genoptag
fr: Réenregistrer
ms: Rakam Semula

source: To see others answers, you need to publish yours.
ar: لكي ترى إجابات الآخرين، تحتاج إلى نشر إجابتك.
be: Каб убачыць адказы іншых, вам трэба апублікаваць свой.
da: For at se andres svar, skal du offentliggøre dit eget.
fr: Pour voir les réponses des autres, vous devez publier la vôtre.
ms: Untuk melihat jawapan orang lain, anda perlu menerbitkan jawapan anda.

source: Previous questions
ar: الأسئلة السابقة
be: Папярэднія пытанні
da: Tidligere spørgsmål
fr: Questions précédentes
ms: Soalan terdahulu

source: See Answers
ar: شاهد الإجابات
be: Паглядзець адказы
da: Se svar
fr: Voir les réponses
ms: Lihat Jawapan

source: Answer Now
ar: أجب الآن
be: Адказаць Зараз
da: Svar Nu
fr: Répondre maintenant
ms: Jawab Sekarang

source: Not that time
ar: ليس هذا الوقت
be: Не ў гэты раз
da: Ikke den tid
fr: Pas ce moment-là

source: We will help you to learn the language you need
ar: سوف نساعدك على تعلم اللغة التي تحتاجها
be: Мы дапаможам вам вывучыць мову, якая вам патрэбная
da: Vi vil hjælpe dig med at lære det sprog, du har brug for
fr: Nous vous aiderons à apprendre la langue dont vous avez besoin
ms: Kami akan membantu anda untuk mempelajari bahasa yang anda perlukan

source: Real-time microphone
ar: ميكروفون في الوقت الفعلي
be: Мікрафон у рэжыме рэальнага часу
da: Mikrofon i realtid

source: Record a message and get {points} points
ar: سجل رسالة واحصل على {points} نقاط
be: Запішыце паведамленне і атрымаеце {points} ачкоў
da: Optag en besked og få {points} point
fr: Enregistrez un message et gagnez {points} points

source: Edit message
ar: تعديل الرسالة
be: Рэдагаваць паведамленне
da: Rediger besked
fr: Modifier le message

source: Delete message
ar: plaintext حذف الرسالة
be: Выдаліць паведамленне
da: Slet besked
fr: Supprimer le message

source: Replies:
ar: الردود:
be: Адказы:
fr: Réponses :

source: No replies yet. Be the first to reply to this message.
ar: لا توجد ردود حتى الآن. كن أول من يرد على هذه الرسالة.
be: Адказаў пакуль няма. Станьце першым, хто адкажа на гэтае паведамленне.
fr: Pas encore de réponses. Soyez le premier à répondre à ce message.

source: Vue & Pinia
ar: Vue و Pinia

source: NoSQL
ar: قاعدة بيانات غير علائقية (NoSQL)

source: Credit card is required for verification only
ar: بطاقة الائتمان مطلوبة للتحقق فقط
be: Крэдытная карта патрабуецца толькі для праверкі
da: Kreditkort kræves kun til verificering
fr: La carte de crédit est requise uniquement pour la vérification
ms: Kad kredit diperlukan untuk pengesahan sahaja

source: Credit card is required
ar: مطلوب بطاقة ائتمان
be: Патрабуецца крэдытная картка
da: Kreditkort er påkrævet
fr: Une carte de crédit est requise
ms: Kad kredit diperlukan

source: Record 2-3 minutes story using <0>{learningLanguageName}</0>
ar: سجل قصة مدتها 2-3 دقائق باستخدام <0>{learningLanguageName}</0>
be: Запішыце 2-3 хвіліны гісторыі, выкарыстоўваючы <0>{learningLanguageName}</0>
da: Optag en historie på 2-3 minutter ved hjælp af <0>{learningLanguageName}</0>
fr: Enregistrez une histoire de 2-3 minutes en utilisant <0>{learningLanguageName}</0>
ms: Rekod cerita 2-3 minit menggunakan <0>{learningLanguageName}</0>

source: Record 2-3 minutes story using <0>{learningLanguageName}</0> or <1>{nativeLanguageName}</1>
ar: سجل قصة مدتها 2-3 دقائق باستخدام <0>{learningLanguageName}</0> أو <1>{nativeLanguageName}</1>
be: Запішыце гісторыю на 2-3 хвіліны, выкарыстоўваючы <0>{learningLanguageName}</0> або <1>{nativeLanguageName}</1>
da: Optag en 2-3 minutters historie ved hjælp af <0>{learningLanguageName}</0> eller <1>{nativeLanguageName}</1>
fr: Enregistrez une histoire de 2-3 minutes en utilisant <0>{learningLanguageName}</0> ou <1>{nativeLanguageName}</1>
ms: Rakamkan cerita 2-3 minit menggunakan <0>{learningLanguageName}</0> atau <1>{nativeLanguageName}</1>

source: Full access is free if you reach the top 5 on the game leaderboard!
fr: L'accès complet est gratuit si vous atteignez le top 5 du classement du jeu !

source: Hint:
fr: Indice:

source: New Words to Vocabulary:
da: Nye ord til ordforråd:
ms: Perkataan Baru ke dalam Kamus:

source: Transcription:
da: Transskription:

source: 1 days of full access
ms: 1 hari akses penuh

source: 1 month, 60$
ms: 1 bulan, 60$

source: 1 week, 30$
ms: 1 minggu, 30$

source: 1-Week Sprint
ms: 1-Minggu Pecutan

source: 10 minutes per day
ms: 10 minit sehari

source: 15 minutes per day
ms: 15 minit sehari

source: 1–2 weeks
ms: 1–2 minggu

source: 20 minutes per day
ms: 20 minit sehari

source: 3 days free trial
ms: 3 hari percubaan percuma

source: 3 minutes per day
ms: 3 minit sehari

source: 4 days free trial
ms: 4 hari percubaan percuma

source: 4 month, 90$
ms: 4 bulan, 90$

source: 4 months full access
ms: 4 bulan akses penuh

source: 4-Month Plan
ms: Pelan 4-Bulan

source: 7 days full access
ms: 7 hari akses penuh

source: About your goal
ms: Mengenai matlamat anda

source: Absolutely! FluencyPal supports various languages and adjusts conversations based on your chosen language and proficiency level.
ms: Sudah tentu! FluencyPal menyokong pelbagai bahasa dan menyesuaikan perbualan berdasarkan bahasa dan tahap kemahiran yang anda pilih.

source: Absolutely! FluencyPal supports various languages and adjusts conversations based on your chosen language and proficiency level. Available languages include:
ms: Sudah tentu! FluencyPal menyokong pelbagai bahasa dan menyesuaikan perbualan berdasarkan bahasa dan tahap kefasihan yang anda pilih. Bahasa yang tersedia termasuk:

source: Advanced system design drills
ms: Latihan reka bentuk sistem lanjutan

source: AI English Speaking Practice
ms: AI Latihan Berbicara Bahasa Inggeris

source: AI feedback on structure and depth
ms: Maklum balas AI tentang struktur dan kedalaman

source: AI will lead you through the conversation
ms: AI akan membimbing anda melalui perbualan

source: Almost ready...
ms: Hampir sedia...

source: Answer <0>{0} questions</0> to get a new position
ms: Jawab <0>{0} soalan</0> untuk mendapatkan kedudukan baru

source: Answer confidently but worry it’s not senior enough
ms: Jawab dengan yakin tetapi bimbang ia tidak cukup berpengalaman

source: API & DB scenarios
ms: Senario API & Pangkalan Data

source: Arabic
ms: Arab

source: Architecture & performance focus
ms: Fokus seni bina & prestasi

source: Are you ready for a senior frontend interview?
ms: Adakah anda bersedia untuk temu duga frontend senior?

source: Based on your answers and senior-level interview patterns.
ms: Berdasarkan jawapan anda dan corak temu duga peringkat senior.

source: Be the first to answer and share your thoughts
ms: Jadilah yang pertama untuk menjawab dan kongsi pendapat anda

source: Before the free trial
ms: Sebelum percubaan percuma

source: Beginner
ms: Pemula

source: Beginner Mode:
ms: Mod Permulaan:

source: Behavioral / leadership questions
ms: Soalan tingkah laku / kepimpinan

source: Behavioral coaching
ms: Latihan perubahan tingkah laku

source: Belarusian
ms: Belarusia

source: Best for most engineers
ms: Terbaik untuk kebanyakan jurutera

source: Boost your fluency with FluencyPal, the friendly AI English tutor that's ready to chat 24/7. Designed for intermediate and advanced learners, FluencyPal adapts to your speaking level, provides instant corrections, and helps you speak confidently.
ms: Boost kecekapan anda dengan FluencyPal, tutor bahasa Inggeris AI mesra yang sedia berbual 24/7. Direka untuk pelajar pertengahan dan lanjutan, FluencyPal menyesuaikan dengan tahap perbualan anda, memberikan pembetulan segera, dan membantu anda bercakap dengan yakin.

source: Build strong, repeatable answers across APIs, databases, concurrency, and system design.
ms: Bina jawapan yang kuat dan boleh diulang dalam API, pangkalan data, kebersamaan, dan reka bentuk sistem.

source: By submitting this form, you agree to our:
ms: Dengan menghantar borang ini, anda bersetuju dengan:

source: Can I buy credits in bulk?
ms: Bolehkah saya membeli kredit dalam jumlah besar?

source: Can I cancel anytime?
ms: Bolehkah saya batalkan pada bila-bila masa?

source: Casual Conversation:
ms: Perbualan Santai:

source: Chinese
ms: Cina

source: Choose the closest option.
ms: Pilih pilihan yang paling hampir.

source: Choose your backend prep plan
ms: Pilih pelan persediaan backend anda

source: Confident Communication
ms: Komunikasi yang Yakin

source: Continue practicing with more questions, track your progress, and refine your answers to ace your next interview.
ms: Teruskan berlatih dengan lebih banyak soalan, jejak kemajuan anda, dan perhalusi jawapan anda untuk cemerlang dalam temu duga anda yang seterusnya.

source: Copy link
ms: Salin pautan

source: CV and LinkedIn review
ms: Kajian CV dan LinkedIn

source: Daily AI mock interviews
ms: Temuduga tiruan AI harian

source: Daily backend mock interviews
ms: Temu duga tiruan harian latar belakang

source: Daily conversational tasks introduce new vocabulary and language structures, reinforcing your skills and accelerating fluency improvements.
ms: Tugas perbualan harian memperkenalkan kosa kata baru dan struktur bahasa, mengukuhkan kemahiran anda dan mempercepatkan peningkatan kefasihan.

source: Danish
ms: Denmark

source: Deep skill development
ms: Pembangunan kemahiran mendalam

source: Deeper architecture feedback
ms: Maklum balas arkitektur yang lebih mendalam

source: Describe what you want to achieve, and AI will build a custom plan.
ms: Huraikan apa yang anda ingin capai, dan AI akan membina rancangan khas untuk anda.

source: Do you offer refunds?
ms: Adakah anda menawarkan bayaran balik?

source: Don't Rush Your Answers
ms: Jangan Terburu-buru Dengan Jawapan Anda

source: Don’t let mistakes stop you. Build fluency and confidence with daily speaking practice, anytime you need it.
ms: Jangan biarkan kesilapan menghentikan anda. Bangunkan kelancaran dan keyakinan dengan latihan bercakap harian, bila-bila masa anda memerlukannya.

source: Each day, we remove 3 points from everyone so that everyone has a fair chance to win.
ms: Setiap hari, kami tolak 3 mata dari setiap orang supaya setiap orang mempunyai peluang yang adil untuk menang.

source: Easy
ms: Mudah

source: English
ms: Inggeris

source: Everything you need for APIs, data, resiliency, and system design
ms: Segala yang anda perlukan untuk API, data, ketahanan, dan reka bentuk sistem

source: Expand vocabulary
ms: Kembangkan perbendaharaan kata

source: Expanded Vocabulary
ms: Perkataan yang Diperluas

source: Explain concepts but struggle to structure the answer
ms: Terangkan konsep tetapi sukar untuk menyusun jawapan

source: Explaining architecture decisions clearly
ms: Menjelaskan keputusan seni bina dengan jelas

source: Failed to copy text. Please try again.
ms: Gagal menyalin teks. Sila cuba lagi.

source: Feel structured and confident most of the time
ms: Rasa teratur dan yakin sebahagian besar masa

source: Finally
ms: Akhirnya

source: Finish conversation
ms: Selesai perbualan

source: Finishing...
ms: Menyelesaikan...

source: FluencyPal is an AI-powered English conversation practice app designed for intermediate and advanced learners. It provides realistic conversational practice in multiple languages, with immediate feedback on speaking and pronunciation.
ms: FluencyPal ialah aplikasi amalan perbualan bahasa Inggeris yang dipacu oleh AI, direka untuk pelajar perantaraan dan lanjutan. Ia menyediakan amalan perbualan yang realistik dalam pelbagai bahasa, dengan maklum balas segera tentang percakapan dan sebutan.

source: FluencyPal provides three modes: Casual Conversation for uninterrupted speaking practice, Talk & Correct for instant grammar and pronunciation feedback, and Beginner Mode for slower, guided conversations.
ms: FluencyPal menyediakan tiga mod: Perbualan Santai untuk latihan bertutur tanpa gangguan, Bercakap & Membetulkan untuk maklum balas tatabahasa dan sebutan secara segera, dan Mod Pemula untuk perbualan yang lebih perlahan dan berpandu.

source: FluencyPal won’t charge you during the trial.
ms: FluencyPal tidak akan mengenakan caj kepada anda semasa percubaan.

source: For longer searches & senior roles
ms: Untuk carian yang lebih panjang & peranan senior

source: For people preparing for multiple roles, relocating, switching careers, or targeting senior jobs.
ms: Bagi individu yang bersiap untuk pelbagai peranan, berpindah, menukar kerjaya, atau mensasarkan pekerjaan peringkat senior.

source: Form a sentence
ms: Bentuk satu ayat

source: French
ms: Perancis

source: Frequently used words and useful phrases
ms: Kata-kata yang kerap digunakan dan frasa yang berguna

source: From founder
ms: Dari pengasas

source: Full access to backend simulations
ms: Akses penuh ke simulasi backend

source: Full-stack with strong frontend focus
ms: Tumpuan kepada frontend yang kuat dengan keupayaan penuh-stack

source: Game username:
ms: Nama pengguna permainan:

source: German
ms: Jerman

source: Get a rule
ms: Dapatkan peraturan

source: Get detailed feedback, scripts, and practice scenarios.
ms: Dapatkan maklum balas terperinci, skrip, dan senario latihan.

source: Get fast, intensive preparation. Fix your biggest weaknesses in just 7 days.
ms: Dapatkan persediaan pantas dan intensif. Atasi kelemahan terbesar anda dalam masa 7 hari sahaja.

source: Good
ms: Baik

source: Got it
ms: Faham

source: Guide me
ms: Pandu saya

source: Homework
ms: Tugasan Rumah

source: How FluencyPal helps you pass senior interviews
ms: Bagaimana FluencyPal membantu anda lulus temu duga senior

source: How to Ace Your English Job Interview: A Step-by-Step Guide for Intermediate Learners (2025)
ms: Bagaimana Untuk Lulus Dengan Cemerlang Dalam Temuduga Kerja Bahasa Inggeris: Panduan Langkah-Demi-Langkah Untuk Pelajar Tahap Sederhana (2025)

source: How well do you know
ms: Sejauh mana anda mengenali

source: I can discuss most topics in detail
ms: Saya boleh membincangkan kebanyakan topik dengan terperinci

source: I can discuss various topics
ms: Saya boleh membincangkan pelbagai topik

source: I can maintain a simple conversation
ms: Saya boleh mengekalkan perbualan ringkas

source: I know a few simple words
ms: Saya tahu beberapa perkataan mudah

source: I want to learn English to travel. And I want to understand movies and songs.
ms: Saya ingin belajar Bahasa Inggeris untuk melancong. Dan saya ingin memahami filem dan lagu.

source: I'm a beginner
ms: Saya seorang pemula

source: In a hurry? Perfect for last-minute interviews
ms: Dalam tergesa-gesa? Sempurna untuk temu duga saat akhir

source: Indonesian
ms: Indonesia

source: Instant feedback on answers
ms: Maklum balas segera terhadap jawapan

source: Instant feedback on API and data answers
ms: Maklum balas segera mengenai jawapan API dan data

source: Intensive
ms: Intensif

source: Italian
ms: Itali

source: Japanese
ms: Jepun

source: Jump straight into implementation details
ms: Teruskan kepada butiran pelaksanaan

source: Korean
ms: Korea

source: Last-minute backend prep
ms: Persiapan belakang pentas saat akhir

source: Let's decide at what pace we will study!
ms: Mari kita tentukan pada kadar apa kita akan belajar!

source: Let's do it
ms: Jom lakukan itu

source: Let's go
ms: Mari kita pergi

source: Let's rock it!
ms: Jom rock it!

source: Long-term backend interview strategy
ms: Strategi temuduga backend jangka panjang

source: Long-term interview strategy
ms: Strategi temuduga jangka panjang

source: Malay
ms: Melayu

source: Mid-level Frontend Developer
ms: Pembangun Frontend Pertengahan

source: More info means better results.
ms: Maklumat lebih bermaksud hasil yang lebih baik.

source: More uniq lessons
ms: Pelajaran yang lebih unik

source: Most experienced developers fail interviews not because of skills, but because of how they explain decisions.
ms: Kebanyakan pembangun berpengalaman gagal dalam temuduga bukan kerana kemahiran, tetapi kerana cara mereka menerangkan keputusan.

source: Multiple frameworks
ms: Pelbagai rangka kerja

source: My native language
ms: Bahasa ibunda saya

source: My Position: <0>{0}</0>
ms: Posisi Saya: <0>{0}</0>

source: Negotiation and stakeholder stories
ms: Negosiasi dan cerita pemegang kepentingan

source: New words:
ms: Kata-kata baru:

source: Next position ({nextUserUsername}): <0>{pointsToNextPosition}</0>
ms: Posisi seterusnya ({nextUserUsername}): <0>{pointsToNextPosition}</0>

source: Nice!
ms: Bagus!

source: No charge during trial
ms: Tiada caj semasa percubaan

source: No homework assigned yet.
ms: Tiada kerja rumah yang diberikan lagi.

source: No one gets a job just because they answer quickly. Take your time to think through your responses carefully.
ms: Tiada siapa mendapat pekerjaan hanya kerana mereka menjawab dengan cepat. Luangkan masa anda untuk berfikir dengan teliti mengenai jawapan anda.

source: No payment after trial. Cancel anytime.
ms: Tiada pembayaran selepas percubaan. Batal pada bila-bila masa.

source: No payment required after trial. You decide when to pay.
ms: Tiada pembayaran diperlukan selepas percubaan. Anda membuat keputusan bila untuk membayar.

source: No theory. No tutors. Just real interview practice.
ms: Tiada teori. Tiada tutor. Hanya latihan temuduga sebenar.

source: Not scheduled yet
ms: Belum dijadualkan lagi

source: Now let’s determine your starting point!
ms: Sekarang mari kita tentukan titik mula anda!

source: Okay
ms: Okey

source: One person answered already — see what they said & share yours
ms: Satu orang sudah menjawab — lihat apa yang mereka katakan & kongsi jawapan anda

source: Only $2/day
ms: Hanya $2/hari

source: Open the plan
ms: Buka pelan

source: Other / Vanilla JS
ms: Lain-lain / Vanilla JS

source: Pause too long trying to find the perfect answer
ms: Berhenti terlalu lama cuba mencari jawapan yang sempurna

source: Payment history
ms: Sejarah pembayaran

source: Performance & optimization questions
ms: Prestasi & soalan pengoptimuman

source: Personalized feedback in minutes
ms: Maklum balas peribadi dalam beberapa minit

source: Personalized improvement plan
ms: Pelan penambahbaikan peribadi

source: Personalized scripts for HR and behavioral questions
ms: Skrip diperibadikan untuk soalan HR dan tingkah laku

source: Phone call mode
ms: Mod panggilan telefon

source: Pick the closest match.
ms: Pilih padanan yang paling dekat.

source: Portuguese
ms: Portugis

source: Practice real Senior Frontend Developer interview questions and get a personalized action plan to address your gaps before the next interview.
ms: Berlatih soalan temuduga sebenar Pembangun Hadapan Senior dan dapatkan pelan tindakan yang diperibadikan untuk menangani kekurangan anda sebelum temuduga seterusnya.

source: Practice speaking and listening without stress
ms: Amalkan berbicara dan mendengar tanpa tekanan

source: Practice speaking fluently without interruptions.
ms: Amalkan bercakap dengan lancar tanpa gangguan.

source: Prepare for multiple interviews, deeper system design, and advanced resiliency scenarios.
ms: Bersedia untuk pelbagai temu duga, reka bentuk sistem yang lebih mendalam, dan senario ketahanan lanjutan.

source: Priority feedback queue
ms: Barisan maklum balas keutamaan

source: Rating:
ms: Penilaian:
