Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Yes. FluencyPal generates a personalized practice plan based on your goals and proficiency level. Your daily sessions focus on relevant vocabulary, grammar, and real-life conversations. You can interact with the AI using voice or text.
ar: نعم. يُنشئ FluencyPal خطة ممارسة شخصية بناءً على أهدافك ومستوى إتقانك. تركز جلساتك اليومية على المفردات والقواعد والمحادثات الحقيقية ذات الصلة. يمكنك التفاعل مع الذكاء الاصطناعي باستخدام الصوت أو النص.
be: Так. FluencyPal стварае персаналізаваны план практыкі на аснове вашых мэтаў і ўзроўню валодання мовай. Вашы штодзённыя заняткі засяроджаны на адпаведным лексіконе, граматыцы і размовах у рэальным жыцці. Вы можаце ўзаемадзейнічаць з AI з дапамогай голасу або тэксту.
da: Ja. FluencyPal genererer en personlig træningsplan baseret på dine mål og færdighedsniveau. Dine daglige sessioner fokuserer på relevant ordforråd, grammatik og samtaler fra det virkelige liv. Du kan interagere med AI'en ved hjælp af stemme eller tekst.
de: Ja. FluencyPal erstellt basierend auf Ihren Zielen und Ihrem Kenntnisstand einen personalisierten Übungsplan. Ihre täglichen Sitzungen konzentrieren sich auf relevanten Wortschatz, Grammatik und reale Gespräche. Sie können mit der KI über Stimme oder Text interagieren.
es: Sí. FluencyPal genera un plan de práctica personalizado basado en tus objetivos y nivel de competencia. Tus sesiones diarias se centran en vocabulario relevante, gramática y conversaciones de la vida real. Puedes interactuar con la IA utilizando voz o texto.
fr: Oui. FluencyPal génère un plan de pratique personnalisé basé sur vos objectifs et votre niveau de compétence. Vos séances quotidiennes se concentrent sur le vocabulaire pertinent, la grammaire et les conversations réelles. Vous pouvez interagir avec l'IA en utilisant la voix ou le texte.
id: Ya. FluencyPal menghasilkan rencana latihan yang dipersonalisasi berdasarkan tujuan dan tingkat kemahiran Anda. Sesi harian Anda fokus pada kosakata yang relevan, tata bahasa, dan percakapan kehidupan nyata. Anda dapat berinteraksi dengan AI menggunakan suara atau teks.
it: Sì. FluencyPal genera un piano di pratica personalizzato basato sui tuoi obiettivi e livello di competenza. Le tue sessioni giornaliere si concentrano su vocabolario rilevante, grammatica e conversazioni reali. Puoi interagire con l'AI utilizzando la voce o il testo.
ja: はい。FluencyPalは、あなたの目標と熟練度に基づいて個別の練習プランを作成します。日々のセッションでは、関連する語彙、文法、実際の会話に焦点を当てます。音声またはテキストを使用してAIと対話できます。
no: Ja. FluencyPal genererer en personlig treningsplan basert på dine mål og ferdighetsnivå. Dine daglige økter fokuserer på relevant vokabular, grammatikk og samtaler fra virkeligheten. Du kan samhandle med AI-en ved hjelp av stemme eller tekst.
pl: Tak. FluencyPal generuje spersonalizowany plan praktyki w oparciu o Twoje cele i poziom biegłości. Twoje codzienne sesje koncentrują się na odpowiednim słownictwie, gramatyce i rozmowach w rzeczywistych sytuacjach. Możesz wchodzić w interakcje z AI za pomocą głosu lub tekstu.
pt: Sim. O FluencyPal gera um plano de prática personalizado com base nos seus objetivos e nível de proficiência. As suas sessões diárias focam em vocabulário relevante, gramática e conversas do dia a dia. Você pode interagir com a IA usando voz ou texto.
ru: Да. FluencyPal создает персонализированный план практики на основе ваших целей и уровня владения. Ваши ежедневные занятия сосредоточены на актуальном словарном запасе, грамматике и реальных разговорах. Вы можете взаимодействовать с ИИ с помощью голоса или текста.
sv: Ja. FluencyPal genererar en personlig träningsplan baserat på dina mål och din kompetensnivå. Dina dagliga sessioner fokuserar på relevant ordförråd, grammatik och verkliga samtal. Du kan interagera med AI:n med hjälp av röst eller text.
th: ใช่ FluencyPal สร้างแผนการฝึกฝนเฉพาะบุคคลตามเป้าหมายและระดับความชำนาญของคุณ การฝึกฝนรายวันของคุณจะเน้นที่คำศัพท์ ไวยากรณ์ และการสนทนาในชีวิตจริงที่เกี่ยวข้อง คุณสามารถโต้ตอบกับ AI โดยใช้เสียงหรือข้อความ
tr: Evet. FluencyPal, hedeflerinize ve yeterlilik seviyenize göre kişiselleştirilmiş bir çalışma planı oluşturur. Günlük oturumlarınız, ilgili kelime bilgisi, dilbilgisi ve gerçek yaşam konuşmalarına odaklanır. Yapay zeka ile sesli veya metin yoluyla etkileşimde bulunabilirsiniz.
uk: Так. FluencyPal генерує персоналізований план практики на основі ваших цілей та рівня володіння мовою. Ваші щоденні заняття зосереджені на актуальному словниковому запасі, граматиці та розмовах з реального життя. Ви можете взаємодіяти з AI за допомогою голосу або тексту.
vi: Vâng. FluencyPal tạo ra một kế hoạch luyện tập cá nhân hóa dựa trên mục tiêu và trình độ của bạn. Các buổi học hàng ngày của bạn tập trung vào từ vựng liên quan, ngữ pháp, và các cuộc hội thoại thực tế. Bạn có thể tương tác với AI bằng giọng nói hoặc văn bản.

source: Yes. FluencyPal offers free full access for users who rank in the top 5 of our speaking game. The game is free to play and includes reading text aloud, describing images, discussing topics, and answering questions. You can improve your speaking skills while playing.
ar: نعم. FluencyPal يقدم وصولاً كاملاً مجانياً للمستخدمين الذين يحتلون المركز الخمسة الأوائل في لعبة التحدث لدينا. اللعبه مجانية وتتضمن قراءة النصوص بصوت عالٍ، وصف الصور، مناقشة المواضيع، والإجابة على الأسئلة. يمكنك تحسين مهارات التحدث لديك أثناء اللعب.
be: Так. FluencyPal прапануе бясплатны поўны доступ для карыстальнікаў, якія займаюць топ-5 у нашай гульні на размову. Гульня бясплатная для гульні і ўключае чытанне тэксту ўслых, апісанне малюнкаў, абмеркаванне тэм і адказы на пытанні. Вы можаце палепшыць свае навыкі размовы падчас гульні.
da: Ja. FluencyPal tilbyder gratis fuld adgang til brugere, der rangerer i top 5 i vores talspil. Spillet er gratis at spille og inkluderer at læse tekst højt, beskrive billeder, diskutere emner og besvare spørgsmål. Du kan forbedre dine talefærdigheder, mens du spiller.
de: Ja. FluencyPal bietet kostenlosen vollen Zugang für Nutzer, die in den Top 5 unseres Sprachspiels ranken. Das Spiel ist kostenlos spielbar und beinhaltet das laute Vorlesen von Texten, das Beschreiben von Bildern, das Diskutieren von Themen und das Beantworten von Fragen. Sie können Ihre Sprechfähigkeiten verbessern, während Sie spielen.
es: Sí. FluencyPal ofrece acceso completo y gratuito para los usuarios que se encuentren entre los 5 primeros de nuestro juego de conversación. El juego es gratuito e incluye leer textos en voz alta, describir imágenes, discutir temas y responder preguntas. Puedes mejorar tus habilidades de conversación mientras juegas.
fr: Oui. FluencyPal offre un accès complet gratuit pour les utilisateurs qui se classent parmi les 5 premiers de notre jeu de parole. Le jeu est gratuit et inclut la lecture de textes à voix haute, la description d'images, la discussion de sujets et la réponse à des questions. Vous pouvez améliorer vos compétences orales en jouant.
id: Ya. FluencyPal menawarkan akses penuh gratis untuk pengguna yang berada di peringkat 5 teratas dalam permainan berbicara kami. Permainan ini gratis untuk dimainkan dan mencakup membaca teks dengan lantang, mendeskripsikan gambar, membahas topik, dan menjawab pertanyaan. Anda dapat meningkatkan keterampilan berbicara sambil bermain.
it: Sì. FluencyPal offre accesso completo gratuito agli utenti che si classificano tra i primi 5 del nostro gioco di conversazione. Il gioco è gratuito e include la lettura ad alta voce di testi, la descrizione di immagini, la discussione di argomenti e la risposta a domande. Puoi migliorare le tue abilità di conversazione mentre giochi.
ja: はい。FluencyPalでは、スピーキングゲームでトップ5にランクインしたユーザーに無料のフルアクセスを提供しています。このゲームは無料でプレイでき、テキストを声に出して読むこと、画像を説明すること、トピックについて議論すること、質問に答えることが含まれています。ゲームをプレイしながらスピーキングスキルを向上させることができます。
no: Ja. FluencyPal tilbyr gratis full tilgang for brukere som rangerer blant de 5 beste i vårt tale-spill. Spillet er gratis å spille og inkluderer å lese tekst høyt, beskrive bilder, diskutere emner og svare på spørsmål. Du kan forbedre dine taleferdigheter mens du spiller.
pl: Tak. FluencyPal oferuje pełny dostęp za darmo dla użytkowników, którzy zajmują miejsca w pierwszej 5 naszego językowego wyzwania. Gra jest darmowa i obejmuje głośne czytanie tekstu, opisywanie obrazów, omawianie tematów i odpowiadanie na pytania. Możesz poprawić swoje umiejętności mówienia podczas gry.
pt: Sim. O FluencyPal oferece acesso completo gratuito para os usuários que se classificam entre os 5 melhores do nosso jogo de fala. O jogo é gratuito e inclui ler texto em voz alta, descrever imagens, discutir tópicos e responder perguntas. Você pode melhorar suas habilidades de fala enquanto joga.
ru: Да. FluencyPal предоставляет бесплатный полный доступ пользователям, которые занимают топ-5 в нашем игровом соревновании по устной речи. Игра бесплатна и включает в себя чтение текста вслух, описание изображений, обсуждение тем и ответы на вопросы. Вы можете улучшить свои навыки устной речи, играя в эту игру.
sv: Ja. FluencyPal erbjuder gratis fullständig tillgång för användare som rankas bland de topp 5 i vårt talspel. Spelet är gratis att spela och inkluderar att läsa text högt, beskriva bilder, diskutera ämnen och besvara frågor. Du kan förbättra dina talfärdigheter medan du spelar.
th: ใช่ FluencyPal มอบการเข้าถึงเต็มรูปแบบฟรีสำหรับผู้ใช้ที่ติดอันดับใน 5 อันดับแรกของเกมการพูดของเรา เกมนี้สามารถเล่นได้ฟรีและรวมถึงการอ่านข้อความเสียงดัง, การอธิบายภาพ, การอภิปรายหัวข้อ, และการตอบคำถาม คุณสามารถพัฒนาทักษะการพูดของคุณในขณะที่เล่นได้
tr: Evet. FluencyPal, konuşma oyunumuzda ilk 5'e giren kullanıcılar için ücretsiz tam erişim sunar. Oyun ücretsizdir ve metinleri yüksek sesle okumayı, resimleri tanımlamayı, konuları tartışmayı ve soruları yanıtlamayı içerir. Oynarken konuşma becerilerinizi geliştirebilirsiniz.
uk: Так. FluencyPal надає безкоштовний повний доступ користувачам, які потрапляють до топ-5 у нашій грі на мовлення. Гра безкоштовна та включає в себе читання тексту вголос, описування зображень, обговорення тем і відповідь на питання. Ви можете покращити свої навички мовлення, граючи.
vi: Có. FluencyPal cung cấp quyền truy cập đầy đủ miễn phí cho người dùng xếp hạng trong top 5 của trò chơi nói của chúng tôi. Trò chơi miễn phí để chơi và bao gồm việc đọc to văn bản, mô tả hình ảnh, thảo luận về các chủ đề và trả lời câu hỏi. Bạn có thể cải thiện kỹ năng nói của mình khi chơi.

source: Yes. FluencyPal supports multiple languages and adapts conversations to your selected language and proficiency level. Available languages include:
ar: نعم. يدعم FluencyPal لغات متعددة ويكيف المحادثات مع اللغة ومستوى الكفاءة الذي تختاره. تتضمن اللغات المتاحة:
be: Так. FluencyPal падтрымлівае некалькі моў і адаптуе размовы ў адпаведнасці з абранай вамі мовай і ўзроўнем валодання. Даступныя мовы ўключаюць:
da: Ja. FluencyPal understøtter flere sprog og tilpasser samtaler til dit valgte sprog og færdighedsniveau. Tilgængelige sprog inkluderer:
de: Ja. FluencyPal unterstützt mehrere Sprachen und passt Gespräche an die von Ihnen gewählte Sprache und das Sprachniveau an. Verfügbare Sprachen sind:
es: Sí. FluencyPal admite múltiples idiomas y adapta las conversaciones a su idioma seleccionado y nivel de competencia. Los idiomas disponibles incluyen:
fr: Oui. FluencyPal prend en charge plusieurs langues et adapte les conversations à votre langue sélectionnée et à votre niveau de compétence. Les langues disponibles incluent :
id: Ya. FluencyPal mendukung berbagai bahasa dan menyesuaikan percakapan dengan bahasa yang Anda pilih dan tingkat kemahiran Anda. Bahasa yang tersedia meliputi:
it: Sì. FluencyPal supporta più lingue e adatta le conversazioni alla tua lingua selezionata e al tuo livello di competenza. Le lingue disponibili includono:
ja: はい。フルーエンシーパルは複数の言語をサポートしており、選択した言語や熟練度に応じた会話へと適応します。利用可能な言語には以下が含まれます：
no: Ja. FluencyPal støtter flere språk og tilpasser samtaler til ditt valgte språk og ferdighetsnivå. Tilgjengelige språk inkluderer:
pl: Tak. FluencyPal obsługuje wiele języków i dostosowuje rozmowy do wybranego języka i poziomu biegłości. Dostępne języki obejmują:
pt: Sim. O FluencyPal suporta múltiplos idiomas e adapta as conversas ao idioma selecionado e ao seu nível de proficiência. Os idiomas disponíveis incluem:
ru: Да. FluencyPal поддерживает несколько языков и адаптирует разговоры к вашему выбранному языку и уровню владения. Доступные языки включают:
sv: Ja. FluencyPal stöder flera språk och anpassar konversationer till ditt valda språk och kunskapsnivå. Tillgängliga språk inkluderar:
th: ใช่ FluencyPal รองรับหลายภาษาและปรับการสนทนาให้ตรงกับภาษาที่คุณเลือกและระดับความชำนาญของคุณ ภาษาที่มีให้เลือกได้แก่:
tr: Evet. FluencyPal birden fazla dili destekler ve konuşmaları seçtiğiniz dil ve yeterlilik seviyesine göre uyarlar. Mevcut diller şunları içerir:
uk: Так. FluencyPal підтримує кілька мов і адаптує розмови до обраної вами мови та рівня володіння. Доступні мови включають:
vi: Có. FluencyPal hỗ trợ nhiều ngôn ngữ và điều chỉnh hội thoại theo ngôn ngữ bạn chọn cũng như mức độ thông thạo của bạn. Các ngôn ngữ có sẵn bao gồm:

source: Yes. If you are not satisfied with our service, you can request a refund. Please contact our support team via the chat above, and we will guide you through the refund process.
id: Ya. Jika Anda tidak puas dengan layanan kami, Anda dapat meminta pengembalian dana. Silakan hubungi tim dukungan kami melalui obrolan di atas, dan kami akan memandu Anda melalui proses pengembalian dana.
it: Sì. Se non sei soddisfatto del nostro servizio, puoi richiedere un rimborso. Ti preghiamo di contattare il nostro team di supporto tramite la chat qui sopra, e ti guideremo attraverso il processo di rimborso.
ja: はい。サービスにご満足いただけない場合は、返金をリクエストできます。上記のチャットを通してサポートチームにご連絡ください。返金手続きをご案内いたします。
no: Ja. Hvis du ikke er fornøyd med tjenesten vår, kan du be om refusjon. Ta kontakt med vårt supportteam via chatten ovenfor, så vil vi veilede deg gjennom refusjonsprosessen.
pl: Tak. Jeśli nie jesteś zadowolony z naszej usługi, możesz zażądać zwrotu pieniędzy. Skontaktuj się z naszym zespołem wsparcia za pośrednictwem powyższego czatu, a my przeprowadzimy Cię przez proces zwrotu.
ru: Да. Если вы не удовлетворены нашим сервисом, вы можете запросить возврат средств. Пожалуйста, свяжитесь с нашей службой поддержки через чат выше, и мы проведем вас через процесс возврата средств.
sv: Ja. Om du inte är nöjd med vår tjänst kan du begära en återbetalning. Vänligen kontakta vårt supportteam via chatten ovan, så kommer vi att guida dig genom återbetalningsprocessen.
uk: Так. Якщо ви не задоволені нашим сервісом, ви можете запросити відшкодування. Будь ласка, зв'яжіться з нашою службою підтримки через чат вище, і ми проведемо вас через процес повернення коштів.

source: Yes. If you're not satisfied with the service, on "Profile/Payment history" page you can request a refund and we will discuss the details.
de: Ja. Wenn Sie mit dem Service nicht zufrieden sind, können Sie auf der Seite "Profil/Zahlungsverlauf" eine Rückerstattung anfordern, und wir werden die Einzelheiten besprechen.
es: Sí. Si no está satisfecho con el servicio, en la página de "Perfil/Historial de pagos" puede solicitar un reembolso y discutiremos los detalles.
id: Ya. Jika Anda tidak puas dengan layanan tersebut, di halaman "Profil/Riwayat pembayaran" Anda dapat meminta pengembalian dana dan kami akan mendiskusikan rinciannya.
it: Sì. Se non sei soddisfatto del servizio, nella pagina "Profilo/Storico pagamenti" puoi richiedere un rimborso e discuteremo i dettagli.
ja: はい。サービスにご満足いただけない場合は、「プロフィール/支払い履歴」ページから返金をリクエストでき、詳しい内容についてお話し合いします。
no: Ja. Hvis du ikke er fornøyd med tjenesten, kan du på siden "Profil/Betalingshistorikk" be om refusjon, og vi vil diskutere detaljene.
pl: Tak. Jeśli nie jesteś zadowolony z usługi, na stronie "Profil/Historia płatności" możesz zażądać zwrotu pieniędzy, a my omówimy szczegóły.
pt: Sim. Se você não estiver satisfeito com o serviço, na página "Perfil/Histórico de Pagamentos" você pode solicitar um reembolso e iremos discutir os detalhes.
ru: Да. Если вы не удовлетворены услугой, на странице «Профиль/История платежей» вы можете запросить возврат и мы обсудим детали.
sv: Ja. Om du inte är nöjd med tjänsten kan du på sidan "Profil/Betalningshistorik" begära en återbetalning, så diskuterar vi detaljerna.
th: ใช่ ถ้าคุณไม่พอใจกับบริการ บนหน้าต่าง "โปรไฟล์/ประวัติการชำระเงิน" คุณสามารถขอคืนเงินได้และเราจะพูดคุยรายละเอียดกัน
tr: Evet. Hizmetten memnun kalmadıysanız, "Profil/Ödeme geçmişi" sayfasında iade talebinde bulunabilirsiniz ve detayları görüşeceğiz.
uk: Так. Якщо ви не задоволені послугою, на сторінці "Профіль/Історія платежів" ви можете запросити відшкодування, і ми обговоримо деталі.
vi: Vâng. Nếu bạn không hài lòng với dịch vụ, trên trang "Hồ sơ/Lịch sử thanh toán" bạn có thể yêu cầu hoàn tiền và chúng tôi sẽ thảo luận về chi tiết.

source: Yes. Simply play on the Community page or send messages in the chat to earn points. The top five users will have full access as long as they remain at the top!
de: Ja. Spiele einfach auf der Community-Seite oder sende Nachrichten im Chat, um Punkte zu sammeln. Die fünf besten Benutzer haben vollen Zugriff, solange sie an der Spitze bleiben!
es: Sí. Simplemente juega en la página de la Comunidad o envía mensajes en el chat para ganar puntos. ¡Los cinco mejores usuarios tendrán acceso completo mientras permanezcan en la cima!
id: Ya. Cukup mainkan di halaman Komunitas atau kirim pesan di obrolan untuk mendapatkan poin. Lima pengguna teratas akan memiliki akses penuh selama mereka tetap di posisi teratas!
it: Sì. Gioca semplicemente sulla pagina della Comunità o invia messaggi nella chat per guadagnare punti. I primi cinque utenti avranno pieno accesso finché rimarranno tra i primi!
ja: はい。コミュニティページでプレイするか、チャットでメッセージを送信することでポイントを獲得できます。上位5名のユーザーは、トップにいる限り、フルアクセスが提供されます！
no: Ja. Spill ganske enkelt på fellesskapssiden eller send meldinger i chatten for å tjene poeng. De fem beste brukerne vil ha full tilgang så lenge de forblir på toppen!
pl: Tak. Po prostu graj na stronie Społeczności lub wysyłaj wiadomości na czacie, aby zdobywać punkty. Pięciu najlepszych użytkowników będzie miało pełny dostęp, o ile pozostaną na szczycie!
pt: Sim. Basta jogar na página da Comunidade ou enviar mensagens no chat para ganhar pontos. Os cinco melhores usuários terão acesso completo enquanto permanecerem no topo!
ru: Да. Просто играйте на странице сообщества или отправляйте сообщения в чате, чтобы зарабатывать очки. Пять лучших пользователей получат полный доступ, пока они остаются в топе!
sv: Ja. Spela helt enkelt på community-sidan eller skicka meddelanden i chatten för att tjäna poäng. De fem bästa användarna kommer att ha full åtkomst så länge de förblir i toppen!
th: ใช่ เพียงแค่เล่นในหน้าชุมชนหรือส่งข้อความในแชทเพื่อรับแต้ม ผู้ใช้ห้าอันดับแรกจะได้รับสิทธิ์ใช้งานเต็มรูปแบบตราบใดที่พวกเขายังคงอยู่ในอันดับสูงสุด!
tr: Evet. Puan kazanmak için topluluk sayfasında oynamanız veya sohbette mesaj göndermeniz yeterlidir. İlk beş kullanıcı, tepede kaldıkları sürece tam erişime sahip olacaktır!
uk: Так. Просто грайте на сторінці Спільноти або відправляйте повідомлення в чаті, щоб заробити бали. П'ять найкращих користувачів отримають повний доступ, поки залишаються на вершині!
vi: Vâng. Chỉ cần chơi trên trang Cộng đồng hoặc gửi tin nhắn trong cuộc trò chuyện để kiếm điểm. Năm người dùng hàng đầu sẽ có quyền truy cập đầy đủ miễn là họ giữ vững vị trí hàng đầu!

source: Yes. Simply play on the Community page or send messages in the community feed to earn points. The top five users will have full access as long as they remain at the top!
uk: Так. Просто грайте на сторінці Спільноти або надсилайте повідомлення у стрічку спільноти, щоб заробляти очки. П'ять найкращих користувачів будуть мати повний доступ, поки залишатимуться на вершині!

source: Yes. Since there is no automatic renewal, you can simply stop using the app at any time without being charged again.
ar: نعم. نظرًا لعدم وجود تجديد تلقائي، يمكنك ببساطة التوقف عن استخدام التطبيق في أي وقت دون أن يتم تحصيل رسوم مرة أخرى.
be: Так. Паколькі аўтаматычнае падаўжэнне адсутнічае, вы можаце проста перастаць выкарыстоўваць дадатак у любы час, і вам не будзе спаганяцца плата зноў.
da: Ja. Da der ikke er automatisk fornyelse, kan du blot stoppe med at bruge appen når som helst uden at blive opkrævet igen.
de: Ja. Da es keine automatische Verlängerung gibt, können Sie die App einfach jederzeit nicht mehr nutzen, ohne erneut belastet zu werden.
es: Sí. Como no hay renovación automática, puedes simplemente dejar de usar la aplicación en cualquier momento sin que se te cobre de nuevo.
fr: Oui. Comme il n'y a pas de renouvellement automatique, vous pouvez simplement arrêter d'utiliser l'application à tout moment sans être facturé à nouveau.
id: Ya. Karena tidak ada pembaruan otomatis, Anda dapat berhenti menggunakan aplikasi kapan saja tanpa dikenakan biaya lagi.
it: Sì. Poiché non c'è rinnovo automatico, puoi semplicemente smettere di usare l'app in qualsiasi momento senza essere addebitato nuovamente.
ja: はい。自動更新がないため、いつでもアプリの利用を停止するだけで、再度料金が請求されることはありません。
no: Ja. Siden det ikke er automatisk fornyelse, kan du enkelt slutte å bruke appen når som helst uten å bli belastet igjen.
pl: Tak. Ponieważ nie ma automatycznego odnawiania, możesz po prostu przestać używać aplikacji w dowolnym momencie bez ponoszenia kolejnych opłat.
pt: Sim. Como não há renovação automática, você pode simplesmente parar de usar o aplicativo a qualquer momento sem ser cobrado novamente.
ru: Да. Поскольку автоматическое продление отсутствует, вы можете просто прекратить использовать приложение в любой момент, не подвергаясь повторному списанию средств.
sv: Ja. Eftersom det inte finns någon automatisk förnyelse kan du enkelt sluta använda appen när som helst utan att bli debiterad igen.
th: ใช่ เนื่องจากไม่มีการต่ออายุอัตโนมัติ คุณสามารถหยุดใช้งานแอปได้ตลอดเวลาโดยไม่ต้องเสียค่าใช้จ่ายอีก
tr: Evet. Otomatik yenileme olmadığı için, uygulamayı dilediğiniz zaman kullanmayı bırakarak yeniden ücretlendirilmeden kullanımınızı durdurabilirsiniz.
uk: Так. Оскільки автоматичного продовження немає, ви можете просто припинити користування додатком у будь-який час, не сплачуючи знову.
vi: Vâng. Vì không có gia hạn tự động, bạn có thể ngừng sử dụng ứng dụng bất cứ lúc nào mà không bị tính phí lại.
