Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: For a senior-level interview, you should go beyond 'components + global store'. Talk about module boundaries (feature-based folders, domain-driven slices), isolated design systems, clear contracts between API and UI, and how you avoid tight coupling. Mention decisions around routing, data-fetching strategy (for example React Query or SWR), error handling, and how you'd support gradual refactors or micro-frontend approaches. This shows you think like an architect, not just an implementer.
ar: لإجراء مقابلة على مستوى متقدم، يجب عليك التعمق أكثر من مجرد 'المكونات + المتجر العالمي'. تحدث عن حدود الوحدات (مجلدات قائمة على الميزات، قطع في المجال)، نظم التصميم المعزولة، العقود الواضحة بين الواجهة البرمجية وواجهة المستخدم، وكيف تتجنب الاقتران المحكم. اذكر القرارات المتعلقة بالتوجيه، إستراتيجية جلب البيانات (على سبيل المثال React Query أو SWR)، التعامل مع الأخطاء، وكيف ستدعم التعديلات التدريجية أو مناهج الواجهة الأمامية الصغيرة. هذا يوضح أنك تفكر كمهندس معماري، وليس مجرد منفذ.
be: Для інтэрв'ю на ўзроўні старшага спецыяліста вам варта выходзіць за межы 'кампаненты + глабальны сховішча'. Разкажыце пра межы модуляў (папкі на аснове функцыяналу, часткі, арыентаваныя на дамен), ізаляваныя сістэмы дызайну, ясныя кантракты паміж API і UI, і як вы пазбягаеце шчыльнага злучэння. Згадайце рашэнні наконт маршрутызацыі, стратэгіі атрымання дадзеных (напрыклад, React Query або SWR), апрацоўкі памылак, і як вы падтрымліваеце паступовыя рэфактары альбо падыходы да мікра-фронтэндаў. Гэта паказвае, што вы думаеце як архітэктар, а не проста як выканаўца.
da: Til en interview på senior-niveau bør du gå ud over 'komponenter + global butik'. Tal om modulgrænser (funktionsbaserede mapper, domænedrevne skiver), isolerede design systemer, klare kontrakter mellem API og UI, og hvordan du undgår stram kobling. Nævn beslutninger omkring routing, data-hentningsstrategi (for eksempel React Query eller SWR), fejlhåndtering, og hvordan du vil støtte gradvise omlægninger eller mikro-frontend tilgange. Dette viser, at du tænker som en arkitekt, ikke kun som en implementeringsansvarlig.
de: Für ein Interview auf Senior-Level sollten Sie über 'Komponenten + globaler Speicher' hinausgehen. Sprechen Sie über Modulgrenzen (feature-basierte Ordner, domänengesteuerte Slices), isolierte Designsysteme, klare Verträge zwischen API und UI und wie Sie enge Kopplungen vermeiden. Erwähnen Sie Entscheidungen bezüglich Routing, Datenabrufstrategie (zum Beispiel React Query oder SWR), Fehlerbehandlung und wie Sie schrittweise Refaktorisierungen oder Mikro-Frontend-Ansätze unterstützen würden. Dies zeigt, dass Sie wie ein Architekt denken, nicht nur als Implementierer.
es: Para una entrevista de nivel sénior, deberías ir más allá de 'componentes + almacén global'. Habla sobre los límites de los módulos (carpetas basadas en características, fragmentos dirigidos por el dominio), sistemas de diseño aislados, contratos claros entre la API y la interfaz de usuario, y cómo evitas el acoplamiento estrecho. Menciona decisiones alrededor del enrutamiento, la estrategia de obtención de datos (por ejemplo React Query o SWR), el manejo de errores, y cómo apoyarías refactorizaciones graduales o enfoques de micro-frontend. Esto demuestra que piensas como un arquitecto, no solo como un implementador.
fr: Pour un entretien de niveau senior, vous devriez aller au-delà de « composants + magasin global ». Parlez des limites de module (dossiers basés sur les fonctionnalités, tranches axées sur le domaine), des systèmes de conception isolés, des contrats clairs entre l'API et l'UI, et comment vous évitez les couplages serrés. Mentionnez les décisions concernant le routage, la stratégie de récupération de données (par exemple React Query ou SWR), la gestion des erreurs, et comment vous soutiendriez des refactorisations progressives ou des approches micro-frontends. Cela montre que vous pensez comme un architecte, pas seulement comme un implémenteur.
id: Untuk wawancara tingkat senior, Anda harus melampaui 'komponen + penyimpanan global'. Bicarakan tentang batasan modul (folder berbasis fitur, potongan berbasis domain), sistem desain yang terisolasi, kontrak yang jelas antara API dan UI, dan bagaimana Anda menghindari keterkaitan yang erat. Sebutkan keputusan seputar pengaturan rute, strategi pengambilan data (misalnya React Query atau SWR), penanganan kesalahan, dan bagaimana Anda mendukung pengubahan bertahap atau pendekatan mikro-frontend. Ini menunjukkan bahwa Anda berpikir seperti seorang arsitek, bukan hanya pelaksana.
it: Per un colloquio di livello senior, dovresti andare oltre 'componenti + store globale'. Parla dei confini dei moduli (cartelle basate sulle caratteristiche, slice guidati dal dominio), dei sistemi di design isolati, dei contratti chiari tra API e UI, e di come eviti l'accoppiamento stretto. Menziona le decisioni relative al routing, la strategia di recupero dei dati (per esempio React Query o SWR), la gestione degli errori e come supporteresti refactoring graduali o approcci micro-frontend. Questo dimostra che pensi come un architetto, non solo come un implementatore.
ja: シニアレベルのインタビューでは、「コンポーネント＋グローバルストア」以上の話をするべきです。モジュールの境界線（機能ベースのフォルダ、ドメイン駆動のスライス）、独立したデザインシステム、APIとUI間の明確な契約、そして密結合を避ける方法について話しましょう。ルーティングに関する決定、データ取得戦略（例：React QueryやSWR）、エラーハンドリング、段階的なリファクタリングやマイクロフロントエンドのアプローチをどのようにサポートするかを述べましょう。これは、ただの実装者ではなく、アーキテクトとして考えていることを示します。
ms: Untuk temu duga peringkat senior, anda harus melangkaui 'komponen + stor global'. Bincangkan tentang sempadan modul (folder berasaskan ciri, hirisan dipacu domain), sistem reka bentuk terasing, kontrak yang jelas antara API dan UI, dan cara anda mengelakkan sambungan rapat. Sebutkan keputusan mengenai penghalaan, strategi pengambilan data (contohnya React Query atau SWR), pengendalian ralat, dan bagaimana anda menyokong perubahan semula secara beransur-ansur atau pendekatan mikro-frontend. Ini menunjukkan bahawa anda berfikir seperti seorang arkitek, bukan sekadar pelaksana.
pl: Na rozmowie kwalifikacyjnej na poziomie seniora powinieneś wyjść poza 'komponenty + globalny store'. Porozmawiaj o granicach modułów (foldery oparte na funkcjach, podziały zorientowane na domeny), odizolowanych systemach projektowych, wyraźnych kontraktach między API a UI oraz o tym, jak unikasz ścisłego powiązania. Wspomnij o decyzjach dotyczących routingu, strategii pobierania danych (na przykład React Query lub SWR), obsługi błędów oraz o tym, jak wspierałbyś stopniową refaktoryzację lub podejścia mikro-frontendowe. To pokazuje, że myślisz jak architekt, a nie tylko realizator.
pt: Para uma entrevista de nível sênior, você deve ir além de 'componentes + store global'. Fale sobre os limites dos módulos (pastas baseadas em funcionalidades, fatias orientadas a domínios), sistemas de design isolados, contratos claros entre API e UI, e como evitar um forte acoplamento. Mencione decisões em torno do roteamento, estratégia de obtenção de dados (por exemplo, React Query ou SWR), tratamento de erros e como você apoiaria refatorações graduais ou abordagens de micro-frontend. Isso mostra que você pensa como um arquiteto, não apenas como um implementador.
ru: Для интервью уровня senior вы должны выйти за пределы «компоненты + глобальное хранилище». Поговорите о границах модулей (папки, основанные на функциональных особенностях, доменно-ориентированные срезы), изолированных системах дизайна, четких контрактах между API и UI, и о том, как вы избегаете тесной связи. Упомяните решения, связанные с маршрутизацией, стратегией получения данных (например, React Query или SWR), обработкой ошибок и о том, как вы поддерживаете постепенную рефакторизацию или подходы с микро-фронтендом. Это показывает, что вы мыслите как архитектор, а не только как исполнитель.
sv: För en intervju på seniornivå bör du gå längre än 'komponenter + global butik'. Prata om modulgränser (funktionbaserade mappar, domänstyrda skivor), isolerade designsystem, tydliga kontrakter mellan API och UI, och hur du undviker hård koppling. Nämn beslut kring routing, dataintagningsstrategi (till exempel React Query eller SWR), felhantering, och hur du skulle stödja gradvisa omstruktureringar eller mikrofrontend-ansatser. Detta visar att du tänker som en arkitekt, inte bara som en implementerare.
th: สำหรับการสัมภาษณ์ในระดับอาวุโส คุณควรก้าวไปไกลกว่า 'components + global store' พูดถึงขอบเขตของโมดูล (โฟลเดอร์ตามฟีเจอร์, การแบ่งสไลซ์ตามโดเมน) ระบบการออกแบบที่แยกกัน, สัญญาที่ชัดเจนระหว่าง API และ UI, และวิธีที่คุณหลีกเลี่ยงการจับคู่แน่น พูดถึงการตัดสินใจเกี่ยวกับการกำหนดเส้นทาง, กลยุทธ์การดึงข้อมูล (เช่น React Query หรือ SWR), การจัดการข้อผิดพลาด, และวิธีที่คุณสนับสนุนการรีแฟกเตอร์แบบค่อยเป็นค่อยไปหรือวิธีการแบบ micro-frontend สิ่งนี้แสดงว่าคุณคิดเหมือนวิศวกรโครงสร้าง ไม่ใช่แค่ผู้ดำเนินการค่ะ
tr: Üst düzey bir mülakat için 'bileşenler + global mağaza'nın ötesine geçmelisiniz. Modül sınırları (özellik tabanlı klasörler, alan odaklı dilimler), izole edilmiş tasarım sistemleri, API ve UI arasındaki net sözleşmeler ve sıkı bağımlılığı nasıl önlediğiniz konularını konuşun. Yönlendirme kararları, veri getirme stratejisi (örneğin React Query veya SWR), hata yönetimi konularını ve aşamalı yeniden yapılanmaları veya mikro-frontend yaklaşımlarını nasıl destekleyeceğinizi belirtin. Bu, sadece bir uygulayıcı değil, bir mimar gibi düşündüğünüzü gösterir.
uk: Для співбесіди на старшому рівні, ви повинні вийти за рамки 'компоненти + глобальне сховище'. Поговоріть про межі модуля (папки на основі функцій, частини, керовані доменом), ізольовані системи дизайну, чіткі контракти між API та UI, і як ви уникаєте тісного зв'язування. Згадайте про рішення щодо маршрутизації, стратегії отримання даних (наприклад, React Query або SWR), обробки помилок, і як ви підтримуєте поступові переробки або підходи мікро-фронтендів. Це показує, що ви думаєте як архітектор, а не просто як імплементатор.
vi: Đối với một buổi phỏng vấn cấp cao, bạn nên đi xa hơn 'các thành phần + cửa hàng toàn cầu'. Nói về ranh giới module (các thư mục dựa trên tính năng, các lát cắt theo lĩnh vực), hệ thống thiết kế độc lập, hợp đồng rõ ràng giữa API và UI, và cách bạn tránh sự kết hợp chặt chẽ. Đề cập đến các quyết định xung quanh định tuyến, chiến lược lấy dữ liệu (ví dụ React Query hoặc SWR), xử lý lỗi, và cách bạn hỗ trợ các tinh chỉnh dần dần hoặc cách tiếp cận micro-frontend. Điều này cho thấy bạn suy nghĩ như một kiến trúc sư, không chỉ là một người thực hiện.

source: For example:
ar: على سبيل المثال:
da: For eksempel:
de: Zum Beispiel:
es: Por ejemplo:
fr: Par exemple:
id: Sebagai contoh:
it: Ad esempio:
ja: 例えば:
ms: Sebagai contoh:
no: For eksempel:
pl: Na przykład:
pt: Por exemplo:
ru: Например:
sv: Till exempel:
th: ตัวอย่าง:
tr: Örneğin:
uk: For example: 1. Welcome to MyTeacher AI! Welcome to the future of learning, where we craft each lesson specifically for you. Improve your English skills now with MyTeacher AI! 2. Try out a lesson for free Not sure if MyTeacher AI is right for you? Try out one of our English lessons for free. See for yourself, risk-free! 3. Progress tracking Stay motivated as you see your English skills improve. MyTeacher AI keeps track of your progress over time, showing you how much you're learning! 4. 24/7 support Got a question? Simply ask! Our support team is here round the clock to help you. 5. Satisfaction guaranteed We are devoted to the success of our students. That's why we guarantee your satisfaction with MyTeacher AI. 6. Accelerated learning With MyTeacher AI you will learn English quickly and effectively!
vi: Ví dụ:

source: For focused, uninterrupted learning.
id: Untuk pembelajaran yang terfokus dan tidak terganggu.
it: Per un apprendimento concentrato e senza interruzioni.
ja: フォーカスされた、途切れのない学習のために。
no: For fokusert, uforstyrret læring.
ru: Для сосредоточенного и непрерывного обучения.
sv: För fokuserat, oavbrutet lärande.
uk: Для зосередженого, безперервного навчання.

source: For learners getting started
ar: للمتعلمين الذين يبدؤون
be: Для навучэнцаў, якія толькі пачынаюць
da: For elever, der lige er begyndt
de: Für Anfänger, die gerade erst anfangen
es: Para estudiantes que están comenzando
fr: Pour les apprenants qui débutent
id: Bagi pembelajar yang baru memulai
it: Per i principianti che stanno iniziando
ja: 学習者のためのスタートガイド
no: For elever som nettopp begynner
pl: Dla uczących się rozpoczynających naukę
pt: Para alunos começando
ru: Для начинающих учеников
sv: För nybörjare som just har börjat
th: สำหรับผู้เรียนที่เพิ่งเริ่มต้น
tr: Öğrenmeye yeni başlayanlar için
uk: Для тих, хто починає навчатися
vi: Dành cho người học mới bắt đầu

source: For learners who want flexibility
ar: للمتعلمين الذين يرغبون في التحرر
be: Для вучняў, якія хочуць гнучкасць
da: For elever, der ønsker fleksibilitet
de: Für Lernende, die Flexibilität wünschen
es: Para estudiantes que quieren flexibilidad
fr: Pour les apprenants qui veulent de la flexibilité
id: Untuk pelajar yang menginginkan fleksibilitas
it: Per gli studenti che desiderano flessibilità
ja: フレキシビリティを求める学習者のために
ms: Untuk pelajar yang mahu fleksibiliti
no: For elever som ønsker fleksibilitet
pl: Dla uczących się, którzy cenią sobie elastyczność
pt: Para aprendizes que desejam flexibilidade
ru: Для учащихся, которые хотят гибкость
sv: För elever som vill ha flexibilitet
th: สำหรับผู้เรียนที่ต้องการความยืดหยุ่น
tr: Esneklik isteyen öğrenciler için
uk: Для учнів, які хочуть гнучкості
vi: Dành cho những người học muốn linh hoạt

source: For long job searches & career growth
ar: للبحث عن وظيفة طويلة والنمو المهني
be: Для працяглых пошукаў працы і кар'ернага росту
da: For lange jobsøgninger & karrierevækst
de: Für langwierige Jobsuche & berufliches Wachstum
es: Para búsquedas de empleo prolongadas y crecimiento profesional
fr: Pour de longues recherches d'emploi et une croissance de carrière
id: Untuk pencarian kerja yang panjang & pertumbuhan karier
it: Per lunghe ricerche di lavoro & crescita professionale
ja: 長期的な求人検索とキャリア成長のために
ms: Untuk pencarian kerja jangka panjang & pertumbuhan kerjaya
no: For lange jobbøk og karrierevekst
pl: Dla długich poszukiwań pracy i rozwoju kariery
pt: Para pesquisas de emprego longas & crescimento na carreira
ru: Для длительного поиска работы и карьерного роста
sv: För långa jobbsökningar & karriärtillväxt
th: สำหรับการหางานที่ยาวนานและการเติบโตในอาชีพ
tr: Uzun iş arayışları ve kariyer gelişimi için
uk: Для тривалих пошуків роботи та кар'єрного зростання
vi: Cho các cuộc tìm kiếm việc làm dài hạn & phát triển sự nghiệp

source: For people seeking long-term career growth and comprehensive interview preparation.
ar: لأولئك الذين يسعون إلى نمو مهني طويل الأمد واستعداد شامل للمقابلات.
be: Для людзей, якія імкнуцца да доўгатэрміновага кар'ернага росту і ўсебаковай падрыхтоўкі да сумоўя.
da: For folk, der søger langsigtet karrierevækst og omfattende forberedelse til jobsamtaler.
de: Für Menschen, die langfristiges Karrierewachstum und umfassende Vorbereitung auf Vorstellungsgespräche suchen.
es: Para personas que buscan un crecimiento profesional a largo plazo y una preparación integral para entrevistas.
fr: Pour les personnes cherchant une croissance professionnelle à long terme et une préparation complète aux entretiens.
id: Untuk orang-orang yang mencari pertumbuhan karier jangka panjang dan persiapan wawancara yang komprehensif.
it: Per le persone che cercano una crescita professionale a lungo termine e una preparazione completa per i colloqui.
ja: 長期的なキャリア成長と包括的な面接準備を求める人々のために。
no: For folk som søker langsiktig karrierevekst og omfattende forberedelse til intervjuer.
pl: Dla osób poszukujących długoterminowego rozwoju zawodowego i kompleksowego przygotowania do rozmów kwalifikacyjnych.
pt: Para pessoas que buscam crescimento profissional a longo prazo e preparação abrangente para entrevistas.
ru: Для людей, стремящихся к долгосрочному карьерному росту и всесторонней подготовке к собеседованиям.
sv: För människor som söker långsiktig karriärtillväxt och omfattande förberedelse för intervjuer.
th: สำหรับผู้ที่ต้องการเติบโตในสายอาชีพในระยะยาวและการเตรียมตัวสำหรับการสัมภาษณ์อย่างครอบคลุม
tr: Uzun vadeli kariyer gelişimi ve kapsamlı mülakat hazırlığı arayanlar için.
uk: Для людей, які шукають довгострокове зростання в кар'єрі та всеосяжну підготовку до співбесіди.
vi: Đối với những người tìm kiếm sự phát triển nghề nghiệp lâu dài và chuẩn bị phỏng vấn một cách toàn diện.

source: for {USER_NAME}
ar: plaintext لـ {USER_NAME}
be: для {USER_NAME}
da: til {USER_NAME}
de: für {USER_NAME}
es: para {USER_NAME}
fr: pour {USER_NAME}
id: untuk {USER_NAME}
it: per {USER_NAME}
ja: {USER_NAME} 用
pl: dla {USER_NAME}
pt: para {USER_NAME}
ru: для {USER_NAME}
sv: för {USER_NAME}
th: สำหรับ {USER_NAME}
tr: {USER_NAME} için
uk: для {USER_NAME}
vi: cho {USER_NAME}

source: Formal Writing Practice
ar: تدريب على الكتابة الرسمية
be: Практыка Фармальнага Пісьма
da: Formel Skrivepraksis
de: Formale Schreibübung
es: Práctica de Escritura Formal
fr: Pratique de l'Écriture Formelle
id: Praktek Menulis Formal
it: Pratica di Scrittura Formale
ja: フォーマルな文章作成の練習
ms: Latihan Penulisan Formal
no: Formell Skrivepraksis
pl: Praktyka Pisania Formalnego
pt: Prática de Escrita Formal
ru: Практика формального письма
sv: Formell Skrivövning
th: การฝึกเขียนในรูปแบบทางการ
tr: Resmi Yazı Pratiği
uk: Практика формального письма
vi: Luyện viết chính thức

source: Four Ways FluencyPal Boosts Your Speaking Skills
ar: أربع طرق تعمل FluencyPal على تعزيز مهاراتك في التحدث
be: Чатыры Спосабы, Як FluencyPal Павялічвае Вашы Навыкі Гаворкі
da: Fire måder, hvorpå FluencyPal forbedrer dine taleevner
de: Vier Wege, wie FluencyPal Ihre Sprechfähigkeiten verbessert
es: Cuatro maneras en que FluencyPal mejora tus habilidades de conversación
fr: Quatre façons dont FluencyPal améliore vos compétences en expression orale
id: Empat Cara FluencyPal Meningkatkan Keterampilan Berbicara Anda
it: Quattro modi in cui FluencyPal potenzia le tue abilità di conversazione
ja: フルエンシーパルがあなたのスピーキングスキルを向上させる4つの方法
ms: Empat Cara FluencyPal Meningkatkan Kemahiran Percakapan Anda
no: Fire måter FluencyPal forbedrer taleferdighetene dine
pl: Cztery sposoby, w jakie FluencyPal poprawia Twoje umiejętności mówienia
pt: Quatro Maneiras que o FluencyPal Impulsiona suas Habilidades de Fala
ru: Четыре способа, которыми FluencyPal укрепляет ваши разговорные навыки
sv: Fyra sätt som FluencyPal förbättrar dina talfärdigheter
th: สี่วิธีที่ FluencyPal ช่วยเสริมทักษะการพูดของคุณ
tr: FluencyPal'ın Konuşma Becerilerinizi Artırmanın Dört Yolu
uk: Чотири способи, як FluencyPal підвищує ваші розмовні навички
vi: Bốn Cách FluencyPal Tăng Cường Kỹ Năng Nói Của Bạn

source: Framework-specific insights (React, Vue, Angular)
ar: رؤى خاصة بالإطار (ريآكت، فيو، أنجولار)
be: Інфармацыя спецыфічная для фреймворкаў (React, Vue, Angular)
da: Indsigt i rammeværksspecifikke områder (React, Vue, Angular)
de: Framework-spezifische Einblicke (React, Vue, Angular)
es: Información específica del marco (React, Vue, Angular)
fr: Perspectives spécifiques au cadre (React, Vue, Angular)
id: Pandangan khusus kerangka kerja (React, Vue, Angular)
it: Approfondimenti specifici al framework (React, Vue, Angular)
ja: フレームワーク固有の洞察 (React, Vue, Angular)
ms: Wawasan khusus rangka kerja (React, Vue, Angular)
no: Innsikt om spesifikke rammeverk (React, Vue, Angular)
pl: Spostrzeżenia specyficzne dla frameworków (React, Vue, Angular)
pt: Informações específicas do framework (React, Vue, Angular)
sv: Ramverksspecifika insikter (React, Vue, Angular)
th: ข้อมูลเชิงลึกเฉพาะของเฟรมเวิร์ก (React, Vue, Angular)
tr: Framework'e özgü içgörüler (React, Vue, Angular)
uk: Інсайти, специфічні для фреймворків (React, Vue, Angular)
vi: Thông tin chi tiết theo khung (React, Vue, Angular)

source: Frameworks & Libraries
ar: أطر العمل والمكتبات
be: Фреймворкі і бібліятэкі
da: Frameworks & Biblioteker
de: Frameworks & Bibliotheken
es: Frameworks y bibliotecas
fr: Cadres & Bibliothèques
id: Kerangka & Pustaka
it: Framework & Librerie
ja: フレームワークとライブラリ
ms: Rangka Kerja & Perpustakaan
no: Rammeverk & Biblioteker
pl: Frameworki i biblioteki
pt: Frameworks & Bibliotecas
ru: Фреймворки и библиотеки
sv: Frameworks & Bibliotek
th: plaintext เฟรมเวิร์กและไลบรารี
tr: Frameworkler ve Kütüphaneler
uk: Фреймворки та бібліотеки
vi: Khung công tác & Thư viện

source: Free
ar: مجاني
be: Бясплатна
da: Gratis
de: Frei
es: Gratis
fr: Gratuit
id: Gratis
it: Gratuito
ja: 無料
ms: Percuma
no: Gratis
pl: Darmowe
pt: Gratuito
ru: Бесплатно
sv: Gratis
th: ฟรี
tr: Ücretsiz
uk: Вільно
vi: Miễn phí

source: Free Access
id: Akses Gratis
it: Accesso Gratuito
ja: 無料アクセス
no: Gratis tilgang
ru: Бесплатный доступ
sv: Fri tillgång
uk: Безкоштовний Доступ

source: Free Conversation
ar: محادثة مجانية
be: Бясплатная размова
da: Gratis samtale
de: Kostenloses Gespräch
es: Conversación libre
fr: Conversion Libre
id: Percakapan Bebas
it: Conversazione Gratis
ja: フリーカンバセーション
no: Gratis Samtale
pl: Darmowa rozmowa
pt: Conversação Livre
ru: Свободный разговор
sv: Gratis konversation
th: การสนทนาฟรี
tr: Ücretsiz Konuşma
uk: Вільна розмова
vi: Cuộc trò chuyện tự do

source: Free plan is for speaking and writing practice. Paid plan unlocks listening and real-time conversations with AI
ar: الخطة المجانية مخصصة لممارسة التحدث والكتابة. الخطة المدفوعة تفتح الاستماع والمحادثات الفورية مع الذكاء الاصطناعي
be: Бясплатны план прызначаны для практыкі маўлення і пісьма. Платны план адкрывае магчымасці праслухоўвання і размоў у рэальным часе з AI
da: Gratisplanen er til tale- og skriveøvelser. Betalt plan låser op for lytteøvelser og samtaler i realtid med AI
de: Der kostenlose Plan ist für Sprech- und Schreibübungen. Der kostenpflichtige Plan schaltet das Zuhören und Echtzeitgespräche mit der KI frei.
es: El plan gratuito es para práctica de habla y escritura. El plan de pago desbloquea la escucha y conversaciones en tiempo real con IA
fr: Le plan gratuit est destiné à la pratique de l'expression orale et écrite. Le plan payant débloque l'écoute et les conversations en temps réel avec l'IA
id: Paket gratis untuk latihan berbicara dan menulis. Paket berbayar membuka akses mendengarkan dan percakapan waktu nyata dengan AI
it: Il piano gratuito è per la pratica del parlato e della scrittura. Il piano a pagamento sblocca l'ascolto e le conversazioni in tempo reale con l'AI
ja: 無料プランはスピーキングとライティングの練習用です。有料プランではAIとのリスニングとリアルタイムの会話がアンロックされます。
no: Gratisplanen er for tale- og skriveøvelse. Betalt plan låser opp lytting og sanntidssamtaler med AI
pl: Bezpłatny plan jest przeznaczony do ćwiczenia mówienia i pisania. Płatny plan odblokowuje słuchanie i rozmowy w czasie rzeczywistym z AI
pt: O plano gratuito é para prática de fala e escrita. O plano pago desbloqueia audição e conversas em tempo real com IA
ru: Бесплатный план предназначен для практики разговорной и письменной речи. Платный план открывает функции для тренировки понимания на слух и общения в реальном времени с AI.
sv: Gratisplanen är för övning i att tala och skriva. Betalplanen låser upp lyssning och realtidskonversationer med AI
th: แผนฟรีสำหรับฝึกพูดและเขียน แผนชำระเงินปลดล็อกการฟังและการสนทนากับ AI แบบเรียลไทม์
tr: Ücretsiz plan konuşma ve yazma pratiği içindir. Ücretli plan, AI ile dinleme ve gerçek zamanlı konuşmaların kilidini açar.
uk: Безкоштовний план призначений для практики говоріння та письма. Платний план відкриває функції слухання та розмови в реальному часі за допомогою AI.
vi: Gói miễn phí dành cho thực hành nói và viết. Gói trả phí mở khóa tính năng nghe và trò chuyện theo thời gian thực với AI.

source: Free plan:
ar: خطة مجانية:
be: Бясплатны план:
da: Gratis plan:
de: Kostenloser Plan:
es: Plan gratuito:
fr: Plan gratuit :
id: Paket gratis:
it: Piano gratuito:
ja: plaintext 無料プラン：
no: Gratisplan:
pl: Plan darmowy:
pt: Plano gratuito:
ru: Бесплатный план:
sv: Gratisplan:
th: แผนฟรี:
tr: Ücretsiz plan:
uk: Безкоштовний план:
vi: Kế hoạch miễn phí:
