Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Less
ar: أقل
be: Менш
da: Mindre
de: Weniger
es: Menos
fr: Moins
id: Kurang
it: Meno
ja: 少ない
ms: Kurang
no: Mindre
pl: Mniej
pt: Menos
ru: Менее
sv: Mindre
th: น้อยลง
tr: Daha az
uk: Менше
vi: Ít hơn

source: Lesson Plan
es: Plan de Lección
id: Rencana Pelajaran
it: Piano della lezione
ja: レッスンプラン
no: Leksjonsplan
pl: Plan Lekcji
pt: Plano de Aula
ru: Учебный план
sv: Lektionsplan
uk: План уроку

source: Let's choose how to start practicing
ar: دعونا نختار كيفية البدء في ممارسة اللغة
be: Давайце абярэм, як пачаць практыкавацца
da: Lad os vælge, hvordan vi vil begynde at øve os
de: Lass uns auswählen, wie wir mit dem Üben beginnen möchten
es: Vamos a elegir cómo empezar a practicar
fr: Choisissons comment commencer à pratiquer
id: Mari pilih cara untuk mulai berlatih
it: Scegliamo come iniziare a praticare
ja: 練習を始める方法を選びましょう
ms: Mari pilih cara untuk mula berlatih
no: La oss velge hvordan vi skal begynne å øve
pl: Wybierzmy, jak zacząć ćwiczyć
pt: Vamos escolher como começar a praticar
ru: Давайте выберем, с чего начать практиковаться
sv: Låt oss välja hur vi ska börja öva
th: เลือกวิธีการเริ่มฝึกฝนของคุณ
tr: Haydi pratiğe nasıl başlayacağımızı seçelim
uk: Давайте оберемо, як розпочати практику
vi: Hãy chọn cách để bắt đầu luyện tập

source: Let's continue...
de: Lass uns weitergehen...
es: Continuemos...
id: Mari kita lanjutkan...
it: Continuiamo...
ja: 続きを見てみましょう...
no: La oss fortsette...
pl: Kontynuujmy...
pt: Vamos continuar...
ru: Давайте продолжим...
sv: Låt oss fortsätta...
th: มาดูกันต่อ...
tr: Devam edelim...
uk: Давайте продовжимо...
vi: Hãy tiếp tục...

source: Let's create an account
ar: لنقم بإنشاء حساب
be: Давайце створым уліковы запіс
da: Lad os oprette en konto
de: Lass uns ein Konto erstellen
es: Creemos una cuenta
fr: Créons un compte
id: Mari buat akun
it: Creiamo un account
ja: アカウントを作成しましょう
ms: Mari buat akaun
no: La oss opprette en konto
pl: Stwórzmy konto
pt: Vamos criar uma conta
ru: Давайте создадим аккаунт
sv: Låt oss skapa ett konto
th: เรามาสร้างบัญชีกันเถอะ
tr: Haydi bir hesap oluşturalım
uk: Давайте створимо обліковий запис
vi: Hãy tạo một tài khoản

source: Let's see who has the best arguments.
ar: دعونا نرى من لديه أفضل الحجج.
be: Давай паглядзім, у каго лепшыя аргументы.
da: Lad os se, hvem der har de bedste argumenter.
de: Lasst uns sehen, wer die besten Argumente hat.
es: Veamos quién tiene los mejores argumentos.
fr: Voyons qui a les meilleurs arguments.
id: Mari kita lihat siapa yang memiliki argumen terbaik.
it: Vediamo chi ha i migliori argomenti.
ja: 最高の議論を持っているのは誰か見てみましょう。
no: La oss se hvem som har de beste argumentene.
pl: Zobaczmy, kto ma najlepsze argumenty.
pt: Vamos ver quem tem os melhores argumentos.
ru: Давайте посмотрим, у кого самые лучшие аргументы.
sv: Låt oss se vem som har de bästa argumenten.
th: มาดูกันว่าใครมีเหตุผลที่ดีที่สุด
tr: En iyi argümanlara kimin sahip olduğunu görelim.
uk: Давай подивимось, у кого найкращі аргументи.
vi: Hãy xem ai có những lập luận tốt nhất.

source: Let’s make sure you’re ready
ar: لنتأكد من أنك جاهز
be: Давайце ўпэўнімся, што вы гатовы
da: Lad os sikre os, at du er klar
de: Lassen Sie uns sicherstellen, dass Sie bereit sind
es: Asegurémonos de que estás listo
fr: Assurons-nous que vous êtes prêt
id: Mari pastikan Anda siap
it: Assicuriamoci che tu sia pronto
ja: あなたが準備できていることを確認しましょう
ms: Pastikan anda sudah bersedia
no: La oss sørge for at du er klar
pl: Upewnijmy się, że jesteś gotowy
pt: Vamos garantir que você está pronto
ru: Давайте убедимся, что вы готовы
sv: Låt oss se till att du är redo
th: มาตรวจสอบว่าคุณพร้อมแล้ว
tr: Hadi, hazır olduğundan emin olalım
uk: Давайте переконаємося, що ви готові
vi: Hãy chắc chắn rằng bạn đã sẵn sàng

source: Like
ar: أعجبني
be: Падабаецца
de: Wie
es: Me gusta
fr: Comme
id: Suka
it: Come
ja: plaintext いいね
no: Liker
pl: Lubić
pt: Curtir
ru: Нравится
sv: Gilla
th: ถูกใจ
tr: Beğen
uk: Якщо
vi: Thích

source: Limited access
id: Akses terbatas
it: Accesso limitato
ja: 限定アクセス
no: Begrenset tilgang
pl: Ograniczony dostęp
ru: Ограниченный доступ
sv: Begränsad åtkomst
uk: Обмежений доступ

source: Limited access...
id: Akses terbatas...
it: Accesso limitato...
ja: 制限付きアクセス...
no: Begrenset tilgang...
pl: Ograniczony dostęp...
ru: Ограниченный доступ...
sv: Begränsad åtkomst...
uk: Обмежений доступ...

source: Limited messages
id: Pesan terbatas
it: Messaggi limitati
ja: 限定メッセージ数
no: Begrensede meldinger
ru: Ограниченные сообщения
uk: Обмежена кількість повідомлень

source: Limited messages and voice features
id: Fitur pesan dan suara terbatas
it: Funzionalità di messaggi e voce limitate
ja: メッセージと音声機能が制限されています
no: Begrenset antall meldinger og talefunksjoner
pl: Ograniczone wiadomości i funkcje głosowe
ru: Ограниченные сообщения и голосовые функции
sv: Begränsade meddelanden och röstfunktioner
uk: Обмежена кількість повідомлень і голосових функцій

source: Limited voice features
id: Fitur suara terbatas
it: Funzionalità vocali limitate
ja: 制限された音声機能
no: Begrensede stemmefunksjoner
ru: Ограниченные голосовые функции
sv: Begränsade röstfunktioner
uk: Обмежені голосові функції

source: Listening practice. You can hear AI responses
ar: ممارسة الاستماع. يمكنك سماع ردود الذكاء الاصطناعي
be: Практыка слухання. Вы можаце слухаць адказы AI
da: Lytteøvelse. Du kan høre AI-svar
de: Hörübungen. Sie können KI-Antworten hören.
es: Escucha práctica. Puedes escuchar respuestas de IA
fr: Pratique d'écoute. Vous pouvez entendre les réponses de l'IA
id: Praktik mendengarkan. Anda dapat mendengar respons AI
it: Esercizio di ascolto. Puoi ascoltare le risposte dell'IA
ja: リスニング練習。AIの回答を聞くことができます
no: Lytteøvelse. Du kan høre AI-svar
pl: Ćwiczenie słuchania. Możesz usłyszeć odpowiedzi AI
pt: Prática de escuta. Você pode ouvir as respostas da IA
ru: Практика аудирования. Вы можете услышать ответы ИИ
sv: Lyssningsövningar. Du kan höra AI-svar
th: ฝึกการฟัง คุณสามารถได้ยินการตอบสนองของ AI
tr: Dinleme pratiği. AI yanıtlarını duyabilirsiniz
uk: Практика слухання. Ви можете почути відповіді AI
vi: Thực hành nghe. Bạn có thể nghe phản hồi của AI

source: Listening practice. You will hear AI responses
de: Hörverständnisübung. Sie werden AI-Antworten hören
es: Práctica auditiva. Escucharás respuestas de IA
fr: Pratique d'écoute. Vous entendrez des réponses de l'IA.
id: Latihan mendengarkan. Anda akan mendengar respon AI
it: Ascolto pratico. Sentirai le risposte dell'IA
ja: リスニング練習。AIの応答をお聞きいただけます
no: Lyttetrening. Du vil høre AI-responser
pl: Ćwiczenie ze słuchania. Usłyszysz odpowiedzi AI
pt: Prática de escuta. Você ouvirá respostas da IA
ru: Практика аудирования. Вы услышите ответы ИИ.
sv: Lyssningsövning. Du kommer att höra AI-svar
th: การฝึกฝนการฟัง คุณจะได้ยินคำตอบจาก AI
tr: Dinleme çalışması. AI yanıtlarını duyacaksınız.
uk: Практика аудіювання. Ви почуєте відповіді AI
vi: Luyện nghe. Bạn sẽ nghe các phản hồi của AI

source: Literature & Fiction
ar: الأدب والخيال
be: Літаратура і мастацкая літаратура
da: Litteratur & Skønlitteratur
de: Literatur & Belletristik
es: Literatura y ficción
fr: Littérature & Fiction
id: Literatur & Fiksi
it: Letteratura e narrativa
ja: 文学 & フィクション
ms: Sastera & Fiksyen
no: Litteratur & Fiksjon
pl: Literatura i Fikcja
pt: Literatura & Ficção
ru: Литература и Художественная проза
sv: Litteratur & Fiction
th: วรรณกรรมและนวนิยาย
tr: Edebiyat ve Kurgu
uk: Література і художня література
vi: Văn học & Tiểu thuyết

source: Load More
de: Mehr laden
es: Cargar más
id: Muat Lebih Banyak
it: Carica Altro
ja: もっと読む
no: Last inn mer
pl: Załaduj więcej
pt: Carregar Mais
ru: Загрузить больше
sv: Ladda mer
th: โหลดเพิ่มเติม
tr: Daha Fazla Yükle
uk: Завантажити більше
vi: Tải Thêm

source: Load more
id: Muat lebih banyak
it: Carica di più
ja: もっと読み込む
no: Last inn mer
pl: Załaduj więcej
ru: Загрузить больше
sv: Ladda mer
uk: Завантажити більше

source: Loading
es: Cargando
id: Memuat
it: Caricamento
ja: 読み込み中
no: Laster
pl: Ładowanie
pt: Carregando
ru: Загрузка
sv: Laddar
uk: Завантаження

source: Loading a word...
id: Memuat sebuah kata...
it: Caricamento di una parola...
ja: plaintext 単語を読み込み中...
no: Laster inn et ord...
ru: Загрузка слова...
uk: Завантаження слова...

source: Loading.
ar: جارِ التحميل.
be: Загрузка.
da: Indlæser.
de: Laden.
es: Cargando.
fr: Chargement.
id: Memuat.
it: Caricamento.
ja: ロード中。
ms: Memuat.
no: Laster.
pl: Ładowanie.
pt: Carregando.
ru: Загрузка.
sv: Laddar.
th: กำลังโหลด.
tr: Yükleniyor.
uk: Завантаження.
vi: Đang tải.

source: Loading..
ar: جارٍ التحميل..
be: Загрузка..
da: Indlæser..
de: Wird geladen...
es: Cargando..
fr: Chargement..
id: Memuat..
it: Caricamento in corso..
ja: 読み込み中..
ms: Memuatkan..
no: Laster inn..
pl: Ładowanie..
pt: Carregando..
ru: Загрузка..
sv: Laddar..
th: กำลังโหลด..
tr: Yükleniyor..
uk: Завантаження...
vi: Đang tải..

source: Loading...
ar: جار التحميل...
be: Загрузка...
da: Indlæser...
de: Wird geladen...
es: Cargando...
fr: Chargement...
id: Memuat...
it: Caricamento...
ja: 読み込み中...
ms: Memuatkan...
no: Laster...
pl: Ładowanie...
pt: Carregando...
ru: Загрузка...
sv: Laddar...
th: กำลังโหลด...
tr: Yükleniyor...
uk: Завантаження...
vi: Đang tải...

source: Log Out
ar: تسجيل الخروج
be: Выйсці
da: Log Ud
de: Abmelden
es: Cerrar sesión
fr: Se déconnecter
id: Keluar
it: Disconnetti
ja: ログアウト
ms: Log Keluar
no: Logg ut
pl: Wyloguj się
pt: Sair
ru: Выйти
sv: Logga ut
th: ออกจากระบบ
tr: Oturumu Kapat
uk: Вийти
vi: Đăng Xuất

source: Log out of your account
ar: تسجيل الخروج من حسابك
be: Выйсці з вашага ўліковага запісу
da: Log ud af din konto
de: Von Ihrem Konto abmelden
es: Cerrar sesión de tu cuenta
fr: Se déconnecter de votre compte
id: Log keluar dari akun Anda
it: Esci dal tuo account
ja: アカウントからログアウトする
ms: Log keluar dari akaun anda
no: Logg ut av kontoen din
pl: Wyloguj się ze swojego konta
pt: Faça logout da sua conta
ru: Выйти из аккаунта
sv: Logga ut från ditt konto
th: ออกจากบัญชีของคุณ
tr: Hesabınızdan çıkış yapın
uk: Вийти з вашого облікового запису
vi: Đăng xuất khỏi tài khoản của bạn

source: Logging/Tracing
ar: التسجيل/التتبع
be: Рэгістрацыя/Адсочванне
da: Logføring/Sporing
de: Protokollierung/Verfolgung
es: Registro/Rastreo
fr: Journalisation/Traçage
it: Logging/Tracciamento
ja: ログ/トレーシング
no: Loggføring/Sporing
pl: Rejestrowanie/Śledzenie
ru: Логирование/Трассировка
sv: Loggning/Spårning
th: การบันทึก/การตรวจสอบ
tr: Günlükleme/İzleme
uk: Логування/Трасування
vi: Nhật ký/Dấu vết

source: Longer words and richer expressions
id: Kata-kata yang lebih panjang dan ekspresi yang lebih kaya
it: Parole più lunghe ed espressioni più ricche
ja: 長い言葉と豊かな表現
no: Lengre ord og rikere uttrykk
ru: Длинные слова и более насыщенные выражения
uk: Більш довгі слова та багатші вирази

source: Looking for something specific?
ar: تبحث عن شيء محدد؟
be: Шукаеце нешта канкрэтнае?
da: Leder du efter noget specielt?
de: Suchen Sie nach etwas Bestimmtem?
es: ¿Buscando algo específico?
fr: Vous cherchez quelque chose de spécifique ?
id: Mencari sesuatu yang spesifik?
it: Cerchi qualcosa di specifico?
ja: 特定のものを探していますか？
ms: Mencari sesuatu yang tertentu?
no: Ser du etter noe spesifikt?
pl: Szukasz czegoś konkretnego?
pt: Procurando algo específico?
ru: Ищете что-то конкретное?
sv: Letar du efter något specifikt?
th: กำลังมองหาสิ่งที่เฉพาะเจาะจงอยู่ใช่ไหม?
tr: Özel bir şey mi arıyorsunuz?
uk: Шукаєте щось конкретне?
vi: Đang tìm kiếm một cái gì đó cụ thể?

source: Main goal in learning
ar: الهدف الرئيسي في التعلم
be: Асноўная мэта ў навучанні
da: Hovedmål i læring
de: Hauptziel beim Lernen
es: Objetivo principal en el aprendizaje
fr: Objectif principal de l'apprentissage
id: Tujuan utama dalam belajar
it: Obiettivo principale nell'apprendimento
ja: 学習の主な目的
ms: Matlamat utama dalam pembelajaran
no: Hovedmål i læring
pl: Główny cel w nauce
pt: Objetivo principal na aprendizagem
ru: Основная цель в обучении
sv: Huvudmål med lärandet
th: เป้าหมายหลักในการเรียนรู้
tr: Öğrenmede ana hedef
uk: Основна мета у навчанні
vi: Mục tiêu chính trong việc học

source: Make sure to allow webcam access in your browser settings.
ar: تأكد من السماح بالوصول إلى كاميرا الويب في إعدادات المتصفح لديك.
be: Пераканайцеся, што дазволілі доступ да вэб-камеры ў наладах вашага браўзера.
da: Sørg for at tillade webcam-adgang i dine browserindstillinger.
de: Stellen Sie sicher, dass der Webcam-Zugriff in Ihren Browsereinstellungen aktiviert ist.
es: Asegúrate de permitir el acceso a la cámara web en la configuración de tu navegador.
fr: Assurez-vous d'autoriser l'accès à la webcam dans les paramètres de votre navigateur.
id: Pastikan untuk mengizinkan akses webcam di pengaturan browser Anda.
it: Assicurati di consentire l'accesso alla webcam nelle impostazioni del tuo browser.
ja: カメラへのアクセスをブラウザの設定で許可してください。
no: Pass på at du tillater tilgang til webkamera i nettleserinnstillingene dine.
pl: Upewnij się, że w ustawieniach przeglądarki zezwoliłeś na dostęp do kamery internetowej.
pt: Certifique-se de permitir o acesso à webcam nas configurações do seu navegador.
ru: Убедитесь, что в настройках браузера разрешен доступ к веб-камере.
sv: Se till att tillåta webbkameratillgång i dina webbläsarinställningar.
th: อนุญาตให้เข้าถึงเว็บแคมในการตั้งค่าของเบราว์เซอร์คุณ
tr: Tarayıcı ayarlarında kamera erişimine izin verdiğinizden emin olun.
uk: Переконайтеся, що доступ до вебкамери дозволено в налаштуваннях вашого браузера.
vi: Hãy chắc chắn cho phép truy cập webcam trong cài đặt trình duyệt của bạn.

source: Make sure your microphone is working properly.
es: Asegúrate de que tu micrófono esté funcionando correctamente.
id: Pastikan mikrofon Anda berfungsi dengan baik.
it: Assicurati che il tuo microfono funzioni correttamente.
ja: マイクが正常に動作していることを確認してください。
no: Sørg for at mikrofonen din fungerer som den skal.
pl: Upewnij się, że Twój mikrofon działa prawidłowo.
pt: Certifique-se de que seu microfone está funcionando corretamente.
ru: Убедитесь, что ваш микрофон работает правильно.
sv: Se till att din mikrofon fungerar korrekt.
uk: Переконайтеся, що ваш мікрофон працює належним чином.

source: Make sure your webcam is working properly.
es: Asegúrate de que tu cámara web esté funcionando correctamente.
id: Pastikan webcam Anda berfungsi dengan baik.
it: Assicurati che la tua webcam funzioni correttamente.
ja: あなたのウェブカメラが正常に動作していることを確認してください。
no: Sørg for at webkameraet ditt fungerer som det skal.
pl: Upewnij się, że Twoja kamera internetowa działa prawidłowo.
pt: Certifique-se de que sua webcam está funcionando corretamente.
ru: Убедитесь, что ваша веб-камера работает правильно.
sv: Se till att din webbkamera fungerar korrekt.
uk: Переконайтеся, що ваша веб-камера працює належним чином.

source: Malay Learning Plan
ar: خطة التعلم للغة الملايوية
be: План вучэння малайскай мовы
da: Malay Læringsplan
de: Malay Lernplan
es: Plan de Aprendizaje de Malay
fr: Plan d'Apprentissage du Malais
id: Rencana Belajar Bahasa Melayu
it: Piano di Apprendimento del Malese
ja: マレー語学習プラン
ms: Rancangan Pembelajaran Bahasa Melayu
no: Malay-læringsplan
pl: Plan Nauki Malajskiego
pt: Plano de Aprendizado de Malaio
ru: План обучения малайскому
sv: Malaysiskt Lärplan
th: แผนการเรียนรู้ภาษามาเลย์
tr: Malay Öğrenme Planı
uk: План вивчення малайської
vi: Kế Hoạch Học Tiếng Mã Lai

source: Manage your full access settings
de: Verwalten Sie Ihre vollen Zugriffseinstellungen
es: Administra tus configuraciones de acceso completo
id: Kelola pengaturan akses penuh Anda
it: Gestisci le impostazioni di accesso completo
ja: あなたのフルアクセス設定を管理する
no: Administrer innstillingene for full tilgang
pl: Zarządzaj swoimi ustawieniami pełnego dostępu
pt: Gerencie suas configurações de acesso total
ru: Управляйте настройками полного доступа
sv: Hantera dina fullständiga åtkomstinställningar
th: จัดการการตั้งค่าการเข้าถึงเต็มรูปแบบของคุณ
tr: Tam erişim ayarlarınızı yönetin
uk: Керуйте налаштуваннями повного доступу
vi: Quản lý cài đặt quyền truy cập đầy đủ của bạn

source: Manage your profile settings and check your progress
ar: إدارة إعدادات ملفك الشخصي وتحقق من تقدمك
be: Кіруйце наладамі свайго профілю і правярайце свой прагрэс
da: Administrer dine profilindstillinger og kontroller din fremgang
de: Verwalten Sie Ihre Profileinstellungen und überprüfen Sie Ihren Fortschritt
es: Administra la configuración de tu perfil y verifica tu progreso
fr: Gérez les paramètres de votre profil et vérifiez vos progrès
id: Kelola pengaturan profil Anda dan periksa kemajuan Anda
it: Gestisci le impostazioni del tuo profilo e controlla i tuoi progressi
ja: プロフィール設定を管理し、進捗状況を確認する
ms: Urus tetapan profil anda dan semak kemajuan anda
no: Administrer profilinnstillingene dine og sjekk fremgangen din
pl: Zarządzaj ustawieniami swojego profilu i sprawdzaj swoje postępy
pt: Gerencie as configurações do seu perfil e verifique seu progresso
ru: Управляйте настройками своего профиля и проверяйте свой прогресс
sv: Hantera dina profilinställningar och kontrollera dina framsteg
th: จัดการการตั้งค่าโปรไฟล์ของคุณและตรวจสอบความก้าวหน้าของคุณ
tr: Profil ayarlarınızı yönetin ve ilerlemenizi kontrol edin
uk: Керуйте налаштуваннями свого профілю та перевіряйте свій прогрес
vi: Quản lý cài đặt hồ sơ của bạn và kiểm tra tiến trình của bạn
