Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Every player competes individually
id: Setiap pemain bersaing secara individu
it: Ogni giocatore compete individualmente
ja: すべてのプレイヤーは個別に競争します
no: Hver spiller konkurrerer individuelt
ru: Каждый игрок соревнуется индивидуально
uk: Кожен гравець змагається індивідуально

source: Everything in Free, plus:
ar: كل شيء في الإصدار المجاني، بالإضافة إلى:
be: Усё з Бясплатнага, плюс:
da: Alt i Gratis, plus:
de: Alles in Free, plus:
es: Todo en Free, además:
fr: Tout en Gratuit, plus :
id: Semuanya di Gratis, plus:
it: Tutto incluso in Gratis, più:
ja: フリープランに加えて、以下の特典があります：
ms: Semua dalam Percuma, ditambah:
no: Alt i Free, pluss:
pl: Wszystko w Free, plus:
pt: Tudo em Grátis, mais:
ru: Все, что в Free, плюс:
sv: Allt i Free, plus:
th: ทุกอย่างในแพ็คเกจฟรี บวกกับ:
tr: Ücretsiz sürümde olan her şey, artı:
uk: Все з Безкоштовного, плюс:
vi: Tất cả trong phiên bản Miễn phí, cộng thêm:

source: Everything you need to stand out and get the job
ar: كل ما تحتاجه للتميز والحصول على الوظيفة
be: Усё, што вам трэба, каб вылучыцца і атрымаць працу
da: Alt du behøver for at skille dig ud og få jobbet
de: Alles, was Sie brauchen, um aufzufallen und den Job zu bekommen
es: Todo lo que necesitas para destacar y conseguir el trabajo
fr: Tout ce dont vous avez besoin pour vous démarquer et obtenir le poste
id: Segala sesuatu yang Anda butuhkan untuk menonjol dan mendapatkan pekerjaan
it: Tutto ciò di cui hai bisogno per distinguerti e ottenere il lavoro
ja: 際立ち、仕事を得るために必要なすべてのこと
ms: Segala yang anda perlukan untuk menonjol dan mendapatkan pekerjaan
no: Alt du trenger for å skille deg ut og få jobben
pl: Wszystko, czego potrzebujesz, aby się wyróżnić i zdobyć pracę
pt: Tudo o que você precisa para se destacar e conseguir o emprego
ru: Всё, что нужно, чтобы выделиться и получить работу
sv: Allt du behöver för att sticka ut och få jobbet
th: ทุกสิ่งที่คุณต้องการเพื่อโดดเด่นและได้งาน
tr: Her şey öne çıkmak ve işi almak için ihtiyaç duyduğunuz şeyler
uk: Усе, що вам потрібно, щоб виділитися та отримати роботу
vi: Mọi thứ bạn cần để nổi bật và đạt được công việc

source: Example: I'm preparing for a business trip to Berlin
id: Contoh: Saya sedang bersiap untuk perjalanan bisnis ke Berlin
it: Esempio: Mi sto preparando per un viaggio d'affari a Berlino
ja: 例: ベルリンへの出張の準備をしています
no: Eksempel: Jeg forbereder meg på en forretningsreise til Berlin
pl: Przykład: Przygotowuję się do podróży służbowej do Berlina
ru: Пример: Я готовлюсь к деловой поездке в Берлин
sv: Exempel: Jag förbereder mig för en affärsresa till Berlin
uk: Приклад: Я готуюся до ділової поїздки в Берлін

source: existential fiction
ar: خيال وجودي
be: экзістэнцыйная літаратура
da: eksistentiel fiktion
de: existenzielle Fiktion
es: ficción existencial
fr: fiction existentielle
id: fiksi eksistensial
it: finzione esistenziale
ja: 実存主義フィクション
ms: fiksi eksistensial
no: eksistensiell fiksjon
pl: literatura egzystencjalna
pt: ficção existencial
ru: экзистенциальная фантастика
sv: existentiell fiktion
th: นวนิยายเชิงปรัชญาการดำรงอยู่
tr: varoluşçu kurgu
uk: екзистенціальна фантастика
vi: hư cấu hiện sinh

source: Exit
id: Keluar
it: Esci
ja: 終了
no: Avslutt
pl: Wyjście
ru: Выход
sv: Avsluta
uk: Вихід

source: Expand Your Vocabulary
ar: وسع مفرداتك
be: Расшырце свой слоўнік
da: Udvid dit ordforråd
de: Erweitern Sie Ihr Vokabular
es: Expande Tu Vocabulario
fr: Développez votre vocabulaire
id: Perluas Kosakata Anda
it: Espandi il tuo vocabolario
ja: ボキャブラリーを増やしましょう
ms: Perluas Kosakata Anda
no: Utvid ordforrådet ditt
pl: Rozwiń Swoje Słówka
pt: Amplie Seu Vocabulário
ru: Расширьте свой словарный запас
sv: Utvidga ditt ordförråd
th: ขยายคำศัพท์ของคุณ
tr: Kelime Dağarcığını Genişlet
uk: Розширте свій словниковий запас
vi: Mở Rộng Từ Vựng

source: Experience alone isn’t enough when interviews focus on reasoning, trade-offs, and communication.
ar: الخبرة وحدها ليست كافية عندما تركز المقابلات على التفكير، والمفاضلات، والتواصل.
be: Вопыту аднаго недастаткова, калі інтэрв’ю сфакусаваны на мысленні, кампрамісах і камунікацыі.
da: Erfaring alene er ikke nok, når interviews fokuserer på ræsonnering, kompromiser og kommunikation.
de: Erfahrung allein reicht nicht aus, wenn sich Interviews auf Argumentation, Abwägungen und Kommunikation konzentrieren.
es: La experiencia por sí sola no es suficiente cuando las entrevistas se centran en el razonamiento, las compensaciones y la comunicación.
fr: L'expérience seule ne suffit pas lorsque les entretiens se concentrent sur le raisonnement, les compromis et la communication.
id: Pengalaman saja tidak cukup ketika wawancara berfokus pada penalaran, pertimbangan, dan komunikasi.
it: L'esperienza da sola non è sufficiente quando i colloqui si concentrano su ragionamento, compromessi e comunicazione.
ja: 経験だけでは、不十分です。面接は論理的思考、トレードオフ、そしてコミュニケーションに重点を置くからです。
no: Erfaring alene er ikke nok når intervjuer fokuserer på resonnement, avveininger og kommunikasjon.
pl: Samo doświadczenie nie wystarczy, gdy rozmowy kwalifikacyjne skupiają się na rozumowaniu, kompromisach i komunikacji.
pt: A experiência por si só não é suficiente quando as entrevistas focam em raciocínio, concessões e comunicação.
ru: Опыт сам по себе недостаточен, когда в интервью акцентируется внимание на логике, компромиссах и общении.
sv: Erfarenhet ensam räcker inte när intervjuer fokuserar på resonemang, kompromisser och kommunikation.
th: ประสบการณ์เพียงอย่างเดียวไม่เพียงพอ เมื่อการสัมภาษณ์มุ่งเน้นไปที่การใช้เหตุผล ข้อแลกเปลี่ยน และการสื่อสาร
tr: Deneyim tek başına yeterli değildir, zira mülakatlar akıl yürütme, ödünleşimler ve iletişim üzerine odaklanır.
uk: Досвіду недостатньо, коли інтерв'ю зосереджені на міркуваннях, компромісах і спілкуванні.
vi: Kinh nghiệm đơn thuần không đủ khi các cuộc phỏng vấn tập trung vào lập luận, đánh đổi, và giao tiếp.

source: Experience next-level language practice with Bruno, your friendly AI tutor. Whether you're a beginner or advanced learner, Bruno adapts to your pace, corrects mistakes, and keeps you motivated.
ar: اختبر مستوى جديدًا من ممارسة اللغة مع برونو، معلمك الذكي الودود. سواء كنت مبتدئًا أو متعلمًا متقدمًا، يتكيف برونو مع سرعتك، ويصحح الأخطاء، ويبقيك متحمسًا.
be: Азнаёміцеся з наступным узроўнем практыкі мовы з Бруна, вашым дружэлюбным AI-тутарам. Не важна, ці вы пачаткоўца ці прадумкалы вучонца, Бруна прыстасоўваецца да вашага тэмпу, карэкціруе памылкі і мацуе васу.
da: Oplev sprogetræning på næste niveau med Bruno, din venlige AI-lærer. Uanset om du er nybegynder eller avanceret elev, tilpasser Bruno sig dit tempo, retter fejl og holder dig motiveret.
de: Erleben Sie das nächste Level des Sprachenlernens mit Bruno, Ihrem freundlichen KI-Tutor. Egal, ob Sie ein Anfänger oder fortgeschrittener Lernender sind, Bruno passt sich Ihrem Tempo an, korrigiert Fehler und hält Sie motiviert.
es: Experimenta una práctica de idiomas de siguiente nivel con Bruno, tu amigable tutor de IA. Ya seas un principiante o un aprendiz avanzado, Bruno se adapta a tu ritmo, corrige errores y te mantiene motivado.
fr: Vivez une pratique linguistique de niveau supérieur avec Bruno, votre sympathique tuteur IA. Que vous soyez débutant ou apprenant avancé, Bruno s'adapte à votre rythme, corrige les erreurs et vous garde motivé.
id: Rasakan latihan bahasa tingkat lanjut dengan Bruno, tutor AI ramah Anda. Apakah Anda pemula atau pelajar tingkat lanjut, Bruno menyesuaikan dengan kecepatan Anda, memperbaiki kesalahan, dan menjaga Anda termotivasi.
it: Sperimenta una pratica linguistica di livello superiore con Bruno, il tuo amichevole tutor AI. Che tu sia un principiante o un apprendista avanzato, Bruno si adatta al tuo ritmo, corregge gli errori e ti tiene motivato.
ja: 次世代の言語練習を体験してください、あなたの友達のAIチューター、ブルーノと共に。初心者でも上級者でも、ブルーノはあなたのペースに合わせ、間違いを修正し、モチベーションを保ちます。
ms: Alami latihan bahasa peringkat seterusnya dengan Bruno, tutor AI mesra anda. Sama ada anda seorang pemula atau pelajar lanjutan, Bruno menyesuaikan dengan rentak anda, membetulkan kesilapan, dan memastikan anda sentiasa bermotivasi.
no: Opplev språkpraksis på neste nivå med Bruno, din vennlige AI-lærer. Enten du er nybegynner eller avansert elev, tilpasser Bruno seg ditt tempo, retter feil og holder deg motivert.
pl: Doświadcz językowej praktyki na najwyższym poziomie z Brunem, twoim przyjaznym nauczycielem AI. Niezależnie od tego, czy jesteś początkującym, czy zaawansowanym uczniem, Bruno dostosowuje się do twojego tempa, poprawia błędy i motywuje cię.
pt: Experimente a prática de idiomas em um novo nível com Bruno, seu amigável tutor de IA. Seja você um iniciante ou um aprendiz avançado, Bruno se adapta ao seu ritmo, corrige erros e mantém você motivado.
ru: Ощутите практику языка на новом уровне с Бруно, вашим дружелюбным AI-учителем. Независимо от того, новичок вы или продвинутый ученик, Бруно подстраивается под ваш темп, исправляет ошибки и поддерживает вашу мотивацию.
sv: Upplev språkpraktik på nästa nivå med Bruno, din vänliga AI-t tutor. Oavsett om du är nybörjare eller avancerad elev, anpassar sig Bruno efter ditt tempo, rättar misstag och håller dig motiverad.
th: สัมผัสการฝึกภาษาระดับต่อไปกับ บรูโน่ ครูฝึก AI ของคุณที่เป็นมิตร ไม่ว่าคุณจะเป็นผู้เริ่มต้นหรือผู้เรียนระดับสูง บรูโน่จะปรับให้เข้ากับจังหวะของคุณ แก้ไขข้อผิดพลาด และทำให้คุณมีแรงจูงใจต่อไป
tr: Deneyiminizi bir üst seviyeye taşıyan dil pratiği ile Bruno ile tanışın, dost canlısı AI öğretmeniniz. İster acemi ister ileri düzey bir öğrenci olun, Bruno hızınıza uyum sağlar, hataları düzeltir ve sizi motive tutar.
uk: Відчуйте практику мови нового рівня з Бруно, вашим дружнім AI-наставником. Незалежно від того, початківець ви чи досвідчений учень, Бруно підстроюється під ваш темп, виправляє помилки і підтримує вашу мотивацію.
vi: Trải nghiệm việc luyện tập ngôn ngữ ở cấp độ tiếp theo với Bruno, gia sư AI thân thiện của bạn. Dù bạn là người mới bắt đầu hay học viên nâng cao, Bruno sẽ điều chỉnh theo nhịp độ của bạn, sửa lỗi và giữ cho bạn động lực.

source: Explain EF Core change tracking and when to use AsNoTracking for read-heavy endpoints.
ar: اشرح تتبع التغيير في EF Core ومتى يجب استخدام AsNoTracking لنقاط النهاية الكثيفة القراءة.
be: Патлумачце адсочванне зменаў EF Core і калі выкарыстоўваць AsNoTracking для канчатковых кропак з цяжкімі аперацыямі чытання.
da: Forklar EF Core ændringssporing og hvornår man skal bruge AsNoTracking til read-heavy endpoints.
de: Erklären Sie EF Core Änderungsverfolgung und wann AsNoTracking für leseintensive Endpunkte verwendet werden sollte.
es: Explica el seguimiento de cambios de EF Core y cuándo utilizar AsNoTracking para endpoints con alta carga de lectura.
fr: Expliquez le suivi des changements EF Core et quand utiliser AsNoTracking pour les points de terminaison à forte lecture.
id: Jelaskan pelacakan perubahan EF Core dan kapan menggunakan AsNoTracking untuk endpoint yang banyak membaca.
it: Spiega il tracciamento delle modifiche di EF Core e quando utilizzare AsNoTracking per endpoint con elevato carico di lettura.
ja: EF Core の変更追跡について説明し、読み込み頻度の高いエンドポイントに AsNoTracking を使用するタイミングを説明してください。
ms: Terangkan penjejakan perubahan EF Core dan bila untuk menggunakan AsNoTracking bagi titik akhir yang banyak bacaan.
no: Forklar EF Core-endringssporing og når du skal bruke AsNoTracking for leseintensive endepunkter.
pl: Wyjaśnij śledzenie zmian w EF Core i kiedy używać AsNoTracking dla punktów końcowych z dużą liczbą odczytów.
pt: Explique o rastreamento de alterações do EF Core e quando usar AsNoTracking para endpoints com alto volume de leitura.
ru: Объясните отслеживание изменений в EF Core и когда использовать AsNoTracking для конечных точек с высокой загрузкой на чтение.
sv: Förklara EF Core förändringsspårning och när man ska använda AsNoTracking för lästunga ändpunkter.
th: อธิบายการติดตามการเปลี่ยนแปลง EF Core และเมื่อใดที่จะใช้ AsNoTracking สำหรับเอ็นดพอยต์ที่มีการอ่านหนัก
tr: EF Core değişiklik takibini ve okuma ağırlıklı uç noktalar için AsNoTracking'i ne zaman kullanacağınızı açıklayın.
uk: Поясніть відстеження змін EF Core та коли використовувати AsNoTracking для кінцевих точок із великим обсягом читання.
vi: Giải thích theo dõi thay đổi EF Core và khi nào nên sử dụng AsNoTracking cho các điểm cuối đọc nhiều.

source: Explain how React reconciliation works and how it affects performance.
ar: اشرح كيف يعمل التوفيق في React وكيف يؤثر على الأداء.
be: Патлумачце, як працуе рэактыўнае ўзгадненне і як гэта ўплывае на прадукцыйнасць.
da: Forklar hvordan React-reconciliation fungerer, og hvordan det påvirker ydeevnen.
de: Erklären Sie, wie die React-Reconciliation funktioniert und wie sie die Leistung beeinflusst.
es: Explica cómo funciona la reconciliación en React y cómo afecta al rendimiento.
fr: Expliquez comment fonctionne la réconciliation de React et comment elle affecte les performances.
id: Jelaskan bagaimana rekonsiliasi React bekerja dan bagaimana hal itu mempengaruhi kinerja.
it: Spiega come funziona la riconciliazione di React e come influisce sulle prestazioni.
ja: Reactのリコンシリエーション（調整）がどのように機能するか、そしてそれがパフォーマンスにどのように影響するかを説明してください。
ms: Terangkan bagaimana penyatuan React berfungsi dan bagaimana ia mempengaruhi prestasi.
no: Forklar hvordan React-rekonsiliering fungerer og hvordan det påvirker ytelsen.
pl: Wyjaśnij, jak działa uzgadnianie w React i jak wpływa na wydajność.
pt: Explique como funciona a reconciliação do React e como ela afeta o desempenho.
ru: Объясните, как работает реконcиляция в React и как это сказывается на производительности.
sv: Förklara hur React-rekonciliationsprocessen fungerar och hur den påverkar prestandan.
th: อธิบายการทำงานของการประสานใน React และการที่มันส่งผลต่อประสิทธิภาพอย่างไร
tr: React uzlaşmasının nasıl çalıştığını ve performansı nasıl etkilediğini açıklayın.
uk: Поясніть, як працює узгодження в React і як воно впливає на продуктивність.
vi: Giải thích cách thức hoạt động của quá trình hòa giải trong React và nó ảnh hưởng như thế nào đến hiệu suất.

source: Explain it in plain words
ar: اشرحها بكلمات بسيطة
be: Патлумачце гэта простымі словамі
da: Forklar det med enkle ord
de: Erklären Sie es in einfachen Worten
es: Explícalo en palabras sencillas
fr: Expliquez-le en termes simples
id: Jelaskan dengan kata-kata sederhana
it: Spiegalo in parole semplici
ja: 簡単な言葉で説明してください
no: Forklar det med enkle ord
pl: Wyjaśnij to prostymi słowami
pt: Explique em palavras simples
ru: Объясните это простыми словами
sv: Förklara det med enkla ord
th: อธิบายในคำพูดง่ายๆ
tr: Basit kelimelerle açıkla
uk: Поясніть простими словами
vi: Giải thích nó bằng từ ngữ đơn giản

source: Explain request handling in ASP.NET Core
ar: اشرح معالجة الطلبات في ASP.NET Core
be: Патлумачце апрацоўку запытаў у ASP.NET Core
da: Forklar anmodningshåndtering i ASP.NET Core
de: Erklären Sie die Verarbeitung von Anfragen in ASP.NET Core
es: Explicar el manejo de solicitudes en ASP.NET Core
fr: Expliquez la gestion des requêtes dans ASP.NET Core
id: Menjelaskan penanganan permintaan dalam ASP.NET Core
it: Spiega la gestione delle richieste in ASP.NET Core
ja: ASP.NET Core でのリクエスト ハンドリングを説明する
ms: Terangkan pengendalian permintaan dalam ASP.NET Core
no: Forklar forespørselsbehandling i ASP.NET Core
pl: Wyjaśnij obsługę żądań w ASP.NET Core
pt: Explique o tratamento de solicitações no ASP.NET Core
ru: Объясните обработку запросов в ASP.NET Core
sv: Förklara hantering av förfrågningar i ASP.NET Core
th: อธิบายการจัดการคำขอใน ASP.NET Core
tr: ASP.NET Core'da istek işleme sürecini açıkla
uk: Поясніть обробку запитів у ASP.NET Core
vi: Giải thích việc xử lý yêu cầu trong ASP.NET Core

source: Explain REST, versioning, idempotency, and resiliency patterns with clarity.
ar: اشرح REST، التحكم في الإصدارات، خاصية عدم التأثر بالتكرار، وأنماط المرونة بوضوح.
be: Патлумачце REST, версіянаванне, ідэмпатэнтнасць і ўзоры стойкасці з яснасцю.
da: Forklar REST, versioning, idempotens, og resiliencymønstre med klarhed.
de: Erklären Sie REST, Versionierung, Idempotenz und Resilienz-Muster mit Klarheit.
es: Explica REST, versionamiento, idempotencia y patrones de resiliencia con claridad.
fr: Expliquez REST, le versioning, l'idempotence et les motifs de résilience avec clarté.
id: Jelaskan REST, versioning, idempotency, dan pola-pola resiliensi dengan jelas.
it: Spiega REST, versioning, idempotency e resiliency patterns con chiarezza.
ja: REST、バージョニング、冪等性、およびレジリエンシーパターンを明確に説明します。
ms: Jelaskan REST, pengurusan versi, idempotensi, dan corak ketahanan dengan jelas.
no: Forklar REST, versjonering, idempotens og resiliensmønstre med klarhet.
pl: Wyjaśnij REST, wersjonowanie, idempotencję oraz wzorce odporności z jasnością.
pt: Explique REST, versionamento, idempotência e padrões de resiliência com clareza.
ru: Объясните REST, версионирование, идемпотентность и паттерны устойчивости с ясностью.
sv: Förklara REST, versionering, idempotens och resiliensmönster med tydlighet.
th: อธิบาย REST, การกำหนดรุ่น, การไม่ก่อผลกระทบซ้ำและรูปแบบความยืดหยุ่นอย่างชัดเจน
tr: REST, versiyonlama, idempotency ve esneklik desenlerini açık bir şekilde açıklayın.
uk: Поясніть REST, версіонування, ідемпотентність та стратегії стійкості з чіткістю.
vi: Giải thích REST, phiên bản hóa, tính idempotency, và các mẫu kháng chịu với sự rõ ràng.

source: Explain the basic concepts of React components and props.
ar: اشرح المفاهيم الأساسية لمكونات React والـ Props.
be: Патлумачце базавыя паняцці React кампанентаў і ўласцівасцей (props).
da: Forklar de grundlæggende koncepter for React-komponenter og props.
de: Erklären Sie die grundlegenden Konzepte von React-Komponenten und -Requisiten.
es: Explica los conceptos básicos de los componentes y las propiedades (props) en React.
fr: Expliquez les concepts de base des composants React et des props.
id: Jelaskan konsep dasar dari komponen dan props dalam React.
it: Spiega i concetti di base dei componenti React e delle props.
ja: Reactコンポーネントとプロップスの基本概念を説明してください。
no: Forklar de grunnleggende konseptene med React-komponenter og props.
pl: Wyjaśnij podstawowe pojęcia dotyczące komponentów i propsów w React.
pt: Explique os conceitos básicos de componentes e props do React.
ru: Объясните основные концепции компонентов и свойств (props) в React.
sv: Förklara de grundläggande koncepten av React-komponenter och rekvisita (props).
th: อธิบายแนวคิดพื้นฐานของคอมโพเนนต์และพร็อพใน React
tr: React bileşenlerinin ve prop'ların temel kavramlarını açıklayın.
uk: Поясніть основні поняття компонентів і пропсів у React.
vi: Giải thích các khái niệm cơ bản về các thành phần và thuộc tính trong React.

source: Explain the difference between == and === in JavaScript.
ar: اشرح الفرق بين == و === في JavaScript.
be: Растлумачце розніцу паміж == і === у JavaScript.
da: Forklar forskellen mellem == og === i JavaScript.
de: Erklären Sie den Unterschied zwischen == und === in JavaScript.
es: Explica la diferencia entre == y === en JavaScript.
fr: Expliquez la différence entre == et === en JavaScript.
id: Jelaskan perbedaan antara == dan === dalam JavaScript.
it: Spiega la differenza tra == e === in JavaScript.
ja: JavaScriptにおける == と === の違いを説明します。
no: Forklar forskjellen mellom == og === i JavaScript.
pl: Wyjaśnij różnicę między == a === w JavaScript.
pt: Explique a diferença entre == e === em JavaScript.
ru: Объясните разницу между == и === в JavaScript.
sv: Förklara skillnaden mellan == och === i JavaScript.
th: อธิบายความแตกต่างระหว่าง == และ === ใน JavaScript
tr: JavaScript'te == ve === operatörleri arasındaki farkı açıklayın.
uk: Поясніть різницю між == та === у JavaScript.
vi: Giải thích sự khác biệt giữa == và === trong JavaScript.

source: Explain trade-offs like a senior
ar: اشرح المقايضات مثل شخص ذو خبرة
be: Патлумачце кампрамісы, як старшы спецыяліст
da: Forklar afvejninger som en senior
de: Erkläre Kompromisse wie ein Senior
es: Explica compensaciones como un senior
fr: Expliquez les compromis comme un enseignant expérimenté
id: Jelaskan kompromi seperti seorang senior
it: Spiega i compromessi come un esperto senior
ja: トレードオフをシニアのように説明する
no: Forklar kompromisser som en senior
pl: Wyjaśnij kompromisy jak doświadczony specjalista
pt: Explique concessões como um veterano
ru: Объясните компромиссы как опытный специалист
sv: Förklara kompromisser som en senior
th: อธิบายการแลกเปลี่ยนประโยชน์หรือค่าใช้จ่ายเป็นเหมือนผู้ที่มีประสบการณ์
tr: Tavizleri üst düzey biri gibi açıklayın
uk: Поясніть компроміси, як старший спеціаліст
vi: Giải thích sự đánh đổi như một người cao cấp

source: Explain your steps (reproduce, isolate, fix, verify)
ar: اشرح خطواتك (إعادة الإنتاج، العزل، الإصلاح، التحقق)
be: Патлумачце вашыя дзеянні (аднавіць, ізаляваць, выправіць, праверыць)
da: Forklar dine trin (reproducere, isolere, rette, bekræfte)
de: Erklären Sie Ihre Schritte (reproduzieren, isolieren, beheben, überprüfen)
es: Explica tus pasos (reproducir, aislar, corregir, verificar)
fr: Expliquez vos étapes (reproduire, isoler, corriger, vérifier)
id: Jelaskan langkah Anda (memproduksi ulang, mengisolasi, memperbaiki, memverifikasi)
it: Spiega i tuoi passaggi (riproduci, isola, risolvi, verifica)
ja: 手順を説明する（再現、特定、修正、検証）
no: Forklar trinnene dine (reprodusere, isolere, fikse, verifisere)
pl: Wyjaśnij swoje kroki (odtwórz, wyizoluj, napraw, zweryfikuj)
pt: Explique suas etapas (reproduzir, isolar, corrigir, verificar)
ru: Объясните ваши шаги (воспроизведение, изоляция, исправление, проверка)
sv: Förklara dina steg (återskapa, isolera, fixa, verifiera)
th: อธิบายขั้นตอนของคุณ (ทำซ้ำ, แยกปัญหา, แก้ไข, ตรวจสอบ)
tr: Adımlarınızı açıklayın (yeniden üret, izole et, düzelt, doğrula)
uk: Поясніть ваші кроки (відтворення, ізоляція, виправлення, перевірка)
vi: Giải thích các bước của bạn (tái tạo, cách ly, sửa chữa, xác minh)

source: Explore Role-Play Scenarios
ar: استكشاف سيناريوهات تبادل الأدوار
be: Даследуйце сітуацыі для ролавай гульні
da: Udforsk Rollespilsscenarier
de: Erforschen Sie Rollenspiel-Szenarien
es: Explorar Escenarios de Juego de Rol
fr: Explorez les scénarios de jeu de rôle
id: Jelajahi Skenario Peran
it: Esplora scenari di ruolo
ja: 役割演技シナリオを探る
ms: Jelajahi Senario Peranan
no: Utforsk rollespillscenarioer
pl: Zbadaj scenariusze odgrywania ról
pt: Explore Cenários de Role-Play
ru: Исследуйте сценарии ролевых игр
sv: Utforska Rollspelsscenarier
th: สำรวจสถานการณ์บทบาทสมมติ
tr: Rol Oynama Senaryolarını Keşfedin
uk: Досліджуйте сценарії рольової гри
vi: Khám Phá Các Kịch Bản Đóng Vai

source: Explore techniques to talk about wellness and mental well-being.
ar: استكشف التقنيات للحديث عن العافية والرفاهية النفسية.
be: Даследуйце тэхнікі для размовы пра фізічнае здароўе і псіхічнае благапалучча.
da: Udforsk teknikker til at tale om velvære og mental sundhed.
de: Erkunden Sie Techniken, um über Wellness und psychisches Wohlbefinden zu sprechen.
es: Explora técnicas para hablar sobre bienestar y salud mental.
fr: Explorez des techniques pour parler de bien-être et de santé mentale.
id: Jelajahi teknik untuk berbicara tentang kesejahteraan dan kesehatan mental.
it: Esplora tecniche per parlare di benessere e salute mentale.
ja: ウェルネスとメンタルヘルスについて話すための技術を探究しましょう。
ms: Terokai teknik untuk bercakap tentang kesihatan dan kesejahteraan mental.
no: Utforsk teknikker for å snakke om velvære og mental helse.
pl: Odkrywaj techniki, aby rozmawiać o zdrowiu i dobrym samopoczuciu psychicznym.
pt: Explore técnicas para falar sobre bem-estar e saúde mental.
ru: Изучайте техники для обсуждения здоровья и психического благополучия.
sv: Utforska tekniker för att prata om välbefinnande och mental hälsa.
th: สำรวจเทคนิคในการสนทนาเกี่ยวกับสุขภาพร่างกายและสุขภาพจิต.
tr: Sağlık ve zihinsel iyi oluş hakkında konuşma tekniklerini keşfedin.
uk: Досліджуйте методи розмови про здоров'я та психічне благополуччя.
vi: Khám phá các kỹ thuật để nói về sức khỏe và tâm lý.
