Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Get full access to all features. Practice real interviews, get AI feedback, and see your full analysis. We use a card to prevent abuse and give you uninterrupted access to all features.
ar: احصل على وصول كامل إلى جميع الميزات. قم بتطبيق المقابلات الحقيقية، واحصل على تعليقات الذكاء الاصطناعي، وشاهد كامل تحليلك. نحن نستخدم بطاقة لمنع الإساءة ومنحك وصولاً غير منقطع إلى جميع الميزات.
be: Атрымайце поўны доступ да ўсіх функцый. Практыкуйце сапраўдныя інтэрв'ю, атрымлівайце зваротную сувязь ад AI і глядзіце свой поўны аналіз. Мы выкарыстоўваем картку, каб прадухіліць злоўжыванне і даць вам бесперапынны доступ да ўсіх функцый.
da: Få fuld adgang til alle funktioner. Praktiser rigtige interviews, få AI-feedback, og se din fulde analyse. Vi bruger et kort til at forhindre misbrug og give dig uafbrudt adgang til alle funktioner.
de: Erhalten Sie vollen Zugriff auf alle Funktionen. Üben Sie echte Vorstellungsgespräche, erhalten Sie KI-Feedback und sehen Sie Ihre vollständige Analyse. Wir verwenden eine Karte, um Missbrauch zu verhindern und Ihnen ununterbrochenen Zugang zu allen Funktionen zu bieten.
es: Obtén acceso completo a todas las funciones. Practica entrevistas reales, recibe retroalimentación de IA y ve tu análisis completo. Usamos una tarjeta para prevenir abusos y darte acceso ininterrumpido a todas las funciones.
fr: Accédez à toutes les fonctionnalités. Entraînez-vous à de véritables entretiens, recevez des retours d'IA, et consultez votre analyse complète. Nous utilisons une carte pour prévenir les abus et vous donner un accès ininterrompu à toutes les fonctionnalités.
id: Dapatkan akses penuh ke semua fitur. Latih wawancara nyata, dapatkan umpan balik AI, dan lihat analisis penuh Anda. Kami menggunakan kartu untuk mencegah penyalahgunaan dan memberi Anda akses tanpa gangguan ke semua fitur.
it: Ottieni accesso completo a tutte le funzionalità. Pratica interviste reali, ottieni feedback dall'IA e visualizza la tua analisi completa. Utilizziamo una carta per prevenire gli abusi e darti accesso senza interruzioni a tutte le funzionalità.
ja: すべての機能へのフルアクセスを獲得しましょう。実際のインタビューを練習し、AIフィードバックを受け取り、完全な分析を確認できます。不正利用を防ぎ、すべての機能に中断なくアクセスするためにカードを使用します。
ms: Dapatkan akses penuh kepada semua ciri. Berlatih temu bual sebenar, dapatkan maklum balas AI, dan lihat analisis penuh anda. Kami menggunakan kad untuk mencegah penyalahgunaan dan memberikan anda akses tanpa gangguan kepada semua ciri.
no: Få full tilgang til alle funksjoner. Øv på ekte intervjuer, få AI-tilbakemelding, og se din fullstendige analyse. Vi bruker et kort for å forhindre misbruk og gi deg uavbrutt tilgang til alle funksjoner.
pl: Uzyskaj pełen dostęp do wszystkich funkcji. Ćwicz prawdziwe rozmowy kwalifikacyjne, otrzymuj opinie od AI i zobacz pełną analizę swoich wyników. Używamy karty w celu zapobiegania nadużyciom oraz zapewnienia Ci nieprzerwanego dostępu do wszystkich funkcji.
pt: Obtenha acesso total a todos os recursos. Pratique entrevistas reais, receba feedback de IA e veja sua análise completa. Usamos um cartão para prevenir abusos e proporcionar a você acesso ininterrupto a todos os recursos.
ru: Получите полный доступ ко всем функциям. Практикуйте настоящие интервью, получайте обратную связь от ИИ и просматривайте полный анализ. Мы используем карту для предотвращения злоупотреблений и предоставления вам непрерывного доступа ко всем функциям.
sv: Få full åtkomst till alla funktioner. Öva på riktiga intervjuer, få AI-återkoppling och se din fullständiga analys. Vi använder ett kort för att förhindra missbruk och ge dig oavbruten åtkomst till alla funktioner.
th: รับสิทธิ์การเข้าถึงคุณสมบัติทั้งหมด ฝึกซ้อมการสัมภาษณ์จริง รับข้อเสนอแนะจาก AI และดูการวิเคราะห์ของคุณทั้งหมด เราใช้บัตรเพื่อป้องกันการใช้งานในทางที่ผิดและมอบการเข้าถึงคุณสมบัติทั้งหมดให้คุณอย่างต่อเนื่อง
tr: Tüm özelliklere tam erişim sağlayın. Gerçek mülakatları pratiğe dökün, yapay zeka geri bildirimi alın ve tam analizlerini görün. Kötüye kullanımı önlemek ve bütün özelliklere kesintisiz erişim sağlamak için bir kart kullanıyoruz.
uk: Отримайте повний доступ до всіх функцій. Практикуйте реальні інтерв'ю, отримуйте зворотний зв'язок від штучного інтелекту та переглядайте ваш повний аналіз. Ми використовуємо карту, щоб запобігти зловживанням і надати вам безперервний доступ до всіх функцій.
vi: Được truy cập đầy đủ tất cả các tính năng. Thực hành phỏng vấn thực tế, nhận phản hồi từ AI và xem phân tích toàn diện của bạn. Chúng tôi sử dụng thẻ để ngăn chặn lạm dụng và cung cấp cho bạn quyền truy cập không gián đoạn vào tất cả các tính năng.

source: Get immediate feedback and explanations on your grammar mistakes as you practice. Enhance your speaking accuracy naturally.
ar: احصل على تغذية راجعة فورية وشرح للأخطاء النحوية الخاصة بك أثناء الممارسة. حسّن دقة حديثك بشكل طبيعي.
be: Атрымайце негайны водгук і тлумачэнні на вашы памылкі па граматыцы падчас практыкі. Паляпшыце вашу маўленчы акуратнасць натуральна.
da: Få øjeblikkelig feedback og forklaringer på dine grammatikkfejl, mens du øver. Forbedr din talefærdighed naturligt.
de: Erhalten Sie sofortiges Feedback und Erklärungen zu Ihren Grammatikfehlern, während Sie üben. Verbessern Sie Ihre Sprechgenauigkeit auf natürliche Weise.
es: Obtén retroalimentación inmediata y explicaciones sobre tus errores gramaticales mientras practicas. Mejora tu precisión al hablar de forma natural.
fr: Obtenez des retours immédiats et des explications sur vos erreurs de grammaire pendant que vous pratiquez. Améliorez votre précision à l'oral naturellement.
id: Dapatkan umpan balik dan penjelasan segera mengenai kesalahan gramatikal Anda saat Anda berlatih. Tingkatkan akurasi bicara Anda secara alami.
it: Ricevi feedback immediato e spiegazioni sui tuoi errori grammaticali mentre pratichi. Migliora la tua precisione nel parlare in modo naturale.
ja: 即座にフィードバックを受け取り、練習中の文法の間違いについて説明を受けましょう。自然にスピーキングの正確性を向上させます。
ms: Dapatkan maklum balas serta penjelasan segera mengenai kesalahan tatabahasa anda semasa anda berlatih. Tingkatkan ketepatan pertuturan anda secara semula jadi.
no: Få umiddelbar tilbakemelding og forklaringer på grammatikkfeilene dine mens du øver. Forbedre talepresisjonen din på en naturlig måte.
pl: Uzyskaj natychmiastową informację zwrotną i wyjaśnienia dotyczące swoich błędów gramatycznych podczas ćwiczeń. Naturalnie popraw swoją dokładność w mówieniu.
pt: Receba feedback imediato e explicações sobre seus erros gramaticais enquanto pratica. Melhore sua precisão ao falar de forma natural.
ru: Получайте незамедлительные отзывы и объяснения по вашим грамматическим ошибкам в процессе практики. Улучшайте свою речь естественным образом.
sv: Få omedelbar feedback och förklaringar på dina grammatikfel medan du övar. Förbättra din talnoggrannhet på ett naturligt sätt.
th: รับข้อเสนอแนะแบบทันทีและคำอธิบายเกี่ยวกับความผิดพลาดทางไวยากรณ์ของคุณขณะฝึกฝน ปรับปรุงความแม่นยำในการพูดของคุณอย่างเป็นธรรมชาติ
tr: Hızla pratik yaparken dilbilgisi hatalarınızla ilgili anında geri bildirim ve açıklamalar alın. Konuşma doğruluğunuzu doğal bir şekilde artırın.
uk: Отримуйте миттєвий зворотний зв'язок та пояснення ваших граматичних помилок під час практики. Підвищуйте свою точність у говорінні природно.
vi: Nhận phản hồi và giải thích ngay lập tức về những lỗi ngữ pháp của bạn khi bạn luyện tập. Nâng cao độ chính xác trong việc nói của bạn một cách tự nhiên.

source: Get in touch with the FluencyPal for any inquiries, support, or feedback.
ar: تواصل مع FluencyPal لأي استفسارات أو دعم أو ملاحظات.
be: Звяжыцеся з FluencyPal для любых запытаў, падтрымкі або водгукаў.
da: Få kontakt med FluencyPal for eventuelle forespørgsler, support eller feedback.
de: Nehmen Sie Kontakt mit dem FluencyPal auf, für Anfragen, Unterstützung oder Feedback.
es: Póngase en contacto con FluencyPal para cualquier consulta, soporte o comentario.
fr: Contactez le FluencyPal pour toute demande, support ou retour d'expérience.
id: Hubungi FluencyPal untuk pertanyaan, dukungan, atau umpan balik.
it: Contatta FluencyPal per qualsiasi domanda, supporto o feedback.
ja: FluencyPalにお問い合わせ、ご支援、またはフィードバックがある場合は、お気軽にご連絡ください。
ms: Dapatkan sentuhan dengan FluencyPal untuk sebarang pertanyaan, sokongan, atau maklum balas.
no: Ta kontakt med FluencyPal for eventuelle henvendelser, support eller tilbakemeldinger.
pl: Skontaktuj się z FluencyPal w przypadku wszelkich zapytań, wsparcia lub opinii.
pt: Entre em contato com o FluencyPal para quaisquer perguntas, suporte ou feedback.
ru: Связаться с FluencyPal по любым вопросам, поддержке или отзывам.
sv: Kontakta FluencyPal för eventuella frågor, support eller feedback.
th: ติดต่อกับ FluencyPal สำหรับคำถาม, การสนับสนุน, หรือข้อเสนอแนะแต่ละข้อ
tr: FluencyPal ile herhangi bir soru, destek veya geri bildirim için iletişime geçin.
uk: Зв'яжіться з FluencyPal для будь-яких запитів, підтримки або відгуків.
vi: Liên hệ với FluencyPal để biết thêm thông tin, hỗ trợ hoặc phản hồi.

source: Get inspired and learn about the latest trends in language learning, teaching, and technology.
ar: احصل على الإلهام وتعرّف على أحدث الاتجاهات في تعلم اللغة، والتدريس، والتكنولوجيا.
be: Атрымайце натхненне і даведайцеся пра апошнія трэнды ў вучэнні моваў, навучанні і тэхналогіях.
da: Bliv inspireret og lær om de nyeste trends inden for sprogindlæring, undervisning og teknologi.
de: Lass dich inspirieren und erfahre mehr über die neuesten Trends im Sprachenlernen, Unterrichten und in der Technologie.
es: Inspírate y aprende sobre las últimas tendencias en el aprendizaje de idiomas, la enseñanza y la tecnología.
fr: Obtenez de l'inspiration et découvrez les dernières tendances en matière d'apprentissage des langues, d'enseignement et de technologie.
id: Dapatkan inspirasi dan pelajari tren terbaru dalam pembelajaran bahasa, pengajaran, dan teknologi.
it: Lasciati ispirare e scopri le ultime tendenze nell'apprendimento delle lingue, nell'insegnamento e nella tecnologia.
ja: インスピレーションを得て、言語学習、教育、テクノロジーの最新トレンドについて学びましょう。
ms: Dapatkan inspirasi dan pelajari tentang trend terkini dalam pembelajaran bahasa, pengajaran, dan teknologi.
no: Bli inspirert og lær om de nyeste trendene innen språkinnlæring, undervisning og teknologi.
pl: Zainspiruj się i dowiedz się o najnowszych trendach w nauce języków, nauczaniu i technologii.
pt: Inspire-se e aprenda sobre as últimas tendências em aprendizagem de idiomas, ensino e tecnologia.
ru: Получите вдохновение и узнайте о последних тенденциях в изучении языков, преподавании и технологиях.
sv: Bli inspirerad och lär dig om de senaste trenderna inom språkinlärning, undervisning och teknik.
th: ได้รับแรงบันดาลใจและเรียนรู้เกี่ยวกับแนวโน้มล่าสุดในด้านการเรียนรู้ภาษา การสอน และเทคโนโลยี。
tr: İlham alın ve dil öğrenimi, öğretimi ve teknolojideki en son trendler hakkında bilgi edinin.
uk: Надихайтеся та дізнавайтеся про останні тенденції в вивченні мов, навчанні та технологіях.
vi: Lấy cảm hứng và tìm hiểu về những xu hướng mới nhất trong việc học ngôn ngữ, giảng dạy và công nghệ.

source: Get instant AI feedback on clarity, vocabulary, and flow — while you speak.
ar: احصل على ردود فعل فورية من الذكاء الاصطناعي حول الوضوح والمفردات وتدفق الكلام - أثناء حديثك.
be: Атрымаеце імгненную зваротную сувязь ад AI па яснасці, слоўніку і плыні — пакуль вы размаўляеце.
da: Få øjeblikkelig AI-feedback på klarhed, ordforråd og flow — mens du taler.
de: Erhalten Sie sofortiges KI-Feedback zu Klarheit, Wortschatz und Fluss — während Sie sprechen.
es: Obtén comentarios instantáneos de IA sobre claridad, vocabulario y fluidez mientras hablas.
fr: Obtenez un retour d'information instantané de l'IA sur la clarté, le vocabulaire et le débit — pendant que vous parlez.
id: Dapatkan umpan balik AI instan tentang kejelasan, kosakata, dan aliran — saat Anda berbicara.
it: Ottieni feedback istantaneo dall'IA su chiarezza, vocabolario e flusso — mentre parli.
ja: 話している間に、明瞭さ、語彙、流れについて即座にAIフィードバックを得ることができます。
no: Få øyeblikkelige AI-tilbakemeldinger på klarhet, vokabular og flyt — mens du snakker.
pl: Uzyskaj natychmiastową informację zwrotną od AI na temat klarowności, słownictwa i płynności — podczas mówienia.
pt: Receba feedback instantâneo de IA sobre clareza, vocabulário e fluência — enquanto você fala.
ru: Получайте мгновенную обратную связь от ИИ о ясности, словарном запасе и плавности — во время разговора.
sv: Få omedelbar AI-återkoppling om tydlighet, ordförråd och flöde — medan du pratar.
th: รับข้อเสนอแนะจาก AI ทันทีเกี่ยวกับความชัดเจน คำศัพท์ และการไหลลื่น — ในขณะที่คุณพูด
tr: Konuştukça açıklık, kelime dağarcığı ve akıcılık üzerine anında AI geri bildirimi alın.
uk: Отримуйте миттєвий зворотний зв’язок від ШІ щодо ясності, словникового запасу та плавності — під час вашої розмови.
vi: Nhận phản hồi tức thì từ AI về độ rõ ràng, từ vựng và mức độ trôi chảy — khi bạn nói.

source: Get instant AI feedback on structure, clarity, and senior-level reasoning — before the real interview.
ar: احصل على ملاحظات فورية من الذكاء الاصطناعي حول الهيكل والوضوح والتفكير على مستوى عالٍ - قبل المقابلة الحقيقية.
be: Атрымайце імгненную зваротную сувязь ад AI аб структуры, яснасці і мысленні на ўзроўні старшага спецыяліста — перад сапраўдным інтэрв'ю.
da: Få øjeblikkelig AI-feedback på struktur, klarhed og fornuft på seniorniveau — før den rigtige samtale.
de: Erhalten Sie sofortiges AI-Feedback zu Struktur, Klarheit und fortgeschrittenem Denkvermögen – noch vor dem eigentlichen Vorstellungsgespräch.
es: Obtén retroalimentación instantánea de IA sobre la estructura, claridad y razonamiento a nivel senior — antes de la entrevista real.
fr: Obtenez un retour d'information instantané de l'IA sur la structure, la clarté et le raisonnement de niveau senior — avant le véritable entretien.
id: Dapatkan umpan balik instan dari AI tentang struktur, kejelasan, dan pemikiran tingkat senior — sebelum wawancara sebenarnya.
it: Ottieni feedback istantaneo dall'IA su struttura, chiarezza e ragionamento di livello senior — prima del vero colloquio.
ja: 構造、明瞭さ、上級レベルの推論についての即時AIフィードバックを実際の面接の前に受け取りましょう。
no: Få umiddelbar AI-tilbakemelding på struktur, klarhet og seniornivå resonnering — før det virkelige intervjuet.
pl: Uzyskaj natychmiastową informację zwrotną od AI na temat struktury, jasności i rozumowania na poziomie zaawansowanym — zanim odbędzie się prawdziwa rozmowa kwalifikacyjna.
pt: Obtenha feedback instantâneo da IA sobre estrutura, clareza e raciocínio de nível sênior — antes da entrevista real.
ru: Получите мгновенную обратную связь от ИИ по структуре, ясности и уровню мышления для старших специалистов — до настоящего собеседования.
sv: Få omedelbar AI-feedback på struktur, klarhet och resonemang på seniornivå — innan den riktiga intervjun.
th: รับความคิดเห็นจาก AI ทันทีเกี่ยวกับโครงสร้าง ความชัดเจน และการให้เหตุผลในระดับสูง — ก่อนการสัมภาษณ์จริง
tr: Gerçek mülakat öncesinde yapı, açıklık ve üst düzey akıl yürütme konularında anında AI geri bildirimi alın.
uk: Отримайте миттєвий зворотний зв'язок від AI щодо структури, чіткості та міркувань на рівні старшого спеціаліста — ще до справжньої співбесіди.
vi: Nhận phản hồi từ AI ngay lập tức về cấu trúc, sự rõ ràng, và lý luận cấp cao — trước khi tham gia phỏng vấn thực sự.

source: Get My Plan
ar: احصل على خطتي
be: Атрымаць мой план
da: Få Min Plan
de: Erhalte Meinen Plan
es: Obtén Mi Plan
fr: Obtenez Mon Plan
id: Dapatkan Rencana Saya
it: Ottieni il mio piano
ja: プランを取得
no: Få Min Plan
pl: Uzyskaj Mój Plan
pt: Obter Meu Plano
ru: Получить мой план
sv: Få Min Plan
th: รับแผนของฉัน
tr: Planımı Al
uk: Отримати Мій План
vi: Nhận Kế Hoạch Của Tôi

source: Get new words and phrases in context
ar: احصل على كلمات وعبارات جديدة في السياق
be: Атрымлівайце новыя словы і фразы ў кантэксце
da: Få nye ord og sætninger i kontekst
de: Erhalte neue Wörter und Redewendungen im Kontext
es: Obtén nuevas palabras y frases en contexto
fr: Obtenez de nouveaux mots et expressions dans le contexte
id: Dapatkan kata-kata dan frasa baru dalam konteks
it: Ottieni nuove parole e frasi nel contesto
ja: コンテキスト内で新しい単語とフレーズを習得する
ms: Dapatkan perkataan dan frasa baru dalam konteks
no: Få nye ord og uttrykk i kontekst
pl: Poznaj nowe słowa i zwroty w kontekście
pt: Obtenha novas palavras e frases no contexto
ru: Получайте новые слова и фразы в контексте
sv: Få nya ord och fraser i sammanhang
th: รับคำศัพท์และวลีใหม่ๆ ในบริบท
tr: Bağlamda yeni kelimeler ve ifadeler edinin
uk: Отримуйте нові слова та фрази в контексті
vi: Nhận từ vựng và cụm từ mới trong ngữ cảnh

source: Get Ready
id: Bersiaplah
it: Preparati
ja: 準備する
no: Gjør deg klar
ru: Готовьтесь
uk: Готуйтеся

source: Get Started
ar: ابدأ
be: Пачаць
da: Kom Igang
de: Loslegen
es: Comenzar
fr: Commencer
id: Mulai
it: Inizia
ja: 開始する
ms: Mula
no: Kom i gang
pl: Rozpocznij
pt: Comece Agora
ru: Начать
sv: Kom Igång
th: เริ่มต้น
tr: Başla
uk: Почати
vi: Bắt Đầu

source: Get Started Free
ar: ابدأ مجانًا
be: Пачаць бясплатна
da: Kom i gang gratis
de: Kostenlos starten
es: Comienza Gratis
fr: Commencez gratuitement
id: Mulai Secara Gratis
it: Inizia Gratis
ja: 無料で始める
ms: Dapatkan Mula secara Percuma
no: Bli med gratis
pl: Zacznij za darmo
pt: Comece Grátis
ru: Начать бесплатно
sv: Börja gratis
th: เริ่มต้นฟรี
tr: Ücretsiz Başlayın
uk: Розпочати безкоштовно
vi: Bắt đầu miễn phí

source: Get started with basic features
ar: ابدأ باستخدام الميزات الأساسية
be: Пачніце з базавых функцый
da: Kom i gang med grundlæggende funktioner
de: Loslegen mit grundlegenden Funktionen
es: Comience con las funciones básicas
fr: Commencez avec les fonctionnalités de base
id: Mulai dengan fitur dasar
it: Inizia con le funzionalità di base
ja: 基本機能を使い始める
no: Kom i gang med grunnleggende funksjoner
pl: Rozpocznij przygodę z podstawowymi funkcjami
pt: Comece com recursos básicos
ru: Начните с базовых функций
sv: Kom igång med grundläggande funktioner
th: เริ่มต้นด้วยคุณสมบัติพื้นฐาน
tr: Temel özelliklerle başlayın
uk: Розпочніть з основних функцій
vi: Bắt đầu với các tính năng cơ bản

source: Get unlimited access to AI-powered language practice
ar: احصل على وصول غير محدود لممارسة اللغة المدعومة بالذكاء الاصطناعي
be: Атрымаць неабмежаваны доступ да практыкі мовы, якую падтрымлівае AI
da: Få ubegrænset adgang til AI-drevet sprogtræning
de: Erhalten Sie unbegrenzten Zugang zu KI-gestütztem Sprachtraining
es: Obtén acceso ilimitado a la práctica de idiomas impulsada por IA
fr: Obtenez un accès illimité à la pratique linguistique alimentée par l'IA
id: Dapatkan akses tak terbatas untuk praktik bahasa yang didukung AI
it: Ottieni accesso illimitato a pratiche linguistiche potenziate dall'IA
ja: 無制限のAI駆動の言語練習へのアクセスを得る
ms: Dapatkan akses tanpa had kepada latihan bahasa yang dipacu AI
no: Få ubegrenset tilgang til AI-drevet språkøvelse
pl: Uzyskaj nieograniczony dostęp do językowej praktyki z AI.
pt: Obtenha acesso ilimitado à prática de idiomas com inteligência artificial
ru: Получите неограниченный доступ к языковой практике с использованием ИИ
sv: Få obegränsad tillgång till AI-drivna språkövningar
th: รับการเข้าถึงการฝึกฝนภาษาแบบไม่จำกัดที่ขับเคลื่อนด้วย AI
tr: Sonsuz AI destekli dil pratik erişimi edinin
uk: Отримайте необмежений доступ до мовної практики з підтримкою ШІ
vi: Nhận quyền truy cập không giới hạn vào việc thực hành ngôn ngữ hỗ trợ bởi AI

source: Gift
ar: هدية
be: Падарунак
da: Gave
de: Geschenk
es: Regalo
fr: Cadeau
id: Hadiah
it: Regalo
ja: ギフト
ms: Hadiah
no: Gave
pl: Prezent
pt: Presente
ru: Подарок
sv: Gåva
th: ของขวัญ
tr: Hediye
uk: Подарунок
vi: Quà tặng

source: Give a small example (counter, input, button)
ar: قدم مثالاً صغيرًا (عداد، إدخال، زر)
be: Дайце невялікі прыклад (лічыльнік, уваход, кнопка)
da: Giv et lille eksempel (tæller, input, knap)
de: Geben Sie ein kleines Beispiel (Zähler, Eingabe, Schaltfläche)
es: Dar un pequeño ejemplo (contador, entrada, botón)
fr: Donnez un petit exemple (compteur, entrée, bouton)
id: Berikan contoh kecil (penghitung, masukan, tombol)
it: Fornisci un piccolo esempio (contatore, input, pulsante)
ja: 小さな例を挙げる (カウンター、入力、ボタン)
no: Gi et lite eksempel (teller, inndata, knapp)
pl: Podaj mały przykład (licznik, wejście, przycisk)
pt: Forneça um pequeno exemplo (contador, entrada, botão)
ru: Дайте небольшой пример (счетчик, ввод, кнопка)
sv: Ge ett litet exempel (räknare, inmatning, knapp)
th: ให้ตัวอย่างขนาดเล็ก (ตัวนับ, อินพุต, ปุ่ม)
tr: Küçük bir örnek ver (sayaç, giriş, düğme)
uk: Дайте невеликий приклад (лічильник, введення, кнопка)
vi: Đưa ra một ví dụ nhỏ (bộ đếm, đầu vào, nút bấm)

source: Give us your feedback
ar: أعطنا ملاحظاتك
be: Дайце нам вашы водгукі
da: Giv os din feedback
de: Geben Sie uns Ihr Feedback
es: Danos tu opinión
fr: Donnez-nous votre avis
id: Beri kami umpan balik Anda
it: Dacci il tuo feedback
ja: フィードバックをお寄せください
ms: Berikan maklum balas anda
no: Gi oss din tilbakemelding
pl: Podziel się z nami swoją opinią
pt: Dê-nos o seu feedback
ru: Дайте нам свой отзыв
sv: Ge oss din feedback
th: ให้คำติชมของคุณแก่เรา
tr: Bize geri bildiriminizi verin
uk: Надішліть нам свої відгуки
vi: Hãy cho chúng tôi phản hồi của bạn

source: Global Chat
de: Globaler Chat
es: Chat Global
id: Obrolan Global
it: Chat Globale
ja: グローバルチャット
pl: Globalny czat
pt: Chat Global
ru: Глобальный чат
sv: Global chatt
th: Global Chat แชททั่วโลก
tr: Global Sohbet
uk: Глобальний чат
vi: Phòng Trò Chuyện Toàn Cầu

source: Go to Practice
ar: اذهب إلى التمرين
be: Перайсці да практыкі
da: Gå til Øvelse
de: Gehe zu Übung
es: Ir a la Práctica
fr: Aller à la pratique
id: Pergi ke Latihan
it: Vai a Pratica
ja: 練習に行く
no: Gå til Øvelse
pl: Przejdź do Ćwiczeń
pt: Vá para Prática
ru: Перейти к Практике
sv: Gå till Träning
th: ไปที่การฝึกฝน
tr: Pratik Yap
uk: Перейти до практики
vi: Đi đến Luyện tập

source: Go to Practice with AI
de: Gehe zu Übung mit KI
es: Ir a Practicar con IA
id: Pergi ke Latihan dengan AI
it: Vai alla Pratica con l'IA
ja: AIでの練習に進む
no: Gå til Øv med AI
pl: Przejdź do Ćwiczenia z AI
pt: Ir para Prática com IA
ru: Перейти к практике с ИИ
sv: Gå till Öva med AI
th: ไปที่การฝึกฝนกับ AI
tr: AI ile Pratik Yapmaya Git
uk: Перейти до практики з AI
vi: Đi đến Thực hành với AI

source: Go to the main page
ar: اذهب إلى الصفحة الرئيسية
be: Перайсці на галоўную старонку
da: Gå til hovedsiden
de: Gehe zur Hauptseite
es: Ir a la página principal
fr: Aller à la page principale
id: Pergi ke halaman utama
it: Vai alla pagina principale
ja: メインページに移動する
ms: Pergi ke halaman utama
no: Gå til hovedsiden
pl: Przejdź do strony głównej
pt: Vá para a página principal
ru: Перейти на главную страницу
sv: Gå till huvudsidan
th: ไปที่หน้าหลัก
tr: Ana sayfaya git
uk: Перейти на головну сторінку
vi: Đi đến trang chính

source: Goal
ar: هدف
be: Мэта
da: Mål
de: Ziel
es: Meta
fr: Objectif
id: Tujuan
it: Obiettivo
ja: 目標
ms: Matlamat
no: Mål
pl: Cel
pt: Meta
ru: Цель
sv: Mål
th: เป้าหมาย
tr: Hedef
uk: Мета
vi: Mục tiêu

source: Goal Role Play
es: Interpretación de Papel para Meta
id: Bermain Peran Tujuan
it: Gioco di Ruolo degli Obiettivi
ja: 目標ロールプレイ
no: Mål Rollespill
pl: Cel gry ról
pt: Meta Jogo de Papéis
ru: Целевая Ролевая Игра
sv: Mål Rollspel
uk: Цільова рольова гра

source: Goal Talk
es: Habla de Objetivos
id: Tujuan Bicara
it: Obiettivo Conversazione
ja: ゴールトーク
no: Målsamtale
pt: Meta Fala
ru: Целевая беседа
sv: Målprat
uk: Цільовий Розмовник
