Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Engineers switching from mid-level to senior roles and needing stronger behavioral stories
ar: المهندسون الذين ينتقلون من أدوار متوسطة إلى أدوار عليا ويحتاجون إلى قصص سلوكية أقوى
be: Інжынеры, якія пераходзяць з сярэдняга ўзроўню на старэйшыя ролі і маюць патрэбу ў больш моцных паводзінавых гісторыях
da: Ingeniører, der skifter fra mellemlederniveau til seniorroller og har brug for stærkere adfærdshistorier
de: Ingenieure, die von mittleren in Senior-Rollen wechseln und stärkere Verhaltensgeschichten benötigen
es: Ingenieros que pasan de roles de nivel medio a roles senior y necesitan historias conductuales más sólidas
fr: Les ingénieurs passant de postes intermédiaires à des rôles seniors et ayant besoin d'histoires comportementales plus solides
id: Insinyur yang beralih dari peran tingkat menengah ke peran senior dan membutuhkan cerita perilaku yang lebih kuat
it: Ingegneri che passano da ruoli di livello intermedio a ruoli senior e che necessitano di storie comportamentali più forti
ja: エンジニアがミッドレベルからシニアの役職に移行し、より強力な行動ストーリーを必要とする場合
ms: Jurutera yang beralih dari peranan pertengahan ke peranan kanan dan memerlukan cerita tingkah laku yang lebih kuat
no: Ingeniører som går fra mellomnivå til seniorroller og trenger sterkere atferdsfortellinger
pl: Inżynierowie przechodzący z ról średniego szczebla do seniorów i potrzebujący mocniejszych opowieści o zachowaniu
pt: Engenheiros mudando de cargos de nível intermediário para seniores e precisando de histórias comportamentais mais fortes
ru: Инженеры, переходящие с уровня среднего специалиста на уровень старшего специалиста и нуждающиеся в более сильных историях о поведении
sv: Ingenjörer som byter från medelnivå till seniora roller och behöver starkare beteendebaserade berättelser
th: วิศวกรที่เปลี่ยนจากตำแหน่งระดับกลางไปสู่ตำแหน่งอาวุโสและต้องการเรื่องราวทางพฤติกรรมที่เข้มแข็งขึ้น
tr: Orta düzeyden kıdemli rollere geçiş yapan mühendisler ve daha güçlü davranışsal hikayelere ihtiyaç duyanlar
uk: Інженери, які переходять з середнього рівня на старші посади та потребують більш потужних історій поведінки
vi: Các kỹ sư chuyển từ vai trò trung cấp lên cấp cao và cần những câu chuyện hành vi mạnh mẽ hơn

source: English Fluency
ar: طلاقة اللغة الإنجليزية
be: Свабода англійскай мовы
da: Engelsk Færdigheder
de: Englische Sprachgewandtheit
es: Fluidez en Inglés
fr: Fluence anglaise
id: Kefasihan Berbahasa Inggris
it: Fluenza in inglese
ja: 英語の流暢さ
ms: Kefasihan Bahasa Inggeris
no: Norsk Flytighet
pl: Płynność w języku angielskim
pt: Fluência em Inglês
ru: Английская беглость
sv: Engelsk flyt
th: ความคล่องแคล่วทางภาษาอังกฤษ
tr: İngilizce Akıcılığı
uk: Англійська Флюентність
vi: Thông thạo tiếng Anh

source: English fluency
ar: إتقان اللغة الإنجليزية
be: Валодаўладанне англійскай
da: Flydende engelsk
de: Englisch fließend
es: Fluidez en inglés
fr: Maîtrise de l'anglais
id: Kemampuan berbahasa Inggris
it: Fluenza in inglese
ja: 英語の流暢さ
ms: Kecekapan Bahasa Inggeris
no: Engelsk flytende
pl: Biegłość w języku angielskim
pt: Fluência em inglês
ru: Владение английским
sv: Flyt i engelska
th: ความชำนาญในภาษาอังกฤษ
tr: İngilizce akıcılığı
uk: Володіння англійською
vi: Sự lưu loát tiếng Anh

source: English for Professionals
ar: الإنجليزية للمحترفين
be: Англійская для прафесіяналаў
da: Engelsk for professionelle
de: Englisch für Fachleute
es: Inglés para Profesionales
fr: Anglais pour professionnels
id: Bahasa Inggris untuk Profesional
it: Inglese per Professionisti
ja: プロフェッショナルのための英語
ms: Inggeris untuk Profesional
no: Engelsk for Profesjonelle
pl: Angielski dla Profesjonalistów
pt: Inglês para Profissionais
ru: Английский для профессионалов
sv: Engelska för yrkesverksamma
th: อังกฤษสำหรับผู้เชี่ยวชาญ
tr: Profesyoneller için İngilizce
uk: Англійська для професіоналів
vi: Tiếng Anh cho Chuyên Gia

source: English interview mistakes
ar: أخطاء المقابلة باللغة الإنجليزية
be: Памылкі на англійскім у часе інтэрв'ю
da: Engelske interviewfejl
de: Fehler bei englischen Vorstellungsgesprächen
es: Errores en la entrevista en inglés
fr: Erreurs d'entretien en anglais
id: Kesalahan wawancara dalam bahasa Inggris
it: Errori nell'intervista in inglese
ja: 英語面接の間違い
ms: Kesilapan temu duga dalam bahasa Inggeris
no: Engelsk intervju-feil
pl: Błędy podczas angielskiej rozmowy kwalifikacyjnej
pt: Erros em entrevistas em inglês
ru: Ошибки на английском во время собеседования
sv: Engelska intervju misstag
th: ข้อผิดพลาดในการสัมภาษณ์ภาษาอังกฤษ
tr: İngilizce mülakat hataları
uk: Помилки англійської інтерв'ю
vi: Lỗi trong buổi phỏng vấn tiếng Anh

source: English job interview tips
ar: نصائح المقابلة الوظيفية باللغة الإنجليزية
be: Парады па правядзенні англійскага спікеру
da: Tips til engelsk jobinterview
de: Tipps für englische Vorstellungsgespräche
es: Consejos para entrevistas de trabajo en inglés
fr: Conseils pour un entretien d'embauche en anglais
id: Tips wawancara kerja dalam bahasa Inggris
it: Suggerimenti per il colloquio di lavoro in inglese
ja: 英語の面接のコツ
ms: Tip temuduga kerja dalam Bahasa Inggeris
no: Tips for engelsk jobbintervju
pl: Porady dotyczące rozmowy kwalifikacyjnej w języku angielskim
pt: Dicas para entrevistas de emprego em inglês
ru: Советы для англоязычного собеседования на работу
sv: Tips för engelska jobbintervjuer
th: ทิปส์สำหรับสัมภาษณ์งานภาษาอังกฤษ
tr: İngilizce iş görüşmesi ipuçları
uk: Поради щодо англійського співбесіди на роботу
vi: Mẹo phỏng vấn xin việc bằng tiếng Anh

source: English Learning Articles
ar: مقالات تعلم اللغة الإنجليزية
be: Артыкулы па навучанні англійскай мове
da: Dansk Læringsartikler
de: Deutsch Lernartikel
es: Artículos para Aprender Inglés
fr: Articles sur l'apprentissage de l'anglais
id: Artikel Pembelajaran Bahasa Inggris
it: Articoli per l'apprendimento dell'inglese
ja: 英語学習記事
ms: Artikel Pembelajaran Bahasa Inggeris
no: Artikler om engelsklæring
pl: Artykuły o nauce angielskiego
pt: Artigos sobre Aprendizado de Inglês
ru: Статьи по изучению английского языка
sv: Svenska Lärande Artiklar
th: บทความการเรียนรู้ภาษาอังกฤษ
tr: İngilizce Öğrenme Makaleleri
uk: Статті з вивчення англійської мови
vi: Bài viết về học tiếng Anh

source: English Learning Plan
ar: خطة تعلم الإنجليزية
be: План вучэння англійскай мовы
da: Engelsk Læringsplan
de: Englisch Lernplan
es: Plan de Aprendizaje de Inglés
fr: Plan d'Apprentissage de l'Anglais
id: Rencana Belajar Bahasa Inggris
it: Piano di Apprendimento dell'Inglese
ja: 英語学習プラン
ms: Rancangan Pembelajaran Bahasa Inggeris
no: Engelsk Læringsplan
pl: Plan Nauki Angielskiego
pt: Plano de Aprendizagem de Inglês
ru: План Изучения Английского
sv: Engelska Inlärningsplan
th: แผนการเรียนภาษาอังกฤษ
tr: İngilizce Öğrenme Planı
uk: План вивчення англійської
vi: Kế Hoạch Học Tiếng Anh

source: English Phrases
ar: عبارات إنجليزية
be: Англійскія фразы
da: Engelske sætninger
de: Englische Sätze
es: Frases en inglés
fr: Expressions anglaises
id: Frasa Bahasa Inggris
it: Frasi Inglesi
ja: 英語のフレーズ
ms: Frasa-frasa Inggeris
no: Engelske Fraser
pl: Angielskie Zwroty
pt: Frases em Inglês
ru: Английские фразы
sv: Engelska Fraser
th: วลีภาษาอังกฤษ
tr: İngilizce İfadeler
uk: Англійські фрази
vi: Cụm từ tiếng Anh

source: English Practice
ar: ممارسة اللغة الإنجليزية
be: Практыка англійскай
da: Engelsk Praksis
de: Englisch Übung
es: Práctica de Inglés
fr: Pratique de l'anglais
id: Latihan Bahasa Inggris
it: Pratica di inglese
ja: 英語の練習
ms: Amalan Bahasa Inggeris
no: Engelsk Praksis
pl: Praktyka angielskiego
pt: Prática de Inglês
ru: Практика английского
sv: Engelsk praktik
th: การฝึกภาษาอังกฤษ
tr: İngilizce Pratiği
uk: Практика англійської
vi: Thực hành tiếng Anh

source: English Practice Tips
ar: نصائح لممارسة اللغة الإنجليزية
be: Парады па практыцы англійскай мовы
da: Danish Practice Tips
de: Englisch Übungstipps
es: Consejos para Practicar Inglés
fr: Conseils de pratique en anglais
id: Tips Praktik Bahasa Inggris
it: Suggerimenti per la Pratica dell'Inglese
ja: 英語練習のヒント
ms: Tips Latihan Bahasa Inggeris
no: Norske Øvelsetips
pl: Porady dotyczące praktyki angielskiego
pt: Dicas de Prática de Inglês
ru: Советы по практике английского языка
sv: Svenska övningstips
th: เคล็ดลับการฝึกภาษาอังกฤษ
tr: İngilizce Pratik İpuçları
uk: Поради з практики англійської мови
vi: Mẹo thực hành tiếng Anh

source: English speaking coach
ar: مدرب اللغة الإنجليزية
be: Трэнер па размаўленні на англійскай мове
da: Engelsk talende coach
de: Englisch sprechender Coach
es: Entrenador de habla inglesa
fr: Coach de conversation en anglais
id: Pelatih berbicara bahasa Inggris
it: Allenatore di conversazione in inglese
ja: 英語スピーキングコーチ
ms: Jurulatih bercakap bahasa Inggeris
no: Engelsk talecoach
pl: Trener mówienia po angielsku
pt: Coach de fala em inglês
ru: Коуч по разговорному английскому
sv: Engelsktalande coach
th: โค้ชพูดภาษาอังกฤษ
tr: İngilizce konuşma eğitmeni
uk: Коуч з англійської мови
vi: Huấn luyện viên nói tiếng Anh

source: English Speaking Exercises
ar: تمارين التحدث باللغة الإنجليزية
be: Практычныя вправы па англійскай мове
da: Engelske Taleøvelser
de: Englische Sprechübungen
es: Ejercicios de habla en inglés
fr: Exercices de Parole en Anglais
id: Latihan Berbicara dalam Bahasa Inggris
it: Esercizi di Parlare in Inglese
ja: 英語スピーキング練習
ms: Latihan Berbicara dalam Bahasa Inggeris
no: Engelske taletreninger
pl: Ćwiczenia mówienia po angielsku
pt: Exercícios de Fala em Inglês
ru: Упражнения для говорения на английском
sv: Engelska talövningar
th: แบบฝึกหัดการพูดภาษาอังกฤษ
tr: İngilizce Konuşma Alıştırmaları
uk: Вправи на говоріння англійською
vi: Các bài tập nói tiếng Anh

source: English speaking partner
ar: شريك تحدث باللغة الإنجليزية
be: Партнер па размове на англійскай мове
da: Engelsk talende partner
de: Englisch sprechender Partner
es: Socio de conversación en inglés
fr: Partenaire de conversation en anglais
id: Mitra berbicara dalam bahasa Inggris
it: Partner di conversazione in inglese
ja: 英語スピーキングパートナー
ms: Rakan bercakap bahasa Inggeris
no: Engelsk samtalepartner
pl: Partner do rozmowy po angielsku
pt: Parceiro de conversação em inglês
ru: Партнёр для общения на английском языке
sv: Engelsk talande partner
th: คู่สนทนาภาษาอังกฤษ
tr: İngilizce konuşma partneri
uk: Партнер для розмови англійською
vi: Đối tác nói tiếng Anh

source: English Speaking Practice
ar: ممارسة التحدث باللغة الإنجليزية
be: Практыка англійскай мовы
da: Engelsk Taleøvelse
de: Englisch Sprechpraxis
es: Práctica de Habla en Inglés
fr: Pratique de la parole en anglais
id: Latihan Berbicara Bahasa Inggris
it: Esercizio di Conversazione in Inglese
ja: 英語スピーキング練習
ms: Amalan Berbicara Bahasa Inggeris
no: Engelsk samtalepraksis
pl: Praktyka mówienia po angielsku
pt: Prática de Fala em Inglês
ru: Практика разговорного английского
sv: Engelsk Talövning
th: การฝึกพูดภาษาอังกฤษ
tr: İngilizce Konuşma Pratiği
uk: Практика розмовної англійської
vi: Thực hành nói tiếng Anh

source: English speaking practice app
ar: تطبيق ممارسة المحادثة باللغة الإنجليزية
be: Праграма для практыкі размаўляння на англійскай мове
da: Engelsk taletreningsapp
de: Englisch sprechübung App
es: Aplicación de práctica de conversación en inglés
fr: Application de pratique de conversation en anglais
id: Aplikasi latihan berbicara bahasa Inggris
it: App per la pratica della lingua inglese
ja: 英会話練習アプリ
ms: Aplikasi latihan bercakap dalam Bahasa Inggeris
no: App for å øve på engelsktalende
pl: Aplikacja do ćwiczenia mówienia po angielsku
pt: Aplicativo de prática de conversação em inglês
ru: Приложение для практики английского разговорного языка
sv: App för att öva engelska talande
th: แอปฝึกพูดภาษาอังกฤษ
tr: İngilizce konuşma pratik uygulaması
uk: Додаток для практики розмовної англійської
vi: Ứng dụng thực hành nói tiếng Anh

source: English Vocabulary
id: Kosakata Bahasa Inggris
it: Vocabolario Inglese
ja: 英語の語彙
no: Engelsk vokabular
ru: Английский словарный запас
uk: Англійська лексика

source: Enhance Your Grammar
ar: تعزيز قواعدك
be: Удасканалюйце Вашу Граматыку
da: Forbedre Dit Grammatik
de: Verbessern Sie Ihre Grammatik
es: Mejora Tu Gramática
fr: Améliorez votre grammaire
id: Tingkatkan Tata Bahasa Anda
it: Migliora la tua grammatica
ja: 文法を強化する
ms: Tingkatkan Tatabahasa Anda
no: Forbedre grammatikkferdighetene dine
pl: Popraw swoją gramatykę
pt: Aprimore Sua Gramática
ru: Улучшите вашу грамматику
sv: Förbättra Din Grammatik
th: ปรับปรุงไวยากรณ์ของคุณ
tr: Dilbilginizi Geliştirin
uk: Покращуйте свою граматику
vi: Cải thiện Ngữ pháp

source: Enhance your vocabulary by describing words in unique ways.
ar: قم بتحسين مفرداتك عن طريق وصف الكلمات بطرق فريدة.
be: Палепшыце свой слоўнік, апісваючы словы ў арыгінальныя спосабы.
da: Forbedr dit ordforråd ved at beskrive ord på unikke måder.
de: Erweitern Sie Ihren Wortschatz, indem Sie Wörter auf einzigartige Weise beschreiben.
es: Mejora tu vocabulario describiendo palabras de maneras únicas.
fr: Améliorez votre vocabulaire en décrivant les mots de manières uniques.
id: Tingkatkan kosakata Anda dengan mendeskripsikan kata-kata dengan cara yang unik.
it: Migliora il tuo vocabolario descrivendo le parole in modi unici.
ja: ユニークな方法で単語を説明することにより、あなたの語彙を強化します。
ms: Tingkatkan kosakata anda dengan mendeskripsikan kata-kata dengan cara yang unik.
no: Forbedre ordforrådet ditt ved å beskrive ord på unike måter.
pl: Wzbogać swoje słownictwo, opisując słowa w unikalny sposób.
pt: Melhore o seu vocabulário descrevendo palavras de maneiras únicas.
ru: Улучшите свой словарный запас, описывая слова уникальным образом.
sv: Förbättra ditt ordförråd genom att beskriva ord på unika sätt.
th: เสริมทักษะคำศัพท์ของคุณโดยการบรรยายคำในทางที่ไม่ธรรมดา
tr: Kelimeleri benzersiz yollarla tarif ederek kelime dağarcığınızı geliştirin.
uk: Покращте свій словниковий запас, описуючи слова унікальними способами.
vi: Nâng cao từ vựng của bạn bằng cách mô tả từ theo các cách độc đáo.

source: Enjoy the game and see how the AI guesses your description!
ar: استمتع باللعبة وشاهد كيف يقوم الذكاء الصناعي بتخمين وصفك!
be: Насалоджвайцеся гульнёй і глядзіце, як ШІ угадвае ваш апісанне!
da: Nyd spillet og se hvordan AI gætter din beskrivelse!
de: Genießen Sie das Spiel und sehen Sie, wie die KI Ihre Beschreibung errät!
es: ¡Disfruta del juego y observa cómo la IA adivina tu descripción!
fr: Profitez du jeu et voyez comment l'IA devine votre description!
id: Nikmati permainan dan lihat bagaimana AI menebak deskripsi Anda!
it: Goditi il gioco e guarda come l'IA indovina la tua descrizione!
ja: ゲームを楽しみ、AIがあなたの説明をどのように推測するかを見てみましょう！
ms: Nikmati permainan dan lihat bagaimana AI menebak deskripsi anda!
no: Nyt spillet og se hvordan AI-en gjetter beskrivelsen din!
pl: Ciesz się grą i zobacz, jak AI odgaduje twój opis!
pt: Aproveite o jogo e veja como a IA adivinha sua descrição!
ru: Наслаждайтесь игрой и посмотрите, как AI угадывает ваше описание!
sv: Njut av spelet och se hur AI gissar din beskrivning!
th: สนุกกับเกมและดูว่า AI จะทายคำอธิบายของคุณได้ยังไง!
tr: Oyunun tadını çıkarın ve AI'ın tanımınızı nasıl tahmin ettiğini görün!
uk: Насолоджуйтесь грою та дивіться, як штучний інтелект вгадує ваш опис!
vi: Tận hưởng trò chơi và xem AI đoán mô tả của bạn!

source: Enter your email to get a sign-in link
ar: أدخل بريدك الإلكتروني للحصول على رابط تسجيل الدخول
be: Увядзіце вашу электронную пошту, каб атрымаць спасылку для ўваходу
da: Indtast din e-mail for at få et login-link
de: Geben Sie Ihre E-Mail-Adresse ein, um einen Anmeldelink zu erhalten
es: Ingrese su correo electrónico para obtener un enlace de inicio de sesión
fr: Entrez votre email pour recevoir un lien de connexion
id: Masukkan email Anda untuk mendapatkan tautan masuk
it: Inserisci la tua email per ricevere un link di accesso
ja: メールアドレスを入力してサインインリンクを取得
no: plaintext Skriv inn e-posten din for å få en innloggingslenke
pl: Wprowadź swój adres e-mail, aby otrzymać link do logowania
pt: Digite seu e-mail para receber um link de acesso
ru: Введите ваш email, чтобы получить ссылку для входа
sv: Ange din e-post för att få en inloggningslänk
th: กรุณากรอกอีเมลของคุณเพื่อรับลิงก์เข้าสู่ระบบ
tr: Giriş bağlantısını almak için e-postanızı girin
uk: Введіть свій email, щоб отримати посилання для входу
vi: Nhập email của bạn để nhận liên kết đăng nhập

source: Entry-level candidates targeting startups or agencies with modern web development stacks
ar: مرشحو المستوى المبتدئ يستهدفون الشركات الناشئة أو الوكالات التي تستخدم تقنيات تطوير الويب الحديثة
be: Кандыдаты пачатковага ўзроўню, якія нацэлены на стартапы або агенцтвы з сучаснымі стэкамі вэб-распрацоўкі
da: Kandidater på indgangsniveau, der sigter mod startups eller bureauer med moderne webudviklingsstakke
de: Einsteiger, die auf Startups oder Agenturen mit modernen Web-Entwicklungs-Stacks abzielen.
es: Candidatos de nivel inicial que se dirigen a startups o agencias con pilas modernas de desarrollo web
fr: Les candidats débutants ciblant les startups ou les agences avec des piles de développement web modernes
id: Kandidat tingkat pemula yang menargetkan startup atau agensi dengan tumpukan pengembangan web modern
it: Candidati entry-level che mirano a startup o agenzie con stack di sviluppo web moderni
ja: 現代のウェブ開発スタックを備えたスタートアップやエージェンシーをターゲットにするエントリーレベルの候補者
no: Entry-level kandidater som retter seg mot oppstartsbedrifter eller byråer med moderne stakker for webutvikling
pl: Kandydaci na poziomie podstawowym celujący w startupy lub agencje z nowoczesnymi stosami rozwoju webowego
pt: Candidatos iniciantes visando startups ou agências com stacks de desenvolvimento web modernos
ru: Кандидаты начального уровня, ориентирующиеся на стартапы или агентства с современными стеками веб-разработки
sv: Kandidater på nybörjarnivå som riktar sig mot startup-företag eller byråer med moderna webbapputvecklingsstackar
th: ผู้สมัครระดับเริ่มต้นที่มุ่งเป้าไปยังสตาร์ทอัพหรือเอเจนซี่ที่มีสแต็คการพัฒนาเว็บสมัยใหม่
tr: Modern web geliştirme yığınlarına sahip girişimler veya ajansları hedefleyen giriş seviyesi adaylar
uk: Кандидати початкового рівня, які націлені на стартапи або агентства з сучасними стеками веб-розробки
vi: Ứng viên cấp độ đầu vào nhắm mục tiêu vào các công ty khởi nghiệp hoặc cơ quan với các ngăn xếp phát triển web hiện đại

source: Error analyzing conversation
ar: خطأ في تحليل المحادثة
be: Памылка пры аналізе размовы
da: Fejl ved analyse af samtale
de: Fehler bei der Analyse des Gesprächs
es: Error al analizar la conversación
fr: Erreur d'analyse de conversation
id: Kesalahan dalam menganalisis percakapan
it: Errore nell'analisi della conversazione
ja: 会話の分析エラー
ms: Ralat menganalisa perbualan
no: Feil ved analyse av samtale
pl: Błąd analizy rozmowy
pt: Erro ao analisar conversa
ru: Ошибка анализа беседы
sv: Fel vid analys av konversation
th: ข้อผิดพลาดในการวิเคราะห์บทสนทนา
tr: Konuşma analizinde hata
uk: Помилка аналізу розмови
vi: Lỗi phân tích cuộc trò chuyện

source: Error creating payment session
ar: خطأ في إنشاء جلسة الدفع
be: Памылка пры стварэнні сесіі плацяжоў
da: Fejl ved oprettelse af betalingssession
de: Fehler beim Erstellen der Zahlungssitzung
es: Error al crear la sesión de pago
fr: Erreur lors de la création de la session de paiement
id: Kesalahan dalam membuat sesi pembayaran
it: Errore nella creazione della sessione di pagamento
ja: 支払いセッションの作成中にエラーが発生しました
ms: Ralat mencipta sesi pembayaran
no: Feil ved oppretting av betalingsøkt
pl: Błąd podczas tworzenia sesji płatności
pt: Erro ao criar a sessão de pagamento
ru: Ошибка создания сессии оплаты
sv: Fel vid skapande av betalningssession
th: ข้อผิดพลาดในการสร้างเซสชันการชำระเงิน
tr: Ödeme oturumu oluşturma hatası
uk: Помилка при створенні сесії оплати
vi: Lỗi khi tạo phiên thanh toán

source: Error creating payment session. Notification sent to support. Try again later.
de: Fehler bei der Erstellung der Zahlungs-Sitzung. Benachrichtigung an den Support gesendet. Bitte versuchen Sie es später erneut.
es: Error al crear la sesión de pago. Notificación enviada al soporte. Inténtalo de nuevo más tarde.
id: Terjadi kesalahan saat membuat sesi pembayaran. Pemberitahuan telah dikirim ke dukungan. Coba lagi nanti.
it: Errore durante la creazione della sessione di pagamento. Notifica inviata al supporto. Riprova più tardi.
ja: 支払いセッションの作成中にエラーが発生しました。サポートに通知が送信されました。後でもう一度お試しください。
no: Feil ved opprettelse av betalingsøkt. Varsel sendt til støtte. Prøv igjen senere.
pl: Błąd podczas tworzenia sesji płatności. Powiadomienie wysłane do wsparcia. Spróbuj ponownie później.
pt: Erro ao criar sessão de pagamento. Notificação enviada ao suporte. Tente novamente mais tarde.
ru: Ошибка при создании платежной сессии. Уведомление отправлено в службу поддержки. Попробуйте позже.
sv: Fel vid skapande av betalningssession. Avisering skickad till support. Försök igen senare.
th: ข้อผิดพลาดในการสร้างการชำระเงิน การแจ้งเตือนถูกส่งไปยังฝ่ายสนับสนุนแล้ว กรุณาลองใหม่ภายหลัง
tr: Ödeme oturumu oluşturulurken hata oluştu. Destek ekibine bildirim gönderildi. Lütfen daha sonra tekrar deneyin.
uk: Помилка створення платіжної сесії. Повідомлення надіслано в службу підтримки. Спробуйте ще раз пізніше.
vi: Lỗi khi tạo phiên thanh toán. Thông báo đã được gửi đến bộ phận hỗ trợ. Vui lòng thử lại sau.

source: Error creating payment session. Try again later.
ar: خطأ في إنشاء جلسة الدفع. حاول مرة أخرى لاحقًا.
be: Памылка пры стварэнні сесіі аплаты. Паспрабуйце зноў пазней.
da: Fejl ved oprettelse af betalingssession. Prøv igen senere.
de: Fehler beim Erstellen der Zahlungssitzung. Bitte versuchen Sie es später erneut.
es: Error al crear la sesión de pago. Inténtalo de nuevo más tarde.
fr: Erreur lors de la création de la session de paiement. Veuillez réessayer plus tard.
id: Terjadi kesalahan saat membuat sesi pembayaran. Coba lagi nanti.
it: Errore durante la creazione della sessione di pagamento. Riprova più tardi.
ja: 支払いセッションの作成中にエラーが発生しました。後でもう一度お試しください。
ms: Ralat semasa mencipta sesi pembayaran. Cuba lagi nanti.
no: Feil ved opprettelse av betalingsøkt. Prøv igjen senere.
pl: Błąd podczas tworzenia sesji płatności. Spróbuj ponownie później.
pt: Erro ao criar sessão de pagamento. Tente novamente mais tarde.
ru: Ошибка при создании платёжной сессии. Попробуйте позже.
sv: Fel vid skapande av betalningssession. Försök igen senare.
th: เกิดข้อผิดพลาดในการสร้างเซสชันการชำระเงิน กรุณาลองใหม่ภายหลัง
tr: Ödeme oturumu oluşturulurken hata oluştu. Lütfen daha sonra tekrar deneyin.
uk: Помилка створення платіжної сесії. Спробуйте ще раз пізніше.
vi: Lỗi khi tạo phiên thanh toán. Vui lòng thử lại sau.

source: Error creating plan. Please try again.
ar: خطأ في إنشاء الخطة. يرجى المحاولة مرة أخرى.
be: Памылка пры стварэнні плана. Калі ласка, паспрабуйце яшчэ раз.
da: Fejl ved oprettelse af plan. Prøv venligst igen.
de: Fehler beim Erstellen des Plans. Bitte versuchen Sie es erneut.
es: Error al crear el plan. Por favor, inténtalo de nuevo.
fr: Erreur lors de la création du plan. Veuillez réessayer.
id: Galat membuat rencana. Silakan coba lagi.
it: Errore nella creazione del piano. Per favore riprova.
ja: プランの作成中にエラーが発生しました。もう一度お試しください。
ms: Ralat membuat pelan. Sila cuba lagi.
no: Feil ved oppretting av plan. Vennligst prøv igjen.
pl: Błąd podczas tworzenia planu. Proszę spróbować ponownie.
pt: Erro ao criar plano. Por favor, tente novamente.
ru: Ошибка при создании плана. Пожалуйста, попробуйте еще раз.
sv: Fel vid skapande av plan. Försök igen.
th: ข้อผิดพลาดในการสร้างแผน กรุณาลองใหม่อีกครั้ง
tr: Plan oluşturulurken hata oluştu. Lütfen tekrar deneyin.
uk: Помилка створення плану. Будь ласка, спробуйте ще раз.
vi: Lỗi khi tạo kế hoạch. Vui lòng thử lại.
