Repository: dmowski/fluencypal
Catalog: src/locales/*.po
Languages: ar, be, da, de, es, fr, id, it, ja, ms, no, pl, pt, ru, sv, th, tr, uk, vi

source: Error during analyzing message
ar: خطأ أثناء تحليل الرسالة
be: Памылка пры аналізе паведамлення
da: Fejl under analysering af besked
de: Fehler bei der Analyse der Nachricht
es: Error durante el análisis del mensaje
fr: Erreur lors de l'analyse du message
id: Kesalahan saat menganalisis pesan
it: Errore durante l'analisi del messaggio
ja: メッセージの分析中にエラーが発生しました
ms: Ralat semasa menganalisis mesej
no: Feil under analyse av melding
pl: Błąd podczas analizy wiadomości
pt: Erro durante a análise da mensagem
ru: Ошибка при анализе сообщения
sv: Fel under analys av meddelande
th: ข้อผิดพลาดในระหว่างการวิเคราะห์ข้อความ
tr: Mesaj analizi sırasında hata
uk: Помилка під час аналізу повідомлення
vi: Lỗi trong quá trình phân tích tin nhắn

source: Error during payment process
ar: خطأ أثناء عملية الدفع
be: Памылка падчас правядзення аплаты
da: Fejl under betalingsprocessen
de: Fehler beim Zahlungsvorgang
es: Error durante el proceso de pago
fr: Erreur lors du processus de paiement
id: Kesalahan selama proses pembayaran
it: Errore durante il processo di pagamento
ja: 支払いプロセス中のエラー
ms: Ralat semasa proses pembayaran
no: Feil under betalingsprosessen
pl: Błąd podczas procesu płatności
pt: Erro durante o processo de pagamento
ru: Ошибка в процессе оплаты
sv: Fel under betalningsprocessen
th: ข้อผิดพลาดระหว่างกระบวนการชำระเงิน
tr: Ödeme işlemi sırasında hata
uk: Помилка під час процесу оплати
vi: Lỗi trong quá trình thanh toán

source: Error processing payment
ar: خطأ في معالجة الدفع
be: Памылка пры апрацоўцы аплаты
da: Fejl ved behandling af betaling
de: Fehler bei der Zahlungsabwicklung
es: Error al procesar el pago
fr: Erreur lors du traitement du paiement
id: Kesalahan memproses pembayaran
it: Errore nell'elaborazione del pagamento
ja: 支払いの処理中にエラーが発生しました
ms: Ralat memproses bayaran
no: Feil ved behandling av betaling
pl: Błąd przetwarzania płatności
pt: Erro ao processar pagamento
ru: Ошибка при обработке платежа
sv: Fel vid bearbetning av betalning
th: ข้อผิดพลาดในการประมวลผลการชำระเงิน
tr: Ödeme işlenirken hata oluştu
uk: Помилка обробки платежу
vi: Lỗi xử lý thanh toán

source: Error:
ar: خطأ:
be: Памылка:
da: Fejl:
de: Fehler:
fr: Erreur:
id: Kesalahan:
it: Errore:
ja: エラー:
ms: Ralat:
no: Feil:
pl: Błąd:
pt: Erro:
ru: Ошибка:
sv: Fel:
th: ข้อผิดพลาด:
tr: Hata:
uk: Помилка:
vi: Lỗi:

source: Error:
ar: خطأ:
be: Памылка:
da: Fejl:
de: Fehler:
fr: Erreur:
id: Kesalahan:
it: Errore:
ja: エラー:
ms: Ralat:
no: Feil:
pl: Błąd:
pt: Erro:
ru: Ошибка:
sv: Fel:
th: ข้อผิดพลาด:
tr: Hata:
uk: Помилка:
vi: Lỗi:

source: Essays
ar: مقالات
be: Эсэ
de: Aufsätze
es: Ensayos
fr: Dissertations
id: Esai
it: Saggi
ja: エッセイ
ms: Esei
no: Stiler
pl: Eseje
pt: Redações
ru: Эссе
sv: Uppsatsar
th: เรียงความ
tr: Makaleler
uk: Есе
vi: Bài văn

source: Essential words for discussing mental health and psychology.
ar: كلمات أساسية لمناقشة الصحة العقلية والنفسية.
be: Важныя словы для абмеркавання псіхічнага здароўя і псіхалогіі.
da: Vigtige ord for at diskutere mental sundhed og psykologi.
de: Wesentliche Wörter für die Diskussion über psychische Gesundheit und Psychologie.
es: Palabras esenciales para discutir sobre salud mental y psicología.
fr: Mots essentiels pour discuter de la santé mentale et de la psychologie.
id: Kata-kata esensial untuk mendiskusikan kesehatan mental dan psikologi.
it: Parole essenziali per discutere di salute mentale e psicologia.
ja: 心の健康と心理学を議論するための必須の単語。
ms: Perkataan penting untuk membincangkan kesihatan mental dan psikologi.
no: Essensielle ord for å diskutere psykisk helse og psykologi.
pl: Niezbędne słowa do dyskusji na temat zdrowia psychicznego i psychologii.
pt: Palavras essenciais para discutir saúde mental e psicologia.
ru: Основные слова для обсуждения психического здоровья и психологии.
sv: Viktiga ord för att diskutera mental hälsa och psykologi.
th: คำที่จำเป็นสำหรับการสนทนาเกี่ยวกับสุขภาพจิตและจิตวิทยา.
tr: Zihinsel sağlık ve psikolojiyi tartışmak için olmazsa olmaz kelimeler.
uk: Основні слова для обговорення психічного здоров'я та психології.
vi: Từ vựng cần thiết để thảo luận về sức khỏe tâm thần và tâm lý học.

source: Even Strong Senior Developers Fail Interviews
ar: plaintext حتى المطورين الكبار ذوي الخبرة يفشلون في المقابلات أحيانًا
be: Нават моцныя старэйшыя распрацоўшчыкі правальваюцца на сумоўях
da: Selv Stærke Seniorudviklere Fejler Interviews
de: Selbst erfahrene Senior-Entwickler fallen bei Interviews durch
es: Incluso los Desarrolladores Senior Fuertes Fracasan en las Entrevistas
fr: Même les développeurs seniors expérimentés échouent aux entretiens
id: Bahkan Pengembang Senior yang Kuat Gagal dalam Wawancara
it: Anche i Sviluppatori Senior Esperti Falliscono i Colloqui
ja: 経験豊かなシニア開発者でも面接に失敗する
no: Selv Sterke Seniorutviklere Feiler i Intervjuer
pl: Nawet Mocni Starsi Programiści Nie Zdają Rozmów Kwalifikacyjnych
pt: Até Desenvolvedores Sêniores Fortes Falham em Entrevistas
ru: Даже опытные сеньор-разработчики проваливают интервью
sv: Även starka seniorutvecklare misslyckas med intervjuer
th: แม้แต่โปรแกรมเมอร์อาวุโสที่แข็งแกร่งก็ยังสอบสัมภาษณ์ไม่ผ่าน
tr: Deneyimli Kıdemli Geliştiriciler Bile Mülakatlarda Başarısız Olabilir
uk: Навіть досвідчені старші розробники провалюють співбесіди
vi: Ngay cả những nhà phát triển cấp cao mạnh mẽ cũng trượt phỏng vấn
